[
  {
    "topic": 3,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/cisco/view/9961-exam-300-115-topic-3-question-14-discussion/",
    "body": "ABC, Inc. is a medium sized company, with an enterprise network (access, distribution and core switches) that provides LAN connectivity from user PCs to corporate servers. The distribution switches are configured to use HSRP to provide a high availability solution.<br>✑ DSW1  primary device for VLAN 101 VLAN 102 and VLAN 105<br>✑ DSW2  primary device for VLAN 103 and VLAN 104<br>✑ A failure of GigabitEthemet1/0/1 on primary device should cause the primary device to release its status as the primary device, unless GigabitEthernet1/0/1 on backup device has also failed.<br>Troubleshooting has identified several issues. Currently all interfaces are up. Using the running configurations and show commands, you have been asked to investigate and respond to the following question.<br><img src=\"/assets/media/exam-media/01585/0016600001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/01585/0016700001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/01585/0016800001.png\" class=\"in-exam-image\"><br>All interfaces are active. DSW2 has not become the active device for the VLAN 103 HSRP group. As related to the VLAN 103 HSRP group, what can be done to make the group function properly?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn DSW1, disable preempt.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn DSW1, decrease the priority value to a value less than 190 and greater than 150.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn DSW2, increase the priority value to a value greater 200 and less than 250.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn DSW2, increase the decrement value in the track command to a value greater than 10 and less than 50."
    ],
    "answer": "C",
    "answerDescription": "From the output shown below of the HSRP status of DSW2, we see that the active router has a priority of 200, while the local priority is 190. We need to increase the priority of DSW2 to greater than 200, but it should be less than 250 so that if the gig 1/0/1 interface goes down, DSW1 will become active. DSW2 is configured to decrement the priority by 50 if this interface goes down, so the correct answer is to increase the priority to more than 200, but less than 250.<br><img src=\"/assets/media/exam-media/01585/0016900001.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-25T01:21:00.000Z",
        "voteCount": 1,
        "content": "I not understand why it should be less than 250... what's happen if I set 260 ?"
      },
      {
        "date": "2019-12-08T07:15:00.000Z",
        "voteCount": 1,
        "content": "I see letter B as an option too :/. I think with letter B and C we could achieve this scenario."
      }
    ],
    "examNameCode": "300-115",
    "topicNumber": "3"
  }
]