[
  {
    "topic": 5,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/cisco/view/6623-exam-300-135-topic-5-question-3-discussion/",
    "body": "Instructions -<br>The main screen consists of two parts; the Main scenario and the Topology tabs. The main scenario describes TSHOOT.com test bed. The Topology tabs allow you to display the appropriate and select the trouble ticket.<br>To complete the item, you will first need to familiarize yourself with the TSHOOT.com test bed by clicking on the master scenario first and then the topologies tabs.<br>Once you are familiar with the test bed and the topologies, you should start evaluating the trouble ticket. You will be presented with a Trouble Ticket scenario that will describe the fault condition. You will need to determine on which device the fault condition is located, to which technology the fault condition is related, and the solution to each trouble ticket. This will be done by answering three questions.<br><br>Ticket Selection -<br>✑ To begin, click on the Ticket on the Topology tabs.<br>Some of the questions will require you to use the scroll bar to see all options.<br>✑ Please note.<br><br>Fault Isolation -<br>✑ Read the ticket scenario to understand the fault condition.<br>✑ Open the appropriate topology, based upon the ticket scenario.<br>✑ Open the console of the desired device by clicking on that device in the topology, based upon your troubleshooting methodology.<br>✑ Use the supported show, ping and trace commands to begin your fault isolation process.<br>✑ Move to other devices as need by clicking on those devices within the topology.<br><br>Fault Identification -<br>✑ The trouble ticket will include three questions that you will need to answer:<br>1. Which device contains the fault<br>2. Which technology the fault condition is related to<br>3. What is the solution to the issue<br>✑ To advance to the next question within the ticket click on \"Next Question\".<br>✑ When you click \"DONE\", the trouble ticket will turn RED and will no longer be accessible.<br>✑ You may also use the \"Previous Question\" button to review questions within that specific ticket.<br>✑ To complete a trouble ticket, answer all three questions and click \"DONE\". This will store your response to the questions. Do not click on \"DONE\" unless you have answered all questions within the ticket.<br><br>Item Completion -<br>✑ Click the NEXT button on the bottom of the screen once a ticket is RED. This action moves you to the next item.<br><br>Scenario -<br>The company has created the test bed network shown in the layer 2 and layer 3 topology exhibits.<br>This network consists of four routers, two layer 3 switches and two layer 2 switches.<br>In the IPv4 layer 3 topology, R1, R2, R3, and R4 are running OSPF with an OSPF process number 1.<br>DSW1, DSW2 and R4 are running EIGRP with an AS of 10. Redistribution is enabled where necessary.<br>R1 is running a BGP AS with a number of 65001. This AS has an eBGP connection to AS 65002 in the ISP's network. Because the company's address space is in the private range, R1 is also providing NAT translations between the inside (10.1.0.0/16 &amp; 10.2.0.0/16) networks and the outside (209.65.200.0/24) network.<br>ASW1 and ASW2 are layer 2 switches.<br>NTP is enabled on all devices with 209.65.200.226 serving as the master clock source.<br>The client workstations receive their IP address and default gateway via R4's DHCP server. The default gateway address of 10.2.1.254 is the IP address of HSRP group 10 which is running on DSW1 and DSW2.<br>In the IPv6 layer 3 topology R1, R2, and R3 are running OSPFv3 with an OSPF process number 6. DSW1, DSW2 and R4 are running RIPng process name<br>RIP_ZONE. The two IPv6 routing domains, OSPF 6 and RIPng are connected via GRE tunnel running over the underlying IPv4 OSPF domain. Redistribution is enabled where necessary.<br>Recently the implementation group has been using the test bed to do a \"˜proof-of-concept' on several implementations. This involved changing the configuration on one or more of the devices. You will be presented with a series of trouble tickets related to issues introduced during these configurations.<br><img src=\"/assets/media/exam-media/02722/0014200001.jpg\" class=\"in-exam-image\"><br>The implementation group has been using the test bed to do a \"˜proof-of-concept' that requires both Client 1 and Client 2 to access the WEB Server at<br>209.65.200.241. After several changes to the network addressing, routing scheme, DHCP services, NTP services, and FHRP services, a trouble ticket has been opened indicating that Client 1 cannot ping the 209.65.200.241 address.<br>Use the supported commands to isolate the cause of this fault and answer the following questions.<br>What is the solution to the fault condition?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn configuration mode, using the interface range port-channel 23, port-channel 24, then configure switchport trunk allowed vlan none followed by commands. switchport trunk allowed vlan 10,20,200",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn configuration mode, using the interface range port-channel 13, port-channel 23, then configure switchport trunk allowed vlan none followed by commands. switchport trunk allowed vlan 10,200",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn configuration mode, using the interface range port-channel 23, port-channel 24, then configure switchport trunk allowed vlan none followed by commands. switchport trunk allowed vlan 10,20,",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn configuration mode, using the interface range port-channel 13, port-channel 23, then configure switchport trunk allowed vlan 10,200 followed by then no shutdown commands. interface Fastethernet 1/0/1, B"
    ],
    "answer": "Explanation",
    "answerDescription": "Solution -<br>Steps need to follow as below:-1.When we check on client 1 &amp; Client 2 desktop we are not receiving DHCP address from R4Ipconfig ----- Client will be getting<br>169.X.X.X2.On ASW1 port Fa1/0/ 1 &amp; Fa1/0/2 access port VLAN 10 was assigned which is using IPaddress 10.2.1.0/24Sh run ------- &amp; check for running config of int fa1/0/1 &amp; fa1/0/2====================================================interface FastEthernet1/0/1switchport mode accessswitchport access vlan 10interface FastEthernet1/0/2switchport mode accessswitchport access vlan 10====================================================<br>3.We need to check on ASW 1 trunk port the trunk Po13 &amp; Po23 were receiving VLAN 20 &amp;200 but not VLAN 10 so that switch could not get DHCP IP address and was failing to reach IPaddress of Internet4.<br>Change required:<br>On ASW1 below change is required for switch-to-switch connectivity..int range portchannel13,portchannel23switchport trunk allowed vlan noneswitchport trunk allowed vlan 10,200",
    "votes": [],
    "comments": [
      {
        "date": "2019-10-15T02:23:00.000Z",
        "voteCount": 2,
        "content": "answer is B"
      }
    ],
    "examNameCode": "300-135",
    "topicNumber": "5"
  }
]