[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/isc/view/37084-exam-sscp-topic-6-question-16-discussion/",
    "body": "In the days before CIDR (Classless Internet Domain Routing), networks were commonly organized by classes. Which of the following would have been true of a<br>Class B network?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe first bit of the IP address would be set to zero.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe first bit of the IP address would be set to one and the second bit set to zero.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe first two bits of the IP address would be set to one, and the third bit set to zero.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe first three bits of the IP address would be set to one."
    ],
    "answer": "C",
    "answerDescription": "Each Class B network address has a 16-bit network prefix, with the two highest order bits set to 1-0.<br>The following answers are incorrect:<br>The first bit of the IP address would be set to zero. Is incorrect because, this would be a Class A network address.<br>The first two bits of the IP address would be set to one, and the third bit set to zero. Is incorrect because, this would be a Class C network address.<br>The first three bits of the IP address would be set to one. Is incorrect because, this is a distractor. Class D &amp; E have the first three bits set to 1. Class D the 4th bit is 0 and for Class E the 4th bit to 1.<br>Classless Internet Domain Routing (CIDR)<br>High Order bits are shown in bold below.<br>For Class A, the addresses are 0.0.0.0 - 127.255.255.255<br>The lowest Class A address is represented in binary as 00000000.00000000.0000000.00000000<br>For Class B networks, the addresses are 128.0.0.0 - 191.255.255.255.<br>The lowest Class B address is represented in binary as 10000000.00000000.00000000.00000000<br>For Class C, the addresses are 192.0.0.0 - 223.255.255.255<br>The lowest Class C address is represented in binary as 11000000.00000000.00000000.00000000<br>For Class D, the addresses are 224.0.0.0 - 239.255.255.255 (Multicast)<br>The lowest Class D address is represented in binary as 11100000.00000000.00000000.00000000<br>For Class E, the addresses are 240.0.0.0 - 255.255.255.255  (Reserved for future usage)<br>The lowest Class E address is represented in binary as 11110000.00000000.00000000.00000000<br><br>Classful IP Address Format -<br><br><img src=\"/assets/media/exam-media/02070/0067300001.jpg\" class=\"in-exam-image\"><br>References:<br>3Com http://www.3com.com/other/pdfs/infra/corpinfo/en_US/501302.pdf<br>AIOv3 Telecommunications and Networking Security (page 438)",
    "votes": [],
    "comments": [
      {
        "date": "2021-09-25T09:16:00.000Z",
        "voteCount": 1,
        "content": "B is correct"
      },
      {
        "date": "2021-08-03T10:55:00.000Z",
        "voteCount": 1,
        "content": "Yep. It should be B"
      },
      {
        "date": "2020-11-16T03:29:00.000Z",
        "voteCount": 3,
        "content": "according to the explanation: Answer should be B"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/isc/view/95929-exam-sscp-topic-6-question-28-discussion/",
    "body": "Remote Procedure Call (RPC) is a protocol that one program can use to request a service from a program located in another computer in a network.  Within which<br>OSI/ISO layer is RPC implemented?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSession layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransport layer\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData link layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork layer"
    ],
    "answer": "The Answer: Session layer, which establishes, maintains and manages sessions and synchronization of data flow.  Session layer protocols control application-to-",
    "answerDescription": "application communications, which is what an RPC call is.<br>The following answers are incorrect:<br>Transport layer: The Transport layer handles computer-to computer communications, rather than application-to-application communications like RPC.<br>Data link Layer: The Data Link layer protocols can be divided into either Logical Link Control (LLC) or Media Access Control (MAC) sublayers.  Protocols like<br>SLIP, PPP, RARP and L2TP are at this layer.  An application-to-application protocol like RPC would not be addressed at this layer.<br>Network layer:  The Network Layer is mostly concerned with routing and addressing of information, not application-to-application communication calls such as an<br>RPC call.<br>The following reference(s) were/was used to create this question:<br>The Remote Procedure Call (RPC) protocol is implemented at the Session layer, which establishes, maintains and manages sessions as well as synchronization of the data flow.<br>Source: Jason Robinett's CISSP Cram Sheet: domain2.<br>Source: Shon Harris AIO v3 pg. 423",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-02-14T19:06:00.000Z",
        "voteCount": 1,
        "content": "Session Layer"
      },
      {
        "date": "2023-02-02T14:46:00.000Z",
        "voteCount": 1,
        "content": "Remote Procedure Call (RPC) is a protocol which works in the session layer of the OSI model and in the Application Layer of TCP/IP model."
      },
      {
        "date": "2023-02-02T14:47:00.000Z",
        "voteCount": 1,
        "content": "I messed this up, can you edit it to RPC spans the transport layer and the application layer in the Open Systems Interconnection (OSI) model of network communication - I was agreeing with KMANB :D"
      },
      {
        "date": "2023-01-18T18:57:00.000Z",
        "voteCount": 2,
        "content": "Whoa this is wrong. RPC can span either the transport layer or application not session"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/isc/view/86921-exam-sscp-topic-6-question-45-discussion/",
    "body": "In which layer of the OSI Model are connection-oriented protocols located in the TCP/IP suite of protocols?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransport layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApplication layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPhysical layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork layer"
    ],
    "answer": "A",
    "answerDescription": "Connection-oriented protocols such as TCP provides reliability.<br>It is the responsibility of such protocols in the transport layer to ensure every byte is accounted for.  The network layer does not provide reliability.  It only privides the best route to get the traffic to the final destination address.<br>For your exam you should know the information below about OSI model:<br>The Open Systems Interconnection model (OSI) is a conceptual model that characterizes and standardizes the internal functions of a communication system by partitioning it into abstraction layers. The model is a product of the Open Systems Interconnection project at the International Organization for Standardization<br>(ISO), maintained by the identification ISO/IEC 7498-1.<br>The model groups communication functions into seven logical layers. A layer serves the layer above it and is served by the layer below it. For example, a layer that provides error-free communications across a network provides the path needed by applications above it, while it calls the next lower layer to send and receive packets that make up the contents of that path. Two instances at one layer are connected by a horizontal.<br><br>OSI Model -<br><img src=\"/assets/media/exam-media/02070/0070100001.jpg\" class=\"in-exam-image\"><br>Image source: http://www.petri.co.il/images/osi_model.JPG<br><br>PHYSICAL LAYER -<br>The physical layer, the lowest layer of the OSI model, is concerned with the transmission and reception of the unstructured raw bit stream over a physical medium.<br>It describes the electrical/optical, mechanical, and functional interfaces to the physical medium, and carries the signals for all of the higher layers. It provides:<br>Data encoding: modifies the simple digital signal pattern (1s and 0s) used by the PC to better accommodate the characteristics of the physical medium, and to aid in bit and frame synchronization. It determines:<br>What signal state represents a binary 1<br>How the receiving station knows when a \"bit-time\" starts<br>How the receiving station delimits a frame<br><br><br>DATA LINK LAYER -<br>The data link layer provides error-free transfer of data frames from one node to another over the physical layer, allowing layers above it to assume virtually error- free transmission over the link. To do this, the data link layer provides:<br>Link establishment and termination: establishes and terminates the logical link between two nodes.<br>Frame traffic control: tells the transmitting node to \"back-off\" when no frame buffers are available.<br>Frame sequencing: transmits/receives frames sequentially.<br>Frame acknowledgment: provides/expects frame acknowledgments. Detects and recovers from errors that occur in the physical layer by retransmitting non- acknowledged frames and handling duplicate frame receipt.<br>Frame delimiting: creates and recognizes frame boundaries.<br>Frame error checking: checks received frames for integrity.<br>Media access management: determines when the node \"has the right\" to use the physical medium.<br><br>NETWORK LAYER -<br>The network layer controls the operation of the subnet, deciding which physical path the data should take based on network conditions, priority of service, and other factors. It provides:<br>Routing: routes frames among networks.<br>Subnet traffic control: routers (network layer intermediate systems) can instruct a sending station to \"throttle back\" its frame transmission when the router's buffer fills up.<br>Frame fragmentation: if it determines that a downstream router's maximum transmission unit (MTU) size is less than the frame size, a router can fragment a frame for transmission and re-assembly at the destination station.<br>Logical-physical address mapping: translates logical addresses, or names, into physical addresses.<br>Subnet usage accounting: has accounting functions to keep track of frames forwarded by subnet intermediate systems, to produce billing information.<br><br>Communications Subnet -<br>The network layer software must build headers so that the network layer software residing in the subnet intermediate systems can recognize them and use them to route data to the destination address.<br>This layer relieves the upper layers of the need to know anything about the data transmission and intermediate switching technologies used to connect systems. It establishes, maintains and terminates connections across the intervening communications facility (one or several intermediate systems in the communication subnet).<br>In the network layer and the layers below, peer protocols exist between a node and its immediate neighbor, but the neighbor may be a node through which data is routed, not the destination station. The source and destination stations may be separated by many intermediate systems.<br><br>TRANSPORT LAYER -<br>The transport layer ensures that messages are delivered error-free, in sequence, and with no losses or duplications. It relieves the higher layer protocols from any concern with the transfer of data between them and their peers.<br>The size and complexity of a transport protocol depends on the type of service it can get from the network layer. For a reliable network layer with virtual circuit capability, a minimal transport layer is required. If the network layer is unreliable and/or only supports datagrams, the transport protocol should include extensive error detection and recovery.<br>The transport layer provides:<br>Message segmentation: accepts a message from the (session) layer above it, splits the message into smaller units (if not already small enough), and passes the smaller units down to the network layer. The transport layer at the destination station reassembles the message.<br>Message acknowledgment: provides reliable end-to-end message delivery with acknowledgments.<br>Message traffic control: tells the transmitting station to \"back-off\" when no message buffers are available.<br>Session multiplexing: multiplexes several message streams, or sessions onto one logical link and keeps track of which messages belong to which sessions<br>(see session layer).<br>Typically, the transport layer can accept relatively large messages, but there are strict message size limits imposed by the network (or lower) layer. Consequently, the transport layer must break up the messages into smaller units, or frames, prepending a header to each frame.<br>The transport layer header information must then include control information, such as message start and message end flags, to enable the transport layer on the other end to recognize message boundaries. In addition, if the lower layers do not maintain sequence, the transport header must contain sequence information to enable the transport layer on the receiving end to get the pieces back together in the right order before handing the received message up to the layer above.<br><br>End-to-end layers -<br>Unlike the lower \"subnet\" layers whose protocol is between immediately adjacent nodes, the transport layer and the layers above are true \"source to destination\" or end-to-end layers, and are not concerned with the details of the underlying communications facility. Transport layer software (and software above it) on the source station carries on a conversation with similar software on the destination station by using message headers and control messages.<br><br>SESSION LAYER -<br>The session layer allows session establishment between processes running on different stations. It provides:<br>Session establishment, maintenance and termination: allows two application processes on different machines to establish, use and terminate a connection, called a session.<br>Session support: performs the functions that allow these processes to communicate over the network, performing security, name recognition, logging, and so on.<br><br>PRESENTATION LAYER -<br>The presentation layer formats the data to be presented to the application layer. It can be viewed as the translator for the network. This layer may translate data from a format used by the application layer into a common format at the sending station, then translate the common format to a format known to the application layer at the receiving station.<br>The presentation layer provides:<br>Character code translation: for example, ASCII to EBCDIC.<br>Data conversion: bit order, CR-CR/LF, integer-floating point, and so on.<br>Data compression: reduces the number of bits that need to be transmitted on the network.<br>Data encryption: encrypt data for security purposes. For example, password encryption.<br><br>APPLICATION LAYER -<br>The application layer serves as the window for users and application processes to access network services. This layer contains a variety of commonly needed functions:<br>Resource sharing and device redirection<br><br>Remote file access -<br><br>Remote printer access -<br><br>Inter-process communication -<br><br>Network management -<br><br>Directory services -<br>Electronic messaging (such as mail)<br><br>Network virtual terminals -<br>The following were incorrect answers:<br>Application Layer - The application layer serves as the window for users and application processes to access network services.<br>Network layer - The network layer controls the operation of the subnet, deciding which physical path the data should take based on network conditions, priority of service, and other factors.<br>Physical Layer - The physical layer, the lowest layer of the OSI model, is concerned with the transmission and reception of the unstructured raw bit stream over a physical medium. It describes the electrical/optical, mechanical, and functional interfaces to the physical medium, and carries the signals for all of the higher layers.<br>The following reference(s) were/was used to create this question:<br>CISA review manual 2014 Page number 260<br>and<br>Official ISC2 guide to CISSP CBK 3rd Edition Page number 287<br>and<br>http://en.wikipedia.org/wiki/Tcp_protocol",
    "votes": [],
    "comments": [
      {
        "date": "2022-11-03T04:35:00.000Z",
        "voteCount": 2,
        "content": "Please\nDo\nNot\nThrow\nSalami\nPizza\nAway\n\nIs how I was taught it in my CCNA training :)"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/isc/view/43989-exam-sscp-topic-6-question-53-discussion/",
    "body": "Communications and network security relates to transmission of which of the following?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tvoice",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tvoice and multimedia",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tdata and multimedia",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tvoice, data and multimedia"
    ],
    "answer": "B",
    "answerDescription": "From the published (ISC)2 goals for the Certified Information Systems Security Professional candidate:<br>The CISSP candidate should be familiar to communications and network security as it relates to voice, data, multimedia, and facsimile transmissions in terms of local area, wide area, and remote access.<br>Source: KRUTZ, Ronald L. &amp; VINES, Russel D., The CISSP Prep Guide: Mastering the Ten Domains of Computer Security, 2001, John Wiley &amp; Sons, Page 57.",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-04T06:29:00.000Z",
        "voteCount": 5,
        "content": "From explanation, correct answer is D"
      },
      {
        "date": "2021-11-24T02:32:00.000Z",
        "voteCount": 1,
        "content": "D is the correct answer"
      },
      {
        "date": "2021-08-04T11:17:00.000Z",
        "voteCount": 3,
        "content": "Correct answer is D"
      },
      {
        "date": "2021-02-04T06:28:00.000Z",
        "voteCount": 2,
        "content": "From explanation,  correct answer is C."
      },
      {
        "date": "2021-10-25T22:23:00.000Z",
        "voteCount": 2,
        "content": "No : \"The CISSP candidate should be familiar to communications and network security as it relates to voice, data, multimedia, and facsimile transmissions in terms of local area, wide area, and remote access.\""
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/isc/view/95854-exam-sscp-topic-6-question-54-discussion/",
    "body": "One of the following statements about the differences between PPTP and L2TP is NOT true<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPPTP can run only on top of IP networks.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPPTP is an encryption protocol and L2TP is not.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tL2TP works well with all firewalls and network devices that perform NAT.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tL2TP supports AAA servers C"
    ],
    "answer": "Explanation",
    "answerDescription": "L2TP is affected by packet header modification and cannot cope with firewalls and network devices that perform NAT.<br>\"PPTP can run only on top of IP networks.\" is correct as PPTP encapsulates datagrams into an IP packet, allowing PPTP to route many network protocols across an IP network.<br>\"PPTP is an encryption protocol and L2TP is not.\" is correct. When using PPTP, the PPP payload is encrypted with Microsoft Point-to-Point Encryption (MPPE) using MSCHAP or EAP-TLS.<br>\"L2TP supports AAA servers\" is correct as L2TP supports TACACS+ and RADIUS.<br>NOTE:<br>L2TP does work over NAT. It is possible to use a tunneled mode that wraps every packet into a UDP packet. Port 4500 is used for this purpose.  However this is not true of PPTP and it is not true as well that it works well with all firewalls and NAT devices.<br>References:<br>All in One Third Edition page 545<br>Official Guide to the CISSP Exam page 124-126",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-02-14T19:18:00.000Z",
        "voteCount": 1,
        "content": "C is the answer"
      },
      {
        "date": "2023-01-18T08:01:00.000Z",
        "voteCount": 1,
        "content": "C is the answer btw"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/isc/view/77881-exam-sscp-topic-6-question-60-discussion/",
    "body": "Which of the following methods of providing telecommunications continuity involves the use of an alternative media?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAlternative routing",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDiverse routing",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLong haul network diversity",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLast mile circuit protection\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "A",
    "answerDescription": "Alternative routing is a method of routing information via an alternate medium such as copper cable or fiber optics. This involves use of different networks, circuits or end points should the normal network be unavailable. Diverse routing routes traffic through split cable facilities or duplicate cable facilities. This can be accomplished with different and/or duplicate cable sheaths. If different cable sheaths are used, the cable may be in the same conduit and therefore subject to the same interruptions as the cable it is backing up. The communication service subscriber can duplicate the facilities by having alternate routes, although the entrance to and from the customer premises may be in the same conduit. The subscriber can obtain diverse routing and alternate routing from the local carrier, including dual entrance facilities. This type of access is time-consuming and costly. Long haul network diversity is a diverse long-distance network utilizing T1 circuits among the major long-distance carriers. It ensures long-distance access should any one carrier experience a network failure. Last mile circuit protection is a redundant combination of local carrier T1s microwave and/or coaxial cable access to the local communications loop. This enables the facility to have access during a local carrier communication disaster. Alternate local carrier routing is also utilized.<br>Source: Information Systems Audit and Control Association, Certified Information Systems Auditor 2002 review manual, chapter 5: Disaster Recovery and<br>Business Continuity (page 259).",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-11-27T03:57:00.000Z",
        "voteCount": 1,
        "content": "Last mile circuit protection involves using alternative media to ensure continuity of telecommunications services. It typically refers to having redundant physical pathways or media (such as fiber optic and copper lines) to connect the last mile between the service provider and the customer premises. This redundancy helps ensure that if one pathway or medium is disrupted, the telecommunications service can continue to function using the alternative pathway or medium."
      },
      {
        "date": "2022-08-01T15:31:00.000Z",
        "voteCount": 1,
        "content": "This is not correct. Alternative routing does not specific physical media, only an alternative path."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/isc/view/42269-exam-sscp-topic-6-question-69-discussion/",
    "body": "Secure Shell (SSH-2) supports authentication, compression, confidentiality, and integrity, SSH is commonly used as a secure alternative to all of the following protocols below except:<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ttelnet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\trlogin",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRSH",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHTTPS"
    ],
    "answer": "D",
    "answerDescription": "HTTPS is used for secure web transactions and is not commonly replaced by SSH.<br>Users often want to log on to a remote computer. Unfortunately, most early implementations to meet that need were designed for a trusted network. Protocols/ programs, such as TELNET, RSH, and rlogin, transmit unencrypted over the network, which allows traffic to be easily intercepted. Secure shell (SSH) was designed as an alternative to the above insecure protocols and allows users to securely access resources on remote computers over an encrypted tunnel. SSHs services include remote log-on, file transfer, and command execution. It also supports port forwarding, which redirects other protocols through an encrypted SSH tunnel. Many users protect less secure traffic of protocols, such as X Windows and VNC (virtual network computing), by forwarding them through a SSH tunnel.<br>The SSH tunnel protects the integrity of communication, preventing session hijacking and other man-in-the-middle attacks. Another advantage of SSH over its predecessors is that it supports strong authentication. There are several alternatives for SSH clients to authenticate to a SSH server, including passwords and digital certificates. Keep in mind that authenticating with a password is still a significant improvement over the other protocols because the password is transmitted encrypted.<br><br>The following were wrong answers:<br>telnet is an incorrect choice.  SSH is commonly used as an more secure alternative to telnet.  In fact Telnet should not longer be used today. rlogin is and incorrect choice.  SSH is commonly used as a more secure alternative to rlogin.<br>RSH is an incorrect choice.  SSH is commonly used as a more secure alternative to RSH.<br><br>Reference(s) used for this question:<br>Hernandez CISSP, Steven (2012-12-21). Official (ISC)2 Guide to the CISSP CBK, Third Edition ((ISC)2 Press) (Kindle Locations 7077-7088). Auerbach<br>Publications. Kindle Edition.",
    "votes": [],
    "comments": [
      {
        "date": "2021-08-10T12:31:00.000Z",
        "voteCount": 1,
        "content": "Yep the right answer is D"
      },
      {
        "date": "2021-05-06T10:32:00.000Z",
        "voteCount": 3,
        "content": "Right answer is D. SSH provides a secure option to all Except: HTTPS"
      },
      {
        "date": "2021-01-13T07:15:00.000Z",
        "voteCount": 1,
        "content": "the right answer should be A"
      },
      {
        "date": "2022-08-01T15:34:00.000Z",
        "voteCount": 2,
        "content": "Absolutely not, SSH replaces telnet."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/isc/view/59178-exam-sscp-topic-6-question-85-discussion/",
    "body": "In stateful inspection firewalls, packets are:<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInspected at only one layer of the Open System Interconnection (OSI) model",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInspected at all Open System Interconnection (OSI) layers",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDecapsulated at all Open Systems Interconnect (OSI) layers.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEncapsulated at all Open Systems Interconnect (OSI) layers."
    ],
    "answer": "B",
    "answerDescription": "Many times when a connection is opened, the firewall will inspect all layers of the packet. While this inspection is scaled back for subsequent packets to improve performance, this is the best of the four answers.<br>When packet filtering is used, a packet arrives at the firewall, and it runs through its ACLs to determine whether this packet should be allowed or denied. If the packet is allowed, it is passed on to the destination host, or to another network device, and the packet filtering device forgets about the packet. This is different from stateful inspection, which remembers and keeps track of what packets went where until each particular connection is closed. A stateful firewall is like a nosy neighbor who gets into peoples business and conversations. She keeps track of the suspicious cars that come into the neighborhood, who is out of town for the week, and the postman who stays a little too long at the neighbor ladys house. This can be annoying until your house is burglarized. Then you and the police will want to talk to the nosy neighbor, because she knows everything going on in the neighborhood and would be the one most likely to know something unusual happened.<br>\"Inspected at only one Open Systems Interconnetion (OSI) layer\" is incorrect. To perform stateful packet inspection, the firewall must consider at least the network and transport layers.<br>\"Decapsulated at all Open Systems Interconnection (OSI) layers\" is incorrect. The headers are not stripped (\"decapsulated\" if there is such a word) and are passed through in their entirety IF the packet is passed.<br>\"Encapsulated at all Open Systems Interconnect (OSI) layers\" is incorrect. Encapsulation refers to the adding of a layer's header/trailer to the information received from the above level. This is done when the packet is assembled not at the firewall.<br>Reference(s) used for this question:<br><br>CBK, p. 466 -<br>Harris, Shon (2012-10-25). CISSP All-in-One Exam Guide, 6th Edition (pp. 632-633). McGraw-Hill. Kindle Edition.",
    "votes": [],
    "comments": [
      {
        "date": "2021-08-03T12:32:00.000Z",
        "voteCount": 1,
        "content": "Very funny explanation!"
      },
      {
        "date": "2023-02-04T08:38:00.000Z",
        "voteCount": 1,
        "content": "you are very funny"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/isc/view/133923-exam-sscp-topic-6-question-94-discussion/",
    "body": "Which of the following elements of telecommunications is not used in assuring confidentiality?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork security protocols",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork authentication services",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData encryption services",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPasswords D"
    ],
    "answer": "Explanation",
    "answerDescription": "Passwords are one of the multiple ways to authenticate (prove who you claim to be) an identity which allows confidentiality controls to be enforced to assure the identity can only access the information for which it is authorized. It is the authentication that assists assurance of confidentiality not the passwords.<br>\"Network security protocols\" is incorrect. Network security protocols are quite useful in assuring confidentiality in network communications.<br>\"Network authentication services\" is incorrect. Confidentiality is concerned with allowing only authorized users to access information. An important part of determining authorization is authenticating an identity and this service is supplied by network authentication services.<br>\"Data encryption services\" is incorrect. Data encryption services are quite useful in protecting the confidentiality of information.<br>Reference(s) used for this question:<br>Official ISC2 Guide to the CISSP CBK, pp. 407 - 520<br>AIO 3rd Edition, pp. 415 - 580",
    "votes": [],
    "comments": [
      {
        "date": "2024-02-14T19:32:00.000Z",
        "voteCount": 1,
        "content": "D is the answer"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/isc/view/52008-exam-sscp-topic-6-question-129-discussion/",
    "body": "Which of the following mechanisms was created to overcome the problem of collisions that occur on wired networks when traffic is simultaneously transmitted from different nodes?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCarrier sense multiple access with collision avoidance (CSMA/CA)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCarrier sense multiple access with collision detection (CSMA/CD)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPolling",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tToken-passing"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-09T11:09:00.000Z",
        "voteCount": 7,
        "content": "Token ring doesn't make sense as it specifically lists \"multiple nodes.\" The whole point of token ring is that you don't communicate if you don't have the token.\n\nCSMA/CA is for Wi-Fi\nCSMA/CD is for Ethernet\n\nSince it says wired, the only answer that makes sense is CSMA/CD"
      },
      {
        "date": "2022-10-13T14:41:00.000Z",
        "voteCount": 1,
        "content": "I'm confused, are you saying the token ring doesn't make sense because above it states above \"simultaneously transmitted from different nodes\"? Or did that part get looked over and it didn't make sense because token-passing is the actual process of passing the token to nodes in order to transmit?\n\nCSMA/CA isn't correct because it's not a wired network.\n\nEither way, token-passing is 100% the correct answer. In order to \"talk\" you need to hold the \"special token,\" or else you sit there silently. It's a black-and-white situation and completely avoids collisions."
      },
      {
        "date": "2022-10-13T14:42:00.000Z",
        "voteCount": 3,
        "content": "CSMA/CD is collision detection, not avoidance, even though it tries its best to avoid it.  The issue is when two nodes want to transmit at the same time. If both channels kick on their random timer for x amount of time. Channel 1 ends up having a smaller wait time because it's randomized and it starts to transmit its frame. Channel 2 is just kicking it waiting and sees the frame come in. Now channel 2 starts to talk, but channel 1 isn't finished so they collide. Now they set the timer again and give it another shot, if they collide again channel 2 waits longer for the next randomized wait time. Now channel 1 gets more freedom to talk, and it will most likely cause yes, another collision until channel 2's timer is so long that channel 1 basically owns that entire path.\n\nThe only way they could have played on words here to make CSMA/CD the victor is if they had used \"ethernet network\" instead of \"wired network\" Token runs on (typically) type 6 or type 3 STP/UTP cable which is used in telephone circuits."
      },
      {
        "date": "2024-05-09T01:51:00.000Z",
        "voteCount": 1,
        "content": "The mechanism created to overcome the problem of collisions that occur on wired networks when traffic is simultaneously transmitted from different nodes is D. Token-passing1. This method ensures that only one device at a time has the right to transmit data, preventing collisions. In contrast, Carrier sense multiple access with collision detection (CSMA/CD) is used in Ethernet networks and allows devices to listen for a clear channel before transmitting data, but it does not prevent collisions. The other options, Carrier sense multiple access with collision avoidance (CSMA/CA) and Polling, are not specifically designed to address collision problems in wired networks. So, the correct answer is D. Token-passing."
      },
      {
        "date": "2022-07-26T16:24:00.000Z",
        "voteCount": 1,
        "content": "Answer is B CSMA/CD."
      },
      {
        "date": "2021-08-04T12:53:00.000Z",
        "voteCount": 3,
        "content": "bzpunk is right. The answer is B - CSMA/CD"
      },
      {
        "date": "2021-05-06T11:19:00.000Z",
        "voteCount": 3,
        "content": "Answer is A.\n\nhttps://www.ionos.com/digitalguide/server/know-how/csmaca-carrier-sense-multiple-access-with-collision-avoidance/"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/isc/view/95645-exam-sscp-topic-6-question-137-discussion/",
    "body": "How would an IP spoofing attack be best classified?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSession hijacking attack\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPassive attack",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFragmentation attack",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSniffing attack A"
    ],
    "answer": "Explanation",
    "answerDescription": "IP spoofing is used to convince a system that it is communicating with a known entity that gives an intruder access. IP spoofing attacks is a common session hijacking attack.<br>Source: KRUTZ, Ronald L. &amp; VINES, Russel D., The CISSP Prep Guide: Mastering the Ten Domains of Computer Security, John Wiley &amp; Sons, 2001, Chapter 3:<br>Telecommunications and Network Security (page 77).",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-02-14T19:49:00.000Z",
        "voteCount": 1,
        "content": "A is the answer"
      },
      {
        "date": "2023-01-16T20:59:00.000Z",
        "voteCount": 1,
        "content": "Answer is A."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/isc/view/42276-exam-sscp-topic-6-question-144-discussion/",
    "body": "Which of the following IEEE standards defines the token ring media access method?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t802.3",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t802.11",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t802.5\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t802.2"
    ],
    "answer": "D",
    "answerDescription": "The IEEE 802.5 standard defines the token ring media access method. 802.3 refers to Ethernet's CSMA/CD, 802.11 refers to wireless communications and 802.2 refers to the logical link control.<br>Source: KRUTZ, Ronald L. &amp; VINES, Russel D., The CISSP Prep Guide: Mastering the Ten Domains of Computer Security, John Wiley &amp; Sons, 2001, Chapter 3:<br>Telecommunications and Network Security (page 109).",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-11-28T00:08:00.000Z",
        "voteCount": 1,
        "content": "Voting C as per below"
      },
      {
        "date": "2021-08-04T07:06:00.000Z",
        "voteCount": 3,
        "content": "Yep it's C"
      },
      {
        "date": "2021-06-29T04:40:00.000Z",
        "voteCount": 4,
        "content": "C is the correct answer. IEEE 802.5 Token Ring: Token ring is the IEEE 802.5 standard for a token-passing ring in Communication networks."
      },
      {
        "date": "2021-01-13T09:29:00.000Z",
        "voteCount": 4,
        "content": "C should be the correct answer base on the explanation."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/isc/view/134242-exam-sscp-topic-6-question-157-discussion/",
    "body": "Which of the following remote access authentication systems is the most robust?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTACACS+",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRADIUS",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPAP\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTACACS"
    ],
    "answer": "A",
    "answerDescription": "TACACS+ is a proprietary Cisco enhancement to TACACS and is more robust than RADIUS. PAP is not a remote access authentication system but a remote node security protocol.<br>Source: KRUTZ, Ronald L. &amp; VINES, Russel D., The CISSP Prep Guide: Mastering the Ten Domains of Computer Security, John Wiley &amp; Sons, 2001, Chapter 3:<br>Telecommunications and Network Security (page 122).",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-09T08:34:00.000Z",
        "voteCount": 1,
        "content": "Correct answer is A.\nTACACS+ uses TCP transport protocol on port 49, which makes it more reliable than RADIUS, which uses UDP.\n\nTACACS+ allows to control the authorization of router commands on a per user or per group basis. TACACS+ can do this because it separates authentication and authorization functions, while RADIUS can’t because it combines them. So RADIUS does not allow to control your users on which commands can be executed on a router and which cannot.\n\nAnother important advantage is that TACACS+ encrypts the entire payload of the TACACS+ packet, which provides secure communication between the Network Access Server (NAS) and the TACACS+ server. RADIUS, on the other hand, encrypts only the password, so intercepting packets can reveal important information."
      },
      {
        "date": "2024-02-20T06:40:00.000Z",
        "voteCount": 1,
        "content": "I meant C for the previous question please delete this"
      },
      {
        "date": "2024-02-20T06:39:00.000Z",
        "voteCount": 1,
        "content": "This question was seen earlier and is C"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/isc/view/140231-exam-sscp-topic-6-question-169-discussion/",
    "body": "Unshielded Twisted Pair cabling is a:<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tfour-pair wire medium that is used in a variety of networks.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthree-pair wire medium that is used in a variety of networks.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ttwo-pair wire medium that is used in a variety of networks.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tone-pair wire medium that is used in a variety of networks."
    ],
    "answer": "A",
    "answerDescription": "Unshielded Twisted Pair cabling is a four-pair wire medium that is used in a variety of networks.<br>Source: KRUTZ, Ronald L. &amp; VINES, Russel D., The CISSP Prep Guide: Mastering the Ten Domains of Computer Security, 2001, John Wiley &amp; Sons, Page 101.",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-09T09:45:00.000Z",
        "voteCount": 1,
        "content": "Unshielded Twisted-pair (UTP) cabling, also known as Twisted-pair cabling, falls under the category of two-pair wire medium. It consists of individual pairs of insulated copper wires twisted together, typically encased in an outer plastic jacket. Unlike shielded twisted-pair (STP) cabling, UTP does not have additional shielding around the wires."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/isc/view/93041-exam-sscp-topic-6-question-176-discussion/",
    "body": "Which of the following statements pertaining to packet switching is incorrect?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMost data sent today uses digital signals over network employing packet switching.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMessages are divided into packets.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAll packets from a message travel through the same route.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEach network node or point examines each packet for routing."
    ],
    "answer": "C",
    "answerDescription": "When using packet switching, messages are broken down into packets. Source and destination address are added to each packet so that when passing through a network node, they can be examined and eventually rerouted through different paths as conditions change. All message packets may travel different paths and not arrive in the same order as sent. Packets need to be collected and reassembled into the original message at destination.<br>Source: TIPTON, Hal, (ISC)2, Introduction to the CISSP Exam presentation.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-28T00:31:00.000Z",
        "voteCount": 1,
        "content": "I believe C is the correct answer"
      },
      {
        "date": "2022-12-27T19:21:00.000Z",
        "voteCount": 2,
        "content": "As per your own explanation, the correct answer is D"
      },
      {
        "date": "2023-11-27T19:30:00.000Z",
        "voteCount": 1,
        "content": "Think you need to reread the explanation lol"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/isc/view/140291-exam-sscp-topic-6-question-188-discussion/",
    "body": "Which of the following protocols is designed to send individual messages securely?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tKerberos",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSecure Electronic Transaction (SET).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSecure Sockets Layer (SSL).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSecure HTTP (S-HTTP).\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "An early standard for encrypting HTTP documents, Secure HTTP (S-HTTP) is designed to send individual messages securely. SSL is designed to establish a secure connection between two computers. SET was originated by VISA and MasterCard as an Internet credit card protocol using digital signatures. Kerberos is an authentication system.<br>Source: KRUTZ, Ronald L. &amp; VINES, Russel D., The CISSP Prep Guide: Mastering the Ten Domains of Computer Security, 2001, John Wiley &amp; Sons, Page 89.",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-10T06:59:00.000Z",
        "voteCount": 1,
        "content": "Secure HTTP (S-HTTP) was an early standard designed to send individual messages securely. S-HTTP aimed to provide encryption for specific HTTP documents, allowing users to secure particular pages or resources on a website. However, it didn’t gain widespread adoption and was eventually overshadowed by Secure Sockets Layer (SSL) and its successor, Transport Layer Security (TLS). These protocols offer more comprehensive security for entire communication sessions between clients and servers, rather than just individual messages."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/isc/view/102774-exam-sscp-topic-6-question-193-discussion/",
    "body": "Which of the following is NOT a characteristic or shortcoming of packet filtering gateways?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe source and destination addresses, protocols, and ports contained in the IP packet header are the only information that is available to the router in making a decision whether or not to permit traffic access to an internal network.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThey don't protect against IP or DNS address spoofing.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThey do not support strong user authentication.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThey are appropriate for medium-risk environment."
    ],
    "answer": "D",
    "answerDescription": "Packet filtering firewalls use routers with packet filtering rules to grant or deny access based on source address, destination address, and port.<br>They offer minimum security but at a very low cost, and can be an appropriate choice for a low-risk environment.<br>Source: TIPTON, Harold F. &amp; KRAUSE, Micki, Information Security Management Handbook, 4th edition (volume 1), 2000, CRC Press, Chapter 3, Secured<br>Connections to External Networks (page 60).",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-16T00:28:00.000Z",
        "voteCount": 2,
        "content": "I think this question needs paraphrasing.. It says, \"NOT a characteristic or shortcoming of..\""
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/isc/view/131928-exam-sscp-topic-6-question-220-discussion/",
    "body": "Which of the following is NOT true about IPSec Tunnel mode?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFundamentally an IP tunnel with encryption and authentication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWorks at the Transport layer of the OSI model\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHave two sets of IP headers",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEstablished for gateway service"
    ],
    "answer": "B",
    "answerDescription": "IPSec can be run in either tunnel mode or transport mode. Each of these modes has its own particular uses and care should be taken to ensure that the correct one is selected for the solution:<br>Tunnel mode is most commonly used between gateways, or at an end-station to a gateway, the gateway acting as a proxy for the hosts behind it.<br>Transport mode is used between end-stations or between an end-station and a gateway, if the gateway is being treated as a hostfor example, an encrypted<br>Telnet session from a workstation to a router, in which the router is the actual destination.<br>As Figure 1 shows, basically transport mode should be used for end-to-end sessions and tunnel mode should be used for everything else. (Refer to the figure for the following discussion.)<br>Figure 1 Tunnel and transport modes in IPSec.<br>Figure 1 displays some examples of when to use tunnel versus transport mode:<br>Tunnel mode is most commonly used to encrypt traffic between secure IPSec gateways, such as between the Cisco router and PIX Firewall (as shown in example A in Figure 1). The IPSec gateways proxy IPSec for the devices behind them, such as Alice's PC and the HR servers in Figure 1. In example A, Alice connects to the HR servers securely through the IPSec tunnel set up between the gateways.<br>Tunnel mode is also used to connect an end-station running IPSec software, such as the Cisco Secure VPN Client, to an IPSec gateway, as shown in example<br>B.<br>In example C, tunnel mode is used to set up an IPSec tunnel between the Cisco router and a server running IPSec software. Note that Cisco IOS software and the PIX Firewall sets tunnel mode as the default IPSec mode.<br>Transport mode is used between end-stations supporting IPSec, or between an end-station and a gateway, if the gateway is being treated as a host. In example<br>D, transport mode is used to set up an encrypted Telnet session from Alice's PC running Cisco Secure VPN Client software to terminate at the PIX Firewall, enabling Alice to remotely configure the PIX Firewall securely.<br><br>AH Tunnel Versus Transport Mode -<br>Figure 2 shows the differences that the IPSec mode makes to AH. In transport mode, AH services protect the external IP header along with the data payload. AH services protect all the fields in the header that don't change in transport. The header goes after the IP header and before the ESP header, if present, and other higher-layer protocols.<br>In tunnel mode, the entire original header is authenticated, a new IP header is built, and the new IP header is protected in the same way as the IP header in transport mode.<br>Figure 2 AH tunnel versus transport mode.<br>AH is incompatible with Network Address Translation (NAT) because NAT changes the source IP address, which breaks the AH header and causes the packets to be rejected by the IPSec peer.<br>ESP Tunnel Versus Transport Mode<br>Figure 3 shows the differences that the IPSec mode makes to ESP. In transport mode, the IP payload is encrypted and the original headers are left intact. The<br>ESP header is inserted after the IP header and before the upper-layer protocol header. The upper-layer protocols are encrypted and authenticated along with the<br>ESP header. ESP doesn't authenticate the IP header itself.<br><br>NOTE -<br>Higher-layer information is not available because it's part of the encrypted payload.<br>When ESP is used in tunnel mode, the original IP header is well protected because the entire original IP datagram is encrypted. With an ESP authentication mechanism, the original IP datagram and the ESP header are included; however, the new IP header is not included in the authentication.<br>When both authentication and encryption are selected, encryption is performed first, before authentication. One reason for this order of processing is that it facilitates rapid detection and rejection of replayed or bogus packets by the receiving node. Prior to decrypting the packet, the receiver can detect the problem and potentially reduce the impact of denial-of-service attacks.<br>Figure 3 ESP tunnel versus transport mode.<br>ESP can also provide packet authentication with an optional field for authentication. Cisco IOS software and the PIX Firewall refer to this service as ESP hashed message authentication code (HMAC). Authentication is calculated after the encryption is done. The current IPSec standard specifies SHA-1 and MD5 as the mandatory HMAC algorithms.<br>The main difference between the authentication provided by ESP and AH is the extent of the coverage. Specifically, ESP doesn't protect any IP header fields unless those fields are encapsulated by ESP (tunnel mode). Figure 4 illustrates the fields protected by ESP HMAC.<br>Figure 4 ESP encryption with a keyed HMAC.<br><br>IPSec Transforms -<br>An IPSec transform specifies a single IPSec security protocol (either AH or ESP) with its corresponding security algorithms and mode. Example transforms include the following:<br>The AH protocol with the HMAC with MD5 authentication algorithm in tunnel mode is used for authentication.<br>The ESP protocol with the triple DES (3DES) encryption algorithm in transport mode is used for confidentiality of data.<br>The ESP protocol with the 56-bit DES encryption algorithm and the HMAC with SHA-1 authentication algorithm in tunnel mode is used for authentication and confidentiality.<br><br>Transform Sets -<br>A transform set is a combination of individual IPSec transforms designed to enact a specific security policy for traffic. During the ISAKMP IPSec security association negotiation that occurs in IKE phase 2 quick mode, the peers agree to use a particular transform set for protecting a particular data flow. Transform sets combine the following IPSec factors:<br>Mechanism for payload authenticationAH transform<br>Mechanism for payload encryptionESP transform<br>IPSec mode (transport versus tunnel)<br>Transform sets equal a combination of an AH transform, plus an ESP transform, plus the IPSec mode (either tunnel or transport mode).<br>This brings us to the end of the second part of this five-part series of articles covering IPSec. Be sure to catch the next installment.<br>Cisco Press at:  http://www.ciscopress.com/articles/printerfriendly.asp?p=25477 and<br>Source: TIPTON, Harold F. &amp; KRAUSE, MICKI, Information Security Management Handbook, 4th Edition, Volume 2, 2001, CRC Press, NY, Pages 166-167.",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-23T18:33:00.000Z",
        "voteCount": 1,
        "content": "B is correct. HOWEVER, IPSec Tunnel mode works at the NETWORK layer, not transport layer."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/isc/view/77067-exam-sscp-topic-6-question-223-discussion/",
    "body": "Which of the following statements pertaining to firewalls is incorrect?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFirewalls create bottlenecks between the internal and external network.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFirewalls allow for centralization of security services in machines optimized and dedicated to the task.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFirewalls protect a network at all layers of the OSI models.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFirewalls are used to create security checkpoints at the boundaries of private networks."
    ],
    "answer": "C",
    "answerDescription": "Firewalls can protect a network at multiple layers of the OSI models, however most of the firewalls do not have the ability to monitor the payload of the packets and see if an application level attack is taking place.<br>Today there are a new breed of firewall called Unified Threat Managers or UTM. They are a collection of products on a single computer and not necessarily a typical firewall. A UTM can address all of the layers but typically a firewall cannot.<br>Firewalls are security checkpoints at the boundaries of internal networks through which every packet must pass and be inspected, hence they create bottlenecks between the internal and external networks. But since external connections are relatively slow compared to modern computers, the latency caused by this bottleneck can almost be transparent.<br>By implementing the concept of border security, they centralize security services in machines optimized and dedicated to the task, thus relieving the other hosts on the network from that function.<br>Source: STREBE, Matthew and PERKINS, Charles, Firewalls 24seven, Sybex 2000, Chapter 1: Understanding Firewalls.",
    "votes": [],
    "comments": [
      {
        "date": "2022-06-24T20:27:00.000Z",
        "voteCount": 1,
        "content": "I'm sorry, but Firewalls protect the physical layer? Sounds kinda stoopit."
      },
      {
        "date": "2022-10-13T14:56:00.000Z",
        "voteCount": 3,
        "content": "It can sound as \"stoopit\" as you want but when an outside attack spins up all your virtual machines on a server and pushed that server over capacity and the resource consumption  causes overheating and equipment failure, thats a physical hardware failure. Or when your firewall is bypassed and now your ACL for credentials to a secured area is now wide open and someone rolls in and steals or damages physical equipment. Sure the firewall doesn't guard the door with a shotgun but it's still a line of defense in the physical layer."
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/isc/view/94849-exam-sscp-topic-6-question-239-discussion/",
    "body": "In the context of network enumeration by an outside attacker and possible Distributed Denial of Service (DDoS) attacks, which of the following firewall rules is not appropriate to protect an organization's internal network?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAllow echo reply outbound",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAllow echo request outbound",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDrop echo request inbound",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAllow echo reply inbound\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "A",
    "answerDescription": "Echo replies outbound should be dropped, not allowed. There is no reason for any internet users to send ICMP ECHO Request to your interal hosts from the internet.  If they wish to find out if a service is available, they can use a browser to connect to your web server or simply send an email if they wish to test your mail service.<br>Echo replies outbound could be used as part of the SMURF amplification attack where someone will send ICMP echo requests to gateways broadcast addresses in order to amplify the request by X number of users sitting behind the gateway.<br>By allowing inbound echo requests and outbound echo replies, it makes it easier for attackers to learn about the internal network as well by performing a simply ping sweep.   ICMP can also be used to find out which host has been up and running the longest which would indicates which patches are missing on the host if a critical patch required a reboot.<br>ICMP can also be use for DDoS attacks, so you should strictly limit what type of ICMP traffic would be allowed to flow through your firewall.<br>On top of all this, tools such as LOKI could be use as a client-server application to transfer files back and forward between the internat and some of your internal hosts.    LOKI is a client/server program published in the online publication Phrack . This program is a working proof-of-concept to demonstrate that data can be transmitted somewhat secretly across a network by hiding it in traffic that normally does not contain payloads. The example code can tunnel the equivalent of a<br>Unix RCMD/RSH session in either ICMP echo request (ping) packets or UDP traffic to the DNS port. This is used as a back door into a Unix system after root access has been compromised. Presence of LOKI on a system is evidence that the system has been compromised in the past.<br>The outbound echo request and inbound echo reply allow internal users to verify connectivity with external hosts.<br>The following answers are incorrect:<br>Allow echo request outbound The outbound echo request and inbound echo reply allow internal users to verify connectivity with external hosts.<br>Drop echo request inbound  There is no need for anyone on the internet to attempt pinging your internal hosts.<br>Allow echo reply inbound  The outbound echo request and inbound echo reply allow internal users to verify connectivity with external hosts.<br>Reference(s) used for this question:<br>http://www.phrack.org/issues.html?issue=49&amp;id=6<br>STREBE, Matthew and PERKINS, Charles, Firewalls 24seven, Sybex 2000, Chapter 10: The Perfect Firewall.",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-01-11T16:49:00.000Z",
        "voteCount": 1,
        "content": "Wouldn't this be D?"
      },
      {
        "date": "2023-02-02T19:41:00.000Z",
        "voteCount": 1,
        "content": "no. its A"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/isc/view/94861-exam-sscp-topic-6-question-240-discussion/",
    "body": "Which of the following packets should NOT be dropped at a firewall protecting an organization's internal network?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInbound packets with Source Routing option set",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRouter information exchange protocols",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInbound packets with an internal address as the source IP address\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutbound packets with an external destination IP address"
    ],
    "answer": "D",
    "answerDescription": "Normal outbound traffic has an internal source IP address and an external destination IP address.<br>Traffic with an internal source IP address should only come from an internal interface. Such packets coming from an external interface should be dropped.<br>Packets with the source-routing option enabled usually indicates a network intrusion attempt.<br>Router information exchange protocols like RIP and OSPF should be dropped to avoid having internal routing equipment being reconfigured by external agents.<br>Source: STREBE, Matthew and PERKINS, Charles, Firewalls 24seven, Sybex 2000, Chapter 10: The Perfect Firewall.",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-14T06:08:00.000Z",
        "voteCount": 1,
        "content": "Correct answer is D without doubt"
      },
      {
        "date": "2023-11-28T08:35:00.000Z",
        "voteCount": 1,
        "content": "why would an internal host need to route via the firewall? C is not correct."
      },
      {
        "date": "2023-01-11T19:07:00.000Z",
        "voteCount": 1,
        "content": "Inbound packets with an internal address as the source IP address.\n\nThese packets are likely to be generated by internal hosts, and their traffic needs to be allowed to reach other internal hosts and systems. Blocking this traffic would disrupt normal network communications and potentially prevent internal hosts from functioning properly."
      },
      {
        "date": "2023-02-02T19:42:00.000Z",
        "voteCount": 3,
        "content": "chatgpt again?"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/isc/view/94864-exam-sscp-topic-6-question-248-discussion/",
    "body": "At which layer of ISO/OSI does the fiber optics work?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransport layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData link layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPhysical layer\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "The Answer: Physical layer  The Physical layer is responsible for the transmission of the data through the physical medium. This includes such things as cables.",
    "answerDescription": "Fiber optics is a cabling mechanism which works at Physical layer of OSI model<br>All of the other answers are incorrect.<br>The following reference(s) were/was used to create this question:<br>Shon Harris all in one - Chapter 7 (Cabling)",
    "votes": [
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-02T19:46:00.000Z",
        "voteCount": 1,
        "content": "yeah yeah"
      },
      {
        "date": "2023-01-11T19:25:00.000Z",
        "voteCount": 1,
        "content": "Answer is D"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/isc/view/86976-exam-sscp-topic-6-question-249-discussion/",
    "body": "While using IPsec, the ESP and AH protocols both provides integrity services.   However when using AH, some special attention needs to be paid if one of the peers uses NAT for address translation service.  Which of the items below would affects the use of AH and its  Integrity Check Value (ICV) the most?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tKey session exchange",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPacket Header Source or Destination address\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVPN cryptographic key size",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCrypotographic algorithm used B"
    ],
    "answer": "Explanation",
    "answerDescription": "It may seem odd to have two different protocols that provide overlapping functionality.<br>AH provides authentication and integrity, and ESP can provide those two functions and confidentiality.<br>Why even bother with AH then?<br>In most cases, the reason has to do with whether the environment is using network address translation (NAT). IPSec will generate an integrity check value (ICV), which is really the same thing as a MAC value, over a portion of the packet. Remember that the sender and receiver generate their own values. In IPSec, it is called an ICV value. The receiver compares her ICV value with the one sent by the sender. If the values match, the receiver can be assured the packet has not been modified during transmission. If the values are different, the packet has been altered and the receiver discards the packet.<br>The AH protocol calculates this ICV over the data payload, transport, and network headers. If the packet then goes through a NAT device, the NAT device changes the IP address of the packet. That is its job. This means a portion of the data (network header) that was included to calculate the ICV value has now changed, and the receiver will generate an ICV value that is different from the one sent with the packet, which means the packet will be discarded automatically.<br>The ESP protocol follows similar steps, except it does not include the network header portion when calculating its ICV value. When the NAT device changes the IP address, it will not affect the receivers ICV value because it does not include the network header when calculating the ICV.<br>Here is a tutorial on IPSEC from the Shon Harris Blog:<br>The Internet Protocol Security (IPSec) protocol suite provides a method of setting up a secure channel for protected data exchange between two devices. The devices that share this secure channel can be two servers, two routers, a workstation and a server, or two gateways between different networks. IPSec is a widely accepted standard for providing network layer protection. It can be more flexible and less expensive than end-to end and link encryption methods.<br>IPSec has strong encryption and authentication methods, and although it can be used to enable tunneled communication between two computers, it is usually employed to establish virtual private networks (VPNs) among networks across the Internet.<br>IPSec is not a strict protocol that dictates the type of algorithm, keys, and authentication method to use. Rather, it is an open, modular framework that provides a lot of flexibility for companies when they choose to use this type of technology. IPSec uses two basic security protocols: Authentication Header (AH) and<br>Encapsulating Security Payload (ESP). AH is the authenticating protocol, and ESP is an authenticating and encrypting protocol that uses cryptographic mechanisms to provide source authentication, confidentiality, and message integrity.<br>IPSec can work in one of two modes: transport mode, in which the payload of the message is protected, and tunnel mode, in which the payload and the routing and header information are protected. ESP in transport mode encrypts the actual message information so it cannot be sniffed and uncovered by an unauthorized entity. Tunnel mode provides a higher level of protection by also protecting the header and trailer data an attacker may find useful. Figure 8-26 shows the high- level view of the steps of setting up an IPSec connection.<br>Each device will have at least one security association (SA) for each VPN it uses. The SA, which is critical to the IPSec architecture, is a record of the configurations the device needs to support an IPSec connection. When two devices complete their handshaking process, which means they have agreed upon a long list of parameters they will use to communicate, these data must be recorded and stored somewhere, which is in the SA.<br>The SA can contain the authentication and encryption keys, the agreed-upon algorithms, the key lifetime, and the source IP address. When a device receives a packet via the IPSec protocol, it is the SA that tells the device what to do with the packet. So if device B receives a packet from device C via IPSec, device B will look to the corresponding SA to tell it how to decrypt the packet, how to properly authenticate the source of the packet, which key to use, and how to reply to the message if necessary.<br>SAs are directional, so a device will have one SA for outbound traffic and a different SA for inbound traffic for each individual communication channel. If a device is connecting to three devices, it will have at least six SAs, one for each inbound and outbound connection per remote device. So how can a device keep all of these<br>SAs organized and ensure that the right SA is invoked for the right connection? With the mighty secu rity parameter index (SPI), thats how. Each device has an<br>SPI that keeps track of the different SAs and tells the device which one is appropriate to invoke for the different packets it receives. The SPI value is in the header of an IPSec packet, and the device reads this value to tell it which SA to consult.<br>IPSec can authenticate the sending devices of the packet by using MAC (covered in the earlier section, \"The One-Way Hash\"). The ESP protocol can provide authentication, integrity, and confidentiality if the devices are configured for this type of functionality.<br>So if a company just needs to make sure it knows the source of the sender and must be assured of the integrity of the packets, it would choose to use AH. If the company would like to use these services and also have confidentiality, it would use the ESP protocol because it provides encryption functionality. In most cases, the reason ESP is employed is because the company must set up a secure VPN connection.<br>It may seem odd to have two different protocols that provide overlapping functionality. AH provides authentication and integrity, and ESP can provide those two functions and confidentiality. Why even bother with AH then? In most cases, the reason has to do with whether the environment is using network address translation (NAT). IPSec will generate an integrity check value (ICV), which is really the same thing as a MAC value, over a portion of the packet. Remember that the sender and receiver generate their own values. In IPSec, it is called an ICV value. The receiver compares her ICV value with the one sent by the sender. If the values match, the receiver can be assured the packet has not been modified during transmission. If the values are different, the packet has been altered and the receiver discards the packet.<br>The AH protocol calculates this ICV over the data payload, transport, and network headers. If the packet then goes through a NAT device, the NAT device changes the IP address of the packet. That is its job. This means a portion of the data (network header) that was included to calculate the ICV value has now changed, and the receiver will generate an ICV value that is different from the one sent with the packet, which means the packet will be discarded automatically.<br>The ESP protocol follows similar steps, except it does not include the network header portion when calculating its ICV value. When the NAT device changes the IP address, it will not affect the receivers ICV value because it does not include the network header when calculating the ICV.<br>Because IPSec is a framework, it does not dictate which hashing and encryption algorithms are to be used or how keys are to be exchanged between devices.<br>Key management can be handled manually or automated by a key management protocol. The de facto standard for IPSec is to use Internet Key Exchange (IKE), which is a combination of the ISAKMP and OAKLEY protocols. The Internet Security Association and Key Management Protocol (ISAKMP) is a key exchange architecture that is independent of the type of keying mechanisms used. Basically, ISAKMP provides the framework of what can be negotiated to set up an IPSec connection (algorithms, protocols, modes, keys). The OAKLEY protocol is the one that carries out the negotiation process. You can think of ISAKMP as providing the playing field (the infrastructure) and OAKLEY as the guy running up and down the playing field (carrying out the steps of the negotiation).<br>IPSec is very complex with all of its components and possible configurations. This complexity is what provides for a great degree of flexibility, because a company has many different configuration choices to achieve just the right level of protection. If this is all new to you and still confusing, please review one or more of the following references to help fill in the gray areas.<br>The following answers are incorrect:<br>The other options are distractors.<br>The following reference(s) were/was used to create this question:<br>Shon Harris, CISSP All-in-One Exam Guide- fiveth edition, page 759 and https://neodean.wordpress.com/tag/security-protocol/",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-07-11T11:57:00.000Z",
        "voteCount": 1,
        "content": "It's B baby"
      },
      {
        "date": "2024-04-17T18:33:00.000Z",
        "voteCount": 1,
        "content": "Are these questions even on the test?"
      },
      {
        "date": "2022-11-04T04:05:00.000Z",
        "voteCount": 4,
        "content": "tl;dr B is correct"
      }
    ],
    "examNameCode": "sscp",
    "topicNumber": "6"
  }
]