[
  {
    "topic": 5,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/google/view/10722-exam-professional-cloud-architect-topic-5-question-1/",
    "body": "Mountkirk Games wants you to design their new testing strategy. How should the test coverage differ from their existing backends on the other platforms?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTests should scale well beyond the prior approaches\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUnit tests are no longer required, only end-to-end tests",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTests should be applied after the release is in the production environment",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTests should include directly testing the Google Cloud Platform (GCP) infrastructure"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 28,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 13,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2020-02-25T17:52:00.000Z",
        "voteCount": 35,
        "content": "Tests should include directly \"testing the Google Cloud Platform (GCP) infrastructure\". I don't what does this mean? Testing their resources running on GCP infrastructure or testing GCP services itself? Regardless, Option D suggests SLA requirements which is not the problem. The problem is scalability that can be resolved through stress testing. Also, GCP services are indirectly tested through it (Option D). Hence, I choose option A."
      },
      {
        "date": "2022-06-17T20:46:00.000Z",
        "voteCount": 2,
        "content": "Same, no sense at all to test GCP infra"
      },
      {
        "date": "2022-08-28T18:57:00.000Z",
        "voteCount": 4,
        "content": "Can GCP Infrastructure configuration can be tested like Security, Firewall, Performance, Scaling, Failure ... Istion Failure Injections ... \nA is too generic ... without any reference to what it means"
      },
      {
        "date": "2023-03-31T10:19:00.000Z",
        "voteCount": 1,
        "content": "\"How should the test coverage differ from their existing backends on the other platforms?\"\n\nTest coverage. They are already testing scale. Testing GPA isn’t currently covered."
      },
      {
        "date": "2019-12-20T08:44:00.000Z",
        "voteCount": 15,
        "content": "Should be D, bcaz need to test GCP products too...."
      },
      {
        "date": "2020-08-07T03:29:00.000Z",
        "voteCount": 16,
        "content": "A is ok"
      },
      {
        "date": "2020-08-07T03:30:00.000Z",
        "voteCount": 5,
        "content": "\" had problems scaling their global audience, application servers MySQL databases, and analytics tools.\""
      },
      {
        "date": "2020-08-14T04:58:00.000Z",
        "voteCount": 7,
        "content": "sorry, changing to D"
      },
      {
        "date": "2022-08-28T18:56:00.000Z",
        "voteCount": 1,
        "content": "Configuration of GCP Platform, scaling, scale down, etc ,,,, so D ... A option is to generic  .. Testing to scale beyond previous approaches"
      },
      {
        "date": "2021-03-04T19:47:00.000Z",
        "voteCount": 8,
        "content": "It is D. New to GCP, migrated to GCP.... time to test if it works or not."
      },
      {
        "date": "2024-07-03T06:27:00.000Z",
        "voteCount": 1,
        "content": "option a suits"
      },
      {
        "date": "2023-11-27T00:11:00.000Z",
        "voteCount": 3,
        "content": "A\nAll other options are funny! D the most - we are charged to increase the test coverage and/or test strategy not for GCP infra :-)"
      },
      {
        "date": "2023-11-18T16:24:00.000Z",
        "voteCount": 2,
        "content": "If D is correct, A is correct too. A include D. If we only choose 1 option, it must be A."
      },
      {
        "date": "2023-06-29T05:28:00.000Z",
        "voteCount": 1,
        "content": "Tests should scale well beyond the prior approaches seems correct, since they are migrating to new GCP infrastructure they should have higher scalability in tests. D - Tests should include directly testing the Google Cloud Platform (GCP) infrastructure  seems not required, if they test the app in GCP env that makes sense, just testing GCP infrastructure without any app code in between is not needed."
      },
      {
        "date": "2023-06-17T06:51:00.000Z",
        "voteCount": 4,
        "content": "Are these Mountkirk Games case questions still appearing on the exam?"
      },
      {
        "date": "2023-04-03T07:09:00.000Z",
        "voteCount": 3,
        "content": "As they expect the new game to be very popular, their testing strategy should be designed to scale beyond their previous approaches to ensure that the game can handle the increased traffic and user demands."
      },
      {
        "date": "2023-03-31T10:20:00.000Z",
        "voteCount": 1,
        "content": "How should the test coverage differ from their existing backends on the other platforms?\"  Test coverage. They are already testing scale. Testing GPA isn’t currently covered."
      },
      {
        "date": "2023-03-27T00:28:00.000Z",
        "voteCount": 1,
        "content": "DDDDDDDDD"
      },
      {
        "date": "2023-03-14T11:30:00.000Z",
        "voteCount": 1,
        "content": "Wording in Answer Choice D is intended to confuse. What is being tested is the ability of GCP to handle the scale that Mountkirk needs as the infra of the prior cloud provider could not scale."
      },
      {
        "date": "2023-03-14T11:27:00.000Z",
        "voteCount": 2,
        "content": "The previous \"cloud\" provider could not scale so the need here is to ensure that GCP scales. A is meaningless and generic."
      },
      {
        "date": "2022-12-28T02:36:00.000Z",
        "voteCount": 6,
        "content": "The correct answer is A: Tests should scale well beyond the prior approaches.\n\nMountkirk Games' new game is expected to be very popular, so it's important to have a testing strategy that can handle a high volume of users and ensure that the game can scale well. This means that the test coverage for the new game's backend should be significantly higher than the test coverage for their existing backends on other platforms.\n\nUnit tests and end-to-end tests are both important for ensuring the quality and reliability of the game's backend, so both types of tests should be included in the testing strategy. Testing the GCP infrastructure directly may not be necessary, as GCP provides managed services that are expected to be reliable and well-maintained.\n\nIt's generally not recommended to perform testing only in the production environment, as this can potentially cause problems for live users and result in lost revenue. Instead, it's important to test the game's backend thoroughly in a staging or testing environment before deploying it to production."
      },
      {
        "date": "2022-12-03T07:15:00.000Z",
        "voteCount": 2,
        "content": "A is essential as customer want a scalable system\nB&amp;C does not make sense from testing perspective. \nD is remotely impossible as it might breach acceptable use policy conditions… best to check with Google before doing so."
      },
      {
        "date": "2023-03-14T11:28:00.000Z",
        "voteCount": 2,
        "content": "You don't need permission to stress test your app on GCP."
      },
      {
        "date": "2022-11-05T03:22:00.000Z",
        "voteCount": 2,
        "content": "ok for A"
      },
      {
        "date": "2022-10-20T12:58:00.000Z",
        "voteCount": 1,
        "content": "A makes sense to me"
      },
      {
        "date": "2022-09-22T07:20:00.000Z",
        "voteCount": 1,
        "content": "A is my answer"
      }
    ],
    "examNameCode": "professional-cloud-architect",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/google/view/9190-exam-professional-cloud-architect-topic-5-question-2/",
    "body": "Mountkirk Games has deployed their new backend on Google Cloud Platform (GCP). You want to create a through testing process for new versions of the backend before they are released to the public. You want the testing environment to scale in an economical way. How should you design the process?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a scalable environment in GCP for simulating production load\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the existing infrastructure to test the GCP-based backend at scale",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBuild stress tests into each component of your application using resources internal to GCP to simulate load",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a set of static environments in GCP to test different levels of load ג€\" for example, high, medium, and low"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2019-11-26T17:56:00.000Z",
        "voteCount": 39,
        "content": "A is correct because simulating production load in GCP can scale in an economical way.\n\nB is not correct because one of the pain points about the existing infrastructure was precisely that the environment did not scale well. C is not correct because it is a best practice to have a clear separation between test and production environments. Generating test load should not be done from a production environment. D is not correct because Mountkirk Games wants the testing environment to scale as needed. Defining several static environments for specific levels of load goes against this requirement."
      },
      {
        "date": "2021-03-04T19:49:00.000Z",
        "voteCount": 2,
        "content": "A is correct."
      },
      {
        "date": "2020-07-01T12:05:00.000Z",
        "voteCount": 17,
        "content": "The question is taken from Google Practice Exam\nA: is correct because simulating production load in GCP can scale in an economical way. \n\nB: is not correct because one of the pain points about the existing infrastructure was precisely that the environment did not scale well. \n\nC: is not correct because it is a best practice to have a clear separation between test and production environments. Generating test load should not be done from a production environment. \n\nD: is not correct because Mountkirk Games wants the testing environment to scale as needed. Defining several static environments for specific levels of load goes against this requirement."
      },
      {
        "date": "2022-06-17T21:17:00.000Z",
        "voteCount": 4,
        "content": "C option doesn't mention if that takes production load."
      },
      {
        "date": "2024-01-20T00:26:00.000Z",
        "voteCount": 1,
        "content": "No doubts"
      },
      {
        "date": "2023-12-25T16:39:00.000Z",
        "voteCount": 1,
        "content": "People are saying that test and production environments must be separate, and that's correct, but I don't see where in C it's speaking about the production environment. It's speaking about stress testing each component by itself to see if it's able to handle the expected load. So I'm sticking with C."
      },
      {
        "date": "2023-03-14T11:36:00.000Z",
        "voteCount": 3,
        "content": "Not sure why C is not correct. That is the approach for testing an app in a non-prod environment."
      },
      {
        "date": "2023-12-25T16:38:00.000Z",
        "voteCount": 1,
        "content": "I think the same. People are saying that test and production environments must be separate, and that's correct, but I don't see where in C it's speaking about the production environment. It's speaking about stress testing each component by itself to see if it's able to handle the expected load."
      },
      {
        "date": "2022-12-28T02:39:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is A: Create a scalable environment in GCP for simulating production load.\nTo create a thorough testing process for new versions of the backend before they are released to the public, it's important to simulate production load in the testing environment. This will help ensure that the backend can handle the expected volume of users and scale appropriately.\n\nOne way to do this is to create a scalable environment in GCP that can simulate production load. This could involve using GCP services such as Google Compute Engine or Google Kubernetes Engine to spin up multiple virtual machines or containers to simulate a high volume of requests and traffic. This approach will allow you to test the backend at scale and ensure that it can handle the expected load."
      },
      {
        "date": "2022-12-28T02:39:00.000Z",
        "voteCount": 1,
        "content": "Using the existing infrastructure to test the GCP-based backend at scale may not be feasible, as the existing infrastructure may not be capable of simulating the expected production load. Building stress tests into each component of the application using internal GCP resources could be time-consuming and may not provide a realistic simulation of production load. Creating a set of static environments in GCP to test different levels of load may not be sufficient for testing the backend at scale, as the load may not be consistent with what is expected in production."
      },
      {
        "date": "2022-12-02T06:19:00.000Z",
        "voteCount": 1,
        "content": "A is the right answer"
      },
      {
        "date": "2022-11-05T03:23:00.000Z",
        "voteCount": 1,
        "content": "ok for A"
      },
      {
        "date": "2022-10-15T20:47:00.000Z",
        "voteCount": 2,
        "content": "I would like to choose A because it satisfy the given requirements"
      },
      {
        "date": "2022-09-18T03:59:00.000Z",
        "voteCount": 1,
        "content": "A is correct because simulating production load in GCP can scale in an economical way."
      },
      {
        "date": "2022-09-10T10:30:00.000Z",
        "voteCount": 3,
        "content": "The question is taken from Google Practice Exam\nA: is correct because simulating production load in GCP can scale in an economical way."
      },
      {
        "date": "2021-12-11T11:31:00.000Z",
        "voteCount": 1,
        "content": "A is the correct answer"
      },
      {
        "date": "2021-11-26T19:50:00.000Z",
        "voteCount": 1,
        "content": "vote A"
      },
      {
        "date": "2021-07-07T06:50:00.000Z",
        "voteCount": 3,
        "content": "Answer is A"
      },
      {
        "date": "2021-06-03T17:44:00.000Z",
        "voteCount": 1,
        "content": "Answer: A"
      },
      {
        "date": "2021-05-21T00:24:00.000Z",
        "voteCount": 2,
        "content": "A. Create a scalable environment in GCP for simulating production load"
      },
      {
        "date": "2021-04-01T06:13:00.000Z",
        "voteCount": 1,
        "content": "Answer is A"
      }
    ],
    "examNameCode": "professional-cloud-architect",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/google/view/6549-exam-professional-cloud-architect-topic-5-question-3/",
    "body": "Mountkirk Games wants to set up a continuous delivery pipeline. Their architecture includes many small services that they want to be able to update and roll back quickly. Mountkirk Games has the following requirements:<br>✑ Services are deployed redundantly across multiple regions in the US and Europe<br>✑ Only frontend services are exposed on the public internet<br>✑ They can provide a single frontend IP for their fleet of services<br>✑ Deployment artifacts are immutable<br>Which set of products should they use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGoogle Cloud Storage, Google Cloud Dataflow, Google Compute Engine",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGoogle Cloud Storage, Google App Engine, Google Network Load Balancer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGoogle Kubernetes Registry, Google Container Engine, Google HTTP(S) Load Balancer\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGoogle Cloud Functions, Google Cloud Pub/Sub, Google Cloud Deployment Manager"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 14,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2019-10-13T18:53:00.000Z",
        "voteCount": 47,
        "content": "Correct answer is C."
      },
      {
        "date": "2021-03-04T19:51:00.000Z",
        "voteCount": 4,
        "content": "C is correct"
      },
      {
        "date": "2021-09-04T02:01:00.000Z",
        "voteCount": 42,
        "content": "Answer is C but options should have been Google Kubernetes Engine, Google Container Registry, Google HTTP(S) Load Balancer"
      },
      {
        "date": "2023-12-30T17:04:00.000Z",
        "voteCount": 3,
        "content": "Answer is C, but Container Registry is deprecated, Google is using Artifact Registry now."
      },
      {
        "date": "2019-12-05T06:01:00.000Z",
        "voteCount": 33,
        "content": "If the Question is erroneously formulated, and they mean Google Container Registry and Google Kubernetes Engine, then C is the right answer"
      },
      {
        "date": "2021-02-19T05:07:00.000Z",
        "voteCount": 2,
        "content": "Maybe is not: they could have mispelled on purpose! ;)"
      },
      {
        "date": "2020-07-06T20:19:00.000Z",
        "voteCount": 3,
        "content": "Yeah Exactly! The choice was confusing."
      },
      {
        "date": "2024-07-27T07:57:00.000Z",
        "voteCount": 1,
        "content": "How does C work? \nThere is no such thing as Google Kubernetes Registry\nGoogle Container Engine is the underlying virtualization stack, not a service you can use.\nThe whole terminology is completely off here, completely outdated"
      },
      {
        "date": "2024-01-20T00:30:00.000Z",
        "voteCount": 1,
        "content": "Easy easy"
      },
      {
        "date": "2024-01-18T18:56:00.000Z",
        "voteCount": 2,
        "content": "Refer to this: \"Mountkirk Games makes online, session-based, multiplayer games for the most popular *mobile* platforms.\"\n\nWho says it's web-based, so it's required to have HTTP(S) Load Balancer? The games are for mobile devices. TCP/UDP protocols would suffice.\n\nI bet they (MountKirk Games or EA ;0 ) just also want to collect non-proxied IP addresses from the players. Also, for the mobile platform games, the requests most likely use UDP protocol for inter-player communication/chat. This filter out HTTP(S) proxied Load Balancer effectively, as it has to be an external Network Load Balancer which allow UDP and pass-through requests.\n\nSeems, like all answers are wrong."
      },
      {
        "date": "2023-03-14T13:24:00.000Z",
        "voteCount": 1,
        "content": "Oooooh. Old skool wording"
      },
      {
        "date": "2023-03-14T11:41:00.000Z",
        "voteCount": 3,
        "content": "How is C the answer? No such thing as Google Kubernetes Registry and Google Container Engine"
      },
      {
        "date": "2022-12-28T02:41:00.000Z",
        "voteCount": 6,
        "content": "The correct answer is C: Google Kubernetes Registry, Google Container Engine, Google HTTP(S) Load Balancer.\n\nTo meet the requirements listed in the question, Mountkirk Games should use Google Kubernetes Registry to store their immutable deployment artifacts, Google Container Engine to run their services in a Kubernetes cluster, and Google HTTP(S) Load Balancer to expose their frontend services on the public internet and provide a single frontend IP for their fleet of services."
      },
      {
        "date": "2022-11-05T03:31:00.000Z",
        "voteCount": 1,
        "content": "ok for C"
      },
      {
        "date": "2022-10-15T20:50:00.000Z",
        "voteCount": 1,
        "content": "C is correct"
      },
      {
        "date": "2022-09-10T10:39:00.000Z",
        "voteCount": 3,
        "content": "Only C and we will see."
      },
      {
        "date": "2022-07-24T03:11:00.000Z",
        "voteCount": 1,
        "content": "HTTP(S) Load Balancer is GLOBAL !!!!"
      },
      {
        "date": "2021-12-21T09:50:00.000Z",
        "voteCount": 14,
        "content": "A is not correct because Mountkirk Games wants to set up a continuous delivery pipeline, not a data processing pipeline. Cloud Dataflow is a fully managed service for creating data processing pipelines.\n\nB is not correct because a Cloud Load Balancer distributes traffic to Compute Engine instances. App Engine and Cloud Load Balancer are parts of different solutions.\n\nC is correct because:\n-Google Kubernetes Engine is ideal for deploying small services that can be updated and rolled back quickly. It is a best practice to manage services using immutable containers. -Cloud Load Balancing supports globally distributed services across multiple regions. It provides a single global IP address that can be used in DNS records. Using URL Maps, the requests can be routed to only the services that Mountkirk wants to expose. -Container Registry is a single place for a team to manage Docker images for the services.\n\nD is not correct because you cannot reserve a single frontend IP for cloud functions. When deployed, an HTTP-triggered cloud function creates an endpoint with an automatically assigned IP."
      },
      {
        "date": "2021-12-11T11:19:00.000Z",
        "voteCount": 2,
        "content": "C is the correct answer"
      },
      {
        "date": "2021-11-27T04:53:00.000Z",
        "voteCount": 3,
        "content": "\"They can provide a single frontend IP for their fleet of services\"\n\nonly C can do that"
      },
      {
        "date": "2021-11-26T19:51:00.000Z",
        "voteCount": 2,
        "content": "vote C"
      },
      {
        "date": "2021-09-24T10:50:00.000Z",
        "voteCount": 1,
        "content": "CCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCCC"
      }
    ],
    "examNameCode": "professional-cloud-architect",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/google/view/9253-exam-professional-cloud-architect-topic-5-question-4/",
    "body": "Mountkirk Games' gaming servers are not automatically scaling properly. Last month, they rolled out a new feature, which suddenly became very popular. A record number of users are trying to use the service, but many of them are getting 503 errors and very slow response times. What should they investigate first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify that the database is online",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify that the project quota hasn't been exceeded",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify that the new feature code did not introduce any performance bugs\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify that the load-testing team is not running their tool against production"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 25,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 18,
        "isMostVoted": false
      },
      {
        "answer": "D",
        "count": 8,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2020-01-16T23:29:00.000Z",
        "voteCount": 22,
        "content": "Ans is B"
      },
      {
        "date": "2020-06-06T09:36:00.000Z",
        "voteCount": 11,
        "content": "B is the correct answer\nError code starting like 5xx is something related to server\n503\tUNAVAILABLE\tService unavailable. Typically the server is down."
      },
      {
        "date": "2021-02-16T01:12:00.000Z",
        "voteCount": 2,
        "content": "When server is down you will get timeout (503 - service unavailable - not server)"
      },
      {
        "date": "2024-10-14T10:47:00.000Z",
        "voteCount": 1,
        "content": "It's B"
      },
      {
        "date": "2024-06-02T09:19:00.000Z",
        "voteCount": 2,
        "content": "When you encounter the 503 error, it means that the server in question is unavailable. That could be because it's too busy, for example, or it's under maintenance. Unlike other similar error codes, 503 signifies that your website is online and running, but can't be reached at the present moment"
      },
      {
        "date": "2024-04-27T13:25:00.000Z",
        "voteCount": 2,
        "content": "Its very common that the Gateway goes down and throws 503 if the load on the server is beyond limit. Performance Bug is a good option but it will take a lot of time. Its always better to start debugging from the \"step-1\"; checking the project quota will be faster, hence, I go with B"
      },
      {
        "date": "2024-04-24T11:09:00.000Z",
        "voteCount": 2,
        "content": "In my opinion C"
      },
      {
        "date": "2024-04-12T09:28:00.000Z",
        "voteCount": 2,
        "content": "I vote for C"
      },
      {
        "date": "2024-03-13T17:40:00.000Z",
        "voteCount": 2,
        "content": "B. \n\"What should the team investigate first?\" Quota limits are easy to check, and considering the scaling issues this could be the cause even though Google Typically responds with a 429 to 'over Quota' issues.\nChecking for bugs can be very time consuming, especially if the bugs are related to scale or are intermittent. Go with the first easy thing to check... B."
      },
      {
        "date": "2024-02-11T09:06:00.000Z",
        "voteCount": 2,
        "content": "Such symptoms occur when servers are overloaded which might have caused because of load testing. hence option D would be first thing I would do before I go into deep details of analyzing performance bug."
      },
      {
        "date": "2024-02-01T17:14:00.000Z",
        "voteCount": 3,
        "content": "It cannot be A or B for Sure.\nIf you exceeded a quota value with an HTTP/REST request, Google Cloud returns an HTTP 429 TOO MANY REQUESTS status code.\nStill not sure between C &amp; D. Will prefer D. Any thoughts?"
      },
      {
        "date": "2024-01-29T09:47:00.000Z",
        "voteCount": 7,
        "content": "for me it's C. \n\n503 is service unavailable, for quota problem in GCP we get 429 (https://cloud.google.com/docs/quota/troubleshoot : If you exceeded a quota value with an HTTP/REST request, Google Cloud returns an HTTP 429 TOO MANY REQUESTS status code.)\n\n\nA. Verify that the database is online - if db is down it would be down for all users\nB. Verify that the project quota hasn't been exceeded Most Voted - quota error is 429 https://cloud.google.com/docs/quota/troubleshoot\nC. Verify that the new feature code did not introduce any performance bugs - performance issues would translate into latency issue and possible 503 \nD. Verify that the load-testing team is not running their tool against production -"
      },
      {
        "date": "2024-05-01T19:07:00.000Z",
        "voteCount": 1,
        "content": "Thanks for this explanation."
      },
      {
        "date": "2023-12-25T16:57:00.000Z",
        "voteCount": 3,
        "content": "I think D is the correct one.\nA couldn't be because all players would get the error, not only a few.\nB I don't think it is because the Business objetives tell us that they want to scale globally. Setting a quota would limit their scalability to reduce costs, and the CFO didn't set any cost-reducing objectives.\nC is a good one to do, but would not be the first one. Searching the code for bugs is a task that would take long hours to complete, so I would do it only if the firsts and obvious checks didn't find anything.\nThat leaves D as the first thing to check before going with C. Discarding A &amp; B."
      },
      {
        "date": "2024-02-27T02:04:00.000Z",
        "voteCount": 1,
        "content": "agree is D, quota error code are 4xx. \nhttps://cloud.google.com/docs/quotas/troubleshoot"
      },
      {
        "date": "2024-01-20T00:33:00.000Z",
        "voteCount": 1,
        "content": "Lol😂 Three is always default quota SO B is correct"
      },
      {
        "date": "2024-01-18T19:10:00.000Z",
        "voteCount": 1,
        "content": "Finally, the correct voice here.\n\nhttps://developer.mozilla.org/en-US/docs/Web/HTTP/Status/503\n\"503 Service Unavailable\n\nThe HyperText Transfer Protocol (HTTP) 503 Service Unavailable server error response code indicates that the server is not ready to handle the request.\n\nCommon causes are a server that is down for maintenance or that is *overloaded*.\""
      },
      {
        "date": "2023-12-18T18:40:00.000Z",
        "voteCount": 2,
        "content": "There has been new feature implemented last month, when the requests reached new level the infra didn't scale well anymore, I will first investigate that feature didn't cause performance issues or memory leaks."
      },
      {
        "date": "2023-12-15T07:14:00.000Z",
        "voteCount": 1,
        "content": "It is B. They key here is \"...which suddenly became very popular.\" Which might have caused a quota limit issue all sudden."
      },
      {
        "date": "2023-10-06T02:32:00.000Z",
        "voteCount": 3,
        "content": "I think it should be D. Load testing should not be done in Production and if it is getting dome there and actual high traffic comes from users then application will  crash."
      },
      {
        "date": "2023-08-28T04:25:00.000Z",
        "voteCount": 2,
        "content": "my focus is 'quickly investigated first' - quota is the easiest and quickest to check"
      },
      {
        "date": "2023-08-27T02:42:00.000Z",
        "voteCount": 2,
        "content": "For me its both B &amp; C, but since quota verification is simpler and can be done quickly, they should start there. (keyword: \"What should they investigate first?\")"
      }
    ],
    "examNameCode": "professional-cloud-architect",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/google/view/9191-exam-professional-cloud-architect-topic-5-question-5/",
    "body": "Mountkirk Games needs to create a repeatable and configurable mechanism for deploying isolated application environments. Developers and testers can access each other's environments and resources, but they cannot access staging or production resources. The staging environment needs access to some services from production.<br>What should you do to isolate development environments from staging and production?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a project for development and test and another for staging and production",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a network for development and test and another for staging and production",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate one subnetwork for development and another for staging and production",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate one project for development, a second for staging and a third for production\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 32,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 29,
        "isMostVoted": false
      },
      {
        "answer": "B",
        "count": 8,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2019-11-26T18:13:00.000Z",
        "voteCount": 48,
        "content": "Correct Answer is D. \nhttps://cloud.google.com/appengine/docs/standard/php/creating-separate-dev-environments"
      },
      {
        "date": "2021-03-04T19:53:00.000Z",
        "voteCount": 6,
        "content": "it is A"
      },
      {
        "date": "2020-08-10T14:53:00.000Z",
        "voteCount": 9,
        "content": "D is ok"
      },
      {
        "date": "2020-08-14T05:05:00.000Z",
        "voteCount": 15,
        "content": "not D, A"
      },
      {
        "date": "2021-09-24T10:51:00.000Z",
        "voteCount": 2,
        "content": "hey man...it should be D..."
      },
      {
        "date": "2021-11-06T01:59:00.000Z",
        "voteCount": 2,
        "content": "It's D!!!!"
      },
      {
        "date": "2022-01-19T11:09:00.000Z",
        "voteCount": 1,
        "content": "its standard but look at requirement given here"
      },
      {
        "date": "2019-12-25T22:35:00.000Z",
        "voteCount": 47,
        "content": "Correct is A"
      },
      {
        "date": "2021-04-26T08:40:00.000Z",
        "voteCount": 8,
        "content": "\"The staging environment needs access to some services from production\"\nIts not the best practice, but A has less effort"
      },
      {
        "date": "2021-04-02T09:18:00.000Z",
        "voteCount": 9,
        "content": "Incorrect. Not a best practice to have Staging and Prod resources in the same project. D is correct"
      },
      {
        "date": "2022-01-19T11:08:00.000Z",
        "voteCount": 2,
        "content": "by standard it is absolutely incorrect but here it is requirement. will you still separate it out?"
      },
      {
        "date": "2020-01-12T09:22:00.000Z",
        "voteCount": 5,
        "content": "Agree with A"
      },
      {
        "date": "2022-01-13T18:54:00.000Z",
        "voteCount": 21,
        "content": "D\n\nIn the requirement, the staging environment needs access to production, not the other way around. Answer A could allow staging and production to access each other. In answer D, staging and production are in different project, you can limit the access from either side. So D is correct."
      },
      {
        "date": "2022-09-12T21:50:00.000Z",
        "voteCount": 4,
        "content": "Best approach is D.\nA will also work based on question requirement"
      },
      {
        "date": "2022-01-18T12:50:00.000Z",
        "voteCount": 8,
        "content": "End goal is to separate dev from staging/production. Putting staging/production in same project fits the requirements. Further effort would be required to change access between Staging and Production projects that is out of scope of question. \n\nIt is not best practice, but fits requirements of question."
      },
      {
        "date": "2022-01-19T11:08:00.000Z",
        "voteCount": 5,
        "content": "yes and there is no mention of test environment in option D."
      },
      {
        "date": "2024-08-17T00:33:00.000Z",
        "voteCount": 2,
        "content": "Special case"
      },
      {
        "date": "2024-07-01T06:59:00.000Z",
        "voteCount": 2,
        "content": "better to separate each environment, why have to merge them?"
      },
      {
        "date": "2024-04-11T03:03:00.000Z",
        "voteCount": 2,
        "content": "We have to follow the case requirements not the best practices."
      },
      {
        "date": "2024-03-19T10:05:00.000Z",
        "voteCount": 2,
        "content": "I guess this is a tie up between best practices vs what this org (Mountkirk) demands. If this was a standard question on how to setup each env, then answer D fits. But for this use case, seems like A fits the bill. \nFurther more, if all environments/projects are within same org setup, then resources can still be accesses across."
      },
      {
        "date": "2024-03-04T05:09:00.000Z",
        "voteCount": 1,
        "content": "Answer is D:\nQuestion asked is - \"What should you do to isolate development environments from staging and production?\". If the question meant to include \"Test Environment\", the question would have looked like this - \"What should you do to isolate development &amp; test environments from staging and production?\" but that is not the case so the only logical answer will be to vote D."
      },
      {
        "date": "2023-12-15T07:16:00.000Z",
        "voteCount": 2,
        "content": "Definitively D"
      },
      {
        "date": "2023-11-30T05:20:00.000Z",
        "voteCount": 1,
        "content": "D\nrepeatable and configurable mechanism - so a network each for dev/test, staging and prod is ideal. But as this option is not there I am choosing D - each one having a project."
      },
      {
        "date": "2023-11-15T13:15:00.000Z",
        "voteCount": 1,
        "content": "D is ok"
      },
      {
        "date": "2023-11-14T17:16:00.000Z",
        "voteCount": 1,
        "content": "as per conventional best practices."
      },
      {
        "date": "2023-11-02T13:54:00.000Z",
        "voteCount": 3,
        "content": "Although D is follows industry standards its an incomplete answer, it does not say anything about test.  A is a much complete answer"
      },
      {
        "date": "2023-10-21T05:57:00.000Z",
        "voteCount": 1,
        "content": "D for sure"
      },
      {
        "date": "2023-10-21T05:57:00.000Z",
        "voteCount": 1,
        "content": "D for me."
      },
      {
        "date": "2023-10-08T11:39:00.000Z",
        "voteCount": 1,
        "content": "I think it is B, because you can create separate project for each environment (Test, dev, stage, prod) and connect to right network. You can use firewall rules to set communication between stage and prod."
      },
      {
        "date": "2023-09-25T08:55:00.000Z",
        "voteCount": 1,
        "content": "There is another thread on this topic to iron out the choices and its mostly leaning D\nhttps://www.reddit.com/r/googlecloud/comments/kbkoev/gcp_question_environment_separations/"
      },
      {
        "date": "2023-07-18T03:34:00.000Z",
        "voteCount": 1,
        "content": "Create a project for development and test and another for staging and production"
      }
    ],
    "examNameCode": "professional-cloud-architect",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/google/view/11831-exam-professional-cloud-architect-topic-5-question-6/",
    "body": "Mountkirk Games wants to set up a real-time analytics platform for their new game. The new platform must meet their technical requirements.<br>Which combination of Google technologies will meet all of their requirements?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tKubernetes Engine, Cloud Pub/Sub, and Cloud SQL",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCloud Dataflow, Cloud Storage, Cloud Pub/Sub, and BigQuery\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCloud SQL, Cloud Storage, Cloud Pub/Sub, and Cloud Dataflow",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCloud Dataproc, Cloud Pub/Sub, Cloud SQL, and Cloud Dataflow",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCloud Pub/Sub, Compute Engine, Cloud Storage, and Cloud Dataproc"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 11,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-01-16T23:33:00.000Z",
        "voteCount": 33,
        "content": "Correct Answer B\n\nCloud Dataflow, Cloud Storage, Cloud Pub/Sub, and BigQuery\n\nA real time requires Stream / Messaging so Pub/Sub, Analytics by Big Query. Ingest millions of streaming events per second from anywhere in the world with Cloud Pub/Sub, powered by Google's unique, high-speed private network. Process the streams with Cloud Dataflow to ensure reliable, exactly-once, low-latency data transformation. Stream the transformed data into BigQuery, the cloud-native data warehousing service, for immediate analysis via SQL or popular visualization tools"
      },
      {
        "date": "2020-01-12T09:23:00.000Z",
        "voteCount": 33,
        "content": "Agree with B"
      },
      {
        "date": "2020-08-10T23:06:00.000Z",
        "voteCount": 9,
        "content": "B is ok"
      },
      {
        "date": "2021-03-04T19:55:00.000Z",
        "voteCount": 3,
        "content": "it is B"
      },
      {
        "date": "2024-08-22T16:44:00.000Z",
        "voteCount": 2,
        "content": "Use Case description has changed, this is old use case.\nAnalytics and BQ goes hand in hand, and since only B is using BG, B is still the close answer."
      },
      {
        "date": "2023-02-21T04:54:00.000Z",
        "voteCount": 2,
        "content": "Agree with B"
      },
      {
        "date": "2022-12-03T07:58:00.000Z",
        "voteCount": 2,
        "content": "Real-time analytics = OLAP = Bigquery"
      },
      {
        "date": "2022-11-21T06:15:00.000Z",
        "voteCount": 2,
        "content": "Seems old case study, dosen't match with the below\nhttps://services.google.com/fh/files/blogs/master_case_study_mountkirk_games.pdf"
      },
      {
        "date": "2022-11-05T04:06:00.000Z",
        "voteCount": 1,
        "content": "B is ok"
      },
      {
        "date": "2022-10-15T20:56:00.000Z",
        "voteCount": 1,
        "content": "I am confident is only B"
      },
      {
        "date": "2022-10-10T11:03:00.000Z",
        "voteCount": 1,
        "content": "b is ok"
      },
      {
        "date": "2022-09-10T10:50:00.000Z",
        "voteCount": 2,
        "content": "Correct Answer B\n\nCloud Dataflow, Cloud Storage, Cloud Pub/Sub, and BigQuery"
      },
      {
        "date": "2022-07-24T03:23:00.000Z",
        "voteCount": 1,
        "content": "b it is"
      },
      {
        "date": "2021-12-28T09:57:00.000Z",
        "voteCount": 1,
        "content": "vote B"
      },
      {
        "date": "2021-12-11T11:01:00.000Z",
        "voteCount": 1,
        "content": "B is the correct answer"
      },
      {
        "date": "2021-11-26T20:01:00.000Z",
        "voteCount": 1,
        "content": "vote B"
      },
      {
        "date": "2021-10-13T18:31:00.000Z",
        "voteCount": 1,
        "content": "Aggree with B"
      },
      {
        "date": "2021-09-11T04:48:00.000Z",
        "voteCount": 1,
        "content": "The question also says:  \"The new platform must meet their technical requirements\". The case study says:\n\"Technical requirements:\n1. Dynamically scale up or down based on game activity\n2. Connect to a managed NoSQL database service\n3. Run customize Linux distro\"\nOnly E.&nbsp;Cloud Pub/Sub, Compute Engine, Cloud Storage, and Cloud Dataproc\nseems to have all requirements. am I overthinking this?"
      },
      {
        "date": "2021-09-13T08:26:00.000Z",
        "voteCount": 2,
        "content": "look at the question part: Mountkirk Games wants to set up a real-time analytics platform for their new game -&gt; BigQuery is always a resolution"
      },
      {
        "date": "2023-07-13T03:15:00.000Z",
        "voteCount": 1,
        "content": "the last technical requirements is always fully manage. \ncompute engine is self manage.\nso its can't be E."
      },
      {
        "date": "2021-09-10T04:32:00.000Z",
        "voteCount": 1,
        "content": "Are we seeing the older scenarios in new exam?"
      }
    ],
    "examNameCode": "professional-cloud-architect",
    "topicNumber": "5"
  }
]