[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/apics/view/144927-exam-aws-certified-data-engineer-associate-dea-c01-topic-1/",
    "body": "A company stores petabytes of data in thousands of Amazon S3 buckets in the S3 Standard storage class. The data supports analytics workloads that have unpredictable and variable data access patterns.<br><br>The company does not access some data for months. However, the company must be able to retrieve all data within milliseconds. The company needs to optimize S3 storage costs.<br><br>Which solution will meet these requirements with the LEAST operational overhead?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse S3 Storage Lens standard metrics to determine when to move objects to more cost-optimized storage classes. Create S3 Lifecycle policies for the S3 buckets to move objects to cost-optimized storage classes. Continue to refine the S3 Lifecycle policies in the future to optimize storage costs.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse S3 Storage Lens activity metrics to identify S3 buckets that the company accesses infrequently. Configure S3 Lifecycle rules to move objects from S3 Standard to the S3 Standard-Infrequent Access (S3 Standard-IA) and S3 Glacier storage classes based on the age of the data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse S3 Intelligent-Tiering. Activate the Deep Archive Access tier.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse S3 Intelligent-Tiering. Use the default access tier.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-08-20T03:14:00.000Z",
        "voteCount": 1,
        "content": "It's D but this question has no sense as it's said \"A company stores petabytes of data in thousands of Amazon S3 buckets in the S3 Standard storage class\", you can´t have thousands of S3 buckets in an AWS account, the max number of buckets that yoiu can have is a thousand and this is a hard limit that you can´t modify."
      },
      {
        "date": "2024-08-18T15:56:00.000Z",
        "voteCount": 2,
        "content": "Answer D: Use S3 Intelligent-Tiering with the default access tier. It automatically adjusts storage tiers based on access patterns, ensuring cost savings"
      },
      {
        "date": "2024-08-08T10:18:00.000Z",
        "voteCount": 2,
        "content": "S3 Intelligent-Tiering is designed to optimize storage costs by automatically moving data between two access tiers: frequent access and infrequent access, based on changing access patterns. This solution requires no manual intervention or lifecycle policy management and ensures that data retrieval remains within milliseconds, meeting the requirement for unpredictable and variable data access patterns."
      },
      {
        "date": "2024-08-08T00:47:00.000Z",
        "voteCount": 1,
        "content": "It's D"
      },
      {
        "date": "2024-08-06T18:08:00.000Z",
        "voteCount": 3,
        "content": "Need the instant access of the default access tier. Deep Archive is incorrect."
      },
      {
        "date": "2024-08-03T03:37:00.000Z",
        "voteCount": 1,
        "content": "Answer is C"
      }
    ],
    "examNameCode": "aws-certified-data-engineer-associate-dea-c01",
    "topicNumber": "1"
  }
]