[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/bicsi/view/143611-exam-rcdd-topic-1-question-1-discussion/",
    "body": "An ICT distribution designer working for the owner receives a submitted product that differs from the product specified in the contract documents. The original product is unavailable due to shipping or manufacturing delay. Which action should the ICT distribution designer take?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReject the submittal after verifying compliance with applicable standards.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApprove the submittal after asking about additional compensating warranty offerings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApprove the submittal after verifying code compliance.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApprove the submittal after verifying all significant features of the originally specified product are met."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-07-19T11:38:00.000Z",
        "voteCount": 1,
        "content": "I agree. I'm actually preparing for the RCDD exam now. I'm a little disappointed int eh BICSI TDMM manuals. I have found numerous inconsistencies across the chapters. It's frustrating."
      },
      {
        "date": "2024-07-08T12:44:00.000Z",
        "voteCount": 3,
        "content": "What code could possibly be violated?  Maybe a standard or client spec item, but likely not a code. There's very little in the NEC or IBC that governs communications equipment, and TDMM is not a \"code\". Seems \"D\" would be more appropriate, as it'd be more important that all salient characteristics and functional characteristics are met to be a true \"equal alternative\"."
      }
    ],
    "examNameCode": "rcdd",
    "topicNumber": "1"
  }
]