[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/pmi/view/111195-exam-pmi-sp-topic-2-question-2-discussion/",
    "body": "Thomas works as a contract-based project manager for BlueWell Inc. Management has hired Thomas to manage a high-risk project because Thomas has years of experience with this technology and similar project. Thomas would like to use his own templates for the project schedule, quality, and risk management approach. Management is fine with this, except after reviewing the template they had preferred Thomas to use 24-hour time periods for his project calendar rather than the 8-hour time periods as indicated. Thomas agrees, but now he has to update what document in his project management plan?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject calendar",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActivity attributes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tResource calendar",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSchedule management plan"
    ],
    "answer": "A",
    "answerDescription": "The project calendar needs to be updated to reflect the 24-hour time period rather than the 8-hour time period. The project calendar is used to define the working and nonworking days and times for tasks. This calendar is usually used to represent an organization's traditional working hours. Project uses this calendar to schedule tasks that do not have resources assigned or that have a task type of fixed duration. By default, the Standard base calendar is used as the project calendar. A user can also reflect alternative schedules by using other base calendars. The working days and hours in the project calendar reflect the working days and hours for the whole project. A user can also specify special days off, such as company holidays. A user can also indicate other nonworking times to reflect periods when the whole team will be working on nonproject activities, such as company meetings or department retreats.<br>Incorrect Answers:<br>B: The activities of the project are not changing, only the time periods of the project calendar.<br>C: The resource calendar does not need to be updated as this document defines when resources are available.<br>D: The schedule management plan will reference to the project calendar and the resource calendar. It does not need to be updated directly as a result of the time period change.",
    "votes": [],
    "comments": [
      {
        "date": "2023-06-05T11:12:00.000Z",
        "voteCount": 1,
        "content": "Why Thomas don't need to update the resource calender? On the resource calender you will put how many hours the resource will work (8 or 24 hours per day). If you don't put this data you can not realize when this resource will be available"
      },
      {
        "date": "2024-01-23T17:32:00.000Z",
        "voteCount": 1,
        "content": "Resource calendar is for resource availability. The answer is correct: A Project calendar focuses on the overall timeline and schedule of the project, a resource calendar is specifically concerned with the availability and allocation of resources throughout the project duration. Both calendars are essential tools in project management to ensure that projects are completed on time and resources are utilized effectively."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/pmi/view/30887-exam-pmi-sp-topic-2-question-11-discussion/",
    "body": "Which of the following is an output of the Identify Stakeholders process?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tScope baseline",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject scope statement",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject charter",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStakeholder register"
    ],
    "answer": "D",
    "answerDescription": "The Identify Stakeholders process identifies all people or organizations that are impacted by the project. It also documents relevant information regarding their interests, involvement, and impact on project success. Stakeholder register and stakeholder management strategy are outputs of this process.<br>Incorrect Answers:<br>A: Scope baseline is one of the outputs of the Create Work Breakdown Structure (WBS) process.<br>B: Project scope statement is one of the outputs of the Define Scope process.<br>C: Project charter is one of the inputs of the Identify Stakeholders process.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-08T15:55:00.000Z",
        "voteCount": 1,
        "content": "Repeated question."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/pmi/view/35389-exam-pmi-sp-topic-2-question-14-discussion/",
    "body": "You are working with your project team to identify the project activities within your project. Which of the following is NOT a tool and technique that will be useful in defining the project activities?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDecomposition",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRolling wave plan",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPrecedence diagramming method",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTemplates"
    ],
    "answer": "C",
    "answerDescription": "The precedence diagramming method is not a tool and technique that will be used during the activity definition process. Precedence diagramming method (PDM) is used in critical path methodology for building a project schedule network diagram that uses boxes or rectangles, referred to as nodes, to represent activities, and join each other with arrows that show the logical relationship that exists between them. The tools and techniques used in defining the activity process are as follows: Decomposition: It is used to further divide the project work package into a more smaller and convenient form called activities. Rolling Wave Planning: It is a form of progressive elaboration planning where the work to be accomplished in the near term is planned in detail and future work is planned at a higher level of<br>WBS. Templates: It is an activity list or a part of the activity list taken from the previous project and used in a new project. Expert Judgement: The skilled members in a project team or other experts who develop project scope statements can help provide knowledge in defining activities.",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-28T13:25:00.000Z",
        "voteCount": 1,
        "content": "Templates are not listed as T&amp;T for identify activity as well !"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/pmi/view/29047-exam-pmi-sp-topic-2-question-15-discussion/",
    "body": "You are the project manager for your organization. You are managing a project to create new software for your clients. During the project execution, there have been some unforeseen delays that will require your attention. You will need four inputs to the control schedule process. Which of the following documents would not be an input for the control schedule process?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject schedule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWork performance information",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject management plan",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEarned value management results"
    ],
    "answer": "D",
    "answerDescription": "The results of earned value management are not an input to the control schedule process. The fourth input is organizational process assets. The inputs of schedule control process are as follows:<br>✑ Project Management Plan<br>✑ Project Schedule<br>✑ Work Performance Integration<br>✑ Organizational Process Assets<br>Incorrect Answers:<br>A: The project schedule is an input to the control schedule process.<br>B: The work performance information is an input to the control schedule process.<br>C: The project management plan is an input to the control schedule process.",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-19T07:10:00.000Z",
        "voteCount": 2,
        "content": "check  the answer B. Work performance information\nit should be intgration"
      },
      {
        "date": "2020-09-08T16:00:00.000Z",
        "voteCount": 2,
        "content": "Work performance info is an output, work performance data is an input."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/pmi/view/39357-exam-pmi-sp-topic-2-question-17-discussion/",
    "body": "You are the project manager of the NHQ project. You are working with your project team to create the project schedule and the project network diagram. In order to start the sequencing of the project activities, you will need a document to identify the result of project phases, key project deliverables, and significant, timeless events in the project. Which of the following documents will you need to help sequence the project work?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActivity attributes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActivity list",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject scope statement",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMilestone list"
    ],
    "answer": "D",
    "answerDescription": "The milestone list is needed as an input to the sequence activities process. Milestones are timeless events in the project schedule that are generally created as a result of phase completion. What is a milestone list? A milestone list provides a sequence of indicators about project progress to date and achievements or goals, which are to be achieved. The milestone list is used in project management as an indication of progress through the achievement of a major project accomplishment. It is a project document that is not part of the project management plan. The list contains all the project milestones along with information indicating whether they are mandatory to achieve or not.<br>Incorrect Answers:<br>A: Activity attributes describe the work, nature of the activity, and required resources for the activity.<br>B: While the activity list is an input to activity sequencing, it is not a document that shows timeless events or the results of activity phases.<br>C: The project scope statement is an input to the activity sequence, but it does not define the end result of activity phases.",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-09T01:51:00.000Z",
        "voteCount": 1,
        "content": "A and B are also inputs"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/pmi/view/31564-exam-pmi-sp-topic-2-question-19-discussion/",
    "body": "Beth works as a project manager for BlueWell Inc. Which of the following tools and techniques of Administer Procurements process will Beth use to manage contracts, and procurement documentation and records?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecords Management System",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerformance reporting",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInspection and Audit",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPayment System"
    ],
    "answer": "A",
    "answerDescription": "A records management system is used to manage contract, and procurement documentation and records by the project managers. It includes specific set of processes, related control functions, and automation tools that are merged as part of the project management information system.<br>Incorrect Answers:<br>B: Performance reporting offers the management with the information about how effectively the seller is achieving the contractual objectives.<br>C: Inspection and audits are required by the buyer and supported by the seller as mentioned in the procurement contract during execution of the project to verify the compliance in the seller's work processes or deliverables.<br>D: Payment system determines the payments to the seller, which is processed by the account payable system of the buyer after certification of satisfactory work by the authorized person on the project team.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-18T07:10:00.000Z",
        "voteCount": 1,
        "content": "Administer Procurements was removed from the PMBOK for the 6th edition. It was present in the 5th edition. A question on Administer Procurements most likely will not appear on the PMI-SP exam."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/pmi/view/30888-exam-pmi-sp-topic-2-question-22-discussion/",
    "body": "You work as a project manager for BlueWell Inc. Which of the following plans will you use to define how resources are brought onto the project team, how they are managed while on the project team, and how they may be released from the project team?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject Schedule Management Plan",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject Staffing Management Plan",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject Human Resources Management Plan",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject Communications Management Plan"
    ],
    "answer": "B",
    "answerDescription": "The project staffing management plan will define how resources are brought onto the project team, how they are managed while on the project team, and how they may be released from the project team. The staffing management plan is part of human resources plan. It is a subsidiary plan of the overall project management plan and defines when project team members will be brought onto and released from the project. It describes when and how human resource requirements will be met. Depending upon the needs of the project, it can be formal or informal, highly detailed or broadly framed. The staffing management plan may include the following items: Staff acquisition, resource calendars, staff release plan, training needs, recognition and rewards, compliance, and safety.<br>Incorrect Answers:<br>A: The project schedule management will define when resources are needed and scheduled. But it will not define how resources are allowed to be released from the project.<br>C: This is not a valid project management plan.<br>D: The communications management plan defines project communication requirements and expectations.",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-09T01:43:00.000Z",
        "voteCount": 1,
        "content": "This is not in the most recent version"
      },
      {
        "date": "2020-09-08T16:03:00.000Z",
        "voteCount": 2,
        "content": "Repeated question."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/pmi/view/31575-exam-pmi-sp-topic-2-question-30-discussion/",
    "body": "In the project time management knowledge area, there are six processes. According to the PMBOK, which project time knowledge area will have the majority of the effort?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEstimate activity resources",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDefine activities",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tControl schedule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDevelop schedule"
    ],
    "answer": "C",
    "answerDescription": "Of all six processes, the control schedule process will take the majority of the time in the project time management knowledge area. Control schedule process is a method of monitoring the status of the project to update project progress and deal with the changes to the schedule baseline. It is concerned with:<br>✑ Determining the current status of the project<br>✑ Influencing the factors that create schedule changes<br>✑ Determining that the project schedule has changed<br>✑ Managing the actual changes as they occur<br>✑ Control schedule is a component of the<br>✑ Perform Integration Change Control process.<br>Incorrect Answers:<br>A, B, D: These processes will not take the longest to complete.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-18T07:36:00.000Z",
        "voteCount": 1,
        "content": "PMBOK 6th edition: Project Time Management was changed to Project Schedule Management to reflect that the project schedule is\ndefined and managed during the project, whereas time is not managed"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/pmi/view/20112-exam-pmi-sp-topic-2-question-36-discussion/",
    "body": "You are working with your project team to control the project schedule. You will need five inputs to this process throughout your project. Which one of the following is an output of the project schedule control, and NOT an input?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWork performance information",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject schedule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject management plan",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWork performance measurements"
    ],
    "answer": "D",
    "answerDescription": "Work performance measurements are created from the work performance information. WPMs are an output of Control schedule, Control cost, and Control scope processes, which are monitoring and controlling processes. WPMs consist of planned versus actual performance indicators with respect to scope, schedule, and cost. They are documented and communicated to the stakeholders and are used to make project activity metrics, such as the following: Planned vs. Actual<br>Technical performance and Scope performance Planned vs. Actual Schedule performance Planned vs. Actual Cost performance<br>Incorrect Answers:<br>A: Work performance information is an input to the control schedule process and includes information on project progress and activity start and finish information.<br>B: The project schedule is an input to the control schedule process.<br>C: The project management plan is an input to the control schedule process.",
    "votes": [],
    "comments": [
      {
        "date": "2024-02-14T03:50:00.000Z",
        "voteCount": 1,
        "content": "CISA, CISM, CRISC, CGEIT, CompTIA, CCNA, PMP, PMI-RMP, PMI-ACP, PMI-PBA, PMI-CAPM, SCRUM, Azure, AWS, Salesforce, ITIL, ISTQB, CLOUD, CEHv12, CCISO, GMAT, Six-sigma, SAP, Oracle, ISO...\n\nGet Certified with great ease.\n100% pass guarantee.\nExam support / proxy\n\nPAYMENT ONLY AFTER PASSING\nWhatsApp: +1(940) 268-5570"
      },
      {
        "date": "2024-02-13T06:46:00.000Z",
        "voteCount": 1,
        "content": "Project Schedule the correct answer?"
      },
      {
        "date": "2024-02-08T22:33:00.000Z",
        "voteCount": 1,
        "content": "Work performance information is output of Control Schedule (Kindly correct it)."
      },
      {
        "date": "2020-07-23T15:50:00.000Z",
        "voteCount": 2,
        "content": "Outputs of Control Schedule:\nWork performance information\nSchedule Forecasts\nChange Requests\nProject Management Plan Updates\nProject document Updates"
      },
      {
        "date": "2020-05-09T15:11:00.000Z",
        "voteCount": 4,
        "content": "Work performance data is an input to control schedule and contains data on project status such as which activities have started, their progress (e.g., actual duration, remaining duration, and physical percent complete), and which activities have finished. (PMBOK, P. 225)\nWork performance information is an output of control schedule and includes information on how the project work is performing compared to the schedule baseline. Variances in the start and finish dates and the durations can be calculated at the work package level and control account level. For projects using earned value analysis, the (SV) and (SPI) are documented for inclusion in work performance reports. (PMBOK, P. 228)"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/pmi/view/31579-exam-pmi-sp-topic-2-question-39-discussion/",
    "body": "You are the project manager for the GRT Project in your organization. You have created your time duration estimates based on historical information, but the estimates are not holding true in your current project. Unfortunately, many activities are late. You have decided to create a PERT estimate with your project team for each of their activities. What is the formula used for PERT?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tO+M+P",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t(O+M+P)/3",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t(O+4M+P)/6",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAverage of the estimates"
    ],
    "answer": "C",
    "answerDescription": "PERT uses the formula of (O+4M+P)/6 to predict the duration of the project activities and the overall project schedule. Three-point estimate is a way to enhance the accuracy of activity duration estimates. This concept is originated with the Program Evaluation and Review Technique (PERT). PERT charts the following three estimates: Most likely (TM): The duration of activity based on realistic factors such as resources assigned, interruptions, etc. Optimistic (TO): The activity duration based on the best-case scenario Pessimistic (TP): The activity duration based on the worst-case scenario The expected (TE) activity duration is a weighted average of these three estimates: TE = (TO + 4TM + TP) / 6 Duration estimates based on the above equations (sometimes simple average of the three estimates is also used) provide more accuracy.<br>Incorrect Answers:<br>A: This is not a valid formula.<br>B: This is the formula for the three-point estimate. Note the PERT, while similar, uses 4M and divides the result by six factors.<br>D: This almost describes the three-point estimate, but does not answer the question about PERT.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-18T07:45:00.000Z",
        "voteCount": 2,
        "content": "Repeated question"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/pmi/view/31586-exam-pmi-sp-topic-2-question-44-discussion/",
    "body": "Harry works as a project manager for BlueWell Inc. A risk that has been identified and analyzed in the project planning processes is now coming into fruition. Who among the following is responsible for implementing the risk responses or contingency plan?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRisk owner",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHarry",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject sponsor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSubject matter expert"
    ],
    "answer": "A",
    "answerDescription": "The risk owner is the individual on the project team that is closest to the risk event. The risk owner can be an individual or an organization responsible for implementing risk responses or contingency plan. The risk owner should be empowered with the ability to respond to the risk as it was planned.<br>Incorrect Answers:<br>B: Harry is the project manager and likely would not be the risk owner as well.<br>C: The project sponsor authorizes the project but does not participate in execution of the project.<br>D: While a subject matter expert may be the risk owner on some occasions, he would not be the risk owner on every occasion.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-18T08:04:00.000Z",
        "voteCount": 2,
        "content": "Repeated question"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/pmi/view/20113-exam-pmi-sp-topic-2-question-45-discussion/",
    "body": "Donna is the project manager of the QSD Project and she believes Risk Event D in the following figure is likely to happen.<br><img src=\"/assets/media/exam-media/02362/0011200001.png\" class=\"in-exam-image\"><br>If this event does happen, how much will Donna have left in the risk contingency reserve if none of the other risk events have happened?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t$35,000",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t$41,700",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t$6,700",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t$14,000"
    ],
    "answer": "C",
    "answerDescription": "To answer this question, you'll first need to calculate the contingency reserve. Contingency reserves are estimated costs to be used at the discretion of the project manager to deal with anticipated, but not certain, events. These events are \"known unknowns\" and are part of the project scope and cost baselines. The contingency reserve is calculated by multiplying the probability and the impact for the risk event value for each risk event. The sum of the risk events equals the contingency reserve for the project. The sum of the risk events equals the contingency reserve for the project. In this question, the value is $41,700. If Risk D happens, it'll cost the project $35,000. The difference of $35,000 and $41,700 is $6,700.<br>Incorrect Answers:<br>A: This is the impact of Risk Event<br>B: $41,700 is the amount of the contingency reserve.<br>D: $14,000 is the risk event value of Risk Event",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-09T23:39:00.000Z",
        "voteCount": 2,
        "content": "risk events have a % chance to happen but if they do they still cost the full amount if the impact."
      },
      {
        "date": "2020-09-18T08:06:00.000Z",
        "voteCount": 1,
        "content": "0.6\t12000\t7200\t\n0.15\t45000\t6750\t\n0.35\t15000\t5250\t\n0.4\t35000\t14000\t\n0.5\t17000\t8500\t\n\t\t0\t\n\t\t41700\t=27700"
      },
      {
        "date": "2020-05-09T15:45:00.000Z",
        "voteCount": 2,
        "content": "If risk (D) does happen it will cost 0.4*35,000 = 14,000.\nWhat left is 41,700 - 14,000 = 27,700"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/pmi/view/31622-exam-pmi-sp-topic-2-question-55-discussion/",
    "body": "You work as the project manager for BlueWell Inc. You are reviewing and regulating the progress to meet the performance objectives defined in the project management plan. Mark, a trainee, has a doubt related to the inputs of monitor and control project work. Which of the following is the input to monitor and control project work?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject document updates",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExpert judgment",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerformance report",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject management plan updates"
    ],
    "answer": "C",
    "answerDescription": "Performance report is an input of monitor and control project work. Reports are prepared by the project team detailing activities, milestones, and problems. A performance report is made by the project team detailing activities, milestones, problems, accomplishments, and identified issues. Performance reports are used to report some key information as follows: Current status Scheduled activities Significant accomplishment for the period Forecasts Issues<br>Incorrect Answers:<br>A, D: These are the outputs to monitor and control project work.<br>B: It is the tool and technique used for monitoring and controlling project work.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-18T10:57:00.000Z",
        "voteCount": 2,
        "content": "These aren't correct inputs from the 6th edition."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/pmi/view/20231-exam-pmi-sp-topic-2-question-57-discussion/",
    "body": "Tom is the project manager for the ABC Construction Company. As part of the project scheduling for the construction of a new office building, he has allotted time for the inspectors of the building structure, as well as electrical, plumbing, and safety into the project's schedule. These inspectors can be considered what type of dependency in the project?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMandatory dependencies",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRequired dependencies",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDiscretionary dependencies",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExternal dependencies"
    ],
    "answer": "D",
    "answerDescription": "An external dependency is any nonproject activity that is external to the project but has a direct impact on the project activities. An external dependency may be an inspector or any agency that may have to give prior approval before the project can move forward.<br>Incorrect Answers:<br>A: Mandatory dependencies describe the required order in which the project work must take place - such as foundation before framing, or the operating system installed before the application may be installed.<br>B: Required dependency is not a valid term to describe a dependency.<br>C: Discretionary dependencies describe the optional order of the project work, such as painting the walls before installing the carpet.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-10T12:27:00.000Z",
        "voteCount": 4,
        "content": "Most often inspectors are internal employee or project team not necessarily be external to the project."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/pmi/view/20232-exam-pmi-sp-topic-2-question-58-discussion/",
    "body": "Tom works as the project manager for BlueWell Inc. He spends the majority of his time communicating with team members and the project stakeholders. Various communication skills are involved in the communication processes. Which communication skills are involved in this process? Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInternal and External",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVertical and Horizontal",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfronting and problem solving",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFormal and Informal"
    ],
    "answer": "ABD",
    "answerDescription": "These are some communication activities that Tom uses to communicate with the team and the stakeholders. Communications skills are part of general management skills and are used to exchange information. Communication has many dimensions: Written and oral, listening, and speaking Internal (within the project) and external (customer, the media, the public) Formal (reports, briefings) and informal (memos, ad hoc conversations) Vertical (up and down the organization) and horizontal (with peers) Communication is the most important skill that a project manager must possess. It is the single most important characteristics of a top-class project manager. Project managers must communicate well in order to integrate and maximize the performance of team members.<br>Oral and written communications are the backbone of every successful project. During different phases of a project, a project manager requires to communicate through different manners (for example, documentation, meeting updates, etc.) and he must ensure that the information communicated is explicit, clear, and complete.<br>C: It is a technique to resolve conflict that arises while communicating with different parties.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-10T12:38:00.000Z",
        "voteCount": 1,
        "content": "C, is more important than A,B, And D. Therefore the right answer should be C."
      },
      {
        "date": "2020-11-20T02:30:00.000Z",
        "voteCount": 1,
        "content": "C is a problem-solving technique"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/pmi/view/20234-exam-pmi-sp-topic-2-question-64-discussion/",
    "body": "Ned is the project manager of the HYQ Project. In Ned's project, the management has requested that he enforce resource leveling so that the maximum amount of hours in the project per worker will not exceed 25 hours per week. Ned's pay is based on how quickly he can complete the project work. What must Ned do to accommodate the change in the resource allotment if he has to finish the project on time?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCrash the project.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd more risk mitigation.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReduce the amount of labor.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReduce the project scope."
    ],
    "answer": "A",
    "answerDescription": "The change in the amount of labor Ned is allowed to use will cause his project schedule to increase thereby affecting the project end date. Crashing the project will allow Ned to add more resources while still keeping each resource to a maximum of 25 hours per week.<br>Incorrect Answers:<br>C: Reducing the project labor is what resource leveling does.<br>B: Adding risk mitigation won't necessarily help Ned finish the project faster.<br>D: Ned likely does not have control over descoping decisions.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-10T12:54:00.000Z",
        "voteCount": 1,
        "content": "Most likely organizations levels resources to not exceed certain hours in order not to pay more."
      },
      {
        "date": "2020-09-09T13:12:00.000Z",
        "voteCount": 2,
        "content": "That doesn't negate the fact that there could be other reasons. Crashing is the best answer."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/pmi/view/20237-exam-pmi-sp-topic-2-question-65-discussion/",
    "body": "Which of the following processes fall under the Project Integration Management knowledge area? Each correct answer represents a complete solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tQuality Assurance",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject Plan Development",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIntegrated Change Control",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject Plan Execution"
    ],
    "answer": "BCD",
    "answerDescription": "Project Integration Management is one of the nine Project Management Knowledge areas. It comprises the following processes:<br>✑ Develop Project Charter<br>✑ Develop Preliminary Project Scope Statement<br>✑ Develop Project Management Plan<br>✑ Direct and Manage Project Execution<br>✑ Monitor and Control Project Work<br>✑ Integrated Change Control<br>✑ Close Project<br>These processes occur throughout the project and are repeated quite often during the working of the project. They ensure that the various elements of the project are properly coordinated. What are the Project Management Knowledge Areas? The Project Management Knowledge Areas are groupings that bring together processes that have things in common. For example, Resource Planning, Cost Estimating, Cost Budgeting, etc., are part of the Project Cost Management knowledge group. These processes may or may not be part of different or same process groups. Guide to the PMBOK identifies forty- two processes that are arranged in nine knowledge areas. The knowledge areas are as follows:<br>✑ Project Integration Management<br>✑ Project Scope Management<br>✑ Project Time Management<br>✑ Project Cost Management<br>✑ Project Quality Management<br>✑ Project Human Resource Management<br>✑ Project Communications Management<br>✑ Project Risk Management<br>✑ Project Procurement Management<br>Incorrect Answers:<br>A: Quality Assurance is a part of the Project Quality Management knowledge area.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-10T14:07:00.000Z",
        "voteCount": 1,
        "content": "and \n✑ Stakeholder Management"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/pmi/view/20240-exam-pmi-sp-topic-2-question-73-discussion/",
    "body": "Kenny is the project manager for the NHQ organization. She is creating the project duration estimates. She has stressed to her project team that they will need to create accurate and reliable project duration estimates without padding their estimates for errors or risks. Kenny is also relying on historical information to help her predict the duration of the project work. Jennifer, one of the project team members, wants to know how Kenny will account for the certain-to-happen errors and delays in the project schedule. What approach should Kenny use in the project?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRewards and recognition for completing the project work without delays",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAnalogous estimating",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThree-point estimates",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tManagement reserve"
    ],
    "answer": "D",
    "answerDescription": "Management reserve is an allotment of time added to the end of the project schedule. When delays happen within the project, the delays are subtracted from the management reserve.<br>Incorrect Answers:<br>A: Rewards and recognitions are a good incentive for accurate work, but errors and delays may still happen and the rewards would not necessarily prevent delays in the project.<br>B: Kenny may be using some type of analogous estimating to predict activity duration, but the best answer is the reliance on the management reserve.<br>C: Kenny is not using a three-point estimate in this instance.",
    "votes": [],
    "comments": [
      {
        "date": "2022-02-04T18:06:00.000Z",
        "voteCount": 1,
        "content": "It is also called project Buffer. We are talking about error that may happen. So it is a kind of risk."
      },
      {
        "date": "2020-05-10T14:54:00.000Z",
        "voteCount": 3,
        "content": "Management reserves are intended to address the unknown-unknowns that can affect a project. Management reserve is not included in the schedule baseline, but it is part of the overall project duration requirements. Depending on contract terms, use of management reserves may require a change to the schedule baseline. (PMBOK P. 202)\nHence to account for certain to happen errors three point estimate is the right answer."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/pmi/view/20242-exam-pmi-sp-topic-2-question-77-discussion/",
    "body": "You're a project manager and you've completed your project schedule. The schedule will take 18 months to complete the project work. Throughout the schedule there are instances that the project work will require the project team members to work more than fifty hours per week. If you must adhere to a maximum of 45 hours of project work per team member, per week, what will likely happen to your project schedule as it stands right now?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNothing, the 45 hours limit is a guideline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe project will take longer to complete.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe project will take less time to complete.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe project will require more resources."
    ],
    "answer": "B",
    "answerDescription": "If a resource leveling heuristic, such as 45 hours maximum per time period, is enforced on the project, then the project schedule will take longer to complete. What is resource leveling heuristics? Resource leveling heuristics is a prioritization method that allocates inadequate resources to critical path activities first. It is a schedule network analysis technique useful to a schedule that has already been analyzed by the critical path method. It is used when shared or critical essential resources are only available at certain times, in limited quantities, or to keep resource usage at a constant level. It is a technique that resolves resource conflicts by delaying tasks within their slack allowances. Resource leveling is the process in which project teams come across problems when developing their project schedules. If a company has multiple projects running simultaneously that require the same resources, then problems can arise. It can often cause the critical path method to change.<br>Incorrect Answers:<br>A: The 45-hour limit is a restriction on the project.<br>C: The project will not take less time to complete because the project team members won't be able to complete as much work in the same amount of time.<br>D: The project may require more resources if the project manager and management want the project to finish by a particular date. In this question, however, the focus is on what will happen to the project schedule, not the project staffing.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-10T15:04:00.000Z",
        "voteCount": 1,
        "content": "The focus in the question is to complete the project work in 18 months, hence additional resources are required."
      },
      {
        "date": "2020-09-09T15:15:00.000Z",
        "voteCount": 4,
        "content": "That is not the focus of the question. \"What will likely happen to your project schedule as it stands right now?\" is the focus, since there is a hours work constraint the schedule will increase, therefore the project will be late."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/pmi/view/40347-exam-pmi-sp-topic-2-question-80-discussion/",
    "body": "You are the project manager of the NHQ project. Your project has a budget of $1,258456 and is scheduled to last for three years. Your project is currently forty percent complete though it should be forty-five percent complete. In order to reach this point of the project, you have spent $525,000. Management needs a performance report regarding the NHQ project. Management is concerned that this project will be over budget upon completion. Based on the current performance value what should you report to management regarding the variance at completion?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t-$21,618",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t-$62,922",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tZero - you would not know what this will cost until the project is complete.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t-$54,044"
    ],
    "answer": "D",
    "answerDescription": "The variance at completion can be found by subtracting the estimate at completion from the budget at completion. In this instance, it is:<br>Variance at completion = EAC - BAC<br>= $1,258,456 - $1,312,500.<br>= -$54,044<br>Incorrect Answers:<br>A: This is the cost variance for the project.<br>B: This is the schedule variance for the project.<br>C: You can calculate the variance at completion.",
    "votes": [],
    "comments": [
      {
        "date": "2024-03-01T03:12:00.000Z",
        "voteCount": 1,
        "content": "Formula wrong, but the answer is correct: BAC-EAC"
      },
      {
        "date": "2024-02-13T09:18:00.000Z",
        "voteCount": 1,
        "content": "The answer is D, this is how I got my results.\nThe formula is: BAC-EAC\nTo get the EAC, I divided the AC (525000) by 2 which gave me 262,500, and then multiply the AC (525000) by 2 which gave me 1,050,000. \nNext I added 1,050,000 to 262,500 to get 1,312,500.\nThen: BAC-EAC= 1258456-1312500= -54,044."
      },
      {
        "date": "2021-09-26T21:42:00.000Z",
        "voteCount": 2,
        "content": "Should use VAC = BAC - EAC where EAC = BAC/CPI because of current performance value used."
      },
      {
        "date": "2020-12-19T08:35:00.000Z",
        "voteCount": 2,
        "content": "I think the answer should be (A) = -$21,618\nEV = 503,382.4\nEAC = AC+(BAC-EV)=1,280,073.6\nVAC = BAC – EAC=-21,617.6"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/pmi/view/31708-exam-pmi-sp-topic-2-question-87-discussion/",
    "body": "Mark is the project manager of the NHQ Project. Mark wants to create a salience model as part of his communications planning and scheduling. What does a salience model do for a project?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDescribes classes of stakeholders based on their power, urgency, and legitimacy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClassifies stakeholders based on their influence and impact.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDescribes classes of stakeholders based on their power and influence.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGroups stakeholders based on their power and interest."
    ],
    "answer": "A",
    "answerDescription": "A salience model uses three values to classify stakeholders: power, urgency, and legitimacy in the project. The salience model is a technique for categorizing stakeholders according to their importance. The various difficulties faced by the project managers are as follows: How to choose the right stakeholders? How to prioritize competing claims of the stakeholders communication needs? Stakeholder salience is determined by the evaluation of their power, legitimacy and urgency in the organization. Power is defined as the ability of the stakeholder to impose their will. Urgency is the need for immediate action. Legitimacy shows the stakeholders participation is appropriate or not. . The model allows the project manager to decide the relative salience of a particular stakeholder.<br>Incorrect Answers:<br>B: This is a description of an influence/impact grid over the project.<br>C: This is a description of a power/impact over the project.<br>D: This is a description of a power/interest grid.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-19T04:44:00.000Z",
        "voteCount": 1,
        "content": "Per PMBOK:\nuSalience model. Describes classes of stakeholders based on assessments of their power (level of authority or\nability to influence the outcomes of the project), urgency (need for immediate attention, either time-constrained\nor relating to the stakeholders’ high stake in the outcome), and legitimacy (their involvement is appropriate).\nThere is an adaptation of the salience model that substitutes proximity for legitimacy (applying to the team and\nmeasuring their level of involvement with the work of the project). The salience model is useful for large complex\ncommunities of stakeholders or where there are complex networks of relationships within the community. It is\nalso useful in determining the relative importance of the identified stakeholders."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/pmi/view/20321-exam-pmi-sp-topic-2-question-89-discussion/",
    "body": "You work as a project manager for BlueWell Inc. You and your project team is undergoing the decision making process for the project. You want to involve key participants to gain acceptance and commitment to make the solution work. Which of the following phases of the decision- making model defines this process of work?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIdeas to action",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProblem definition",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProblem solution generation",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSolution action planning"
    ],
    "answer": "D",
    "answerDescription": "The various phases of the decision making process are as follows: Problem definition: This phase explores, clarifies and defines the problem. Problem solution generation: This phase draws out the new idea generating process by brainstorming multiple solutions and rejecting premature decisions. Ideas to action: This phase defines the evaluation criteria, rate pros and cons of alternatives and helps in selecting the best solution. Solution action planning: This phase involves key participants to gain acceptance and commitment to make the solution work. Solution evaluation planning: This phase performs the post implementation analysis, evaluations and lessons learned. Evaluation of the outcome and process: This phase evaluates how well the problem was solved or project goals were achieved.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-11T12:56:00.000Z",
        "voteCount": 1,
        "content": "To involve key participants to gain acceptance and commitment to make the solution work, it would be better in involve them in generating solution to problems, as then they accept and commit to solutions they had generated themselves."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/pmi/view/20325-exam-pmi-sp-topic-2-question-92-discussion/",
    "body": "Allen is the project manager for his organization. He is reviewing the resource requirements for his organization. He has discovered that his project needs Henry, the application developer, for two months, but Henry has a conflict and is already scheduled with another project manager in the organization. This is an example of which of the following?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tResource competition",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMatrix organization",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tResource requirement",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tResource constraint"
    ],
    "answer": "D",
    "answerDescription": "Because this project needs the specific resource of Henry, the application developer, and Henry is not available, it is considered as a resource constraint. Recall that a constraint is anything that limits the project manager's option.<br>Incorrect Answers:<br>A: While there may be some competition for skilled resources, such as Henry, the application developer, it is not the best answer for this question.<br>B: This is likely a matrix organization, but it is not the best answer for this question.<br>C: A resource requirement is simply the need for an application developer.",
    "votes": [],
    "comments": [
      {
        "date": "2024-03-11T06:38:00.000Z",
        "voteCount": 1,
        "content": "Resource Constraint: Here is why, the company has the recourse, but not available at the time the department needs him."
      },
      {
        "date": "2022-01-09T15:39:00.000Z",
        "voteCount": 1,
        "content": "Resource requirement"
      },
      {
        "date": "2020-12-10T16:48:00.000Z",
        "voteCount": 2,
        "content": "This is a constraint as he is not available, planning will now be constrained to when he is"
      },
      {
        "date": "2020-05-11T13:16:00.000Z",
        "voteCount": 2,
        "content": "This is not a resource constraint, it is resource requirement"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/pmi/view/26813-exam-pmi-sp-topic-2-question-96-discussion/",
    "body": "You are the project manager of the GHY Project. This project is scheduled to last for one year and has a BAC of $4,500,000. You are currently 45 percent complete with this project, though you are upposed to be at your second milestone, which accounts for half of the project completion. There have been some errors in the project, which has caused you to spend $2,073,654. Based on the estimate at completion, what is this project's to-complete performance index?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t-$108,120",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t1.02",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t$4,608,120",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t0.98"
    ],
    "answer": "D",
    "answerDescription": "The to-complete performance index when based on the estimate at completion uses the formula (BAC-EV)/(EAC-AC). In this instance, the answer is 0.98, which means the project is likely to reach its performance objectives. To-complete Performance Index (TCPI) is the measured projection of the anticipated performance required to achieve either the BAC or the EA<br>TCPI indicates the future required cost efficiency needed to achieve a target EAC (Estimate At Complete).Once approved, the EAC supersedes the BAC as the cost performance goal. Any significant difference between TCPI and the CPI needed to meet the EAC should be accounted for by management in their forecast of the final cost. The formula for TCPI is as follows: TCPI = {(BAC-EV)/(BAC-AC)}<br>Incorrect Answers:<br>A: -$108,120 is the variance at completion<br>B: This is the value of TCPI using the BAC approach.<br>C: This is the estimate at completion for this project.",
    "votes": [],
    "comments": [
      {
        "date": "2022-01-09T15:53:00.000Z",
        "voteCount": 2,
        "content": "0.98 is CPI. The right answer is 1.02"
      },
      {
        "date": "2021-02-21T17:36:00.000Z",
        "voteCount": 2,
        "content": "The answer is 1.02"
      },
      {
        "date": "2020-07-27T16:36:00.000Z",
        "voteCount": 2,
        "content": "This formula is wrong in the solution.\nIt is TPCOeac = (BAC-BCWP)/(EAC-ACWP) = 4,500,000- (.45*4,500,000) / 4,608,120-2,073,654 = .976537"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/pmi/view/20333-exam-pmi-sp-topic-2-question-98-discussion/",
    "body": "You are the project manager for your organization. You are working with your virtual team to create activity duration estimates for your current project. This virtual team is comprised of team members from around the world. Much of this process will be completed by geographical locations though some conferences will require all the team members to participate and to coordinate the activities that will interact between the different sites. The project manager must consider all of the following when creating the activity duration estimates except for which one?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject calendar",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCritical path",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tResource calendar",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTime zone differences"
    ],
    "answer": "B",
    "answerDescription": "When it comes to creating the project's activity duration estimating, the critical path is not yet a concern. The critical path will be determined by the duration of the project activities and the sequencing of the project events. A critical path is the sequence of project activities, which add up to the longest overall duration. This determines the shortest time possible to complete the project. Any delay of an activity on the critical path directly impacts the planned project completion date (i.e. there is no float on the critical path). A project can have several, parallel, near critical paths. An additional parallel path through the network with the total durations shorter than the critical path is called a sub-critical or non-critical path. These results allow managers to prioritize activities for the effective management of project completion, and to shorten the planned critical path of a project by pruning critical path activities, by \"fast tracking\" (i.e., performing more activities in parallel), and/ or by \"crashing the critical path\" (i.e., shortening the durations of critical path activities by adding resources).<br>Incorrect Answers:<br>A: The project calendar must be considered to determine when the project work is allowed to take place in the different sites.<br>C: The resource calendar must be considered for the availability of the project resource.<br>D: Time zone differences must be considered for communication demands and coordination of events between the geographical sites.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-11T14:13:00.000Z",
        "voteCount": 1,
        "content": "As long as the project manager will shorten the critical path duration by adding resources then the critical path must be considered when creating the activity duration estimates during planning."
      },
      {
        "date": "2020-09-09T15:37:00.000Z",
        "voteCount": 1,
        "content": "The question has to do with the underlying issue of geographically dispersed teams. Critical path in this instance wouldnt matter."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/pmi/view/20340-exam-pmi-sp-topic-2-question-101-discussion/",
    "body": "You work as the project manager for Blue Well Inc. You are working with your project team to schedule the days the project work will take place. You have created a project network diagram as shown in the figure:<br><img src=\"/assets/media/exam-media/02362/0015200001.png\" class=\"in-exam-image\"><br>Based on this diagram, find out the earliest day on which Activity G can be started.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDay 13",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDay 7",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDay 22",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDay 17"
    ],
    "answer": "D",
    "answerDescription": "The earliest Activity G can start is Day 17. This is because activities A, D, C, and F must all be completed before Activity G can start.<br>Incorrect Answers:<br>A: Day 13 does not account for Activity F since Activity F is also a predecessor to Activity G.<br>B: Day 7 is not a valid answer.<br>C: Day 22 is the earliest Activity G can finish.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-11T14:53:00.000Z",
        "voteCount": 1,
        "content": "The earliest day on which Activity G can be started is 16"
      },
      {
        "date": "2020-09-09T15:40:00.000Z",
        "voteCount": 2,
        "content": "No. Day 16 is when Activity F ends."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/pmi/view/31713-exam-pmi-sp-topic-2-question-108-discussion/",
    "body": "You have created the project network diagram for your project. Management is reviewing the network diagram and they are curious as to why you have included levels of effort activities as start-to-start and finish-to-finish successor activities for work that uses particular manufacturing equipment. You explained that the levels of effort activities are maintained for the equipment. This relationship and scheduling scenario is also known as what term?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject management overhead",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHammock activity",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSubproject",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFinish-to-Start"
    ],
    "answer": "B",
    "answerDescription": "This is also known as a hammock activity, as the SS and FF relationship hangs off of the activities in the project network diagram. A hammock activity is a schedule or project planning term for grouping of subtasks that \"hangs\" between two end dates it is fixed to. It groups subtasks that are not related in the hierarchical sense of a Work Breakdown Structure. It also groups subtasks that are not related in a logical sense of a dependency where one subtask must wait for another. A hammock activity usually refers to report information that is time-dependent and lasts from the initial to the latest date of the activities it encompasses. By using a hammock activity, the top management is able to see an overview of the project without being besieged by details.<br>Incorrect Answers:<br>A: Project management overhead describes the work that supports the project objectives, but is not linked directly to the project deliverables.<br>C: A subproject is a discrete set of work that contributes to the project, but branches off the primary project work. A subcontract portion of the project is an example of a subproject.<br>D: Finish-to-start is the most common relationship between project activities in the project network diagram.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-19T05:15:00.000Z",
        "voteCount": 2,
        "content": "Hammock Activity. An activity whose duration is aggregated by logical relationships from a group of related activities\nwithin the schedule model."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/pmi/view/146409-exam-pmi-sp-topic-2-question-109-discussion/",
    "body": "Ned is the project manager for his organization. Ned is using a standard tool to capture, store, and distribute information to the stakeholders about the project costs, schedule, and performance. What term is assigned to this communication tool?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject management information system\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTable reporting",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReporting system",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCommunications management system"
    ],
    "answer": "C",
    "answerDescription": "This is simply an example of a reporting system. It can be part of the project management information system, but for your examination, the PMBOK acknowledges this tool directly as part of project performance reporting. Reporting system is a tool and technique used for reporting performance. It is a standard means to store, capture, and give out the information to the stakeholders about the project costs, performance, and schedule.<br>Incorrect Answers:<br>A: The project management information system does more than just communicating the performance. It is a tool to help the project manager plan and monitor the project.<br>B: Table reporting is one output of a reporting system, not the entire system.<br>D: The PMBOK does not mention a communications management system.",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-08-25T04:54:00.000Z",
        "voteCount": 1,
        "content": "While this term could be used broadly to describe a system for generating reports, a PMIS is a more specific type of reporting system tailored to project management."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/pmi/view/35205-exam-pmi-sp-topic-2-question-116-discussion/",
    "body": "You are project manager of HHK project. Examine the network diagram given below:<br><img src=\"/assets/media/exam-media/02362/0016300001.png\" class=\"in-exam-image\"><br>A vendor reports that he will be four days late on the materials you'll need in order to complete Activity E. Based on the project network diagram, how many days can Activity E be delayed?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFour days",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSix days",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFive days",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tZero, it is on the critical path."
    ],
    "answer": "A",
    "answerDescription": "Activity E has four days of float. The entire project will take 19 days to complete. Float, also called slack, is the amount of time an activity can be delayed without affecting any subsequent activities. There are two types of floats available: Free Float: It is the amount of time a schedule activity can be delayed without delaying the early start date of any immediately following schedule activities. Total Float: It is the total amount of time that a schedule activity may be delayed from its early start date without delaying the project finish date, or violating schedule constraint. Float is calculated by using the critical path method technique.<br>Incorrect Answers:<br>B, C: These are incorrect calculations of the amount float available for Activity<br>D: Activity E is not on the critical path.",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-26T03:17:00.000Z",
        "voteCount": 2,
        "content": "this answer is wrong, Actvity E was delayed due to mentioned reasons in question and took 10 days, so D is right Answer"
      },
      {
        "date": "2024-02-07T07:09:00.000Z",
        "voteCount": 1,
        "content": "I agree with you"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/pmi/view/14420-exam-pmi-sp-topic-2-question-119-discussion/",
    "body": "John works as a project manager for BlueWell Inc. His project has a budget of $795,000 and he has spent $325,000 on the project. But, he has completed only 40 percent of the project work till now. Management wants to know what the project's cost performance index is. What value will John report?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t0.76",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t0.85",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t0.80",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t0.92"
    ],
    "answer": "D",
    "answerDescription": "Cost performance index (CPI) is used to calculate performance efficiencies. It is used in trend analysis to predict future performance. CPI is the ratio of earned value to actual cost. The CPI is calculated based on the following formula: CPI = Earned Value (EV) / Actual Cost (AC) If the CPI value is greater than 1, it indicates better than expected performance, whereas if the value is less than 1, it shows poor performance. The CPI value of 1 indicates that the project is right on target. In this instance, it's<br><br>EV = 0.40 * 750,000 -<br>= 300,000<br><br>CPI = EV/AC -<br>= 300,000/325,000<br>= 0.92",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-18T17:28:00.000Z",
        "voteCount": 6,
        "content": "This is incorrect. It should be (40%x795,000) / 325,000 = .98"
      },
      {
        "date": "2024-02-14T08:58:00.000Z",
        "voteCount": 1,
        "content": "Please update the solution of this question. BAC is 795,000 not 750,000."
      },
      {
        "date": "2021-02-26T19:02:00.000Z",
        "voteCount": 4,
        "content": "the answer is 0.98"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/pmi/view/31689-exam-pmi-sp-topic-2-question-136-discussion/",
    "body": "You are the project manager for your organization. You are working through the control schedule process. According to the PMBOK, there are four inputs to this process. Which one of the following is NOT an input to the control schedule process?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSchedule data",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWork performance information",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject management plan",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject schedule"
    ],
    "answer": "A",
    "answerDescription": "Schedule data is not an input to the control schedule process. Organizational process assets are the final input to the control schedule process. The inputs of schedule control process are as follows: Project Management Plan Project Schedule Work Performance Integration Organizational Process Assets<br>Incorrect Answers:<br>B: Work performance information is an input to the control schedule process.<br>C: The project management plan is an input to the control schedule process.<br>D: The project schedule is an input to the control schedule process.",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-18T16:52:00.000Z",
        "voteCount": 2,
        "content": "Work performance information is an output."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/pmi/view/35216-exam-pmi-sp-topic-2-question-184-discussion/",
    "body": "Which of the following are the outputs to the Determine Budget process? Each correct answer represents a complete solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject document updates",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tScope baseline",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCost performance baseline",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProject funding requirements"
    ],
    "answer": "ACD",
    "answerDescription": "The outputs to the determine budget process are as follows: Cost performance baseline: The cost performance baseline is an authorized time-phased budget at completion. Project funding requirements: The project funding requirements are determined from total funding requirements and periodic funding requirements.<br>Project document updates: The project document updates consists of risk register, cost estimates and project schedule.<br>Incorrect Answers:<br>B: Scope baseline is an input to the determine budget process.",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-26T05:12:00.000Z",
        "voteCount": 1,
        "content": "out of Cost Budget is only Cost baseline and Project Funding Requirements"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/pmi/view/27967-exam-pmi-sp-topic-2-question-188-discussion/",
    "body": "Cathy is the project manager of the NNQ Project. She currently has completed 45 percent of the project but was scheduled to have 65 percent of the project completed. This project has a budget of $344,000 and was scheduled to last four months. Cathy has spent $198,998 to date on the project. Based on this information, what is the estimate at completion for the NNQ Project?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t-$98,217.78",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t-$44,198",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t$441,025.64",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t$243,219.78"
    ],
    "answer": "C",
    "answerDescription": "The estimate at completion (EAC) formula is the Budget at Completion (BAC)/Cost Performance Index (CPI). In this instance, the CPI is .78 and the BAC is<br>$344,000. Cathy's project isn't doing too well.<br>Incorrect Answers:<br>A: This value represents the negative value the project will have once all the work is completed.<br>B: This value represents the negative cost variance.<br>D: This value represents the estimate to complete for the project.",
    "votes": [],
    "comments": [
      {
        "date": "2024-02-19T04:49:00.000Z",
        "voteCount": 1,
        "content": "EAC formula: EAC= AC+[BAC-EV]/CPI"
      },
      {
        "date": "2020-08-10T13:10:00.000Z",
        "voteCount": 1,
        "content": "The explanation has nothing to do with the answer. (198998/45)*100"
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/pmi/view/40391-exam-pmi-sp-topic-2-question-204-discussion/",
    "body": "Mary is the project manager of the H1QZ Project. This project is a subproject of the HQZ Project and the project schedule is fixed and cannot vary. Stephen, a project team member, reports that he's having trouble completing his project assignment and will likely be at least two days late. Examine the figure given below:<br><img src=\"/assets/media/exam-media/02362/0022400004.png\" class=\"in-exam-image\"><br>If Stephen's assignment is Activity B, what impact will his two days of lateness have on the project end date?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe project will complete on time.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe project will be late by one day.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe project will be late by two days.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe project will be early by two days."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-01-09T16:45:00.000Z",
        "voteCount": 4,
        "content": "It should be A"
      },
      {
        "date": "2020-12-20T02:46:00.000Z",
        "voteCount": 4,
        "content": "I think the right answer should be (A). The project will complete on time.\nABEFH = 15(17)\nABDFH = 13(15)\nACDFH = 19\nACGH = 18\nObviously the delay will not affect the project as the activity (B) is not on the critical path."
      }
    ],
    "examNameCode": "pmi-sp",
    "topicNumber": "2"
  }
]