[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/the-open-group/view/107706-exam-og0-023-topic-2-question-2-discussion/",
    "body": "Scenario -<br>Please read this scenario prior to answering the question<br>ArchiSurance senior management; board members, customers and major stockholders have long been concerned about disaster resiliency in light of the company's heavy reliance on a single data center. The data center is located in an area that is prone to flooding and earthquakes, according to expert assessments done by consultants retained for this purpose. In addition, the data center is located under a busy cafeteria, and water occasionally leaks through its ceiling.<br>To address these problems, ArchiSurance has developed a plan to move from its current data center to a pair of ready-to-use data centers in separate cities. The data center move is designed to reduce the risk of business interruption, reduce both planned and unplanned downtime for critical applications, and reassure<br>ArchiSurance stakeholders. However, a number of limitations make the planned transition to the new data centers particularly challenging. A number of critical<br>ArchiSurance applications cannot be offline for more than an hour, and any downtime for these application must only occur in certain four-hour windows each weekend. Also, the move cannot occur during quarterly or year-end closing periods in order to avoid interrupting critical processing. Fulfillment of these specific type of requirements will reduce the risk of business interruption from the data center move activities themselves.<br>ArchiSurance management has therefore planned a multi-phase data center transformation program. All of the activities in each phase are necessary to ensure a progression of stable and fully functional data center configurations. The first phase consists of detailed scheduling and planning to produce a comprehensive transformation plan that meets ArchiSurance timing and scheduling requirements. During the second phase, ArchiSurance is to contract for the hardware and software required for the new datacenters, as well for refunds for the hardware and software to be returned from the current data center once it is shut down.<br>During the third phase, the new data centers are to be set up, and the new hardware and software are to be tested in parallel with what is already in production.<br>The actual transition between the old and new data centers occurs in the fourth phase, and the fifth phase involves shutting down and dismantling the old data center, and returning its hardware and software for contracted refunds. Phases two through five are each to be initiated when specific conditions are met in the previous phase.<br>Refer to the Scenario -<br>The head of IT has asked you to help her explain why ArchiSurance decided to transform its data center infrastructure. You must model the stakeholders, the motivations, and the influencing relationships between these motivations. You must also model the specific goals realized by the data center transformation program and the limitations within which this program must operate.<br>Which answer provides the best explanation?<br><img src=\"/assets/media/exam-media/02406/0007400001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0007500001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0007600001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0007700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-27T10:44:00.000Z",
        "voteCount": 1,
        "content": "Why are these not contraints rather than requirements?"
      }
    ],
    "examNameCode": "og0-023",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/the-open-group/view/100062-exam-og0-023-topic-2-question-3-discussion/",
    "body": "Scenario -<br>Please read this scenario prior to answering the question<br>The ArchiSurance IT Operations (IT Ops) department has five core responsibilities, and continuously executes a core business process for each responsibility. (1)<br>The Batch Ops process makes sure that batch jobs execute completely, successfully, and on time, consistent with their service level agreements (SLAs). (2) The<br>Online Ops process makes sure that all web applications and content delivery services are available and performing according to their SLAs. (3) The Security Ops process protects ArchiSurance IT operations from being damaged by malicious or careless incidents. (4)The User Support process assists users of ArchiSurance systems with problems or requests. (5) The Continuous Improvement process monitors and measures the performance ot each of the other processes and works to solve problems and optimize use of ArchiSurance resources. In order to enable monitoring, each of the other processes generates monitoring data that is read by the Continuous Improvement process.<br>The processes in the System Ops category, which are Batch Ops, Online Ops and Security Ops, each have a separate sub-process for incident management.<br>These sub-processes are triggered, respectively, by Batch, Online and Security Incidents. One of the first steps in each incident management sub-process, is to pass an Incident Alert to each of the other System Ops processes. This is accomplished by posting the alert to the Alert Buffer.<br>The Batch Ops process uses a schedule that lists all batch jobs and their dependencies. The schedule is used by two Batch Ops sub-processes. The Batch<br>Planning sub-process updates this schedule for use by the Execution Management sub-process.<br>The Batch Ops process uses a number of applications that interact with each other. The Batch Scheduler application enables users to manage a database of jobs, job schedules and dependencies, and launches batch jobs according to the database. The Batch Monitor application uses the job schedules as a reference to monitor job execution, and reports all exceptional conditions to the both the Batch Scheduler and the Incident Handler applications via the Alert Buffer described earlier In the scenario. The Incident Handler refers to a set of business rules to determine the systems and individuals that must be notified of each incident.<br>Based on these determinations, the Incident Handler produces appropriate notifications.<br>Due to their critical ity, the Batch Scheduler, Batch Monitor and Incident Handler applications are hosted redundantly in multiple geographically distributed data centers. In each data center, the three applications are hosted on a fully redundant virtual server cluster. Each cluster is connected to two site local area networks, each of which connects to a separate physical storage array.<br><br>Refer to the scenario -<br>As part of an IT service management initiative, you have been asked to show how applications and infrastructure support the Batch Ops process. Model the applications, their functions, the data they access, and the infrastructure that hosts the applications and data, along with the networks that connect the servers. It is only necessary to model a single data center.<br>Which answer provides the most complete and accurate model?<br><img src=\"/assets/media/exam-media/02406/0007900001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0008000001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0008100001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0008200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-20T06:42:00.000Z",
        "voteCount": 1,
        "content": "Answer is A - two site local area networks, ... each connects to a separate physical storage array.  Also Incident Handling Rules in Solution A."
      }
    ],
    "examNameCode": "og0-023",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/the-open-group/view/100071-exam-og0-023-topic-2-question-4-discussion/",
    "body": "Scenario -<br>Please read this scenario prior to answering the question<br>The ArchiSuranceTo Go mobile consumer solution is increasingly important to ArchiSurance, which uses it to sell and renew insurance products, provide customer service, enable accurate and convenient home recordkeeping, and capture and process claims. The solution consists of three components. The<br>Consultant lets customers review their existing coverage, and update it based on common life events, such as getting a new car, moving into a new home, or having a family member move in or out. If necessary, they can speak or chat with a customer service representative. The Home Manager helps customers photograph and catalogue their valuable possessions in order to support the filing of accurate claims in case of loss or damage. The Claim Manager enables customers to quickly file a claim for loss or damage to an insured auto, home or possession. It enables customers to describe the incident by referencing information captured with the Consultant and the Home Manager applications. In addition, it allows the customer to add photographs, audio, video and text to support a claim, submit the claim, and monitor its progress.<br>The ArchiSurancetoGo components rely on a number of application services hosted by ArchiSurance. The first is an Auto Identification and Description (AID) service that the Consultant uses to validate and complete auto information entered by customers. The second service, Home Identification and Description (HID) performs the same function for home information, and is used by the Home Manager. The Consultant also uses the Virtual Agent service to guide customers as they select coverage options, the Payment Processor service to arrange premium payments, and the Coverage Activator service to generate policies and put them in force.<br>ArchiSurance to Go also relies on a number of infrastructure services. The Home Manager uses a Multimedia Repository service to store and retrieve information about insured homes. The Claim Manager also uses this service for claim information entered by customers. All three components of ArchiSuranceTo Go use a<br>Personal Security service to register and authenticate customers, and to manage their profiles.<br>Each application service is realized by an application component with the same name. Also, each infrastructure service is realized by a system software environment with the same name. ArchiSurance hosts both the application components and system software environments in a virtual ized server pool within its data center. Each service has its own virtual server. Each server is connected to a data center network (DCN) which in turn connects to a commercial wide area network (WAN).<br>Refer to the Scenario -<br>The new head of IT infrastructure would like a better understanding of the applications used by ArchiSurance to Go mobile solution and the hosting infrastructure that supports these applications.<br>Which answer provides the best description of the applications and their underlying infrastructure? (Please note that it is not necessary to model the networks).<br><img src=\"/assets/media/exam-media/02406/0008400001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0008500001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0008600001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0008700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-20T06:57:00.000Z",
        "voteCount": 1,
        "content": "ArchiSurance to Go also relies on a number of infrastructure services. The Home Manager uses a Multimedia Repository service to store and retrieve information about insured homes. The Claim Manager also uses this service for claim information entered by customers. All three components of ArchiSuranceTo Go use a\nPersonal Security service to register and authenticate customers, and to manage their profiles.\n\nAlso, each infrastructure service is realized by a system software environment with the same name."
      }
    ],
    "examNameCode": "og0-023",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/the-open-group/view/100233-exam-og0-023-topic-2-question-6-discussion/",
    "body": "Scenario -<br>Please read this scenario prior to answering the question<br>The daily mutual fund trading cycle consists of four key processes: Transaction capture, pricing, trading and reconciliation. Transaction capture consists of two sub-processes: manual exchange and loans and distributions (LSD). For transaction capture, retirement plan participants use an online account management application to enter manual fund exchange transactions. For L&amp;D, plan participants use a separate application to enter requests. The L&amp;D application determines whether the request can be fulfilled based on the mutual fund balances held in each plan balances and a set of business rules. Each day's captured manual exchange transactions accumulate in a transaction database.<br>ArchiSurance contracts with a third-party information service to receive a file of mutual fund prices at the close of each trading day. The pricing application uses this file to convert captured transaction into trades, and then validates each trade against the mutual fund balances held In each plan. The pricing generates a trade file with the minimum number of trades necessary. The trading application sends this file to an external trading service. When the trading application receives a confirmation file back from the trading service, it passes it to the reconciliation application, which updates the plan recordkeeping database.<br>The account management and LSD applications are hosted on separate application server clusters. Each cluster is a physically separate host that runs application server software on a set of virtualized hosts. All of these applications use a database server infrastructure that is hosted on another separate cluster of virtualized servers also on a dedicated physical host. The pricing, consolidation, trading and reconciliation applications, however, are batch applications that run on the<br>ArchiSurance mainframe computer. All application hosts are connected via a converged data center network (DCN), which also connects them to a storage area network (SAN) as well as a wide area network (WAN) that is used to communicate with the external trading service. The SANincludes two physically separate storage arrays, one of which holds data for all databases, and another that holds data for all files.<br>Refer to the Scenario -<br>A newly-formed team of systems analysts would like to better understand the business processes and applications for daily fund trading. Describe the business processes and sub-processes, the applications that they use, the data objects accessed by those applications, and the external application services that access some of those data objects.<br>Which is the best answer?<br><img src=\"/assets/media/exam-media/02406/0009200001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0009200002.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0009300001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0009300002.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-03-09T13:58:00.000Z",
        "voteCount": 1,
        "content": "Answer D : Application Internal Structure to Business Service - Serves (usage) relationship is applicable, this is most suitable answer. C uses flow relationship ."
      },
      {
        "date": "2023-02-21T06:11:00.000Z",
        "voteCount": 1,
        "content": "The application component relationships to functions should be a flow relationships (answer C) and not the serving relationships (answer D)."
      }
    ],
    "examNameCode": "og0-023",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/the-open-group/view/100234-exam-og0-023-topic-2-question-7-discussion/",
    "body": "Scenario -<br>Please read this scenario prior to answering the question<br>The ArchiSurance enterprise document management infrastructure provides critical support for myriad types of documents and document-based transactions, many of which are executed in high volume each day. At the core of the infrastructure is the document management systems software, which has three major modules: a document engine that stores, retrieves and performs a variety of operations on documents, a workflow engine that hosts document management applications, and an application engine, which hosts the most sophisticated applications. The application engine invokes the document and workflow engines as necessary when hosting application components that require their services.<br>The claim management application component is critical to ArchiSurance business operations. It is hosted by the application engine, and launches whenever an individual files a new claim. The claim management component requires different documents to demonstrate proof of loss depending on the type of claim filed, the type of insurance that is in force, and various other circumstances. When the correct documents are filed and verified by an intake operator, proof of loss is complete, and the claim management component assigns the claim to a claim analyst by reading and updating analyst status data and applying business rules stored as data.<br>Due to its business-critical nature, the document management solution is hosted redundantly at two geographically separate data center sites known as Site A and<br>Site B. Both sites provide identical infrastructure. Each site contains a highly available data center network (DCN) that is connected to the highly available<br>ArchiSurance wide area network (WAN). Each claim management server is connected to its site DCN, and each DCN is a converged network that connects both servers and storage arrays, including a physical storage array dedicated to the claim management application. Each site contains four high-powered separate physical servers dedicated to the claim management application. At any one time, one server is on standby while the other three servers are, respectively, hosting the document, workflow and application engines. Each active server provides a monitoring service that is In constant two-way communication with the monitoring service on the standby server. If a server fails, the surviving monitoring services perform a failover sequence to assume failed server's workload if it was active.<br>The surviving monitoring services also alert the operation team on duty.<br>Refer to the Scenario -<br>A new IT manager has asked you to model the applications and system software elements involved in document management, including the services they provide, the data objects they handle, and how they work together.<br>Which answer best models this information?<br><img src=\"/assets/media/exam-media/02406/0009500001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0009600001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0009700001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0009800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-05-04T10:52:00.000Z",
        "voteCount": 1,
        "content": "Services are serving the app engine."
      },
      {
        "date": "2023-02-28T02:47:00.000Z",
        "voteCount": 1,
        "content": "Answer is A.\n\nD - Incorrect - \nAmong A, B, C - A is the best answer as the infrastructure services (Document and Workflow) are serving the Application Engine. , C is also incorrect - because the Claim data is not composed of Analysts data and business rule data. They are seperate."
      },
      {
        "date": "2023-02-21T06:20:00.000Z",
        "voteCount": 1,
        "content": "Assignment relationship is incorrect with passive structural element.\n\nThe assignment relationship links active structure elements with units of behavior that are performed by them, business actors with business roles that are fulfilled by them, and nodes with technology objects."
      }
    ],
    "examNameCode": "og0-023",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/the-open-group/view/101691-exam-og0-023-topic-2-question-12-discussion/",
    "body": "Scenario -<br>Please read this scenario prior to answering the question<br>The ArchiSuranceTo Go mobile consumer solution is increasingly important to ArchiSurance, which uses it to sell and renew insurance products, provide customer service, enable accurate and convenient home recordkeeping, and capture and process claims. The solution consists of three components. The<br>Consultant lets customers review their existing coverage, and update it based on common life events, such as getting a new car, moving into a new home, or having a family member move in or out. If necessary, they can speak or chat with a customer service representative. The Home Manager helps customers photograph and catalogue their valuable possessions in order to support the filing of accurate claims in case of loss or damage. The Claim Manager enables customers to quickly file a claim for loss or damage to an insured auto, home or possession. It enables customers to describe the incident by referencing information captured with the Consultant and the Home Manager applications. In addition, it allows thecustomer to add photocraphs, audio, video and text to support a claim, submit the claim, and monitor its progress.<br>The ArchiSuranceTo Go components rely on a number of application services hosted by ArchiSurance. The first is an Auto Identification and Description (AID) service that the Consultant uses to validate and complete auto information entered by customers. The second service, Home Identification and Description (HID) performs the same function for home information, and is used by the Home Manager. The Consultant also uses the Virtual Agent service to guide customers as they select coverage options, the Payment Processor service to arrange premium payments, and the Coverage Activator service to generate policies and put them in force.<br>ArchiSurance to Go also relies on a number of infrastructure services. The Home Manager uses a Multimedia Repository service to store and retrieve information about insured homes. The Claim Manager also uses this service for claim information entered bycustomers. All three components of ArchiSuranceTo Go use a<br>Personal Security service to register and authenticate customers, and to manage their profiles.<br>Each application service is realized by an application component with the same name. Also, each infrastructure service is realized by a system software environment with the same name. ArchiSurance hosts both the application components and system software environments in a virtualized server pool within its data center. Each service has its own virtual server. Each server is connected to a data center network (DCN) which in turn connects to a commercial wide area network (WAN).<br>Refer to the Scenario -<br>The marketing department would like a better understanding of the business services that ArchiSuranceTo Go delivers, and the application services and components that are used to deliver those business services. The marketing department would also like to understand the data accessed directly by the interactive application components.<br>Which answer provides the best explanation?<br><img src=\"/assets/media/exam-media/02406/0011200001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0011200002.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0011300001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0011300002.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-03-06T13:20:00.000Z",
        "voteCount": 1,
        "content": "Answer A is correct ;"
      }
    ],
    "examNameCode": "og0-023",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/the-open-group/view/100049-exam-og0-023-topic-2-question-15-discussion/",
    "body": "Scenario -<br>Please read this scenario prior to answering the question<br>ArchiSurance has a partnership with ArchiBank in which the two companies market each other's consumer offerings to their own customers. Each quarter, the chief marketing officers (CMOs) of the two companies work together to plan the next quarter's promotions. First, they review each other's business objectives related to the partnership. Then, they formulate the co-operative marketing plan. The CMOs determine which offerings they will promote, the characteristics of the target customers, and the timing of each promotion. They assemble their findings into a co-operative marketing plan that Is reviewed separately by the chief financial officer (CFO) of each organization. If either of the CFOs finds a problem, the CMOs must quickly work together to formulate another version of the plan.<br>The review and reformulation process continues until both CFOs have approved a version of the plan. Then,the CMOs share the plans with their respective operations teams. Each organization's operations team configures the bank's systems toexecute the joint promotions.<br>The cooperative marketing process is enabled by CRM software delivered as a service (SaaS). The two organizations each use separate logical instances of a multi-tenant customer relationship management (CRM) application hosted by a service provider. Each company's CRM instance is a dedicated function of the same CRM application component. The dedicated functions also share the same multi-tenant database. The component's data access layer is designed with safeguards to keep each company's data separate unless it is intentionally shared.<br>Each CRM instance has targeting, exchange and outreach sub-functions. The targeting sub-functions select customers based on criteria developed by the CMOs and configured by the operations teams. The exchange sub-functions share the selected customer profiles with each other, and the outreach sub-functions generate promotional email. In this way, each company's CRM system generates a list of target customers that the other company's CRM system uses to send promotional email.<br>The multi-tenant CRM application component is hosted on a large virtual server complex that is connected via a site network to a physical storage array and a commercial wide-area network (WAN) used by both companies. Both companies access their CRM systems via PCs connected to Local Area Networks (LANs) that are in turn connected to the shared commercial WAN.<br>Refer to the Scenario -<br>The new head of IT has asked you to describe how the CRM application supports the partnership, including the CRM application itself, the various application functions and the data flows between them, and the hosting and networking that supports the CRM application.<br>Which answer provides the best description?<br><img src=\"/assets/media/exam-media/02406/0012200001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0012300001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0012400001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02406/0012500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-20T06:10:00.000Z",
        "voteCount": 1,
        "content": "The exchange sub-functions share the selected customer profiles with each other, So they need Access relationship between them.  Also both share the CRM application, not separate applications. So B is incorrect."
      }
    ],
    "examNameCode": "og0-023",
    "topicNumber": "2"
  }
]