[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/hrci/view/141748-exam-sphr-topic-7-question-47-discussion/",
    "body": "As an HR Professional you should be familiar with the terminology, practices, and rules governing union-based strikes. An organization utilizes union labor and non-union labor in their operations. The union goes on a strike; so the organization shifts work to the non-union labor to offset the effects of the strike. If the union labor decides to picket the operations of the non-union labor, what term is assigned to this process?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDouble Breasting Picketing",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCommon situs picketing",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWildcat strikes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSympathy strike"
    ],
    "answer": "A",
    "answerDescription": "Answer option A is correct.<br>When a union is on a strike and the organization shifts work to non-union operations, the union can picket the non-union operations. This is called a double breasting picket.<br>Answer option D is incorrect. A sympathy strike occurs when non-striking workers don't cross the picket line of striking workers.<br>Answer option B is incorrect. The common situs picketing happens when members of a picketing labor union picket a workplace in which multiple employers work.<br>This could include employers who the picketers don't have a disagreement with.<br>Answer option C is incorrect. A wildcat strike is when a collective bargaining agreement restricts strikes, but workers strike anyway.<br>Guide, HR Certification Institute, ISBN: 978-1-586-44149-4, Section III, The US HR Body of Knowledge.<br>Chapter: Employee and Labor Relations<br>Objective: Union Organization",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-01T20:46:00.000Z",
        "voteCount": 1,
        "content": "he correct answer is B. Common situs picketing.\n\nCommon situs picketing occurs when union labor pickets a site where both union and non-union employees work, typically targeting the entire worksite rather than just the operations involving union labor. This often happens when an employer shifts work to non-union labor during a strike."
      }
    ],
    "examNameCode": "sphr",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/hrci/view/141747-exam-sphr-topic-7-question-77-discussion/",
    "body": "The union rep has requested copies of all the incident reports filed during the last year. You are required to do what?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFurnish copies within 15 calendar days but only of the -Tell Us About the Case \" section",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFurnish the copies by the end of the next business day",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFurnish copies of the -Tell Us About the Case \" section within 7 calendar days",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFurnish the copies by the end of the day"
    ],
    "answer": "C",
    "answerDescription": "Answer option C is correct.<br>The employee representative is entitled to receive copies of incident reports with the identifying information omitted. Employers have 7 calendar days to provide the information to an employee representative. Copies of the OSHA form 300 log must be provided by the end of the following business day (B) when requested by employees or their representatives. Options A and B do not apply to OSHA requirements.<br><br>Chapter: Risk Management -<br>Objective: Review Questions",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-01T20:07:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is A. Furnish copies within 15 calendar days but only of the \"Tell Us About the Case\" section.\n\nUnder OSHA regulations, employers are required to provide access to the \"Tell Us About the Case\" section of the incident reports (OSHA Form 300) to authorized employee representatives within 15 working days of the request."
      }
    ],
    "examNameCode": "sphr",
    "topicNumber": "7"
  }
]