[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/ibm/view/53820-exam-c2150-620-topic-1-question-1-discussion/",
    "body": "A System Administrator has been seeing a lot of SSLv2-Weak_Cipher attacks reported on the network and wants to increase the severity of the events.<br>How can this be accomplished?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Threat Level of the signature.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Incident in SiteProtector for SSLv2_Weak Cipher.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Event Log response for the Intrusion Preventions Object.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tincrease the X-Force Protection Level for the Intrusion Prevention Object."
    ],
    "answer": "Answer: For Security Network IPS (GX) sensors, there is an X-Force Virtual Patch policy that is used to determine which signatures are enabled by default (this",
    "answerDescription": "What do the various Protection Levels in the X-Force Virtual Patch and Trust X-Force Defaults mean? feature is enabled by default but can be disabled). On Security Network Protection (XGS) sensors, this same Protection Level can be specified for each IPS<br>Object in the Intrusion Prevention Policy.<br>Note: Intrusion Prevention Object \"\" Threat level protection<br>X-Force Virtual Patch Protection Levels<br>✑ None<br>Do not enable any signatures by default. This option is for a user that wants complete control over which signatures get enabled.<br>✑ Moderate<br>The moderate policy enables most attack events for a good level of security protection with minimal chance of false alarms. The moderate policy is designed for users who intermittently monitor security events and minimally manage the IPS configuration.<br>✑ Aggressive<br>The aggressive policy enables a high percentage of attack events for a high level of security protection with a chance of false alarms. The aggressive policy is designed for users who perform testing and tuning before IPS deployment, and who closely monitor security events and occasionally fine-tune the IPS configuration.<br>✑ Paranoid<br>The paranoid policy enables almost all attack events (including events from the latest XPUs) for a very high level of security protection with significant chance of false alarms. The paranoid policy is designed for users who perform considerable testing and tuning before IPS or XPU deployment, and who closely monitor security events and frequently fine-tune the IPS configuration.<br>References:<br>http://www-01.ibm.com/support/docview.wss?uid=swg21701441",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-30T08:49:00.000Z",
        "voteCount": 1,
        "content": "c is the correct answer"
      }
    ],
    "examNameCode": "c2150-620",
    "topicNumber": "1"
  }
]