[
  {
    "topic": 4,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/comptia/view/1970-exam-n10-006-topic-4-question-28-discussion/",
    "body": "A network technician is troubleshooting a problem at a remote site. It has been determined that the connection from router A to router B is down. The technician at the remote site re-terminates the CAT5 cable that connects the two routers as a straight through cable. The cable is then tested and is plugged into the correct interface.<br>Which of the following would be the result of this action?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe normal amount of errors and the connection problem has been resolved.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe interface status will indicate that the port is administratively down.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe traffic will flow, but with excessive errors.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe interface status will show line protocol down."
    ],
    "answer": "D",
    "answerDescription": "Devices of different types are connected with a straight through cable (patch cable). In this case, it is used to connect two devices of the same type. It is for this reason that the interface will display the line protocol down status.",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-24T03:04:00.000Z",
        "voteCount": 1,
        "content": "Granted, that in a pre-2006 (ish) networking environment, MDI networking (see below) devices were more or less prevalent, but as any networking engineer worth his salt indelibly knows, is that (esp. in this line of work) nothing remains static (for too long) which also includes the introduction of new technolohgies (or the natural inclination to improve or evolve current technologies - mostly for the better good). \n\nCase in point: MDIX (Medium Dependent Interface Crossover).\n\nIf at least one router had an MDIX ethernet port then the underlying implementation of using a straight-through or crossover cable would be a redunant subject matter; the port would accordingly dedect the cable format and adjust accordingly. \n\nSuccinct but informative paragraph on the tiopic can be read here:\n\nMDI/MDIX (medium dependent interface/MDI crossover) \nhttps://searchnetworking.techtarget.com/definition/MDI-MDIX"
      },
      {
        "date": "2019-06-24T03:40:00.000Z",
        "voteCount": 2,
        "content": "Correction: auto-MDIX &gt; allows for two networking devices to use both straight-though or crossover cables...google (or bing, duckduckgo) it if warranted...:)"
      }
    ],
    "examNameCode": "n10-006",
    "topicNumber": "4"
  }
]