[
  {
    "topic": 5,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/comptia/view/2006-exam-n10-006-topic-5-question-3-discussion/",
    "body": "When troubleshooting a network problem, browsing through the log of a switch, it is discovered that multiple frames contain errors.<br>In which of the following layers does the problem reside? (Select TWO).<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLayer 2",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLayer 3",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLayer 5",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransport layer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData link",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPhysical layer"
    ],
    "answer": "AE",
    "answerDescription": "Layer 2 of the OSI reference model is the data-link layer. Components of the data-link layer include frame-format, Media Access Control (MAC) addressing, protocol identification and error detection.<br>When data is being sent, it is split into protocol data units (PDUs) as it passes through the layers of the OSI model. The PDUs have different names as they are passed through the layers of the OSI model. In layer 2, the PDU is called a Frame.<br>The most common protocol specified in the data-link layer is Ethernet and the most common network component in the data-link layer is a network switch.<br>In this question, problems are discovered with Ethernet frames by examining the logs in a network switch. Therefore, for this question, we are working in Layer 2, the data-link layer.",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-25T02:48:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct, but my discord here is related more with semantics in reference to all possible answers provided. \n\nTechnically one could debate that both answers would need to be in the same syntax (as in  'Layer 1' and ' Layer 2' OR 'Physical layer' and 'Data-Link layer'), but I digress as I do acknowledge that is one was to nitpick 'Data link' does not equate to 'Data-Link layer'), even though colloquially in the industry (i.e. real life, day-to-day verbal exchanges between professionals), 'Data link' IS  “to all intents, constructions, and purposes” Layer 2 (i.e. the Data-Link Layer)...\n\nWhoever designed this particular question had no doubt a sense of humour.\n\nLesson learned: \n\nFor those with some real-life experience in the industry and undergoing a rehash or revision to keep up their skill set, this question is a definite classic example (CAVEAT) that it is always best to reread a question twice over before answering (and leave real-life technical jargon on the way side as it will no doubt lead up to the wrong answer).\n\n'Just sayin' :)"
      },
      {
        "date": "2019-06-25T02:50:00.000Z",
        "voteCount": 1,
        "content": "Correction: \n\n'but I digress as I do acknowledge that if one was to nitpick'"
      }
    ],
    "examNameCode": "n10-006",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/comptia/view/114411-exam-n10-006-topic-5-question-5-discussion/",
    "body": "Which of the following will negotiate standoff timers to allow multiple devices to communicate on congested network segments?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCSMA/CD",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOSPF",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDOCSIS",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBGP A"
    ],
    "answer": "Explanation",
    "answerDescription": "Carrier Sense Multiple Access/Collision Detect (CSMA/CD) is used by devices in an Ethernet network for transmitting data on the network.<br>Any device on an Ethernet network can send data at any time. The network devices sense when the line is idle and therefore available for the transmission of data. The network device then transmits a data frame onto the network. If another device sends a frame at exactly the same time, a collision occurs and the frames are discarded. The network devices will then wait for a random period of time before attempting to send the frame again.",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-07T00:32:00.000Z",
        "voteCount": 1,
        "content": "A shld be the answer"
      }
    ],
    "examNameCode": "n10-006",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/comptia/view/114413-exam-n10-006-topic-5-question-16-discussion/",
    "body": "An organization is moving to a new datacenter. During the move, several technicians raise concerns about a system that could potentially remove oxygen from the server room and result in suffocation.<br>Which of the following systems are they MOST likely discussing?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFire suppression",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMantraps at the entry",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHVAC",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUPS and battery backups"
    ],
    "answer": "A",
    "answerDescription": "Fire suppression systems are often deployed in server rooms to prevent a fire destroying all the I.T. equipment. Different fire suppression systems work in different ways. Obviously a fire suppression system that sprays water onto the fire is no good for a server room as the water would do as much damage as the fire. A common fire suppression system used in server rooms is one that suppresses the fire by starving it of oxygen. One way the oxygen can be removed from the server room is to fill the server room with an inert gas such as carbon dioxide.",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-07T00:56:00.000Z",
        "voteCount": 1,
        "content": "C shld be the answer. HVAC addresses oxygen and airflow"
      }
    ],
    "examNameCode": "n10-006",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/comptia/view/2066-exam-n10-006-topic-5-question-21-discussion/",
    "body": "Which of the following is true about the main difference between a web session that uses port 80 and one that uses port 443?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPort 80 web sessions often use application-level encryption, while port 443 sessions often use transport-level encryption.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPort 80 web session cannot use encryption, while port 443 sessions are encrypted using web certificates.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPort 80 web sessions can use web application proxies, while port 443 sessions cannot traverse web application proxies.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPort 80 web sessions are prone to man-in-the-middle attacks, while port 443 sessions are immune from man-in-the-middle attacks."
    ],
    "answer": "D",
    "answerDescription": "HTTPS stands for HTTP over SSL or HTTP Secure. It is used for secure access to websites. Port 80 web sessions are HTTP (HyperText Transfer Protocol) sessions which offers no security. Port 443 web sessions use HTTPS. HTTPS uses SSL or TLS to encrypt the HTTP traffic.<br>HTTPS provides authentication of the website and associated web server that you are communicating with, which protects against man-in-the-middle attacks.<br>Additionally, it provides bidirectional encryption of communications between a client and server, which protects against eavesdropping and tampering with and/or forging the contents of the communication.",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-29T03:31:00.000Z",
        "voteCount": 3,
        "content": "Even though answer D is technically correct, it is nevertheless a rather specific answer to a question the leans on to a more of a generalist inquiry (hint: the use of 'main difference between' - as there are, no doubt, other examples (other than MITM) of potential security threats when scouring the WWW unprotected.\n\nAnyhow, like eindicatd, Answer D would be fine were it not for the existence of answer B, which in my opinion reflects (answers | explains) the 'generalist' question type more adequately.\n\nCase in point: \n\nIf some random person asked about the main differences between port 80 and port 443, the most succinct (and natural) answer would be encryption (or lack thereof), not (even though technically correct) a more specific potential threat example as with MITM... \n\nRule of thumb when working in IT networking and dealing with its security subset: don't necessarily complicate matters, even (or more so) when answering simple questions. \n\nNutshell: Answer B would be better suited rather than D even if both are correct.\n\nSide note (not to complicate matters) &gt; there are means to encrypt traffic on port 80, but that is beyond the scope of this cert and specifically Question # 22...if interested though:\n\nhttps://letsencrypt.org/docs/allow-port-80/"
      }
    ],
    "examNameCode": "n10-006",
    "topicNumber": "5"
  }
]