[
  {
    "topic": 8,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/87082-exam-az-800-topic-8-question-1-discussion/",
    "body": "You are planning the implementation Azure Arc to support the planned changes.<br>You need to configure the environment to support configuration management policies.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a hybrid runbook worker in Azure Automation.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy the Azure Monitor agent to all the servers.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy the Azure Connected Machine agent to all the servers.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHybrid Azure AD join all the serves."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 11,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-05T11:32:00.000Z",
        "voteCount": 7,
        "content": "Azure Arc enables organizations to manage servers, Kubernetes clusters, and applications anywhere, on-premises, multi-cloud, and edge, using the same management tooling as Azure resources in the cloud.\n\nTo support configuration management policies, you need to deploy the Azure Connected Machine agent to all the servers. The agent will enable you to manage and enforce configuration policies on the servers from the Azure portal, ensuring that all servers comply with the desired state configuration defined in the policies."
      },
      {
        "date": "2023-03-30T01:46:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/governance/machine-configuration/overview\n\nAzure Policy's machine configuration feature provides native capability to audit or configure operating system settings as code, both for machines running in Azure and hybrid Arc-enabled machines. The feature can be used directly per-machine, or at-scale orchestrated by Azure Policy.\n\nTo manage settings inside a machine, a virtual machine extension is enabled and the machine must have a system-managed identity. The extension downloads applicable machine configuration assignment and the corresponding dependencies. The identity is used to authenticate the machine as it reads and writes to the machine configuration service. The extension isn't required for Arc-enabled servers because it's included in the Arc Connected Machine agent.\n\nC is correct"
      },
      {
        "date": "2022-11-06T19:18:00.000Z",
        "voteCount": 2,
        "content": "To connect hybrid machines to Azure, you install the Azure Connected Machine agent on each machine. This agent does not replace the Azure Log Analytics agent / Azure Monitor Agent. \n\nhttps://learn.microsoft.com/en-us/azure/azure-arc/servers/overview"
      },
      {
        "date": "2022-11-06T13:28:00.000Z",
        "voteCount": 2,
        "content": "since 22h2- the connected agent installs itself if you do the azure registration right with AZHCI- but if it does not install then you have to - here is some basic info #1 https://dp.stackhci.azure.com/health browse this with invoke-webrequest -url \" https://dp.stackhci.azure.com/health\" if you dont get a 200 then you will need to add this URL to their whitelist - this is proof for the cusotmer that MS changed - Please make a note of the Firewall Rule change for AZHCIOS here Firewall requirements for Azure Stack HCI - Azure Stack HCI | Microsoft Learn\n\nhttps://learn.microsoft.com/en-us/azure/azure-arc/servers/agent-overview"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "8"
  }
]