[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121096-exam-70-243-topic-1-question-21-discussion/",
    "body": "Your network contains a single Active Directory domain.<br>You plan to deploy System Center 2012 Configuration Manager.<br>The hierarchy will have a Central Administration Site and five Primary Sites.<br>You need to ensure that you can target user groups for software distribution.<br>The solution must minimize network traffic.<br>Which Configuration Manager discovery method should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory User Discovery and Active DirectoryGroup Discovery on the primary sites\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory User Discovery and Active Directory Group Discovery on the Central Administration site",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory User Discovery on the Central Administration site and Active Directory Group Discovery on the primary sites",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory User Discovery on the primary sites and Active Directory Group Discovery on every site"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-09-21T05:54:00.000Z",
        "voteCount": 1,
        "content": "Active Directory User Discovery and Active DirectoryGroup Discovery on the primary sites"
      }
    ],
    "examNameCode": "70-243",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21497-exam-70-243-topic-1-question-22-discussion/",
    "body": "Your network contains a System Center 2012 Configuration Manager environment.<br>The Configuration Manager databases are located on a remote server that runs Microsoft SQL Server.<br>You need to ensure that you can restore the Central Administration site.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Configuration Manager console, enable the Backup Site Server maintenancetask and set a schedule.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Microsoft SQL Server Management Studio, create a maintenance plan for the site databases.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Task Scheduler, create a scheduled task that runs smssqlbkup.exe.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows Server Backup, schedule a full systembackup."
    ],
    "answer": "A",
    "answerDescription": "http://technet.microsoft.com/en-us/library/gg712697.aspx<br>Backup and Recovery in Configuration Manager<br>Enterprise solutions such as System Center 2012 Configuration Manager must prepare for both backup and recovery operationsto avoid loss of critical data. For<br>Configuration Manager sites, this preparation ensures that sites and hierarchies are recovered with the least data loss and in the quickest possible time.<br>Back up a Configuration Manager Site<br>System Center 2012 Configuration Manager provides a backup maintenance task that runs on a schedule and backs up the site database, specific registry keys, and specific folders and files.<br><br>Backup Maintenance Task -<br>You can automate backup for Configuration Manager sites by schedulingthe predefined Backup Site Server maintenance task. You can back up a central administration site and primary site, but there is no backup support for secondary sites or site system servers.<br>To enable the site backup maintenance task<br>✑ In the ConfigurationManager console, click Administration.<br>✑ In the Administration workspace, expand Site Configuration, and then click Sites.<br>✑ Select the site in which you want to enable the site backup maintenance task.<br>✑ On the Home tab, in the Settings group, click Site Maintenance Tasks.<br>✑ Click Backup Site Server and then click Edit.<br>✑ Select Enable this task, and then click Set Paths to specify the backup destination.<br>✑ Configure an appropriate schedule for the site backup task. As a best practice, consider a backup schedule thatis outside active working hours. If you have a hierarchy, consider a schedule that runs at least two times a week to ensure maximum data retention in the event of site failure.<br>✑ Select whether to create an alert if the site backup task fails, click OK, andthen click OK. When selected, Configuration Manager creates a critical alert for the backup failure that you can review in the Alerts node in the Monitoring workspace.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-27T23:46:00.000Z",
        "voteCount": 1,
        "content": "From the Configuration Manager console, enable the Backup Site Server maintenancetask and set a schedule."
      }
    ],
    "examNameCode": "70-243",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46149-exam-70-243-topic-1-question-85-discussion/",
    "body": "DRAG DROP -<br>You have a System Center 2012 R2 Configuration Manager Service Pack 1 (SP1) deployment. The deployment includes the collections described in the following table.<br><img src=\"/assets/media/exam-media/02556/0009900001.png\" class=\"in-exam-image\"><br><br>Configuration Manager has the client settings configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02556/0010000001.png\" class=\"in-exam-image\"><br><br>You need to identify which additional hardware inventory classes will be collected from Computer2 and Computer3.<br>What should you identify? To answer, drag the appropriate hardware inventory classes to the correct computers. Each hardware inventory class may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02556/0010100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02556/0010200001.png\" class=\"in-exam-image\">",
    "answerDescription": "When you create a custom set of client settings, you include in thiscustom list only those settings that should differ from the default. Any settings not included on the custom list will be derived from the default settings automatically.",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-09T03:52:00.000Z",
        "voteCount": 1,
        "content": "Computer 2: TPM &amp; Battery\nComputer 3: Battery &amp; 1394 Controller"
      }
    ],
    "examNameCode": "70-243",
    "topicNumber": "1"
  }
]