[
  {
    "topic": 5,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75544-exam-az-800-topic-5-question-1-discussion/",
    "body": "HOTSPOT -<br>You have on-premises file servers that run Windows Server as shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0013600001.png\" class=\"in-exam-image\"><br>You have the Azure file shares shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0013600002.png\" class=\"in-exam-image\"><br>You add a Storage Sync Service named Sync1 and an Azure File Sync sync group named Group1. Group1 uses share1 as a cloud endpoint.<br>You register Server1 and Server2 with Sync1. You add D:\\Folder1 from Server1 as a server endpoint in Group1.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0013700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0013700002.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/storage/file-sync/file-sync-planning",
    "votes": [],
    "comments": [
      {
        "date": "2022-06-03T12:40:00.000Z",
        "voteCount": 31,
        "content": "Correct answer is No, No, Yes\nA sync group only has 1 cloud endpoint, so share 2 (a cloud endpoint) cannot be added.\nOnly 1 server endpoint from the same server is allowed in the same sync group, so E:\\Folder 2 of Server 1 cannot be a server endpoint. D:\\Folder 1 is already the server endpoint within the sync group.\nServer 2can be added as a Server Endpoint as long as the server is registered.\nRemember a sync group is just a set of files to be kept in sync between servers or for caching on-prem.\nEach Share should have its own Sync Group"
      },
      {
        "date": "2022-05-17T05:34:00.000Z",
        "voteCount": 23,
        "content": "Box 1: No\nA sync group contains one cloud endpoint, or Azure file share, and at least one server endpoint.\n\nBox 2: No\nAzure File Sync does not support more than one server endpoint from the same server in the same Sync Group.\n\nBox 3: Yes\nMultiple server endpoints can exist on the same volume if their namespaces are not overlapping (for example, F:\\sync1 and F:\\sync2) and each endpoint is syncing to a unique sync group.\n\nReference:\nhttps://docs.microsoft.com/en-us/answers/questions/110822/azure-file-sync-multiple-sync-directories-for-same.html\nhttps://docs.microsoft.com/en-us/azure/storage/files/storage-sync-files-deployment-guide"
      },
      {
        "date": "2024-05-01T17:40:00.000Z",
        "voteCount": 1,
        "content": "No\nNo\nYes"
      },
      {
        "date": "2023-11-10T07:55:00.000Z",
        "voteCount": 4,
        "content": "NNY\n\"A registered server can support multiple server endpoints, however, a sync group can only have one server endpoint per registered server at any given time. Other server endpoints within the sync group must be on different registered servers.\nMultiple server endpoints can exist on the same volume if their namespaces are not overlapping (for example, F:\\sync1 and F:\\sync2) and each endpoint is syncing to a unique sync group.\"\nhttps://learn.microsoft.com/en-us/azure/storage/file-sync/file-sync-server-endpoint-create?tabs=azure-portal"
      },
      {
        "date": "2023-11-10T07:36:00.000Z",
        "voteCount": 1,
        "content": "NYY\n\n\"Server endpoint: The path on the Windows Server that is being synced to an Azure file share. This can be a specific folder on a volume or the root of the volume. Multiple server endpoints can exist on the same volume if their namespaces do not overlap.\"\n\nhttps://learn.microsoft.com/en-us/azure/storage/file-sync/file-sync-planning"
      },
      {
        "date": "2023-10-25T02:11:00.000Z",
        "voteCount": 1,
        "content": "it can be No, Yes, Yes. if we consider that reconfiguring the sync group is allowed.\nThey statement isn't saying that we can't  reconfigure the sync group.\n\nTo summarize, the \"No\" responses for both statements are based on the specific configuration details provided, which indicate that Group1 is associated with \"Share1\" as its cloud endpoint and \"D:\\Folder1\" from \"Server1\" as its server endpoint. This means that you cannot add different cloud endpoints (like \"Share2\") or different server endpoints (like \"E:\\Folder2\")      ----&gt; to Group1 without reconfiguring the sync group. &lt;-----\n\nits a microsoft question so you never know what they realy mean.\n\nEvery one is Saying No,No,Yes but if its oke to reconfigure it than its a No, Yes, Yes."
      },
      {
        "date": "2024-01-09T07:07:00.000Z",
        "voteCount": 1,
        "content": "but it is stating what to add, and it is not the volume."
      },
      {
        "date": "2023-03-25T00:51:00.000Z",
        "voteCount": 5,
        "content": "https://learn.microsoft.com/en-us/answers/questions/110822/azure-file-sync-multiple-sync-directories-for-same\n\nAzure File Sync does not support more than one server endpoint from the same server in the same sync group\n\nhttps://learn.microsoft.com/en-us/azure/storage/file-sync/file-sync-deployment-guide?tabs=azure-portal%2Cproactive-portal\n\nA registered server can support multiple server endpoints, however a sync group can only have one server endpoint per registered server at any given time\n\nNo\nNo\nYes"
      },
      {
        "date": "2023-03-11T12:10:00.000Z",
        "voteCount": 1,
        "content": "agree that answer is NNY"
      },
      {
        "date": "2023-01-16T10:48:00.000Z",
        "voteCount": 1,
        "content": "A server endpoint represents a specific location on a registered Windows Server computer, such\nas a folder or a volume. You can add multiple server endpoints for the same Windows Server\ncomputer, but they must be in different sync groups. Server endpoints can be on the same\nvolume of the same Windows Server computer if their namespaces don't overlap. For example, D:\\Folder1 and D:\\Folder2 can be two server endpoints on the same Windows Server computer. You can configure cloud tiering individually for each server endpoint\nSecond = NO"
      },
      {
        "date": "2022-11-05T12:38:00.000Z",
        "voteCount": 2,
        "content": "Only 1 cloud endpoint per - sync group = no Q1\n\t\n\tCan have multiple server endpoint per sync group but only one per server Q2 n\n\t\n\tCan have server endpoint from different server to same sync group Q3 Y"
      },
      {
        "date": "2022-08-22T06:13:00.000Z",
        "voteCount": 2,
        "content": "NO - One Endpoint one share\nNO - Multiple endpoint from same share not permitted as it would be same data at the end\nYES - Multiple endpoints from different servers can happen"
      },
      {
        "date": "2022-06-17T01:35:00.000Z",
        "voteCount": 5,
        "content": "No\nNo \nYes"
      },
      {
        "date": "2022-05-15T05:22:00.000Z",
        "voteCount": 4,
        "content": "Should be\nNo\nYes\nYes\n\nYou can only have ONE cloud endpoint and multiple server endpoints"
      },
      {
        "date": "2022-05-12T15:16:00.000Z",
        "voteCount": 1,
        "content": "Wrong\n\nNYY"
      },
      {
        "date": "2022-11-09T03:38:00.000Z",
        "voteCount": 1,
        "content": "Wrong\n\nNNY"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75982-exam-az-800-topic-5-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to sync files from an on premises server named Server1 to Azure by using Azure File Sync.<br>You have a cloud tiering policy that is configured for 30 percent free space and 70 days.<br>Volume E on Server1 is 500 GB.<br>A year ago, you configured E:\\Data on Server1 to sync by using Azure File Sync. The files that are visible in E:\\Data are shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0013800001.png\" class=\"in-exam-image\"><br>Volume E does NOT contain any other files.<br>Where are File1 and File3 located? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0013900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0014000001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/windows-server/manage/windows-admin-center/azure/azure-file-sync https://docs.microsoft.com/en-us/azure/storage/file-sync/file-sync-cloud-tiering-overview",
    "votes": [],
    "comments": [
      {
        "date": "2022-06-03T12:48:00.000Z",
        "voteCount": 13,
        "content": "Although File3 is less than 70 days old, it is replaced by File1  as the free space policy will override the date. Therefore it will be placed on cold-tier in azure FS only. File 1 which replaces file3 remains on both."
      },
      {
        "date": "2022-06-30T23:30:00.000Z",
        "voteCount": 19,
        "content": "Agree. Correc answer should be:\nFile 1: File server and Azure file share\nFile 3: Azure file share only\n\nExplanation with samples, as nazgul250 posted below:\nhttps://docs.microsoft.com/en-us/azure/storage/file-sync/file-sync-cloud-tiering-policy"
      },
      {
        "date": "2023-09-22T04:09:00.000Z",
        "voteCount": 1,
        "content": "Provided answer is correct."
      },
      {
        "date": "2023-03-25T01:02:00.000Z",
        "voteCount": 4,
        "content": "https://learn.microsoft.com/en-us/azure/storage/file-sync/file-sync-cloud-tiering-policy\n\nThe volume free space policy ensures that a specified percentage of the local volume the server endpoint is located on is always kept free.\n\nThe date policy tiers files last accessed x days ago or later. The volume free space policy will always take precedence. When there isn't enough free space on the volume to store as many days worth of files as described by the date policy, Azure File Sync will override the date policy and continue tiering the coldest files until the volume free space percentage is met.\n\nAzure File share will always be available for all the files. 30% free space so 350GB is allowed meaning that File 3 will be in the file share only"
      },
      {
        "date": "2023-03-25T01:03:00.000Z",
        "voteCount": 2,
        "content": "In other words answer is correct"
      },
      {
        "date": "2023-01-29T11:48:00.000Z",
        "voteCount": 4,
        "content": "File 1: C: Server1 and Azure file share\nFile 3: B: the azure file share only\n\nAzure File Sync uses a cloud tiering policy to determine which files are kept locally and which files are moved to the cloud. The policy is configured to have 30 percent free space and 70 days, meaning that files that haven't been accessed for 70 days are moved to the cloud to keep 30 percent of the disk space free.\n\nIn this scenario, File1 was last accessed 2 days ago and is 200GB in size, so it will remain locally on Server1. File2 was last accessed 10 days ago and is 100GB in size, so it will remain locally on Server1. File3 was last accessed 60 days ago and is 2000GB in size, so it will be moved to the cloud and stored in the Azure file share. File4 was last accessed 100 days ago and is 50GB in size, so it will be moved to the cloud and stored in the Azure file share.\n\nTherefore, File1 is located on Server1 only and File3 is located in the Azure file share only."
      },
      {
        "date": "2022-11-06T08:35:00.000Z",
        "voteCount": 3,
        "content": "70% of 500GB is 350GB.\nFile4 is on Azure file share only because it's older than 70 days.\nFile1 and File2 are a total of 300GB in size. \nFile3 can have 50GB on server1. So File3 should be on Server 1 and Azure file share too."
      },
      {
        "date": "2022-11-09T15:50:00.000Z",
        "voteCount": 2,
        "content": "both are the same:  on Server 1 and Azure file share"
      },
      {
        "date": "2022-12-17T13:09:00.000Z",
        "voteCount": 5,
        "content": "Won’t keep a partial file - 50 GB out of 200GB. This is a file, not a folder. File 3 will be only in Azure, and not at all on the server."
      },
      {
        "date": "2022-05-24T11:00:00.000Z",
        "voteCount": 3,
        "content": "The volume free space policy will always take precedence; when there isn't enough free space on the volume to store as many days worth of files as described by the date policy, Azure File Sync will override the date policy and continue tiering the coldest files until the volume free space percentage is met.\n\nhttps://docs.microsoft.com/en-us/azure/storage/file-sync/file-sync-cloud-tiering-policy"
      },
      {
        "date": "2022-05-22T02:14:00.000Z",
        "voteCount": 2,
        "content": "It should be both same answer onprem File server and Azure file share\nSync mean both ways then data tiering to remove cool file from onprem after 70 days"
      },
      {
        "date": "2022-05-20T13:27:00.000Z",
        "voteCount": 1,
        "content": "The volume free space policy tells Azure File Sync to tier cool files to the cloud when a certain amount of space is taken up on your local disk.\n\nWith the date policy, cool files are tiered to the cloud if they haven't been accessed (that is, read or written to) for x number of days"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75983-exam-az-800-topic-5-question-3-discussion/",
    "body": "HOTSPOT -<br>You have on-premises servers that run Windows Server as shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0014100001.png\" class=\"in-exam-image\"><br>You have an Azure file share named share1 that stores two files named File2.docx and File3.docx.<br>You create an Azure File Sync sync group that includes the following endpoints:<br>✑ share1<br>✑ D:\\Folder1 on Server1<br>✑ D:\\Data1 on Server2<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0014100005.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0014200001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/storage/file-sync/file-sync-introduction",
    "votes": [],
    "comments": [
      {
        "date": "2022-05-22T02:21:00.000Z",
        "voteCount": 28,
        "content": "N,N,Y sync group will sync all data to all endpoints\nYou can not create files same existing names"
      },
      {
        "date": "2022-07-05T10:08:00.000Z",
        "voteCount": 4,
        "content": "Ok, true. But the question is about creating files on the servers that together make up the synced data. Would being joined to a sync group create limitations in what remains also a local folder?\nIs there a source to back this up?"
      },
      {
        "date": "2022-06-03T13:13:00.000Z",
        "voteCount": 9,
        "content": "NNY is the correct answer"
      },
      {
        "date": "2024-08-15T08:11:00.000Z",
        "voteCount": 1,
        "content": "You cannot have 2 same files within the same folder, what about different folders? not sure about the answers in the comments. Azure file share stores its own files File2.docx and File3.docx in its root folder, whereas we've got subfolders within the onpremises servers. does Azure File Sync creates the folder hierarchy within its share?"
      },
      {
        "date": "2024-05-28T00:00:00.000Z",
        "voteCount": 1,
        "content": "-    You can create a file named File2.docx in D:\\Folder1 on Server1: No (already exists due to synchronization)\n-    You can create a file named File1.docx in D:\\Data1 on Server2: Yes (does not exist, so it can be created)\n-    File3.docx will sync to Server1: Yes (will sync from share1 to D:\\Folder1 on Server1)"
      },
      {
        "date": "2024-05-28T00:05:00.000Z",
        "voteCount": 1,
        "content": "I'm sorry. The correct answer is:\n\n    You can create a file named File2.docx in D:\\Folder1 on Server1: No (already exists due to synchronization)\n    You can create a file named File1.docx in D:\\Data1 on Server2: No (already exists due to synchronization)\n    File3.docx will sync to Server1: Yes (will sync from share1 to D:\\Folder1 on Server1)"
      },
      {
        "date": "2024-05-15T00:16:00.000Z",
        "voteCount": 2,
        "content": "I did this in lab.\nN\nN\nY"
      },
      {
        "date": "2023-03-28T04:18:00.000Z",
        "voteCount": 5,
        "content": "I would say\n\nYes (No existing File2)\nNo (Existing File1)\nYes (For sure)"
      },
      {
        "date": "2022-12-19T03:31:00.000Z",
        "voteCount": 2,
        "content": "NNY. I don't think you can create something that already exist. You can modify it though. I believe the trick here is \"english\"."
      },
      {
        "date": "2022-11-05T13:21:00.000Z",
        "voteCount": 2,
        "content": "I just went over this training and i belive #2 is Y - your not changing both files- your only changing 1 and it would simply overwrite the older copy. - \nhttps://learn.microsoft.com/en-us/training/modules/implement-hybrid-file-server-infrastructure/\nY\nY (if we were modigying both then N but we are not)\nY"
      },
      {
        "date": "2022-11-14T14:03:00.000Z",
        "voteCount": 3,
        "content": "1. N - You are not changing a file, it asks if you can create a file with a name that already exists on all endpoints as File2.docx has already been synced from Azure file share (share1) to on-premise endpoints\n2. N - As I understand this is the same scenario. File1 from Server1 has already been synced to all endpoints when you try to create a new file with the same name.\n3. Y - If you add an Azure file share that has an existing set of files as a cloud endpoint to a sync group, the existing files will sync to server endpoints that you add to the same sync group."
      },
      {
        "date": "2022-10-06T07:41:00.000Z",
        "voteCount": 5,
        "content": "1. Yes -&gt; You can :)\n\n2. No -&gt; \"File Sync doesn't provide locking, which means that if the same file is modified on multiple endpoints at the same time before the first modification syncs, a conflict occurs.\"\n\n3. Yes -&gt; \"File Sync implements multi-master replication, which means that changes that occur at any server endpoint sync to all other endpoints in the same sync group.\"\n\n(https://learn.microsoft.com/en-us/training/modules/implement-hybrid-file-server-infrastructure/5-describe-azure-file-synchronization)\nPlease correct ,me if I am wrong"
      },
      {
        "date": "2022-09-20T09:43:00.000Z",
        "voteCount": 3,
        "content": "Should be: No, No, Yes - I tested it in real life. And I don't know why WMG and Vmwarevirtual has written about \"share1 and Share\" now I can find only first one in content of the question"
      },
      {
        "date": "2022-08-04T02:57:00.000Z",
        "voteCount": 2,
        "content": "Tricky, depends if \"share1\" and \"Share\" are supposed to be different or if it is just an error in the text."
      },
      {
        "date": "2022-05-20T13:38:00.000Z",
        "voteCount": 7,
        "content": "1. Y \n2. N\n3. Y \nThis question only deals with Azure file share - Share . The information with the Share 1 folder is puzzling you"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/76313-exam-az-800-topic-5-question-4-discussion/",
    "body": "HOTSPOT -<br>You have a file server named Server1 that runs Windows Server and contains the volumes shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0014200002.png\" class=\"in-exam-image\"><br>On which volumes can you use BitLocker Drive Encryption (BitLocker) and disk quotas? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0014300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0014400001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/windows-server/storage/refs/refs-overview",
    "votes": [],
    "comments": [
      {
        "date": "2022-05-26T10:58:00.000Z",
        "voteCount": 12,
        "content": "from the provided link:\nThe following features are available with ReFS and NTFS:\nFeature \t                      ReFS \tNTFS\nBitLocker encryption \tYes \tYes\n\nThe following features are unavailable on ReFS at this time:\nFunctionality \tReFS \tNTFS\nDisk quotas \t         No \t         Yes"
      },
      {
        "date": "2024-05-28T00:13:00.000Z",
        "voteCount": 2,
        "content": "BitLocker: C, D, E\nDisk quotas: C, D"
      },
      {
        "date": "2023-05-11T05:06:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/windows-server/storage/refs/refs-overview"
      },
      {
        "date": "2023-03-14T03:46:00.000Z",
        "voteCount": 3,
        "content": "Given answer is supported by provided link"
      },
      {
        "date": "2023-01-16T13:17:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/windows-server/storage/refs/refs-overview"
      },
      {
        "date": "2022-10-18T04:32:00.000Z",
        "voteCount": 2,
        "content": "correct"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75467-exam-az-800-topic-5-question-5-discussion/",
    "body": "You have a server that runs Windows Server and contains a shared folder named UserData.<br>You need to limit the amount of storage space that each user can consume in UserData.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStorage Spaces",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWork Folders",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDistributed File System (DFS) Namespaces",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile Server Resource Manager (FSRM)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 30,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-05-11T04:47:00.000Z",
        "voteCount": 15,
        "content": "Features\nFile Server Resource Manager includes the following features:\n\nQuota management allows you to limit the space that is allowed for a volume or folder, and they can be automatically applied to new folders that are created on a volume. You can also define quota templates that can be applied to new volumes or folders."
      },
      {
        "date": "2024-08-15T08:23:00.000Z",
        "voteCount": 1,
        "content": "this one is a no brainer"
      },
      {
        "date": "2024-07-22T19:17:00.000Z",
        "voteCount": 1,
        "content": "D it is (23)"
      },
      {
        "date": "2024-05-01T18:25:00.000Z",
        "voteCount": 2,
        "content": "To limit the amount of storage space that each user can consume in the UserData shared folder, you should use File Server Resource Manager (FSRM). It allows you to create quotas and apply them to specific folders or volumes, ensuring that users cannot exceed their allocated storage space."
      },
      {
        "date": "2023-03-14T04:19:00.000Z",
        "voteCount": 3,
        "content": "This is D for sure"
      },
      {
        "date": "2023-02-05T11:18:00.000Z",
        "voteCount": 3,
        "content": "File Server Resource Manager (FSRM) is the tool you should use to limit the amount of storage space that each user can consume in the UserData folder. FSRM allows you to set storage quotas on a shared folder, which limits the amount of disk space that a user or group can consume."
      },
      {
        "date": "2022-12-08T20:25:00.000Z",
        "voteCount": 3,
        "content": "A correta"
      },
      {
        "date": "2022-08-04T03:01:00.000Z",
        "voteCount": 3,
        "content": "FSRM is correct. The other options do nothing with the question (quota management)."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75001-exam-az-800-topic-5-question-6-discussion/",
    "body": "Your network contains an Active Directory Domain Services (AD DS) domain named contoso.com. The domain contains two servers named Server1 and Server2.<br>Server1 contains a disk named Disk2. Disk2 contains a folder named UserData. UserData is shared to the Domain Users group. Disk2 is configured for deduplication. Server1 is protected by using Azure Backup.<br>Server1 fails.<br>You connect Disk2 to Server2.<br>You need to ensure that you can access all the files on Disk2 as quickly as possible.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a storage pool.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRestore files from Azure Backup.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the File Server Resource Manager server role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the Data Deduplication server role.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 61,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 11,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-05-12T15:26:00.000Z",
        "voteCount": 26,
        "content": "AS007 , you are wrong if you have data onprem in other server, why you will pay to Azure to get you data again? and that will take forever\n\nFrom: https://techcommunity.microsoft.com/t5/storage-at-microsoft/introduction-to-data-deduplication-in-windows-server-2012/ba-p/424257\n3) Portability: A volume that is under deduplication control is an atomic unit. You can back up the volume and restore it to another server. You can rip it out of one Windows 2012 server and move it to another. Everything that is required to access your data is located on the drive. All of the deduplication settings are maintained on the volume and will be picked up by the deduplication filter when the volume is mounted. The only thing that is not retained on the volume are the schedule settings that are part of the task-scheduler engine. If you move the volume to a server that is not running the Data Deduplication feature, you will only be able to access the files that have not been deduplicated."
      },
      {
        "date": "2024-08-15T08:29:00.000Z",
        "voteCount": 1,
        "content": "You're my hero"
      },
      {
        "date": "2022-07-07T10:05:00.000Z",
        "voteCount": 3,
        "content": "I think you're right. Just imagine the disk wouldn't have data deduplication enabled and the server it is attached to fails. Would you go and restore the backup from the cloud? Or would you just plug it into another server to access the data? Well, it doesn't make sense to do that.\nJust because data deduplication requires the installation of a specific server role to read the data doesn't mean that restoring the back-up is the better or faster option. It isn't."
      },
      {
        "date": "2022-08-22T18:16:00.000Z",
        "voteCount": 8,
        "content": "A. Create a storage pool. - Makes no sense\nB. Restore files from Azure Backup. - Data back up still dedup, so not only cost but one more step to add the role on new server\nC. Install the File Server Resource Manager server role. - makes no sense\nD. Install the Data Deduplication server role. - correct"
      },
      {
        "date": "2024-05-01T18:40:00.000Z",
        "voteCount": 3,
        "content": "To swiftly access all the files on Disk2 after connecting it to Server2, you should install the Data Deduplication server role. Here’s why:\n\nData Deduplication:\nDisk2 is already configured for deduplication on Server1.\nWhen you move Disk2 to Server2, the deduplication settings are retained.\nThe deduplication filter recognizes the volume as an atomic unit, including all deduplication settings.\nYou’ll be able to access the deduplicated files directly without unpacking the entire data.\nNo additional efforts are required"
      },
      {
        "date": "2024-01-31T18:26:00.000Z",
        "voteCount": 1,
        "content": "FYI this is a question straight from the MeasureUp practice exam. The correct answer is B - sorry to all you D'ers out there!"
      },
      {
        "date": "2023-11-10T11:44:00.000Z",
        "voteCount": 1,
        "content": "\"'Atomic units' mean that all of the deduplication information about a given volume is kept on that volume, so it can be moved without injury to another system that supports deduplication. If you move it to a system that doesn't have deduplication, you'll only be able to see the nondeduplicated files. The best rule is not to move a deduplicated volume unless it's to another Windows Server 2012 machine.\""
      },
      {
        "date": "2023-10-25T12:59:00.000Z",
        "voteCount": 1,
        "content": "If you already have Server2 and the disk is connected to it, installing the Data Deduplication role could potentially help you save storage space on the disk by eliminating duplicate data. However, it won't necessarily speed up the process of accessing the files immediately, as the deduplication process may take some time, especially if it's a large dataset.\n\nOn the other hand, restoring files from Azure Backup is a quicker way to access and recover the files from the backup without needing to perform deduplication or additional data processing. This is especially important when your goal is rapid data recovery after a server failure.\n\nSo, while installing the Data Deduplication role may be beneficial for storage efficiency in the long term, if your primary concern is quick access to the files on the disk, restoring files from Azure Backup is the more suitable and faster option."
      },
      {
        "date": "2023-11-10T11:40:00.000Z",
        "voteCount": 2,
        "content": "You don't need Deduplication service to deduplicate data on the disk but to access data on deduplicated drive. Without this service you will not be able to read that data"
      },
      {
        "date": "2023-07-18T05:15:00.000Z",
        "voteCount": 1,
        "content": "B is correct"
      },
      {
        "date": "2023-07-02T12:20:00.000Z",
        "voteCount": 1,
        "content": "It's restore from Azure Backup.\n\nReason:\nYup can't use Disk 2 on other mechine if you don't de-dupicate it first on Server 1, and since it failed it won't be much of a use."
      },
      {
        "date": "2023-03-18T04:18:00.000Z",
        "voteCount": 2,
        "content": "\"Disk2 is configured for deduplication\"\n\nD is the answer"
      },
      {
        "date": "2023-02-07T14:27:00.000Z",
        "voteCount": 2,
        "content": "B, because you want it as quickly as possible."
      },
      {
        "date": "2023-01-28T12:21:00.000Z",
        "voteCount": 2,
        "content": "B. Restore files from Azure Backup. This will restore the files on Disk2 that were protected by Azure Backup, and will ensure that you can access all the files on Disk2 as quickly as possible.\n\nOption D, installing the Data Deduplication server role, may not be the best solution because the deduplication process can take a significant amount of time and resources to complete. Additionally, the deduplication metadata may not be accessible if the disk is connected to a different server and the data deduplication feature is not installed on that server."
      },
      {
        "date": "2022-09-28T04:20:00.000Z",
        "voteCount": 5,
        "content": "is te fastest way to get you data back."
      },
      {
        "date": "2022-09-05T10:46:00.000Z",
        "voteCount": 4,
        "content": "Since it says restore as quickly as possible, the fastest way would be to attach the disk to server 2 and enable dedup to be able to work with the files imo. Azure backup will work but wont be the quickest assuming its a reasonable size file share."
      },
      {
        "date": "2022-08-15T09:50:00.000Z",
        "voteCount": 1,
        "content": "Key piece of info or assumption, server failed not the disk. If that's the case then no data lost and no back restore required. But then data is dedup so you need role which can ensure that you can read"
      },
      {
        "date": "2022-08-15T04:31:00.000Z",
        "voteCount": 2,
        "content": "You should restore the files from Azure Backup on Server B. Azure Backup is used to back up files and folders and recover from Azure. You can restore the data using the restore feature of Azure Backup. You can select the latest restore point and mount the data on Server B. This meets the goal because you can restore the data on Disk A and provide access to the domain users group.\n\nYou should not install the Data Deduplication role on Server B. Data Deduplication is used to reduce the impact of redundancies on storage costs. Disk A has deduplication enabled. You need to disable the deduplication for Disk A before mounting on Server B to access the data. Since Server A is not booting up. you cannot disable the deduplication feature for Disk A. Hence, installing the Deduplication role on Server B would not help and this would not meet the goal."
      },
      {
        "date": "2022-08-04T03:05:00.000Z",
        "voteCount": 1,
        "content": "\"Disk2 is configured for deduplication.\" + \"you can access all the files on Disk2 as quickly as possible.\".\n\nThis rules out Azure Backup, because it does not fulfill the \"quick as possible\" condition. Install the Data Dedup role on the server and the disk is up and running almost instantly."
      },
      {
        "date": "2022-07-30T16:42:00.000Z",
        "voteCount": 1,
        "content": "I agree with AvoKikinha"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75468-exam-az-800-topic-5-question-7-discussion/",
    "body": "You have five file servers that run Windows Server.<br>You need to block users from uploading video files that have the .mov extension to shared folders on the file servers. All other types of files must be allowed. The solution must minimize administrative effort.<br>What should you create?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Dynamic Access Control central access policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta data loss prevention (DLP) policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Dynamic Access Control central access rule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta file screen\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 20,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-05-11T04:51:00.000Z",
        "voteCount": 8,
        "content": "On the File Screening Management node of the File Server Resource Manager MMC snap-in, you can perform the following tasks:\n\nCreate file screens to control the types of files that users can save, and generate notifications when users attempt to save unauthorized files.\nDefine file screening templates that can be applied to new volumes or folders and that can be used across an organization.\nCreate file screening exceptions that extend the flexibility of the file screening rules."
      },
      {
        "date": "2022-08-04T03:09:00.000Z",
        "voteCount": 5,
        "content": "Nice of MS to throw in some softball questions.\n\nA) is related to accessing AD resources and such, giving you different access depending on preqrequisites.\n\nB) DLP in MS world is referring to MS 365 files that are protected so they cannot be shared externally/deleted etc.\n\nC) same as A."
      },
      {
        "date": "2024-08-15T08:38:00.000Z",
        "voteCount": 1,
        "content": "I'd rather test myself with honest questions instead of dealing with stupid ones or even worse ambiguous questions where the answer can be a matter of opinion because the question is badly formulated. Some questions are created with the purpose of setting you up for failure"
      },
      {
        "date": "2024-07-25T17:47:00.000Z",
        "voteCount": 1,
        "content": "File Screen (14)"
      },
      {
        "date": "2023-03-14T04:04:00.000Z",
        "voteCount": 3,
        "content": "D for sure"
      },
      {
        "date": "2023-02-05T11:20:00.000Z",
        "voteCount": 3,
        "content": "You should create a file screen in File Server Resource Manager (FSRM) to block users from uploading video files with the .mov extension to shared folders on the file servers. FSRM allows you to define file screening rules, which monitor and restrict the types of files that users can save to a specific folder. This solution minimizes administrative effort by allowing you to create a single file screening rule that can be applied to multiple file servers."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75546-exam-az-800-topic-5-question-8-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory Domain Services (AD DS) domain named adatum.com. The domain contains a file server named Server1 and three users named User1, User2, and User3.<br>Server1 contains a shared folder named Share1 that has the following configurations:<br><img src=\"/assets/media/exam-media/04225/0014700001.png\" class=\"in-exam-image\"><br>The share permissions for Share1 are configured as shown in the Share Permissions exhibit.<br><img src=\"/assets/media/exam-media/04225/0014800001.png\" class=\"in-exam-image\"><br>Share1 contains a file named File1.bxt. The advanced security settings for File1.txt are configured as shown in the File Permissions exhibit.<br><img src=\"/assets/media/exam-media/04225/0014900001.jpg\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0015000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0015000002.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-06-03T13:24:00.000Z",
        "voteCount": 25,
        "content": "WOW, read the question!!!!\nBox 1: No. User 1 share permission in Change (domain users), NTFS = Full Control, most restrictive applies when combining permissions\nBox 2: Yes. User 2 has Read NTFS and Change (share) Read wins\nBox 3: Yes. User 3 has Write NTFS and Change (share) Write wins"
      },
      {
        "date": "2022-09-22T00:26:00.000Z",
        "voteCount": 8,
        "content": "Box 3 should be No - when you configure FolderEnumerationMode to AccessBased only account who has Read specific permission to certain file/folder will see this file/folder. AccessBased Enumeration isn't enabled in default configuration, but in question there is screenshot which shows that it is enabled in our case."
      },
      {
        "date": "2022-11-06T09:29:00.000Z",
        "voteCount": 1,
        "content": "user3 has \"write\" access.\n\nSpecifies which files and folders in the new SMB share will be visible to the users. The acceptable values for this parameter are:\n\nAccessBased. SMB does not the display the files and folders for a share to a user unless that user has rights to access the files and folders. By default, access-based enumeration is disabled for new SMB shares.\nUnrestricted. SMB displays files and folders to a user even when the user does not have permission to access those items."
      },
      {
        "date": "2022-05-12T15:28:00.000Z",
        "voteCount": 24,
        "content": "Wrong,\n\nNYY"
      },
      {
        "date": "2024-02-19T08:05:00.000Z",
        "voteCount": 1,
        "content": "Incorrect. Last one is NO. User doesn't have read permission so he cannot see file.\nEveryone can test it on their own Windows machine. It is simple. Fist I was confused too. But after 10min testing it was clear."
      },
      {
        "date": "2022-05-23T10:36:00.000Z",
        "voteCount": 2,
        "content": "Why? User1 have fullcontrol in the file."
      },
      {
        "date": "2022-07-07T12:05:00.000Z",
        "voteCount": 4,
        "content": "NTFS only applies when u logon to the server locally = eg U1 has FC.\nall 3 questions refers to remote unc connections which means the share permissions dominate which means all 3 users have read and write so u 1 cannot take ownership via unc."
      },
      {
        "date": "2023-01-29T00:31:00.000Z",
        "voteCount": 3,
        "content": "Share + NTFS = Most Restrictive (Which in this case Share permission wins)"
      },
      {
        "date": "2022-11-16T11:39:00.000Z",
        "voteCount": 17,
        "content": "Wrong. How can this be highly voted? It's N Y N as lukiduc9625 and joehoesofat said.\nThe last one is N - write permissions on file are more restrictive than Change+Read on Share1 and write wins over Change+Read. FolderEnumerationMode set to AccessBased will result in showing files/folders which have Read or equivalent permissions - write is not enough. It just has to be Read or it will not show up in the folder."
      },
      {
        "date": "2022-12-21T14:48:00.000Z",
        "voteCount": 9,
        "content": "N  Y N \nLike Kurko said, AccessBasedEnumeration is the key. For that reason, User3 can not see the file1.txt."
      },
      {
        "date": "2022-12-21T14:58:00.000Z",
        "voteCount": 1,
        "content": "On another though... The permissions shown here are not for the folder. It is for the actual file file1.txt. Meaning, if User3 has write permissions, it must mean User3 saved that file and still has permissions to see that file exists. User3 might be able to overwrite, but not edit or delete.\nhttps://community.spiceworks.com/topic/832081-write-only-shared-folder-permissions-in-education-setting#:~:text=Creator%20Owner%20has%3A%20List%20folder%2Fread%20data%2C%20read%20attrib%2C,saved%20to%20make%20sure%20it%20was%20copied%20successfully.\n(Students have to save the file first on their computer they copy and paste the file into the correct dropbox folder.  They can not save directly to the folder.  Students can View their own files they have dropped into this folder and can overwrite them, but they can not delete them. )"
      },
      {
        "date": "2023-12-28T22:42:00.000Z",
        "voteCount": 4,
        "content": "YYY\n1) User 1 has direct non-inherited Full Control rights (same as the highest level admin), so they can take ownership.\n2) User 2 has read rights on the folder. List folder is part of those rights, so they can see the file.\n3) User 3 has read rights on the folder. List folder is part of those rights, so they can see the file."
      },
      {
        "date": "2023-12-18T08:46:00.000Z",
        "voteCount": 2,
        "content": "Let's analyze each of the statements:\n\nWhen User1 connects to \\Server1.adatum.com\\Share1), the user can take ownership of File1.txt.\n\nYes, User1 can take ownership of File1.txt. This is because User1 has full control, which includes the permission to take ownership of a file.\nWhen User2 connects to \\Server1.adatum.com\\Share1), File1.txt is visible.\n\nYes, File1.txt will be visible to User2. User2 has “Change” permission, which includes permission to read files.\nWhen User3 connects to \\Server1.adatum.com\\Share1, File1.txt is visible.\n\nYes, File1.txt will be visible to User3. User3 has “Change” permission, which includes permission to read files."
      },
      {
        "date": "2023-11-10T11:59:00.000Z",
        "voteCount": 2,
        "content": "NYN\n\nYou guys are confuse WRITE permission with MODIFY\n\nMODIFY implies READ\nWRITE doesn't imply READ - can be a separate permission without READ\n\nScreenshot shows WRITE permission and NOT READ so the file is not visible"
      },
      {
        "date": "2023-11-10T12:12:00.000Z",
        "voteCount": 1,
        "content": "Any Object (File / Folder / Shortcut / Reparse Point / etc.) where the user has less than generic read permissions is omitted in the response by the server.\nGeneric Read means:\nList Folder / Read Data\nRead Attributes\nRead Extended Attributes\nRead Permissions"
      },
      {
        "date": "2023-10-08T14:29:00.000Z",
        "voteCount": 3,
        "content": "Test it for yourself in your labs. User3 cannot see it. Write doesn't give you \"Read\" permissions. You need to explicitly tick \"Read\" (and also \"Write\") if you want User3 to be able to write to the file. Answer is: N"
      },
      {
        "date": "2023-09-22T04:54:00.000Z",
        "voteCount": 6,
        "content": "1. NO, you will also need full share access to change the ownership. [tested]\n2. YES, user has read permissions. [tested]\n3. NO, user only has write permissions, therefore cannot read the file. [tested]"
      },
      {
        "date": "2024-02-19T08:01:00.000Z",
        "voteCount": 1,
        "content": "I have tested it also and received the same resolute."
      },
      {
        "date": "2024-02-28T10:14:00.000Z",
        "voteCount": 1,
        "content": "agreed - took 5-10 mins to test for myself."
      },
      {
        "date": "2023-09-21T04:11:00.000Z",
        "voteCount": 2,
        "content": "Correct\nNO. \nYES.\nYES. (reason below)\n\n\n- Usee3 has NTFS Write permission on File1.txt.\n- SHARE1 is a shared folder with Domain users having CHANGE allow permissions. which includes the ability to view files and folders within the share.\n- FolderEnumerationMode is set to AccessBased, which means that file and folder visibility is determined based on the user's NTFS permissions. \n\nSo, in summary, User1 will be able to see and access File1.txt when connecting to \\SERVER1\\SHARE1\\ due to their NTFS Write permission and the share-level CHANGE permissions granted to Domain users."
      },
      {
        "date": "2023-08-12T04:59:00.000Z",
        "voteCount": 1,
        "content": "In an NTFS file share where the FolderEnumerationMode is set to \"AccessBased,\" users who have access to a folder (or share) can see the items within that folder based on their effective permissions. This means that users will only see files and folders for which they have at least the \"List Folder Contents\" permission.\n\nIn your scenario, User3 has only WRITE permission on the file \"file1.txt.\" Since WRITE permission does not include the \"List Folder Contents\" permission, User3 would not be able to see the file \"file1.txt\" in the share, even though they have write access to that specific file. They would not have the necessary permission to enumerate the contents of the folder that contains \"file1.txt,\" so the file would be effectively hidden from User3 when they browse the share.\n\nTo summarize, with the settings you described, User3 would not be able to see the file \"file1.txt\" in the share. They can only modify the file since they have WRITE permission directly on that file, but they don't have the necessary permissions to list the contents of the folder that contains the file."
      },
      {
        "date": "2023-05-11T05:42:00.000Z",
        "voteCount": 1,
        "content": "Good : N,Y,Y\nhttps://www.varonis.com/blog/ntfs-permissions-vs-share"
      },
      {
        "date": "2023-04-14T10:15:00.000Z",
        "voteCount": 2,
        "content": "#3 is definitely NO.  I just tested this out as described.  The key is the FolderEnumerationMode.  Write permissions isn't enough to see the file over the network.  User3 would also need to have READ permissions."
      },
      {
        "date": "2023-03-28T04:40:00.000Z",
        "voteCount": 2,
        "content": "https://www.ntfs.com/ntfs-permissions-ownership.htm#:~:text=You%20must%20have%20Full%20Control,to%20any%20user%20or%20group.\n\nYou must have Full Control or the special permissions \"Take Ownership\" to be able to take ownership of a file or folder.\n\nI would say Yes to all"
      },
      {
        "date": "2023-04-17T03:38:00.000Z",
        "voteCount": 2,
        "content": "Disregard this; answer is No Yes Yes\n\nCredit to prepper666 for the explanation"
      },
      {
        "date": "2023-01-31T18:31:00.000Z",
        "voteCount": 4,
        "content": "Reproduced in Lab - It's N Y N"
      },
      {
        "date": "2023-05-17T17:35:00.000Z",
        "voteCount": 1,
        "content": "I also reproduced it in LAB and @chadamantium is right. \nUser1 can't take ownership (can see file).\nUser2 can see the file. \nUser3 can't see the file.\n\nWhen you enable access-based enumeration is written. \n“Access-based enumeration displays only the files and folders that a user has permissions to access. If a user does not have Read (or equivalent) permissions for a folder, Windows hides the folder from the user’s view. \""
      },
      {
        "date": "2023-01-10T11:58:00.000Z",
        "voteCount": 3,
        "content": "I just tested this in a lab, and it seems that it's YYN.  \nUser1 - Sees the txt file and is able to open the txt file, make changes, and save them.\nUser2 - Sees the txt file and is able to open the txt file, but cannot save any changes (when you try and save, the \"save as\" prompt comes up\nUser3 - when navigating to that share, they cannot see that file\n\nPretty quick and easy to recreate.\nNot sure if anyone else has tested this but this is correct in my lab setting."
      },
      {
        "date": "2022-10-31T20:13:00.000Z",
        "voteCount": 7,
        "content": "Box1: no- has change but not full controll cannot take ownership\nBox2: yes\nBox 3:no - Has write but not read- Access based enumeration says no see"
      },
      {
        "date": "2022-09-22T00:15:00.000Z",
        "voteCount": 6,
        "content": "Suggested answer is wrong! Correct one should be:\nNo - because Share permission is only Change thus it blocks possibility of taking ownership \nYes - no comment is necessary\nNo - there is information in question text that Share1 has option FolderEnumerationMode set to AccessBased - it means that if some account does not have Read permission to the file, that account does not see that file. I tested it in my lab"
      },
      {
        "date": "2022-08-22T18:19:00.000Z",
        "voteCount": 2,
        "content": "NYY\nThat's specifically the point I taught to my team members that why sharing permissions are important"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/77039-exam-az-800-topic-5-question-9-discussion/",
    "body": "DRAG DROP -<br>You have a server named Server1.<br>You plan to use Storage Spaces to expand the storage available to Server1. You attach eight physical disks to Server1. Four disks are HDDs and four are SSDs.<br>You need to create a volume on Server1 that will use the storage on all the new disks. The solution must provide the fastest read performance for frequently used files.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04225/0015100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0015200001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://redmondmag.com/articles/2018/07/31/storage-spaces-windows-server-2016-1.aspx https://redmondmag.com/articles/2018/08/02/storage-spaces-windows-server-2016-2.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2022-07-05T10:20:00.000Z",
        "voteCount": 9,
        "content": "Correct, see the video and the outline of the main steps here: https://docs.microsoft.com/en-us/learn/modules/implement-storage-spaces-storage-spaces-direct/4-implement-storage-spaces."
      },
      {
        "date": "2023-03-18T04:10:00.000Z",
        "voteCount": 3,
        "content": "The main steps in the process are:\n\nCreate AD DS environment. Create a single-domain AD DS forest with a domain member configured as a file server with four data disks.\nCreate a storage pool. Use Server Manager to create a storage pool.\nCreate a mirrored virtual disk hosting a single volume by using Server Manager. Use Server Manager to create a mirrored virtual disk hosting a single volume."
      },
      {
        "date": "2024-05-29T10:12:00.000Z",
        "voteCount": 3,
        "content": "Valid 05/28/2024"
      },
      {
        "date": "2024-04-09T07:49:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/windows-server/storage/storage-spaces/deploy-standalone-storage-spaces"
      },
      {
        "date": "2023-10-27T11:55:00.000Z",
        "voteCount": 3,
        "content": "Create a storage pool. (This combines the HDDs and SSDs into a single pool of storage.)\nCreate a virtual disk. (This is done within the storage pool and allows you to configure the type of resiliency, size, and tiering for performance.)\nCreate a simple volume. (This is done on the virtual disk you created and allows you to assign a drive letter and use the storage.)\n\nYou do not need to convert disks into dynamic or GPT disks for this specific scenario."
      },
      {
        "date": "2023-09-22T05:15:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/87044-exam-az-800-topic-5-question-10-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory Domain Services (AD DS) domain named adatum.com. The domain contains a server named Server1 and the users shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0015300001.jpg\" class=\"in-exam-image\"><br>Server1 contains a folder named D:\\Folder1. The advanced security settings for Folder1 are configured as shown in the Permissions exhibit. (Click the<br>Permissions tab.)<br><img src=\"/assets/media/exam-media/04225/0015300002.png\" class=\"in-exam-image\"><br>Folder1 is shared by using the following configurations:<br><img src=\"/assets/media/exam-media/04225/0015400001.png\" class=\"in-exam-image\"><br>The share permissions for Share1 are shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0015400002.png\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0015400003.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0015500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "To access files in a shared folder, you need to be granted permissions on the folder (NTFS permissions) AND permissions on the share.  The most restrictive permission of the folder permissions and share permissions apply.<br><br>Box 1: Yes -<br>Group1 has Read access to Folder1 and Change access to Share1.  Therefore, User1 can read the files in Share1.<br><br>Box 2: No -<br>Group3 has Full Control access to Share1.  However, Group3 has no permissions configured Folder1. Therefore, User3 cannot access the files in Share1.<br><br>Box 3: Yes -<br>Group2 has write permission to Folder1.  However, Group2 has no permission on Share1.  Therefore, users in Group2 cannot access files in the shared folder.<br>Access Based Enumeration when enabled hides files and folders that users do not have permission to access.  However, Access Based Enumeration is not enabled on Share1.  This is indicated by the FolderEnumerationMode ג€\" Unrestricted setting. Therefore, the share will be visible to User2 even though User2 cannot access the shared folder.",
    "votes": [],
    "comments": [
      {
        "date": "2022-11-05T18:12:00.000Z",
        "voteCount": 14,
        "content": "User1 - Group1 - Has read (most restrictive) = can read so Y\n\nGroup3/user3 - has  full control of share1 but share permissions are unknown- So we cannot say we can delete files so {N}\n\nGroup2/User2 - we have write permissions to share but unknown ntfs permissions- But Read is the goal. - In this case read depends on \nFolder enumeration unrestricted: means access based enumeration is off so file can be seen - without read permissions"
      },
      {
        "date": "2023-05-17T17:53:00.000Z",
        "voteCount": 12,
        "content": "The answer is not correct. \nVery important are share permissions. \n\nUser1 -&gt; Group1\nUser2 &gt; Group2\nUser3 &gt; Group3\n\nPermission on share:\nGroup1 - Allow - Change\nGroup3 - Allow - Full Control\n\nBut on folder permissions\nGroup1 Read\nGroup2 Write \n\nUser1 has access share and permissions.\nUser2 has only access on file.\nUser3 has access to to share but not permission on folder. \n\nAnswer is: \nY\nN\nN\nI also replicated it in LAB."
      },
      {
        "date": "2023-08-13T14:01:00.000Z",
        "voteCount": 1,
        "content": "Spot on!"
      },
      {
        "date": "2024-06-14T07:07:00.000Z",
        "voteCount": 2,
        "content": "For those testing in your own lab, turn OFF access-based enumeration. You will see that even though user2 does not have read rights, he can still see the file."
      },
      {
        "date": "2024-06-14T00:51:00.000Z",
        "voteCount": 2,
        "content": "I see a lot of fuzz around the last answer:\n\nIt is indeed correct because enumeration is unrestricted which means that the user still can see the folder but not access it."
      },
      {
        "date": "2023-09-22T06:50:00.000Z",
        "voteCount": 6,
        "content": "Answers are correct:\n\n1.[YES] User1 is member of Group1. Group1 has read (NTFS) permissions. Group1 has change (SHARE) permissions.\n2.[NO] User 3 is memebr of Group3. Group3 doesn't have any (NTFS) permissions.\n3.[YES] User is able to see the share name, but cannot open the share. I have tested this and this is 100% the correct answer."
      },
      {
        "date": "2023-03-26T04:13:00.000Z",
        "voteCount": 4,
        "content": "User 1 in Group 1 with Read access for folder 1 so can read files\nUser3 in Group 3 with no known permissions for folder 1 so cannot delete\nUser2 in Group 2 with write permissions for folder 1 so can view files\n\nYes\nNo\nYes\n\nAnswer is correct"
      },
      {
        "date": "2023-06-04T11:06:00.000Z",
        "voteCount": 2,
        "content": "Is not correct. User2 dont have share permissions"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/85790-exam-az-800-topic-5-question-11-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory Domain Services (AD DS) domain named contoso.com. The domain contains a server named Server1 that has the<br>DFS Namespaces role service installed. Server1 hosts a domain-based Distributed File System (DFS) Namespace named Files.<br>The domain contains a file server named Server2. Server2 contains a shared folder named Share1. Share1 contains a subfolder named Folder1.<br>In the Files namespace, you create a folder named Folder1 that has a target of \\\\Server2.contoso.com\\Share1\\Folder1.<br>You need to configure a logon script that will map drive letter M to Folder1. The solution must use the path of the DFS Namespace.<br>How should you configure the command to map the drive letter? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0015600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0015700001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-11-05T18:44:00.000Z",
        "voteCount": 14,
        "content": "https://learn.microsoft.com/en-us/windows-server/storage/dfs-namespaces/dfs-overview\n\nClose… look at the question again. in the Files namespace (\\\\contoso\\files), you create a folder named Folder1 that has a target… - so the full namespace is \\\\contoso\\files\\folder1\n the files and folder1 add to the root namespace contoso.com  the target is added to the folder1 as a folder target, but we need none of that information to anwer the question"
      },
      {
        "date": "2022-10-27T05:20:00.000Z",
        "voteCount": 8,
        "content": "No; be aware at the request: The solution must use the path of the DFS Namespace.\nSo, the correct answer is \\\\contoso.com\\Folder1"
      },
      {
        "date": "2023-01-29T08:42:00.000Z",
        "voteCount": 17,
        "content": "You forgot the namespace Files \nAnswer is \\\\contoso.com\\Files\\Folder1\n(Server1 hosts a domain-based Distributed File System (DFS) Namespace named Files)"
      },
      {
        "date": "2024-07-24T07:09:00.000Z",
        "voteCount": 2,
        "content": "Correct answer: - \n\\\\server2.contoso.com\\share1\\folder1\nTested in LAB."
      },
      {
        "date": "2024-08-02T06:09:00.000Z",
        "voteCount": 3,
        "content": "Sure it works, But \" The solution must use the path of the DFS Namespace.\""
      },
      {
        "date": "2023-03-26T04:35:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/windows-server/storage/dfs-namespaces/dfs-overview\n\nNamespace root - The namespace root is the starting point of the namespace. In the previous figure, the name of the root is Public, and the namespace path is \\\\Contoso\\Public\n A user who browses to \\\\Contoso\\Public\\Software\\Tools is transparently redirected to the shared folder \\\\LDN-SVR-01\\Tools or \\\\NYC-SVR-01\\Tools, depending on which site the user is currently located in\n\nhttps://adamtheautomator.com/net-use/\n\nI would go with \\\\contoso.com\\share1\\folder1"
      },
      {
        "date": "2023-03-08T03:36:00.000Z",
        "voteCount": 5,
        "content": "The answer is correct, \\\\contoso.com because you are using dfs, files because is the namespace publicated, and folder1 because is the folde resource, so \\\\contoso.com\\files\\folder1"
      },
      {
        "date": "2023-09-06T08:49:00.000Z",
        "voteCount": 1,
        "content": "correct only the dfs namespace path is relevant here the target dosent matter. the target could be anything. so \\\\contoso.com\\files\\folder1"
      },
      {
        "date": "2023-01-28T12:31:00.000Z",
        "voteCount": 1,
        "content": "The command to map the drive letter should be \"net use M: \\contoso.com\\Files\\Folder1\". This is because the DFS Namespace is hosted on Server1 and is named \"Files\", and the folder within the namespace that is being mapped to the drive letter is named \"Folder1\""
      },
      {
        "date": "2023-01-07T08:57:00.000Z",
        "voteCount": 2,
        "content": "\\\\contoso.com\\Folder1"
      },
      {
        "date": "2022-12-19T07:11:00.000Z",
        "voteCount": 4,
        "content": "\"In the Files namespace, you create a folder named Folder1 that has a target of \\\\Server2.contoso.com\\Share1\\Folder1\"\n\nThe answer is \\\\contoso.com\\Folder1"
      },
      {
        "date": "2022-10-18T05:01:00.000Z",
        "voteCount": 3,
        "content": "Shouldn't \\\\Server2.contoso.com\\Share1\\Folder1 be the correct answer? Please explain."
      },
      {
        "date": "2024-07-24T07:11:00.000Z",
        "voteCount": 1,
        "content": "you are right Teo, your answer is correct."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/85515-exam-az-800-topic-5-question-12-discussion/",
    "body": "DRAG DROP -<br>You have two on-premises servers named Server1 and Server2 that run Windows Server.<br>You have an Azure Storage account named storage1 that contains a file share named share1. Server1 syncs with share1 by using Azure File Sync.<br>You need to configure Server2 to sync with share1.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04225/0015800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0015900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/storage/file-sync/file-sync-server-registration https://docs.microsoft.com/en-us/azure/storage/file-sync/file-sync-server-endpoint-create?tabs=azure-portal",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-15T03:11:00.000Z",
        "voteCount": 11,
        "content": "Given answer is correct"
      },
      {
        "date": "2023-04-14T10:36:00.000Z",
        "voteCount": 3,
        "content": "Answer is correct.  You can register the server before or after the installation of the sync agent."
      },
      {
        "date": "2023-03-26T04:42:00.000Z",
        "voteCount": 4,
        "content": "https://learn.microsoft.com/en-us/azure/storage/file-sync/file-sync-server-registration\n\nBefore a server can be used as a server endpoint in an Azure File Sync sync group, it must be registered with a Storage Sync Service\n\nInstall the Azure File Sync agent\n\nAnswer is correct"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81922-exam-az-800-topic-5-question-13-discussion/",
    "body": "You have a server named Server1 that runs Windows Server. Server1 has the storage pools shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0016000001.png\" class=\"in-exam-image\"><br>You plan to create a virtual disk named VDisk1 that will use storage tiers.<br>Which pools can you use to create VDisk1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPool2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPool1 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPool1, Pool2, and Pool3",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPool1 and Pool2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPool3 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPool2 and Pool3 only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPool1 and Pool3 only"
    ],
    "answer": "F",
    "answerDescription": "",
    "votes": [
      {
        "answer": "F",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-09-12T21:21:00.000Z",
        "voteCount": 5,
        "content": "Answer is Correct You must have at least one SSD and one physical drive attached to use storage tiers."
      },
      {
        "date": "2023-09-22T07:06:00.000Z",
        "voteCount": 2,
        "content": "https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/storage-spaces-how-to-configure-storage-tiers-with-windows/ba-p/256700"
      },
      {
        "date": "2023-03-22T05:02:00.000Z",
        "voteCount": 3,
        "content": "https://learn.microsoft.com/en-us/azure/virtual-machines/disks-pools\n\nOnly premium SSD managed disks and standard SSDs, or ultra disks can be added to a disk pool\n\nF is correct"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82733-exam-az-800-topic-5-question-14-discussion/",
    "body": "Your network contains an Active Directory Domain Services (AD DS) forest. The forest contains three domains. Each domain contains 10 domain controllers.<br>You plan to store a DNS zone in a custom Active Directory partition.<br>You need to create the Active Directory partition for the zone. The partition must replicate to only four of the domain controllers.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tntdsutil.exe\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Sites and Services",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-DnsServer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDNS Manager"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-07-25T18:56:00.000Z",
        "voteCount": 2,
        "content": "ntdsutil.exe\n   (or dnscmd.exe in other variations of this question)"
      },
      {
        "date": "2024-09-07T05:50:00.000Z",
        "voteCount": 1,
        "content": "yep  ."
      },
      {
        "date": "2023-12-21T01:06:00.000Z",
        "voteCount": 2,
        "content": "ntdsutil.exe or dnscmd.exe, either one of those 2 will be on the answer list in the exam."
      },
      {
        "date": "2022-09-18T21:08:00.000Z",
        "voteCount": 2,
        "content": "Should it be dnscmd command instead?"
      },
      {
        "date": "2022-09-22T01:06:00.000Z",
        "voteCount": 3,
        "content": "No, look at https://synergixdesk.zendesk.com/hc/en-us/articles/202927548-Create-DNS-application-directory-partition-to-host-DNS-zone-containing-user-account-entries\nYou have to use ntdsutil.exe"
      },
      {
        "date": "2022-09-22T01:13:00.000Z",
        "voteCount": 11,
        "content": "\"You have to use ntdsutil.exe\" - I mean - from given answers you can only use ntdsutil.exe. But real life you can use dnscmd.exe too. There is another question with almost same text but different set of available answers - that set contains dnscmd.exe, but not ntdsutil.exe"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/87602-exam-az-800-topic-5-question-15-discussion/",
    "body": "You have two severs that have the Hyper-V server role installed. The servers are joined to a failover cluster. Both servers can connect to the same disk on an iSCSI storage device.<br>You plan to use the iSCSI storage to store highly available Hyper-V virtual machines that will. support live migration functionally.<br>You need to configure a storage resource in the failover cluster to store the virtual machines.<br>What should you configure?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCluster Shared Volumes (CSV)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDistributed File System (DFS) Replication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta storage pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta mirrored volume"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 10,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-01T20:04:00.000Z",
        "voteCount": 1,
        "content": "To store highly available Hyper-V virtual machines with support for live migration, configure a Cluster Shared Volume (CSV) in the failover cluster. Here’s why:\n\nCluster Shared Volumes (CSV):\nCSV is a clustered file system that allows multiple nodes in a failover cluster to concurrently access the same storage.\nIt provides shared storage for Hyper-V virtual machines, enabling seamless live migration.\nVM files (VHD/VHDX) reside on CSVs, ensuring high availability and efficient resource utilization.\nSimplifies management and minimizes administrative effort by centralizing storage resources"
      },
      {
        "date": "2023-03-22T05:08:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/windows-server/failover-clustering/failover-cluster-csvs\n\nA for answer"
      },
      {
        "date": "2023-01-28T12:33:00.000Z",
        "voteCount": 4,
        "content": "A. Cluster Shared Volumes (CSV) would be the appropriate configuration for storing highly available Hyper-V virtual machines that support live migration functionality. CSV allows multiple nodes in a failover cluster to have simultaneous read-write access to the same LUN (logical unit number) on an iSCSI storage device, making it possible for live migration of virtual machines between the Hyper-V servers."
      },
      {
        "date": "2022-12-15T01:45:00.000Z",
        "voteCount": 3,
        "content": "give answer is correct"
      },
      {
        "date": "2022-11-15T23:08:00.000Z",
        "voteCount": 2,
        "content": "It should be storage pool"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83192-exam-az-800-topic-5-question-16-discussion/",
    "body": "You have a server named Server1 that runs Windows Server.<br>You plan to host applications in Windows containers.<br>You need to configure Server1 to run containers.<br>What should you install?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWindows Admin Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDocker\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe Windows Subsystem for Linux",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHyper-V"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 11,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-08-15T10:26:00.000Z",
        "voteCount": 1,
        "content": "you might need HyperV if you need Kernel Isolation, however the question doesn't mention any particular need, so Process isolation is the way to go. Docker is the answer anyways"
      },
      {
        "date": "2023-11-10T13:01:00.000Z",
        "voteCount": 1,
        "content": "\"You need Docker in order to work with Windows Containers.\"\nhttps://learn.microsoft.com/en-us/virtualization/windowscontainers/manage-docker/configure-docker-daemon"
      },
      {
        "date": "2023-05-03T16:45:00.000Z",
        "voteCount": 1,
        "content": "This is a tricky question from Docker documentation. It stands that Docker \"uses the Windows Hyper-V features\".\n\nAlso, (from StackOverflow).\nDocker support for Windows has several variants:\n\n    Docker Toolbox which includes Docker Machine that will spin up a boot2docker image inside of VirtualBox. These are Linux containers running with a Linux kernel inside the VM. This was originally the only option for Windows users.\n\n    Docker for Windows using Hyper-V to run the Moby VM, based on LinuxKit, to run Linux images. LinuxKit provides a container based Linux OS, and there's some integration to make it appear less like a VM to the end user, e.g. you can use 127.0.0.1 instead of the IP of the VirtualBox VM. If you have Hyper-V available and want to run Linux containers on Windows, this is the preferred option.\n\n    Windows Server Containers which run Windows binaries on the same host OS, similar to how Linux containers on a Linux OS do not need a VM.\n\n    Hyper-V Containers which run Windows binaries inside of a separate VM for additional isolation."
      },
      {
        "date": "2023-04-05T12:16:00.000Z",
        "voteCount": 1,
        "content": "Correct answer"
      },
      {
        "date": "2023-03-22T05:10:00.000Z",
        "voteCount": 2,
        "content": "\"containers\" so answer is B"
      },
      {
        "date": "2023-01-25T01:01:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct tried to install it in windows server 2019 and its working\nno need for hyper V"
      },
      {
        "date": "2023-01-07T13:41:00.000Z",
        "voteCount": 3,
        "content": "its Microsoft exam ---&gt; hyper-v is correct"
      },
      {
        "date": "2023-02-20T20:58:00.000Z",
        "voteCount": 1,
        "content": "Agreed but that is prompted for when running installation?"
      },
      {
        "date": "2023-01-02T17:37:00.000Z",
        "voteCount": 2,
        "content": "Given Answer is correct"
      },
      {
        "date": "2022-11-04T13:33:00.000Z",
        "voteCount": 3,
        "content": "so yea- the containers are not supported anymore- to get this you must use docker! https://learn.microsoft.com/en-us/virtualization/windowscontainers/quick-start/set-up-environment?tabs=dockerce#prerequisites"
      },
      {
        "date": "2022-09-22T06:41:00.000Z",
        "voteCount": 2,
        "content": "Docker seems like the correct answer, but I thought the Hyper-V role was a pre-requisite, I'll do some testing, maybe that gets installed automatically?"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80925-exam-az-800-topic-5-question-17-discussion/",
    "body": "HOTSPOT -<br>You have a server named Server1 that runs Windows Server. Server1 has a just-a-bunch-of-disks (JBOD) enclosure attached.<br>You plan to create a storage pool on Server1 and a virtual disk that will use a mirror layout.<br>You are considering whether to use a two-way or a three-way mirror layout.<br>What is the minimum number of disks required for each type of mirror layout? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0016300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0016400001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-13T08:36:00.000Z",
        "voteCount": 12,
        "content": "2 and 5\nhttps://learn.microsoft.com/en-us/training/modules/implement-storage-spaces-storage-spaces-direct/2-define-storage-spaces-architecture-components\n\nResiliency levels\nTo create a highly available virtual disk, you need at least one physical disk that satisfies the following requirements:\n\n1.One physical disk is required to create a storage pool.\n2.A minimum of two physical disks are required to create a resilient mirror virtual disk.\n3.A minimum of three physical disks are required to create a virtual disk with resiliency through parity.\n4.Three-way mirroring requires at least five physical disks.\n5.Disks must be blank and unformatted. No volume can exist on the disks."
      },
      {
        "date": "2024-05-01T20:09:00.000Z",
        "voteCount": 3,
        "content": "To create a storage pool with a mirror layout, let’s explore the minimum disk requirements for both two-way and three-way mirrors:\n\nTwo-Way Mirror:\nA two-way mirror provides redundancy by maintaining two copies of data.\nThe minimum number of disks required for a two-way mirror is two.\nIt ensures fault tolerance against a single disk failure.\n\nThree-Way Mirror:\nA three-way mirror enhances redundancy by maintaining three copies of data.\nThe minimum number of disks required for a three-way mirror is five.\nIt provides additional fault tolerance, allowing for two simultaneous disk failures."
      },
      {
        "date": "2023-08-12T05:51:00.000Z",
        "voteCount": 2,
        "content": "I can see the answer for three-way mirror is 5 but can anyone explain why under this link it says you only need 3?\n\nhttps://learn.microsoft.com/en-us/azure-stack/hci/concepts/fault-tolerance#minimum-scale-requirements"
      },
      {
        "date": "2023-08-13T00:19:00.000Z",
        "voteCount": 3,
        "content": "The link is talking about fault domains. Which means the number of servers. To build three way mirrors you will require 5 disks in 3 servers."
      },
      {
        "date": "2023-07-11T06:34:00.000Z",
        "voteCount": 2,
        "content": "Resiliency levels\n\nTo create a highly available virtual disk, you need at least one physical disk that satisfies the following requirements:\n\n    One physical disk is required to create a storage pool.\n    A minimum of two physical disks are required to create a resilient mirror virtual disk.\n    A minimum of three physical disks are required to create a virtual disk with resiliency through parity.\n    Three-way mirroring requires at least five physical disks.\n    Disks must be blank and unformatted. No volume can exist on the disks.\n    You can attach disks by using a variety of bus interfaces, including, small computer system interface (SCSI), Serial Attached SCSI (SAS), Serial ATA (SATA), NVM Express (NVMe)."
      },
      {
        "date": "2023-04-15T05:40:00.000Z",
        "voteCount": 1,
        "content": "as per exam dump.. its says.. 1, 1"
      },
      {
        "date": "2023-03-26T04:46:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/training/modules/implement-storage-spaces-storage-spaces-direct/2-define-storage-spaces-architecture-components\n\nA minimum of two physical disks are required to create a resilient mirror virtual disk.\nA minimum of three physical disks are required to create a virtual disk with resiliency through parity.\nThree-way mirroring requires at least five physical disks.\n\nAnswer is correct"
      },
      {
        "date": "2023-01-29T11:57:00.000Z",
        "voteCount": 2,
        "content": "Three-way mirroring requires a minimum of 5 disks, while two-way mirroring requires a minimum of 2 disks. With three-way mirroring, data is written to three separate disks, which provides more data protection and redundancy in the event of disk failure."
      },
      {
        "date": "2023-01-25T01:14:00.000Z",
        "voteCount": 3,
        "content": "Given answer is correct\nhttps://social.technet.microsoft.com/Forums/en-US/827d7b90-87bf-4bcb-9f06-f6c4a5c31b8f/storagepool-minimum-disk-requirement-for-two-way-and-three-way-mirror?forum=winserverfiles"
      },
      {
        "date": "2022-11-05T20:10:00.000Z",
        "voteCount": 3,
        "content": "This really is a dumb question - you never have a single server pool- but i suppose this is good for academic question. = - Use the storage calculator and play with the numbers - you will see the 2 for two way and 5 for 3 ways is correct- only when you hit 5 drives and 4 nodes- do you see the three mirror for the first time- https://s2dcalc.blob.core.windows.net/www/index.html\nhttps://blog.sqlxdetails.com/capacity-calculator-for-storage-spaces/"
      },
      {
        "date": "2022-10-12T06:43:00.000Z",
        "voteCount": 3,
        "content": "Answer is correct according to https://www.pcmag.com/how-to/how-to-combine-multiple-hard-drives-with-windows-storage-spaces#:~:text=Two%2DWay%20Mirror%20and%20Three,three%2Dway%20mirror%20requires%20five."
      },
      {
        "date": "2022-09-26T08:05:00.000Z",
        "voteCount": 3,
        "content": "Three-way mirror—this option writes three copies of stored data, requiring at least five disks, and will protect against a two-disk failure. https://www.pearsonitcertification.com/articles/article.aspx?p=2014559"
      },
      {
        "date": "2022-09-22T06:52:00.000Z",
        "voteCount": 1,
        "content": "I searched but didn't find the reason why this answer shows 5 required for three-way mirror"
      },
      {
        "date": "2022-09-14T04:18:00.000Z",
        "voteCount": 1,
        "content": "Incorrect Should be 2/3 \nhttps://docs.microsoft.com/en-us/azure-stack/hci/concepts/fault-tolerance"
      },
      {
        "date": "2022-11-03T03:01:00.000Z",
        "voteCount": 3,
        "content": "No, it's 2 and 5. Three-way mirroring requires 5 disks.\n\nhttps://learn.microsoft.com/en-us/training/modules/implement-storage-spaces-storage-spaces-direct/2-define-storage-spaces-architecture-components"
      },
      {
        "date": "2022-09-07T07:41:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80926-exam-az-800-topic-5-question-18-discussion/",
    "body": "HOTSPOT -<br>Your company has offices in Boston and Montreal. The offices are connected by using a 10-Mbps WAN link that is often saturated.<br>The office in Boston contains the following:<br>✑ An Active Directory Domain Services (AD DS) domain controller named DC1<br>✑ A server named Server1 that runs Windows Server and has the File Server role installed<br>The office in Montreal contains 20 client computers that run Windows 10. Montreal does NOT have any servers.<br>The company plans to deploy a new line-of-business (LOB) application to all the client computers. The installation source files for the application are in \\\\Server1<br>\\Apps.<br>You need to make the installation source files available to the client computers in the Montreal office by using the minimum amount of WAN bandwidth possible.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0016600001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0016600002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-07T07:41:00.000Z",
        "voteCount": 11,
        "content": "Correct"
      },
      {
        "date": "2023-03-26T04:52:00.000Z",
        "voteCount": 4,
        "content": "https://learn.microsoft.com/en-us/windows-server/networking/media/branchcache/bc_modes.jpg\n\nAnd for sure you need to install the BranchCache on Server1\n\nAnswer is right"
      },
      {
        "date": "2023-01-17T01:10:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/windows-server/networking/branchcache/branchcache#BKMK_2"
      },
      {
        "date": "2022-11-05T20:19:00.000Z",
        "voteCount": 4,
        "content": "Ways to install branch cache file server/client\nhttps://learn.microsoft.com/en-us/windows-server/networking/branchcache/branchcache\n\nMain office is - BranchCache for Network Files role service of the File Services server role\n\nFor =branch office or clients- install branch cache in distributed mode or hosted mode. -- distributed because several clients will have a copy\n\nYou could also use the office and have - branch cache - with hosted cache server mode enabled- ** not used this question"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80927-exam-az-800-topic-5-question-19-discussion/",
    "body": "You have an on-premises Active Directory Domain Services (AD DS) domain that syncs with an Azure Active Directory (Azure AD) tenant. Group writeback is enabled in Azure AD Connect.<br>The AD DS domain contains a server named Server1. Server1 contains a shared folder named share1.<br>You have an Azure Storage account named storage2 that uses Azure AD-based access control. The storage2 account contains a share named share2.<br>You need to create a security group that meets the following requirements:<br>✑ Can contain users from the AD DS domain<br>✑ Can be used to authorize user access to share1 and share2<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Azure AD tenant, create a security group that has    assigned membership.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the AD DS domain, create a universal security group.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Azure AD tenant, create a security group that has dynamic membership.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Azure AD tenant, create a Microsoft 365 group."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 12,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 5,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-01-06T16:19:00.000Z",
        "voteCount": 10,
        "content": "Answer is A. Group Writeback is enabled so it can access Azure File Share and on-prem share with Azure AD group."
      },
      {
        "date": "2023-03-22T05:17:00.000Z",
        "voteCount": 5,
        "content": "https://learn.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-group-writeback-v2\n\nsince Azure AD security groups are written back with scope ‘Universal’\n\nB it is then"
      },
      {
        "date": "2024-07-27T10:37:00.000Z",
        "voteCount": 3,
        "content": "B. In the AD DS domain, create a universal security group.\n\nHere’s why:\n\nA universal security group in AD DS can contain users from the AD DS domain.\nThis group can be synchronized to Azure AD using Azure AD Connect.\nOnce synchronized, the group can be used to authorize access to resources in both the on-premises AD DS domain (share1) and Azure AD-based resources (share2)."
      },
      {
        "date": "2024-05-01T20:33:00.000Z",
        "voteCount": 2,
        "content": "To create a security group that meets the specified requirements, follow these steps:\n\nCreate a Security Group in Azure Active Directory (Azure AD):\nLog in to the Azure portal.\nNavigate to Azure Active Directory.\nClick on Groups and then select New group.\nChoose Security as the group type.\nEnter a name for the group (e.g., “ShareAccessGroup”).\nSet the Membership type to Assigned.\nAdd the necessary users from the AD DS domain to this group.\nClick Create.\nAuthorize User Access to share1 and share2:\nAssign the newly created security group permissions to the shared folders:\nOn Server1 (on-premises), configure the permissions for the share1 folder to allow access to the security group.\nIn Azure Storage (storage2), configure the permissions for the share2 folder to allow access to the same security group."
      },
      {
        "date": "2024-04-09T09:48:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/entra/identity/hybrid/cloud-sync/how-to-configure-entra-to-active-directory\n\nSupported groups:\n\n- only cloud created&nbsp;Security groups&nbsp;are supported\n- these groups can have assigned or dynamic membership.\n- these groups can only contain on-premises synchronized users and / or additional cloud created security groups.\n- the on-premises user accounts that are synchronized and are members of this cloud created security group, can be from the same domain or cross-domain, but they all must be from the same forest.\n- these groups are written back with the AD groups scope of&nbsp;universal. Your on-premises environment must support the universal group scope.\n- groups that are larger than 50,000 members aren't supported.\n- each direct child nested group counts as one member in the referencing group"
      },
      {
        "date": "2023-12-19T11:49:00.000Z",
        "voteCount": 1,
        "content": "B is WRONG: \nIF YOU CREATE THE UNIVERSAL GROUP IN ADDS THEN THE WRITEBACK OPTION IS IRRELEVANT. THE GROUP GETS SYNCED VIA AD CONNECT BUT WRITEBACK IS IRRELEVANT.\n\nIF YOU CREATE THE SECURITY GROUP IN AZURE IT WILL BE WRITTEN BACK TO ADDS AS A UNIVERSAL GROUP AT WHICH POINT YOU THE USER ACCTS IN ADDS WILL BE ADDED TO THAT GROUP BASED ON THE MAPPING TO THEIR COUNTERPARTS IN AZURE AD. KEEP IN MIND THAT WHEN A USER ACCT SYNCS FROM ON-PREM TO AZURE AD ONLY THE ACCT'S ATTRIBUTES SYNC TO A NEW SID COMPLETELY DIFFERENT THAN THAT OF ADDS, THEREFORE, THE MAPPING I AM ALLUDING TO."
      },
      {
        "date": "2023-09-06T09:23:00.000Z",
        "voteCount": 3,
        "content": "It does not state that groups are actually being synced from adds to azure ad, while it does say that group writeback is enabled. Since this a public preview feature this question is probably not scored."
      },
      {
        "date": "2023-07-27T00:55:00.000Z",
        "voteCount": 3,
        "content": "In my opinion it's A\n\nWhy not most voted B? We do have AAD Connect but not mentioned that groups are being synced from ADDS to AAD but we do have mentioned that group writeback is enabled. By choosing B we do not know if this group will be synced to AAD so we may not be able to use it to give access to share 2\n\nChoosing either A or C we are sure we will have group in both AAD and ADDS and that we will be able to add users from both. In this situation ASSIGNED seems better than DYNAMIC as we do not have any hints that only specific users should have access (it is only CAN CONTAIN users from ADDS)"
      },
      {
        "date": "2022-12-17T23:16:00.000Z",
        "voteCount": 2,
        "content": "B seems to be the best bet, though A might work as well."
      },
      {
        "date": "2022-11-05T20:35:00.000Z",
        "voteCount": 4,
        "content": "This feature is out in preview- all of these answers could be correct- depending on the question- as written- you can go with B- however, the Univeral group will go only back to one OU if you enable it this way--- seems problematic. furthermore you cannot put any domain local groups inside the univeral security group --- also if you go the old way and just have office 365 group- then you can likely do the same thing- but seems like less restrictions- IDK- but here is the guidance - https://learn.microsoft.com/en-us/azure/active-directory/hybrid/how-to-connect-group-writeback-v2"
      },
      {
        "date": "2022-09-07T07:41:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83173-exam-az-800-topic-5-question-20-discussion/",
    "body": "HOTSPOT -<br>You have a Group Policy Object (GPO) named GPO1 that contains user settings only.<br>You plan to apply GPO1 to a global security group named Group1.<br>You link GPO1 to the domain, and you remove all the permissions granted to the Authenticated Users group.<br>You need to configure permissions for GPOI to meet the following requirements:<br>✑ GPO1 must apply only to the users in Group1.<br>✑ The solution must use the principle of least privilege.<br>Which permissions should you grant to Group1 and the Domain Computers group? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0016800003.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0016900001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-29T09:31:00.000Z",
        "voteCount": 24,
        "content": "Group1 &gt; \"Apply group policy and Read\" |\nDomain Computers &gt; Read only\""
      },
      {
        "date": "2024-08-29T06:05:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/troubleshoot/windows-server/group-policy/cannot-apply-user-gpo-when-computer-objects-dont-have-read-permissions"
      },
      {
        "date": "2022-09-22T02:09:00.000Z",
        "voteCount": 5,
        "content": "suggested answer is wrong: Permissions for Group1 are correct, but for Domain Computers correct permissions are \"Read only\". When you choose \"Apply group policy only\" GPO will not be applied for users - I have checked it in my lab"
      },
      {
        "date": "2022-09-22T02:16:00.000Z",
        "voteCount": 11,
        "content": "I'm wrong! I should write:\nPermissions for Group1 should be \"Apply group policy and Read\" and for Domain Computers correct permissions are \"Read only\". When you choose \"Read only\"for Group1 GPO will not be applied for members of Group1. You shouldn't choose \"Apply group policy\" specific permission for Domain Computers group, because this GPO is not designed for this group, but this group have to have Read specific permission - I have checked it in my lab"
      },
      {
        "date": "2024-05-01T21:41:00.000Z",
        "voteCount": 1,
        "content": "To meet the requirements, you should configure permissions for GPO1 as follows:\n\nGrant Apply Group Policy Permission to Group1:\nGrant the Apply Group Policy permission to the Group1 security group. This permission allows the members of Group1 to apply the settings within GPO1.\nEnsure that no other permissions are granted to Group1 on the GPO.\nGrant Read Permission to Domain Computers:\nGrant the Read permission to the Domain Computers group. This permission allows the computers in the domain to read the GPO settings but not apply them.\nEnsure that no other permissions are granted to Domain Computers on the GPO."
      },
      {
        "date": "2024-01-09T19:09:00.000Z",
        "voteCount": 2,
        "content": "this is from Co-Pilot\nTherefore, to meet the requirements, you should grant the following permissions:\n\nGroup1: Apply Group Policy permission only.\nDomain Computers: Read and Apply Group Policy permissions 1."
      },
      {
        "date": "2023-09-22T08:11:00.000Z",
        "voteCount": 3,
        "content": "Answers are as follows:\nGroup1: Apply &amp; Read\nComputer Group: Read"
      },
      {
        "date": "2023-09-22T08:14:00.000Z",
        "voteCount": 1,
        "content": "Group policy requires each computer account to have permission to read GPO data from a domain controller for User Group Policy settings to be successfully applied."
      },
      {
        "date": "2023-08-01T10:20:00.000Z",
        "voteCount": 1,
        "content": "I believe the required permission for Domain Computer is \"Read Only\" and maybe the explanation is in this article: https://support.microsoft.com/en-us/topic/ms16-072-security-update-for-group-policy -june-14-2016-7570425d-d460-3003-b2ac-a464c874725d"
      },
      {
        "date": "2023-03-28T05:15:00.000Z",
        "voteCount": 2,
        "content": "https://www.grouppolicy.biz/2010/05/how-to-apply-a-group-policy-object-to-individual-users-or-computer/\n\nGroup 1 should be read and apply\nComputers read only since \"must apply only to the users in Group1\""
      },
      {
        "date": "2023-01-04T10:00:00.000Z",
        "voteCount": 4,
        "content": "Group 1 =&gt; apply and read \nDomain computers (imho better to use authenticated users) =&gt; read"
      },
      {
        "date": "2022-11-05T21:07:00.000Z",
        "voteCount": 3,
        "content": "I dont like this answer at all- this question says the policy must apply to the users not the computer- the computers would need to be ready and the group1 would need to be apply- that is what i am going with - https://www.freepdfdumps.com/Microsoft.AZ-800.v2022-08-15.q92.html?p=2#"
      },
      {
        "date": "2022-09-22T07:39:00.000Z",
        "voteCount": 3,
        "content": "This wasn't the case in the past, so on older / unpatched systems this might not be correct. But a change was made to improve security, \"Prior to the update, domain joined computers used the user's security context to make the connection and retrieve the policies. After the update is applied, domain joined computers will now retrieve all policies using the computer security context\"  https://techcommunity.microsoft.com/t5/core-infrastructure-and-security/who-broke-my-user-gpos/ba-p/258781"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83283-exam-az-800-topic-5-question-21-discussion/",
    "body": "HOTSPOT -<br>Your network contains a two-domain on-premises Active Directory Domain Services (AD DS) forest named contoso.com. The forest contains the domain controllers shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0017000001.png\" class=\"in-exam-image\"><br>All domain controllers are backed up by using Azure Backup.<br>You create an Active Directory site named Site3. Site1, Site2, and Site3 each has a dedicated site link to the Hub site.<br>In Site3, you install a new server named Server1.<br>You need to promote Server1 to an RODC in child.contoso.com by using the Install from Media (IFM) option. The solution must minimize network traffic.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0017100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0017200001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-23T02:35:00.000Z",
        "voteCount": 14,
        "content": "DC2 is correct DC\nhttps://social.technet.microsoft.com/wiki/contents/articles/8630.active-directory-step-by-step-guide-to-install-an-additional-domain-controller-using-ifm.aspx"
      },
      {
        "date": "2022-11-05T21:16:00.000Z",
        "voteCount": 11,
        "content": "DC2 and ntdsutil- https://www.windowstechno.com/deploy-domain-controller-using-install-from-media-ifm/"
      },
      {
        "date": "2024-05-29T10:13:00.000Z",
        "voteCount": 1,
        "content": "Valid 05/28/2024"
      },
      {
        "date": "2023-03-28T05:25:00.000Z",
        "voteCount": 4,
        "content": "\"promote Server1 to an RODC in child.contoso.com\"\n\nhttps://social.technet.microsoft.com/wiki/contents/articles/8630.active-directory-step-by-step-guide-to-install-an-additional-domain-controller-using-ifm.aspx\n\nTo create installation media for a read-only domain controller (RODC), you can run the ntdsutil ifm command on either a writable domain controller\n\nDC2 to create source and run ntdsutil"
      },
      {
        "date": "2023-01-06T16:23:00.000Z",
        "voteCount": 2,
        "content": "You create IFM by using Windows Azure Backup on DC2."
      },
      {
        "date": "2022-10-26T02:22:00.000Z",
        "voteCount": 4,
        "content": "DC2 not DC1"
      },
      {
        "date": "2022-10-25T22:24:00.000Z",
        "voteCount": 3,
        "content": "NTDSUTIL.exe is correct:\nhttps://social.technet.microsoft.com/wiki/contents/articles/8630.active-directory-step-by-step-guide-to-install-an-additional-domain-controller-using-ifm.aspx\n\"Windows Server 2008 and Windows Server 2008 R2 include an improved version of the Ntdsutil tool that you can use to create installation media for an additional domain controller. You can use Ntdsutil.exe to create installation media for additional domain controllers that you are creating in a domain. The IFM method uses the data in the installation media to install AD DS, which eliminates the need to replicate every object from a partner domain controller.\""
      },
      {
        "date": "2022-10-09T02:59:00.000Z",
        "voteCount": 5,
        "content": "First oart of the answer is DC2.\nAn excerpt from MS doc:\nThe media that you use to create additional domain controllers must be taken from a domain controller in the same domain as the domain of the new domain controller."
      },
      {
        "date": "2022-09-23T02:36:00.000Z",
        "voteCount": 2,
        "content": "The media that you use to create additional domain controllers must be taken from a domain controller in the same domain as the domain of the new domain controller."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/85592-exam-az-800-topic-5-question-22-discussion/",
    "body": "DRAG DROP -<br>You deploy a single-domain Active Directory Domain Services (AD DS) forest named contoso.com.<br>You deploy a server to the domain and configure the server to run a service.<br>You need to ensure that the service can use a group managed service account (gMSA) to authenticate.<br>Which three PowerShell cmdlets should you run in sequence? To answer, move the appropriate cmdlets from the list of cmdlets to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04225/0017300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0017300002.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-16T04:51:00.000Z",
        "voteCount": 13,
        "content": "Given answer is correct"
      },
      {
        "date": "2024-07-27T11:00:00.000Z",
        "voteCount": 1,
        "content": "HOw aout this ???\n\nSet-KdsConfiguration: This cmdlet configures the Key Distribution Service (KDS) root key, which is necessary for creating gMSAs.\nAdd-KdsRootKey: This cmdlet adds a root key to the KDS, which is required for generating passwords for gMSAs.\nNew-ADServiceAccount: This cmdlet creates the gMSA in Active Directory."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/85920-exam-az-800-topic-5-question-23-discussion/",
    "body": "HOTSPOT -<br>You have an on-premises DNS server named Server1 that runs Windows Server. Server1 hosts a DNS zone named fabnkam.com.<br>You have an Azure subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0017400001.png\" class=\"in-exam-image\"><br>You need to design a solution that will automatically resolve the names of any PaaS resources for which you configure private endpoints in Vnet1.<br>How should you configure the name resolution? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0017400002.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0017500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-19T08:45:00.000Z",
        "voteCount": 20,
        "content": "I think the correct answer is:\n-Configure VM1 to fordward request for the contoso.com zone to the Azure-provided DNS al 168.63.129.16\n-Configure fordwarding for the contodo.com zone to VM1\nThe public DNS zone don´t have nothing to do here.\n\nhttps://learn.microsoft.com/en-us/azure/private-link/private-endpoint-dns#on-premises-workloads-using-a-dns-forwarder"
      },
      {
        "date": "2022-10-29T09:34:00.000Z",
        "voteCount": 16,
        "content": "- Configure VM1 to fordward request for the contoso.com zone to the Azure-provided DNS at 168.63.129.16\n- Configure fordwarding for the contodo.com zone to VM1"
      },
      {
        "date": "2023-12-19T12:37:00.000Z",
        "voteCount": 2,
        "content": "SINCE PRIVATE ENDPOINTS HAVE BEEN CREATED FOR THE PAAS RESOURCES THE PUBLIC DNS RECORDS IN THE PUBLIC DNS ZONE ARE NO LONGER USEFUL. THE ON-PREM USERS MUST NOW ACCESS THEM INTERNALLY VIA SOME TYPE OF PRIVATE CONNECTION LIKE VPN OR EXPRESS ROUTE. IN ORDER FOR THEM TO DO SO THEY MUST FORWARD THEIR REQUESTS TO A THE VM IN AZURE THAT HAS DNS INSTALLED WHICH IN TURN WILL ANSWER THEIR QUERIES N FORWARD THEM OUT TO AZURE DNS. CURRENTLY THIS IS THE ONLY WAY TO FORWARD FROM ON-PREM TO AZURE DNS. IT CANNOT BE DONE DIRECTLY. AN AZURE VM WITH DNS INSTALLED MUST BE AVAILABLE TO FORWARD TO AZURE DNS AFTER OM-PREM HAS FORWARDED TO IT.\n-ON ON-PREM FORWARD TO VM1\n&gt;IN AZURE FORWARD TO AZURE DNS WHICH WILL BE HOSTING THE NEWLY ADDED RECORDS FOR THE NEWLY ADDED PRIVATE ENDPOINTS"
      },
      {
        "date": "2023-10-28T09:32:00.000Z",
        "voteCount": 1,
        "content": "On Vnet1:\n\nConfigure VM1 to forward requests for the contoso.com zone to the public DNS zone: This choice ensures that VM1 in Vnet1 forwards DNS requests for the contoso.com zone to the public DNS zone. Since the public DNS zone contains the DNS records of all the platform as a service (PaaS) resources, it allows VM1 to resolve names for these PaaS resources.\nOn the on-premises network:\n\nConfigure forwarding for the contoso.com zone to VM1: This choice sets up forwarding for the contoso.com zone on your on-premises DNS server (Server1) to VM1 in Vnet1. It means that DNS requests originating from your on-premises network for names in the contoso.com zone will be forwarded to VM1 for resolution. VM1 can then use its DNS forwarding configuration to resolve names for PaaS resources using the public DNS zone.\nThese selections ensure that both Vnet1 and the on-premises network can resolve names for PaaS resources with private endpoints by forwarding DNS requests to the appropriate DNS servers that can resolve those names."
      },
      {
        "date": "2023-12-19T12:33:00.000Z",
        "voteCount": 1,
        "content": "PRIVATE ENDPOINT REMOVES ACCESSIBILITY TO THE PAAS RESOURCES VIA PUBLIC IPs SO THEREFORE PUBLIC DNS RECORDS ARE USEFUL."
      },
      {
        "date": "2023-07-12T09:42:00.000Z",
        "voteCount": 3,
        "content": "For on-premises workloads to resolve the FQDN of a private endpoint, use a DNS forwarder to resolve the Azure service public DNS zone in Azure. A DNS forwarder is a Virtual Machine running on the Virtual Network linked to the Private DNS Zone that can proxy DNS queries coming from other Virtual Networks or from on-premises. This is required as the query must be originated from the Virtual Network to Azure DNS. A few options for DNS proxies are: Windows running DNS services, Linux running DNS services, Azure Firewall.\nThe following scenario is for an on-premises network that has a DNS forwarder in Azure. This forwarder resolves DNS queries via a server-level forwarder to the Azure provided DNS 168.63.129.16."
      },
      {
        "date": "2023-05-03T20:57:00.000Z",
        "voteCount": 2,
        "content": "I am not sure what this answer is, but I know that MS tells you not to set up any network configuration inside VM. Everything should be done from Azure Portal (setup static IP on VNIC) and DNS should be set up on VNET. MS always test for best practices."
      },
      {
        "date": "2023-03-29T02:06:00.000Z",
        "voteCount": 4,
        "content": "https://learn.microsoft.com/en-us/azure/private-link/media/private-endpoint-dns/on-premises-using-azure-dns.png\n\nVnet1 to have VM1 forward request for the contoso.com zone to the Azure-provided DNS at 168.63.129.16\n\nOn prem network Configure forwarding for the contoso.com zone to VM1"
      },
      {
        "date": "2023-01-31T19:07:00.000Z",
        "voteCount": 2,
        "content": "Because it specifies \"Private Endpoints in VNet1\", it is assumed that it only needs to resolve resources within that VNet and would use the VNet's private DNS zone.  \nConfigure VM1 to forward contoso.com requests to Azure provided DNS, then configure forwarding to VM1 on-prem."
      },
      {
        "date": "2023-01-28T12:47:00.000Z",
        "voteCount": 4,
        "content": "The answer is correct :\n\nOn vnet1, configure VM1 to forward requests for the contoso.com zone to the public DNS zone.\nOn the on-premises network, configure forwarding for the contoso.com zone to VM1.\n\nThis solution uses the public DNS zone to resolve the names of PaaS resources and the forwarding on the on-premises network to forward the requests to the VM1 which is connected to the Vnet1 and has the DNS server role installed, this will ensure that the names of any PaaS resources with private endpoints in Vnet1 are automatically resolved."
      },
      {
        "date": "2023-01-06T16:27:00.000Z",
        "voteCount": 2,
        "content": "Configure on-prem DNS to forward constoso.com to Azure VM (DNS). Configure Azure VM (DNS) to forward to Azure public DNS forwarders."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80810-exam-az-800-topic-5-question-24-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>Your network contains an Active Directory Domain Services (AD DS) domain named contoso.com.<br>You need to identify which server is the PDC emulator for the domain.<br>Solution: From Active Directory Users and Computers, you right-click contoso.com in the console tree, and then select Operations Master.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 19,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 4,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-22T07:55:00.000Z",
        "voteCount": 9,
        "content": "This seems like Yes should be the correct answer, although technically you would also need to click on the PDC tab which is not mentioned, but that seems obvious."
      },
      {
        "date": "2022-11-03T09:57:00.000Z",
        "voteCount": 6,
        "content": "Well this means the answer is no..."
      },
      {
        "date": "2023-01-06T13:08:00.000Z",
        "voteCount": 7,
        "content": "no is correct answer! \nfirst tab after right click and operation master is RID!  there is no word about swich to PDC tab in question! so NO"
      },
      {
        "date": "2024-01-07T15:34:00.000Z",
        "voteCount": 1,
        "content": "This question is as opposed to the question where they want you to check AD domains and Trusts. so while technically they left out a step, for the purpose of the question this is all they want- use AD users and computers instead of AD domains and trusts."
      },
      {
        "date": "2023-12-02T15:10:00.000Z",
        "voteCount": 1,
        "content": "By the literal writing of the question, the answer is B because you still have to click the PDC tab. If I was marked wrong on this question as written, I'd contest it."
      },
      {
        "date": "2023-10-09T08:02:00.000Z",
        "voteCount": 2,
        "content": "dumb question Microsoft. do we need to click the PDC tab or not? It should be a Yes but technically the question is missing 'click the PDC' tab"
      },
      {
        "date": "2023-09-22T08:26:00.000Z",
        "voteCount": 2,
        "content": "Shou be YESS"
      },
      {
        "date": "2023-07-06T00:15:00.000Z",
        "voteCount": 1,
        "content": "Still needs to click on the PDC tab"
      },
      {
        "date": "2023-03-19T01:15:00.000Z",
        "voteCount": 2,
        "content": "https://www.google.com/url?sa=i&amp;url=https%3A%2F%2Fwww.dtonias.com%2Fdetermine-dc-fsmo-role-holders%2F&amp;psig=AOvVaw1It3sCJF9o8nNkQEwyJIu6&amp;ust=1679303633510000&amp;source=images&amp;cd=vfe&amp;ved=0CA0QjRxqFwoTCPjl083T5_0CFQAAAAAdAAAAABAD\n\nYou still need to click on the PDC tab so answer is No to me"
      },
      {
        "date": "2023-01-02T21:35:00.000Z",
        "voteCount": 2,
        "content": "Should be YES"
      },
      {
        "date": "2022-11-05T22:11:00.000Z",
        "voteCount": 2,
        "content": "Yea change it to A"
      },
      {
        "date": "2022-11-02T06:30:00.000Z",
        "voteCount": 2,
        "content": "As xrisimix said; Operation Masters and then PDC tab"
      },
      {
        "date": "2022-09-26T08:37:00.000Z",
        "voteCount": 2,
        "content": "To find the PDC emulator, the infrastructure master, and the RID master, follow these steps:\nGo to Start | Administrative Tools | Active Directory Users And Computers.\nRight-click the domain, and select Operations Master.\nhttps://www.techrepublic.com/article/tech-tip-find-out-which-servers-hold-which-fsmo-roles-in-a-ws2k3-environment/"
      },
      {
        "date": "2022-09-22T06:45:00.000Z",
        "voteCount": 2,
        "content": "Is YES, i"
      },
      {
        "date": "2022-09-14T04:37:00.000Z",
        "voteCount": 3,
        "content": "Should be Yes. Operation Masters and then PDC tab"
      },
      {
        "date": "2022-09-13T22:35:00.000Z",
        "voteCount": 5,
        "content": "Answer Yes."
      },
      {
        "date": "2022-09-06T23:03:00.000Z",
        "voteCount": 4,
        "content": "This answer should be YES. Because we can check PDC emulator from AD Users and Computers, right click contoso.com in the console tree and then select operations master."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81923-exam-az-800-topic-5-question-25-discussion/",
    "body": "Your network contains an Active Directory Domain Services (AD DS) forest. The forest contains three domains. Each domain contains 10 domain controllers.<br>You plan to store a DNS zone in a custom Active Directory partition.<br>You need to create the Active Directory partition for the zone. The partition must replicate to only four of the domain controllers.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tdnscmd.exe\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Sites and Services",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-DnsServer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDNS Manager"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 28,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-06-09T21:17:00.000Z",
        "voteCount": 6,
        "content": "you need to use dnscmd /createdirectorypartition for this"
      },
      {
        "date": "2023-07-29T03:08:00.000Z",
        "voteCount": 3,
        "content": "correct A --&gt; dnscmd.exe or ntdsutil.exe"
      },
      {
        "date": "2023-05-26T21:55:00.000Z",
        "voteCount": 1,
        "content": "you can use both ntdsutil and dnscmd to create a custom Active Directory partition to host a DNS zone. Here's how you can use each tool:\n\nUsing ntdsutil:\nOpen Command Prompt or PowerShell with administrative privileges.\nType \"ntdsutil\" and press Enter to open the ntdsutil command-line utility.\nWithin ntdsutil, enter the following commands sequentially:\nactivate instance ntds\ncreate nc dc=example,dc=com (Replace \"example,dc=com\" with your desired naming context.)\nquit\nquit\nThis will create a custom Active Directory partition with the specified naming context.\nUsing dnscmd:\nOpen Command Prompt or PowerShell with administrative privileges.\nType \"dnscmd /CreateDirectoryPartition example.com\" (Replace \"example.com\" with your desired partition name) and press Enter.\nThis will create a custom Active Directory partition with the specified name."
      },
      {
        "date": "2023-05-12T00:16:00.000Z",
        "voteCount": 2,
        "content": "A - dnscmd.exe or ntdsutil.exe"
      },
      {
        "date": "2023-02-17T12:50:00.000Z",
        "voteCount": 4,
        "content": "https://learn.microsoft.com/en-us/troubleshoot/windows-server/networking/create-apply-custom-application-directory-partition"
      },
      {
        "date": "2023-01-24T13:06:00.000Z",
        "voteCount": 3,
        "content": "should be A"
      },
      {
        "date": "2022-12-15T16:36:00.000Z",
        "voteCount": 3,
        "content": "A - dnscmd.exe or ntdsutil.exe"
      },
      {
        "date": "2022-11-05T22:13:00.000Z",
        "voteCount": 4,
        "content": "A A A is da answer"
      },
      {
        "date": "2022-10-29T09:36:00.000Z",
        "voteCount": 3,
        "content": "Should be A\nhttps://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/create-apply-custom-application-directory-partition"
      },
      {
        "date": "2022-09-22T07:57:00.000Z",
        "voteCount": 2,
        "content": "I don't think this is possible in DNS Manager, this would require dnscmd.exe or ntdsutil.edxe (which is not included in the possible answers)"
      },
      {
        "date": "2022-09-16T10:47:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/create-apply-custom-application-directory-partition"
      },
      {
        "date": "2022-09-14T04:39:00.000Z",
        "voteCount": 2,
        "content": "Should be A \ndnscmd DC-1 /createdirectorypartition CustomDNSPartition.contoso.com"
      },
      {
        "date": "2022-09-12T21:27:00.000Z",
        "voteCount": 3,
        "content": "Answer is A. https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/create-apply-custom-application-directory-partition"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/87048-exam-az-800-topic-5-question-26-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>Your network contains an Active Directory Domain Services (AD DS) forest. The forest contains three Active Directory sites named Site1, Site2, and Site3. Each site contains two domain controllers. The sites are connected by using DEFAULTIPSITELINK.<br>You open a new branch office that contains only client computers.<br>You need to ensure that the client computers in the new office are primarily authenticated by the domain controllers in Site1.<br>Solution: You create a new subnet object that is associated to Site1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 12,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-11-05T22:19:00.000Z",
        "voteCount": 6,
        "content": "this is correct https://social.technet.microsoft.com/Forums/en-US/bd02927e-4f1e-4928-9f77-d08aace9212d/how-to-design-and-devide-multiple-subnet-for-active-directory-sites?forum=winserverDS"
      },
      {
        "date": "2023-01-28T12:48:00.000Z",
        "voteCount": 5,
        "content": "Yes, creating a new subnet object that is associated with Site1 would meet the goal of ensuring that client computers in the new office are primarily authenticated by the domain controllers in Site1. When a client computer requests authentication, Active Directory will use the subnet-to-site association to determine which site the client computer is in, and will then direct the authentication request to a domain controller in that site. By associating the new subnet with Site1, client computers in the new office will be directed to authenticate with domain controllers in Site1."
      },
      {
        "date": "2023-09-22T08:27:00.000Z",
        "voteCount": 2,
        "content": "YESSSSS"
      },
      {
        "date": "2023-03-21T01:20:00.000Z",
        "voteCount": 5,
        "content": "https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/cc754697(v=ws.11)?redirectedfrom=MSDN\n\nBy associating a site with one or more subnets, you assign a set of IP addresses to the site\n\nDNS uses the site name to locate a domain controller in that site (or in the next closest site to the client). DNS then provides the IP address of the domain controller to the client for the purpose of connecting to the domain controller. For this reason, it is important to ensure that the IP address that you assign to a domain controller maps to a subnet that is associated with the site of the respective server object\n\nAnswer is Yes"
      },
      {
        "date": "2023-12-20T09:22:00.000Z",
        "voteCount": 1,
        "content": "100% accurate"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81924-exam-az-800-topic-5-question-27-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory Domain Services (AD DS) domain named contoso.com.<br>The network contains the servers shown in the following table.<br><img src=\"/assets/media/exam-media/04225/0017700001.png\" class=\"in-exam-image\"><br>You plan to implement IP Address Management (IPAM).<br>You need to use the Group Policy based provisioning method for managed servers. The solution must support server discovery.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04225/0017800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04225/0017900001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-15T12:08:00.000Z",
        "voteCount": 11,
        "content": "Note\n\nIPAM must be installed on a domain member computer. You cannot install IPAM on a domain controller. If IPAM is installed on the same server with DHCP, then DHCP server discovery will be disabled.\n\nhttps://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj878312(v=ws.11)"
      },
      {
        "date": "2023-01-19T10:52:00.000Z",
        "voteCount": 4,
        "content": "Active Directory: An IPAM server must be joined to a domain as a domain member server. Installation in a workgroup environment is not supported, and installation on a domain controller is not supported.\n\nhttps://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj878312(v=ws.11)#hardware-and-software-requirements"
      },
      {
        "date": "2023-01-30T04:40:00.000Z",
        "voteCount": 3,
        "content": "Answer 1: Server1 (server with DHCP role installed for DHCP server discovery)\nAnswer 2: DC1 and Server1 DC1(ADDS) + Server1(DHCP role)"
      },
      {
        "date": "2024-07-28T09:39:00.000Z",
        "voteCount": 1,
        "content": "Wrong, See Jawad's link"
      },
      {
        "date": "2022-09-23T04:08:00.000Z",
        "voteCount": 6,
        "content": "IPAM must be installed on a domain member computer. You cannot install IPAM on a domain controller. If IPAM is installed on the same server with DHCP, then DHCP server discovery will be disabled."
      },
      {
        "date": "2022-09-28T05:51:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj878312(v=ws.11)"
      },
      {
        "date": "2023-03-29T03:15:00.000Z",
        "voteCount": 4,
        "content": "https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj878312(v=ws.11)\n\nIPAM must be installed on a domain member computer. You cannot install IPAM on a domain controller.\nIPAM installation on a DHCP server is not recommended. The IPAM server discovery feature will not be able to discover DHCP roles if DHCP Server is installed on the same computer.\nIPAM supports only domain joined DHCP, DNS and NPS servers in a single Active Directory forest\n\nAnswer is right"
      },
      {
        "date": "2022-09-12T21:30:00.000Z",
        "voteCount": 4,
        "content": "Answer is correct. You cant install IPAM on a DC. https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh831353(v=ws.11)#ipam-deployment-options"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/95682-exam-az-800-topic-5-question-28-discussion/",
    "body": "HOTSPOT<br> -<br><br>Your company has a main office and 10 branch offices that are connected by using WAN links. The network contains an Active Directory domain.<br><br>All users have laptops and regularly travel between offices.<br><br>You plan to implement BranchCache in the branch offices.<br><br>In each branch office, you install a server that runs Windows Server and the BranchCache feature. You register the servers in Active Directory.<br><br>You need to configure the laptops to use the local BranchCache server automatically. The solution must minimize administrative effort.<br><br>Which two Group Policy settings should you configure? To answer, select the settings in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-800/image164.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image165.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-31T19:26:00.000Z",
        "voteCount": 13,
        "content": "\"Turn on BrancheCache\" and \"Enable Automatic Hosted Cache Discovery...\"\nFrom the \"Enable Automatic Hosted Cache Discovery...\" GPO Help:\nIf you enable this policy setting in addition to the \"Turn on BranchCache\" policy setting, BranchCache clients attempt to discover hosted cache servers in the local branch office."
      },
      {
        "date": "2023-02-04T12:20:00.000Z",
        "voteCount": 9,
        "content": "Set the \"Turn on BranchCache\" policy to \"Enabled\". This will enable the BranchCache feature on the laptops.\n\nSet the \"Configure BranchCache\" policy to \"Hosted Cache mode\". This will configure the laptops to use the local BranchCache server automatically, without requiring any manual configuration."
      },
      {
        "date": "2024-05-29T10:14:00.000Z",
        "voteCount": 1,
        "content": "Valid 05/28/2024"
      },
      {
        "date": "2024-04-09T10:51:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/windows-server/networking/branchcache/deploy/use-group-policy-to-configure-domain-member-client-computers\n\n7- In the Turn on BranchCache dialog box, click Enabled, and then click OK.\n\n11- In the Enable Automatic Hosted Cache Discovery by Service Connection Point dialog box, click Enabled, and then click OK.\n\nWhen you enable both the Set BranchCache Distributed Cache mode and the Enable Automatic Hosted Cache Discovery by Service Connection Point policy settings, client computers operate in BranchCache distributed cache mode unless they find a hosted cache server in the branch office, at which point they operate in hosted cache mode."
      },
      {
        "date": "2023-10-28T15:12:00.000Z",
        "voteCount": 7,
        "content": "--&gt; Turn on BranchCache &lt;--CORRECT\n--&gt; Enable Automatic Hosted Cache Discovery by Service Connection ... &lt;-- CORRECT\n\nWRONG --&gt;Set BranchCache Hosted Cache mode&lt;--- THIS IS A SETTING FOR THE SERVER"
      },
      {
        "date": "2023-09-17T09:47:00.000Z",
        "voteCount": 3,
        "content": "In the scenario you've described, the main goal is to configure client laptops to use the local BranchCache server automatically when they are in a branch office. This is achieved primarily through the \"Enable Automatic Hosted Cache Discovery by Service connection point\" setting, which allows laptops to find and use the local cache server without manual configuration.\n\nSo, to minimize administrative effort and ensure that laptops in each branch office automatically utilize the local BranchCache server, it's recommended to configure:\n\n1. Turn on BranchCache (YES)\n2. Enable Automatic Hosted Cache Discovery by Service connection point (YES)\nThese settings will help client laptops discover and use the local cache server in their respective branch offices efficiently."
      },
      {
        "date": "2023-06-14T06:32:00.000Z",
        "voteCount": 7,
        "content": "\"Turn on BranchCache\" \n\"Enable Automatic Hosted Cache Discovery by Service Connection Point\"\nWhy: question ask “The solution must minimize administrative effort”. If you use “Set BrancheCache Hosted mode” would work but you have to define in every site de name of the cache server."
      },
      {
        "date": "2023-07-08T22:34:00.000Z",
        "voteCount": 1,
        "content": "think so\nservers are registered in AD; register as a Service Connection Point in AD DS I wonder"
      },
      {
        "date": "2023-04-14T11:35:00.000Z",
        "voteCount": 4,
        "content": "The provided answer is wrong.  \"Turn on BranchCache\" &amp; \"Enable Automatic Hosted Cache Discovery by Service Connection Point\" is the correct answer."
      },
      {
        "date": "2023-03-29T03:26:00.000Z",
        "voteCount": 2,
        "content": "Turn on branchcache is a must\n\nhttps://learn.microsoft.com/en-us/windows-server/networking/media/branchcache/bc_modes.jpg\n\n\"In each branch office, you install a server that runs Windows Server and the BranchCache feature\"\n\nOther answer is to set hosted cache mode"
      },
      {
        "date": "2023-03-08T10:44:00.000Z",
        "voteCount": 1,
        "content": "I think that is turn on branchcache and setup branchcache hosted mode"
      },
      {
        "date": "2023-02-13T02:08:00.000Z",
        "voteCount": 3,
        "content": "I agree with chadamantium. \"Turn on BranchCache\", \"Enable Automatic...\". \nI can't see the option that empee1977 is talking about. \"Configure BranchCache\". \nAnswer would be automatic while \"Set BranchCache Hosted Cache Mode\" and \"Configure Hosted Cache Servers\" require you configure the server name. \nhttps://learn.microsoft.com/en-us/windows-server/networking/branchcache/deploy/use-group-policy-to-configure-domain-member-client-computers#bkmk_gp\nWhen you enable both the Set BranchCache Distributed Cache mode and the Enable Automatic Hosted Cache Discovery by Service Connection Point policy settings, client computers operate in BranchCache distributed cache mode unless they find a hosted cache server in the branch office, at which point they operate in hosted cache mode."
      },
      {
        "date": "2023-02-13T02:10:00.000Z",
        "voteCount": 1,
        "content": "This policy setting specifies whether client computers should attempt the automatic configuration of hosted cache mode by searching for hosted cache servers."
      },
      {
        "date": "2023-01-17T03:08:00.000Z",
        "voteCount": 5,
        "content": "Since in every branch office we have server, the hosted cache mode is better. https://learn.microsoft.com/en-us/windows-server/networking/branchcache/branchcache#BKMK_2"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/101487-exam-az-800-topic-5-question-29-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Azure subscription that contains the storage accounts shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image178.png\"><br><br>In the East US Azure region, you create a storage sync service named Sync1.<br><br>You need to create a sync group in Sync1.<br><br>Which storage accounts can you use, and what can you specify as the cloud endpoints. To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-800/image179.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image180.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-29T03:33:00.000Z",
        "voteCount": 6,
        "content": "The storage account must be in the same tenant, any subscription, and the same region as the Storage Sync Service. The storage account must be a general purpose v2 or premium file share storage account type.\n\nAnswer is correct"
      },
      {
        "date": "2024-05-29T10:14:00.000Z",
        "voteCount": 2,
        "content": "Valid 05/28/2024"
      },
      {
        "date": "2023-03-04T01:20:00.000Z",
        "voteCount": 4,
        "content": "Correct."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/112169-exam-az-800-topic-5-question-30-discussion/",
    "body": "You have a server named Server1 that runs Windows Server and contains two drives named C and D. Server1 hosts multiple file shares.<br><br>You enable Data Deduplication on drive D and select the General purpose file server workload.<br><br>You need to minimize the space consumed by files that were recently modified or deleted.<br><br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-DedupVolume cmdlet and configure the Scrubbing job.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-DedupSchedule cmdlet and configure a GarbageCollection job.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-DedupVolume cmdlet and configure the InputOutputScale settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-DedupSchedule cmdlet and configure the Optimization job."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 6,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-12T12:07:00.000Z",
        "voteCount": 5,
        "content": "Garbage Collection \tThe Garbage Collection job reclaims disk space by removing unnecessary chunks that are no longer being referenced by files that have been recently modified or deleted."
      },
      {
        "date": "2023-11-11T12:37:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      },
      {
        "date": "2023-06-14T06:42:00.000Z",
        "voteCount": 4,
        "content": "Seems correct: https://learn.microsoft.com/en-us/windows-server/storage/data-deduplication/understand#job-info"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/116078-exam-az-800-topic-5-question-31-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a server named Server1 that runs Windows Server and contains three volumes named C, D, and E.<br><br>Files are stored on Server1 as shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image207.png\"><br><br>For volume D, Data Deduplication is enabled and set to General purpose file server.<br><br>You perform the following actions:<br><br>•\tMove File1 to volume D.<br>•\tCopy File2 to volume D and name the copy File4.<br>•\tMove File3 to volume E.<br><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-800/image208.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image209.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-26T06:48:00.000Z",
        "voteCount": 11,
        "content": "shouldn't it be Y N N?\nfile4 is less than 32kb \nhttps://learn.microsoft.com/en-us/previous-versions/windows/desktop/dedup/about-data-deduplication"
      },
      {
        "date": "2023-11-11T12:47:00.000Z",
        "voteCount": 2,
        "content": "I guess you are right:\n\"Deduplication skips over the following files:\nSystem-state files\nEncrypted files\nFiles with extended attributes\nFiles whose size is less than 32 KB\nReparse points (that are not data deduplication reparse points)\""
      },
      {
        "date": "2023-11-11T12:49:00.000Z",
        "voteCount": 2,
        "content": "And one more thing :)\n\"When new files are added to the volume, they are not optimized right away. Only files that have not been changed for a minimum amount of time are optimized. (This minimum amount of time is set by user-configurable policy.)\""
      },
      {
        "date": "2024-05-28T11:39:00.000Z",
        "voteCount": 3,
        "content": "- File1 is deduplicated after the deduplication job runs: Yes (its size is greater than 32 KB and it is located on volume D with deduplication enabled).\n\n- File3 is deduplicated after the deduplication job runs: No (it was moved to volume E where deduplication is not enabled).\n\n- File4 is deduplicated after the deduplication job runs: No (its size is less than 32 KB and it will be skipped by deduplication)."
      },
      {
        "date": "2024-05-10T07:01:00.000Z",
        "voteCount": 2,
        "content": "No\nNo\nYes"
      },
      {
        "date": "2024-04-27T23:12:00.000Z",
        "voteCount": 1,
        "content": "answers : Y N Y"
      },
      {
        "date": "2023-10-09T08:19:00.000Z",
        "voteCount": 1,
        "content": "should be: Y N Y"
      },
      {
        "date": "2023-09-22T08:50:00.000Z",
        "voteCount": 3,
        "content": "I thinks the answer is correct.\nFile1 &amp; file4 are on the deduplication drive, after the job runs, it should be deduplicated.\nFile3 hower is on another drive, so no deduplications, only garbage collection"
      },
      {
        "date": "2023-09-22T09:09:00.000Z",
        "voteCount": 1,
        "content": "tested this, my answers are correct."
      },
      {
        "date": "2023-09-06T19:03:00.000Z",
        "voteCount": 2,
        "content": "N N Y\n\nreplicated in LAB"
      },
      {
        "date": "2023-11-11T12:53:00.000Z",
        "voteCount": 1,
        "content": "What do you mean? File3 is no loner on D drive. How can it be deduplicated?"
      },
      {
        "date": "2023-07-22T07:20:00.000Z",
        "voteCount": 3,
        "content": "NNY No No Yes"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/112418-exam-az-800-topic-5-question-32-discussion/",
    "body": "You have an Active Directory domain that contains a file server named Server1. Server1 runs Windows Server and includes the file shares shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image210.png\"><br><br>When users login to the network they receive the following network drive mappings.<br><br>•\tH: maps to \\\\server1\\users\\%UserName%<br>•\tG: maps to \\\\server1\\%Department%<br><br>You need to limit the amount of space consumed by user’s on Server1. The solution must meet the following requirements:<br><br>•\tPrevent users using more than 5GB of space on their H: drive<br>•\tPrevent Accounts department users from using more than 10GB of space on the G: drive<br>•\tPrevent Marketing department users from using more than 15GB of space on the G: drive<br>•\tPrevent Customer Service department users from using more than 2GB of space on the G: drive<br>•\tMinimize administrative effort<br><br>What should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile Server Resource Manager (FSRM) quotas\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStorage tiering",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNTFS Disk quotas",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGroup Policy Preferences"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-28T15:54:00.000Z",
        "voteCount": 2,
        "content": "To limit the amount of space consumed by users on Server1 with the specified requirements, you should use File Server Resource Manager (FSRM) quotas. FSRM allows you to set space limits on shared resources and provides more granular control over storage consumption. In this case, you can set FSRM quotas for the H: and G: drives based on the user's department and the specific space limits you need to enforce.\n\nSo, the correct answer is:\n\nA. File Server Resource Manager (FSRM) quotas"
      },
      {
        "date": "2023-06-16T21:19:00.000Z",
        "voteCount": 1,
        "content": "Correct: https://learn.microsoft.com/en-us/windows-server/storage/fsrm/quota-management"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/112419-exam-az-800-topic-5-question-33-discussion/",
    "body": "You have an Azure subscription that contains the storage accounts shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image211.png\"><br><br>In the West US Azure region, you create a storage sync service named SyncA.<br><br>You plan to create a sync group named GroupA.<br><br>What is the maximum number of cloud endpoints you can use with GroupA?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t1\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t2",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t3",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t4"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 15,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-07-28T10:57:00.000Z",
        "voteCount": 2,
        "content": "Always 1 Cloud endpoint per Sync group"
      },
      {
        "date": "2024-05-01T22:15:00.000Z",
        "voteCount": 3,
        "content": "A is correct"
      },
      {
        "date": "2023-12-20T09:54:00.000Z",
        "voteCount": 4,
        "content": "THE QUESTION IS NOT ASKING HOW MANY OF THESE CLOUD ENDPOINTS CAN ALLOCATED TO THE GROUP BASED ON REGION, IN THIS CASE THERE ARE TWO IN WEST US BUT RATHER, HOW MANY CLOUD ENDPOINTS CAN A SYNC GROUP HOST. THE ANSWER IS 1. IT COULD BE ANYONE OF THE TWO IN WEST US BUT THE GROUP CAN ONLY CONTAIN 1 WHICH IS WAHT THE QUESTION ALLUDES TO."
      },
      {
        "date": "2024-08-02T12:18:00.000Z",
        "voteCount": 1,
        "content": "THANK YOU :)"
      },
      {
        "date": "2023-07-19T05:13:00.000Z",
        "voteCount": 3,
        "content": "one cloud end point per sync group"
      },
      {
        "date": "2023-07-13T07:50:00.000Z",
        "voteCount": 4,
        "content": "A is correct, one cloud endpoint per group. Although there can be multiple groups per Sync Service"
      },
      {
        "date": "2023-06-27T03:23:00.000Z",
        "voteCount": 4,
        "content": "given answer is wrong --&gt; ONLY 1 cloud endpoint --&gt; A"
      },
      {
        "date": "2023-06-16T21:25:00.000Z",
        "voteCount": 3,
        "content": "I think it's A. Max one cloud end point per sync group. https://learn.microsoft.com/en-us/azure/storage/files/storage-files-scale-targets?toc=%2Fazure%2Fstorage%2Ffilesync%2Ftoc.json#azure-file-sync-scale-targets"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/123001-exam-az-800-topic-5-question-34-discussion/",
    "body": "DRAG DROP<br> -<br><br>You have an on-premises server named Server1 that runs Windows Server. Server1 contains a file share named Share1.<br><br>You have an Azure subscription.<br><br>You perform the following actions:<br><br>•\tDeploy Azure File Sync.<br>•\tInstall the Azure File Sync agent on Server1.<br>•\tRegister Server1 with Azure File Sync.<br><br>You need to ensure that you can add Share1 as an Azure File Sync server endpoint.<br><br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/az-800/image231.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image232.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-09T08:25:00.000Z",
        "voteCount": 5,
        "content": "Ans correct, create:\nAz Storage Acc\nAz File Share\nSync Group"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/125793-exam-az-800-topic-5-question-35-discussion/",
    "body": "Case Study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Overview -<br><br><br>Company Information -<br>ADatum Corporation is a manufacturing company that has a main office in Seattle and two branch offices in Los Angeles and Montreal.<br><br><br>Fabrikam Partnership -<br><br>ADatum recently partnered with 2 company named Fabrikam, Inc.<br><br>Fabrikam is a manufacturing company that has a main office in Boston and a branch office in Orlando.<br><br>Both companies intend to collaborate on several joint projects.<br><br><br>Existing Environment -<br><br><br>ADatum AD DS Environment -<br><br>The on-premises network of ADatum contains an Active Directory Domain Services (AD DS) forest named adatum.com.<br><br>The forest contains two domains named adatum.com and east.adatum.com and the domain controllers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image236.png\"><br><br><br>Fabrikam AD DS Environment -<br><br>The on-premises network of Fabrikam contains an AD DS forest named fabrikam.com.<br><br>The forest contains two domains named fabrikam.com and south.fabrikam.com.<br><br>The fabrikam.com domain contains an organizational unit (OU) named Marketing.<br><br><br>Server Infrastructure -<br><br>The adatum.com domain contains the servers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image237.png\"><br><br>HyperV1 contains the virtual machines shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image238.png\"><br><br>All the virtual machines on HyperV1 have only the default management tools installed.<br><br>SSPace1 contains the Storage Spaces virtual disks shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image239.png\"><br><br><br>Azure Resources -<br><br>ADatum has an Azure subscription that contains an Azure AD tenant. Azure AD Connect is configured to sync the adatum.com forest with Azure AD.<br><br>The subscription contains the virtual networks shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image240.png\"><br><br>The subscription contains the Azure Private DNS zones shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image241.png\"><br><br>The subscription contains the virtual machines shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image242.png\"><br><br>All the servers are in a workgroup.<br><br>The subscription contains a storage account named storage1 that has a file share named share1.<br><br><br>Requirements -<br><br><br>Planned Changes -<br><br>ADatum plans to implement the following changes:<br><br>•\tSync Data1 to share1.<br>•\tConfigure an Azure runbook named Task1.<br>•\tEnable Azure AD users to sign in to Server1.<br>•\tCreate an Azure DNS Private Resolver that has the following configurations:<br>•\tName: Private1<br>•\tRegion: West US<br>•\tVirtual network: VNet1<br>•\tInbound endpoint: SubnetB<br>•\tEnable users in the adatum.com domain to access the resources in the south.fabrikam.com domain.<br><br><br>Technical Requirements -<br><br>ADatum identifies the following technical requirements:<br><br>•\tThe data on SSPace1 must be available always.<br>•\tDC2 must become the schema master if DC1 fails.<br>•\tVM3 must be configured to enable per-folder quotas.<br>•\tTrusts must allow access to only the required resources.<br>•\tThe users in the Marketing OU must have access to storage1.<br>•\tAzure Automanage must be used on all supported Azure virtual machines.<br>•\tA direct SSH session must be used to manage all the supported virtual machines on HyperV1.<br><br><br>You need to ensure that VM3 meets the technical requirements.<br><br>What should you install first?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnhanced Storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe iSNS Server service",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile Server Resource Manager (FSRM)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWindows Standards-Based Storage Management"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-11-11T13:04:00.000Z",
        "voteCount": 2,
        "content": "\"VM3 must be configured to enable per-folder quotas\"\nFSRM only"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 36,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121555-exam-az-800-topic-5-question-36-discussion/",
    "body": "HOTSPOT<br> -<br><br><br>Case Study<br> -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study<br> -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Overview<br> -<br><br><br>Company Information<br> -<br>ADatum Corporation is a manufacturing company that has a main office in Seattle and two branch offices in Los Angeles and Montreal.<br><br><br>Fabrikam Partnership<br> -<br><br>ADatum recently partnered with 2 company named Fabrikam, Inc.<br><br>Fabrikam is a manufacturing company that has a main office in Boston and a branch office in Orlando.<br><br>Both companies intend to collaborate on several joint projects.<br><br><br>Existing Environment<br> -<br><br><br>ADatum AD DS Environment<br> -<br><br>The on-premises network of ADatum contains an Active Directory Domain Services (AD DS) forest named adatum.com.<br><br>The forest contains two domains named adatum.com and east.adatum.com and the domain controllers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image236.png\"><br><br><br>Fabrikam AD DS Environment<br> -<br><br>The on-premises network of Fabrikam contains an AD DS forest named fabrikam.com.<br><br>The forest contains two domains named fabrikam.com and south.fabrikam.com.<br><br>The fabrikam.com domain contains an organizational unit (OU) named Marketing.<br><br><br>Server Infrastructure<br> -<br><br>The adatum.com domain contains the servers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image237.png\"><br><br>HyperV1 contains the virtual machines shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image238.png\"><br><br>All the virtual machines on HyperV1 have only the default management tools installed.<br><br>SSPace1 contains the Storage Spaces virtual disks shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image239.png\"><br><br><br>Azure Resources<br> -<br><br>ADatum has an Azure subscription that contains an Azure AD tenant. Azure AD Connect is configured to sync the adatum.com forest with Azure AD.<br><br>The subscription contains the virtual networks shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image240.png\"><br><br>The subscription contains the Azure Private DNS zones shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image241.png\"><br><br>The subscription contains the virtual machines shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image242.png\"><br><br>All the servers are in a workgroup.<br><br>The subscription contains a storage account named storage1 that has a file share named share1.<br><br><br>Requirements<br> -<br><br><br>Planned Changes<br> -<br><br>ADatum plans to implement the following changes:<br><br>•\tSync Data1 to share1.<br>•\tConfigure an Azure runbook named Task1.<br>•\tEnable Azure AD users to sign in to Server1.<br>•\tCreate an Azure DNS Private Resolver that has the following configurations:<br>•\tName: Private1<br>•\tRegion: West US<br>•\tVirtual network: VNet1<br>•\tInbound endpoint: SubnetB<br>•\tEnable users in the adatum.com domain to access the resources in the south.fabrikam.com domain.<br><br><br>Technical Requirements<br> -<br><br>ADatum identifies the following technical requirements:<br><br>•\tThe data on SSPace1 must be available always.<br>•\tDC2 must become the schema master if DC1 fails.<br>•\tVM3 must be configured to enable per-folder quotas.<br>•\tTrusts must allow access to only the required resources.<br>•\tThe users in the Marketing OU must have access to storage1.<br>•\tAzure Automanage must be used on all supported Azure virtual machines.<br>•\tA direct SSH session must be used to manage all the supported virtual machines on HyperV1.<br><br><br>You need to ensure that data availability on SSPace1 meets the technical requirements.<br><br>What is the maximum number of physical disks that can fail on each disk? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-800/image253.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image254.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-29T08:40:00.000Z",
        "voteCount": 9,
        "content": "For disk1: max 2 disks\nFor disk2: max 1 disk"
      },
      {
        "date": "2024-07-10T03:23:00.000Z",
        "voteCount": 2,
        "content": "Three-way mirror (8 disks): Maximum 2 disks can fail.\nParity (12 disks): Maximum 1 disk can fail.\nThese configurations ensure that data availability meets the technical requirements for fault tolerance and resilience in Storage Spaces Direct (S2D)."
      },
      {
        "date": "2024-03-24T10:05:00.000Z",
        "voteCount": 2,
        "content": "By default, when you specify Mirror, Storage Spaces creates a two-way mirror. When you specify Parity, Storage Spaces creates a single-parity space.\n\nTo create a three-way mirror space, specify 3 for the NumberofDataCopies parameter or 2 for the PhysicalDiskRedundancy parameter.\n\nTo create a dual-parity space, specify 2 for the PhysicalDiskRedundancy parameter and Fixed provisioning for the ProvisioningType parameter.\nhttps://learn.microsoft.com/en-us/powershell/module/storage/new-storagetier?view=windowsserver2022-ps"
      },
      {
        "date": "2023-11-11T13:32:00.000Z",
        "voteCount": 2,
        "content": "Unfortunately it is not that obvious:\nhttps://learn.microsoft.com/en-us/answers/questions/1166170/two-way-mirror-and-three-way-mirror"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 37,
    "url": "https://www.examtopics.com/discussions/microsoft/view/124890-exam-az-800-topic-5-question-37-discussion/",
    "body": "DRAG DROP<br> -<br><br><br>Case Study<br> -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study<br> -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Overview<br> -<br><br><br>Company Information<br> -<br>ADatum Corporation is a manufacturing company that has a main office in Seattle and two branch offices in Los Angeles and Montreal.<br><br><br>Fabrikam Partnership<br> -<br><br>ADatum recently partnered with 2 company named Fabrikam, Inc.<br><br>Fabrikam is a manufacturing company that has a main office in Boston and a branch office in Orlando.<br><br>Both companies intend to collaborate on several joint projects.<br><br><br>Existing Environment<br> -<br><br><br>ADatum AD DS Environment<br> -<br><br>The on-premises network of ADatum contains an Active Directory Domain Services (AD DS) forest named adatum.com.<br><br>The forest contains two domains named adatum.com and east.adatum.com and the domain controllers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image236.png\"><br><br><br>Fabrikam AD DS Environment<br> -<br><br>The on-premises network of Fabrikam contains an AD DS forest named fabrikam.com.<br><br>The forest contains two domains named fabrikam.com and south.fabrikam.com.<br><br>The fabrikam.com domain contains an organizational unit (OU) named Marketing.<br><br><br>Server Infrastructure<br> -<br><br>The adatum.com domain contains the servers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image237.png\"><br><br>HyperV1 contains the virtual machines shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image238.png\"><br><br>All the virtual machines on HyperV1 have only the default management tools installed.<br><br>SSPace1 contains the Storage Spaces virtual disks shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image239.png\"><br><br><br>Azure Resources<br> -<br><br>ADatum has an Azure subscription that contains an Azure AD tenant. Azure AD Connect is configured to sync the adatum.com forest with Azure AD.<br><br>The subscription contains the virtual networks shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image240.png\"><br><br>The subscription contains the Azure Private DNS zones shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image241.png\"><br><br>The subscription contains the virtual machines shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image242.png\"><br><br>All the servers are in a workgroup.<br><br>The subscription contains a storage account named storage1 that has a file share named share1.<br><br><br>Requirements<br> -<br><br><br>Planned Changes<br> -<br><br>ADatum plans to implement the following changes:<br><br>•\tSync Data1 to share1.<br>•\tConfigure an Azure runbook named Task1.<br>•\tEnable Azure AD users to sign in to Server1.<br>•\tCreate an Azure DNS Private Resolver that has the following configurations:<br>•\tName: Private1<br>•\tRegion: West US<br>•\tVirtual network: VNet1<br>•\tInbound endpoint: SubnetB<br>•\tEnable users in the adatum.com domain to access the resources in the south.fabrikam.com domain.<br><br><br>Technical Requirements<br> -<br><br>ADatum identifies the following technical requirements:<br><br>•\tThe data on SSPace1 must be available always.<br>•\tDC2 must become the schema master if DC1 fails.<br>•\tVM3 must be configured to enable per-folder quotas.<br>•\tTrusts must allow access to only the required resources.<br>•\tThe users in the Marketing OU must have access to storage1.<br>•\tAzure Automanage must be used on all supported Azure virtual machines.<br>•\tA direct SSH session must be used to manage all the supported virtual machines on HyperV1.<br><br><br>You need to implement the planned change for Data1.<br><br>Which actions should you perform in sequence? To answer, drag the appropriate actions to the correct order. Each action may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-800/image255.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image256.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-15T07:40:00.000Z",
        "voteCount": 6,
        "content": "1.Deploy the Storage Sync Service\n2.Install the Azure File Sync agent\n3.Create a sync group and a cloud endpoint\n4.Create a server endpoint\nhttps://learn.microsoft.com/en-us/azure/storage/file-sync/file-sync-deployment-guide?tabs=azure-portal%2Cproactive-portal"
      },
      {
        "date": "2024-07-27T00:25:00.000Z",
        "voteCount": 3,
        "content": "1.Deploy the Storage Sync Service\n2.Install the Azure File Sync agent\n3.Create a sync group and a cloud endpoint\n4.Create a server endpoint\nThis question is valid\nExam date - 27-07-2024"
      },
      {
        "date": "2023-10-29T08:48:00.000Z",
        "voteCount": 1,
        "content": "1. Deploy the Azure Storage Sync service.\nYou need to deploy the Azure Storage Sync service in your Azure subscription to create a sync group.\n\n2. Install and register the Azure File Sync agent.\nInstall the Azure File Sync agent on each of your on-premises servers that you want to sync with Azure.\n\n3. Add a server endpoint.\nAfter the Azure File Sync agent is installed, you configure server endpoints for the folders you want to sync on your on-premises servers.\n\n4.Create a sync group.\nOnce you've configured server endpoints, you can group them into a sync group. Sync groups define the sync topology.\n\nanswer 3 and 4 are in the wrong order. Server endpoint first then a sync group."
      },
      {
        "date": "2023-11-02T09:03:00.000Z",
        "voteCount": 2,
        "content": "im Wrong the order is correct as Chermosomorilla noted"
      },
      {
        "date": "2023-10-31T00:16:00.000Z",
        "voteCount": 6,
        "content": "The answer provided is correct. A Server Endpoint cannot be added until the Sync Group exists, so the order must be:\n \nDeploy Azure Storage Sync Service, \nInstall and register the Azure File Sync agent\nCreate Sync Group\nAdd Server Endpoint\n\nhttps://learn.microsoft.com/en-us/azure/storage/file-sync/file-sync-deployment-guide?tabs=azure-portal%2Cproactive-portal"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 38,
    "url": "https://www.examtopics.com/discussions/microsoft/view/124891-exam-az-800-topic-5-question-38-discussion/",
    "body": "You have a server named Server1 that runs Windows Server. The disks on Server1 are configured as shown in the following exhibit.<br><br><img src=\"https://img.examtopics.com/az-800/image257.png\"><br><br>You need to convert volume E to ReFS. The solution must meet the following requirements:<br><br>•\tThe data on volume E needs to be retained.<br>•\tMinimize administrative effort.<br><br>What should you do first?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBack up the data on volume E.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTake Disk 2 offline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConvert Disk 2 to a dynamic disk.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun convert.exe."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 6,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-29T09:21:00.000Z",
        "voteCount": 6,
        "content": "Answer is Correct.\n\nYou cannot directly convert a basic exFAT disk to ReFS (Resilient File System) because they are different file systems. Converting file systems usually requires reformatting the disk, which would result in data loss. However, you can copy the data from the exFAT disk to another location, reformat the disk as ReFS, and then copy the data back."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 39,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121557-exam-az-800-topic-5-question-39-discussion/",
    "body": "DRAG DROP<br> -<br><br>You have a disaggregated cluster deployment. The deployment contains a scale-out file server (SOFS) cluster that runs Windows Server and a compute cluster that has the Hyper-V role enabled.<br><br>You need to implement Storage Quality of Service (QoS). The solution must ensure that you can control the bandwidth usage between the SOFS cluster and the Hyper-V cluster.<br><br>Which cmdlet should you run on each cluster? To answer, drag the appropriate cmdlets to the correct clusters. Each cmdlet may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-800/image258.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image259.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-07-29T16:53:00.000Z",
        "voteCount": 2,
        "content": "Correct\n\nOn the SOFS cluster:\nNew-StorageQosPolicy: This cmdlet is used to create a new Storage QoS policy that defines the minimum and maximum IOPS (Input/Output Operations Per Second) for storage.\n\nOn the Hyper-V cluster:\nSet-VMHardDiskDrive: This cmdlet is used to configure the QoS policy for a virtual hard disk drive attached to a virtual machine.\n\nYou do not need to use the Set-VMSan cmdlet in this scenario, as it is used for configuring virtual SANs (Storage Area Networks) and is not directly related to Storage QoS."
      },
      {
        "date": "2024-05-29T10:26:00.000Z",
        "voteCount": 1,
        "content": "Valid 05/28/2024"
      },
      {
        "date": "2023-09-27T08:00:00.000Z",
        "voteCount": 2,
        "content": "answer is correct\nhttps://learn.microsoft.com/en-us/windows-server/storage/storage-qos/storage-qos-overview#create-and-apply-a-dedicated-policy"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 40,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126447-exam-az-800-topic-5-question-40-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Active Directory Domain Services (AD DS) domain that contains the member servers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image271.png\"><br><br>Server3 contains a data disk named Disk1 that has Data Deduplication installed. Disk1 contains the files shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image272.png\"><br><br>Server3 fails.<br><br>You need to recover the files on Disk1.<br><br>Which files can you recover if you attach Disk1 to Server1, and which files can you recover if you attach Disk1 to Server2? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-800/image273.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image274.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-25T03:21:00.000Z",
        "voteCount": 10,
        "content": "minimum for dedup is size 32kb, File1.txt can be recovered on server2, because is not deduplicated"
      },
      {
        "date": "2024-07-07T21:48:00.000Z",
        "voteCount": 9,
        "content": "The file extension is not specified randomly, but with a purpose, namely to highlight the type of files.\nFile3.sys implies from the start that it is a system file.\n\nServer1:\n - File1.txt, File2.doc, File3.sys, and File4.bmp\nServer2:\n - File1.txt and File3.sys only\n\nFile1.txt : is not deduplicated (size less than 32kb)\nFile3.sys :  is not deduplicated  (system file)\n\nData deduplication is supported only on the following:\n - Windows Server operating systems beginning with Windows Server 2012\n - NTFS data volumes\n - Cluster shared volume file system (CSVFS) supporting virtual desktop infrastructure (VDI) workloads beginning with Windows Server 2012 R2\n\nDeduplication skips over the following files:\n - System-state files\n - Encrypted files\n - Files with extended attributes\n - Files whose size is less than 32 KB\n - Reparse points (that are not data deduplication reparse points)\nhttps://learn.microsoft.com/en-us/previous-versions/windows/desktop/dedup/about-data-deduplication"
      },
      {
        "date": "2024-04-11T03:41:00.000Z",
        "voteCount": 1,
        "content": "We need more answers to this"
      },
      {
        "date": "2024-02-25T03:09:00.000Z",
        "voteCount": 5,
        "content": "Deduplication skips over system state files. The .sys extension is usually used for operating system files. So if they're trying to imply that File3.sys is a system file, that would be ignored by deduplication, so the answer would be Server 2: File1.txt and File3.sys?"
      },
      {
        "date": "2024-05-23T05:52:00.000Z",
        "voteCount": 3,
        "content": "Correct. option 1, all files (because of the already installed dedup feature) and option 2, file1 and file3."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 41,
    "url": "https://www.examtopics.com/discussions/microsoft/view/131308-exam-az-800-topic-5-question-41-discussion/",
    "body": "You have a server named Server1 that runs Windows Server and contains a file share named Share1.<br><br>You need to prevent users from storing MP4 files in Share1. The solution must ensure that the users can store other types of files in the share.<br><br>What should you configure on Server1?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile Management Tasks",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNTFS Quotas",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNTFS permissions",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tfile screens\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-07-29T18:37:00.000Z",
        "voteCount": 1,
        "content": "File screens (D). \nFile screens allow you to create rules that block specific file types from being saved in a particular folder or share."
      },
      {
        "date": "2024-01-16T07:34:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer, File Screen"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 42,
    "url": "https://www.examtopics.com/discussions/microsoft/view/138657-exam-az-800-topic-5-question-43-discussion/",
    "body": "SIMULATION<br> -<br><br>You need to make the shares named Marketing and Sales from SRV1 available on the network by using the following UNC paths:<br><br>•\t\\\\contoso.com\\documents\\marketing<br>•\t\\\\contoso.com\\documents\\sales<br><br>To complete this task, sign in to the required computer or computers.",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image284.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-08-15T12:58:00.000Z",
        "voteCount": 1,
        "content": "create a DFS namespace named \"documents\" and within the documents namespace create 2 folders: marketing and sales; then Marketing has to be pointed at \\\\SRV1\\marketing, Sales has to point at \\\\SRV1\\sales; this way users will access \"\\\\contoso.com\\documents\\marketing\" and \"\\\\contoso.com\\documents\\sales\". This is a good way to expose all the fileshares located in different servers from 1 single location"
      },
      {
        "date": "2024-06-07T13:04:00.000Z",
        "voteCount": 4,
        "content": "It is related to DFS Namespaces:\nhttps://learn.microsoft.com/en-us/windows-server/storage/dfs-namespaces/dfs-overview"
      },
      {
        "date": "2024-06-16T20:51:00.000Z",
        "voteCount": 1,
        "content": "Agreed, the correct process is to create a DFS namespace called documents, and add the shares to it."
      },
      {
        "date": "2024-04-13T20:23:00.000Z",
        "voteCount": 1,
        "content": "Answer is incorrect.\n\nThe question states there are already two shares from SRV1, therefore there is no need to re-create the file shares again.\n\nWhat you want to do is to make sure when client browse to \\\\contoso\\document\\%sharename% they end up accessing the respective shares from SRV1.  This involves making changes to domain controllers.  Reason being is that when client try to access \\\\contoso.com, they will end up accessing domain controllers because the domain name contoso.com points to all domain controllers of that domain.\n\nEffectively you will need to create a share named \"document\" on domain controller, within the share create two shortcuts that points to \\\\SRV1\\%sharename% respectively."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 43,
    "url": "https://www.examtopics.com/discussions/microsoft/view/141108-exam-az-800-topic-5-question-44-discussion/",
    "body": "Your network contains an Active Directory Domain Services (AD DS) domain named contoso.com. The domain contains the servers shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-800/image306.png\"><br><br>You need to create a Distributed File System (DFS) namespace that will contain the following:<br><br>•\tA domain-based namespace named \\\\contoso.com\\Public<br>•\tA folder named Finance<br><br>Which servers can you configure as folder targets for the Finance folder?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServer3 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServer2 and Server3 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServer1 and Server3 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServer1, Server2, and Server3 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServer1, Server2, Server3, and Server4\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "E",
    "answerDescription": "",
    "votes": [
      {
        "answer": "E",
        "count": 8,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-08-02T12:39:00.000Z",
        "voteCount": 2,
        "content": "Server1 and Server3 both have the DFS Namespaces role, allowing them to be configured as folder targets.\nServer2 only has the DFS Replication role and cannot be configured as a folder target.\nServer4 has no roles assigned, hence cannot be a folder target."
      },
      {
        "date": "2024-06-15T10:40:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/windows-server/storage/dfs-replication/dfsr-overview\nInstall DFS Replication on all servers that you plan to use as members of a replication group."
      },
      {
        "date": "2024-05-29T18:37:00.000Z",
        "voteCount": 1,
        "content": "All servers can be a target as long as they have the shared folder"
      },
      {
        "date": "2024-05-28T04:57:00.000Z",
        "voteCount": 3,
        "content": "All servers can be a target as long as they have the shared folder"
      },
      {
        "date": "2024-05-24T13:43:00.000Z",
        "voteCount": 1,
        "content": "Correct. Server 1 and 3."
      },
      {
        "date": "2024-05-23T06:01:00.000Z",
        "voteCount": 4,
        "content": "All servers can be a target as long as they have the shared folder.. regardless of Role.. So E"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 44,
    "url": "https://www.examtopics.com/discussions/microsoft/view/145813-exam-az-800-topic-5-question-45-discussion/",
    "body": "SIMULATION<br> -<br><br>You need to ensure that the Azure file share named share1 can sync to on-premises servers.<br><br>The required source files are located in a folder named \\\\dc1.contoso.com\\install.<br><br>You do NOT need to specify the on-premises servers at this time.<br><br>To complete this task, sign in the required computer or computers.",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image326.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-08-18T23:35:00.000Z",
        "voteCount": 2,
        "content": "Had this on my exam recently.\n\nNote: It says on-premises servers. You have 3 machines that you can connect so best to be sure to do those for all machines."
      },
      {
        "date": "2024-08-15T13:00:00.000Z",
        "voteCount": 1,
        "content": "You need to install the Azure File Sync Agent I guess"
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 45,
    "url": "https://www.examtopics.com/discussions/microsoft/view/145982-exam-az-800-topic-5-question-46-discussion/",
    "body": "SIMULATION<br> -<br><br>You need to register SRV1 to sync Azure file shares. The registration must use the 12345678 Storage Sync Service.<br><br>The required source files are located in a folder named \\\\dc1.contoso.com\\install.<br><br>You do NOT need to configure file share synchronization at this time, and you do NOT need to update the agent.",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-800/image327.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-08-18T23:37:00.000Z",
        "voteCount": 2,
        "content": "Had this on my exam recently.\n\nLogin to SRV1 &gt; enter File Explorer bar the location &gt; Select  File Sync Folder &gt; Install the exe file &gt; Open the program &gt; Select the subscription, resource group, location etc. &gt; Done!\n\nYou can double check by opening the webbrowser and login to the Azure URL and go to the designated page to see."
      }
    ],
    "examNameCode": "az-800",
    "topicNumber": "5"
  }
]