[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121294-exam-70-411-topic-1-question-1-discussion/",
    "body": "DRAG DROP -<br>Your network contains an Active Directory forest named contoso.com. The forest contains a Network Policy Server (NPS) server named NPS1 and a VPN server named VPN1. VPN1 forwards all authentication requests to NPS1.<br>A partner company has an Active Directory forest named adatum.com. The adatum.com forest contains an NPS server named NPS2.<br>You plan to grant users from adatum.com VPN access to your network.<br>You need to authenticate the users from adatum.com on VPN1.<br>What should you create on each NPS server?<br>To answer, drag the appropriate objects to the correct NPS servers. Each object may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02139/0000200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0000300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-09-23T23:31:00.000Z",
        "voteCount": 1,
        "content": "a network Policy"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21311-exam-70-411-topic-1-question-4-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named contoso.com. The domain contains two servers named Server1 and Server2. Server1 has the Network<br>Policy Server server role installed. Server2 has the DHCP Server server role installed. Both servers run Windows Server 2012 R2.<br>You are configuring Network Access Protection (NAP) to use DHCP enforcement.<br>You configure a DHCP scope as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02139/0000800001.jpg\" class=\"in-exam-image\"><br>You need to ensure that non-compliant NAP clients receive different DHCP options than compliant NAP clients.<br>What should you configure on each server? To answer, select the appropriate options for each server in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02139/0000900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0001000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Health Policies -<br><br>Server Options -<br>* Health policy on the NAP server.<br>* The DHCP server must be NAP enabled.<br>Note: With DHCP enforcement, a computer must be compliant to obtain an unlimited access IP address configuration from a DHCP server. For noncompliant computers, network access is limited by an IP address configuration that allows access only to the restricted network. DHCP enforcement enforces health policy requirements every time a DHCP client attempts to lease or renew an IP address configuration. DHCP enforcement also actively monitors the health status of the<br>NAP client and renews the IPv4 address configuration for access only to the restricted network if the client becomes noncompliant.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-25T10:32:00.000Z",
        "voteCount": 4,
        "content": "NAP is not anymore in the 70-411 objectives, you can check it at microsoft website. You should remove Questions of NAP here to avoid confusion to the future testers."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21312-exam-70-411-topic-1-question-10-discussion/",
    "body": "DRAG DROP -<br>Your network contains an Active Directory domain named contoso.com. All domain controllers run Windows Server 2012 R2.<br>The domain contains an organizational unit (OU) named OU1. OU1 contains an OU named OU2. OU2 contains a user named user1.<br>User1 is the member of a group named Group1. Group1 is in the Users container.<br>You create five Group Policy objects (GPO). The GPOs are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02139/0002300001.png\" class=\"in-exam-image\"><br>The Authenticated Users group is assigned the default permissions to all of the GPOs.<br>There are no site-level GPOs.<br>You need to identify which three GPOs will be applied to User1 and in which order the GPOs will be applied to User1.<br>Which three GPOs should you identify in sequence? To answer, move the appropriate three GPOs from the list of GPOs to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02139/0002400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0002500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: GPO2 -<br><br>Box 2: GPO4 -<br><br>Box 3: GPO5 -<br>Note:<br>* First at the domain level (GPO2), then at the highest OU level GPO4, and finally at the OU level containing user1 GPO5.<br>Incorrect:<br>* Read and Apply group policy are both needed in order for the user or computer to receive and process the policy<br>Not GPO1: Group1 has Deny Apply Group Policy permissions on GPO1.<br>Not GPO3: Group1 has Deny Read permissions on GPO3.<br>GPO2 and GPO4 are disabled.<br>* When a Group Policy Object (GPO) is enforced it means the settings in the Group Policy Object on an Organization Unit (which is shown as a folder within the<br>Active Directory Users and Computers MMC) cannot be overruled by a Group Policy Object (GPO) which is link enabled on an Organizational Unit below the<br>Organizational Unit with the enforced Group Policy Object (GPO).<br>* Group Policy settings are processed in the following order:<br>1 Local Group Policy object<br>2 Site.<br>3 Domain<br>4 Organizational units<br>GPOs that are linked to the organizational unit that is highest in the Active Directory hierarchy are processed first, then GPOs that are linked to its child organizational unit, and so on. Finally, the GPOs that are linked to the organizational unit that contains the user or computer are processed.",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-07T14:44:00.000Z",
        "voteCount": 1,
        "content": "from https://www.briefmenow.org/microsoft/which-three-gpos-should-you-identify-in-sequence-2/\n\n\nGPO1 and GPO3 are out of the equation due to the additional permissions for Group1:\n-GPO1 – Group1 has Deny apply group policy permission\n-GPO3 – Group1 has Deny Read permission\n\nOrder of Group Policy application:\nLocal\nSite\nDomain\nOU\n\nBased on the above:\nGPO2 – Will apply first due to it being linked to the Domain contoso.com\nGPO4 – Will apply next due to it being linked to OU1\nGPO5 – Will apply last due to OU2 being a Sub-OU of OU1"
      },
      {
        "date": "2020-08-07T14:03:00.000Z",
        "voteCount": 1,
        "content": "Policy starts from the top down.  2 -4-5"
      },
      {
        "date": "2020-08-03T22:45:00.000Z",
        "voteCount": 1,
        "content": "1, 3 &amp; 5"
      },
      {
        "date": "2020-05-25T10:34:00.000Z",
        "voteCount": 1,
        "content": "so whats the real answer? there a solution then says incorrect"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14237-exam-70-411-topic-1-question-13-discussion/",
    "body": "Your network contains two Active Directory forests named contoso.com and dev.contoso.com. The contoso.com forest contains a domain controller named DC1.<br>The dev.contoso.com forest contains a domain controller named DC2. Each domain contains an organizational unit (OU) named OU1.<br>Dev.contoso.com has a Group Policy object (GPO) named GPO1. GPO1 contains 200 settings, including several settings that have network paths. GPO1 is linked to OU1.<br>You need to copy GPO1 from dev.contoso.com to contoso.com.<br>What should you do first on DC2?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Group Policy Management console, right-click GPO1 and select Copy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the mtedit.exe command and specify the /Domaintcontoso.com /DC: DC 1 parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Save-NetGpocmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Backup-Gpocmdlet."
    ],
    "answer": "A",
    "answerDescription": "<img src=\"/assets/media/exam-media/02139/0002900001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02139/0003000001.png\" class=\"in-exam-image\"><br>To copy a Group Policy object:<br>In the GPMC console tree, right-click the GPO that you want to copy, and then click Copy.<br>To create a copy of the GPO in the same domain as the source GPO, right-click Group Policy objects, click Paste, specify permissions for the new GPO in the<br>Copy GPO box, and then click OK.<br>For copy operations to another domain, you may need to specify a migration table.<br>The Migration Table Editor (MTE) is provided with Group Policy Management Console (GPMC) to facilitate the editing of migration tables. Migration tables are used for copying or importing Group Policy objects (GPOs) from one domain to another, in cases where the GPOs include domain-specific information that must be updated during copy or import.<br>Source WS2008R2: Backup the existing GPOs from the GPMC, you need to ensure that the \"Group Policy Objects\" container is selected for the \"Backup Up All\" option to be available.<br>Copy a Group Policy Object with the Group Policy Management Console (GPMC)<br>You can copy a Group Policy object (GPO) either by using the drag-and-drop method or right-click method.<br>Applies To: Windows 8, Windows Server 2008 R2, Windows Server 2012<br>References:<br>http://technet.microsoft.com/en-us/library/cc785343<br>(v=WS.10).aspx<br>http://technet.microsoft.com/en-us/library/cc733107.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-18T04:27:00.000Z",
        "voteCount": 1,
        "content": "D Is correct. Copy function is to copy gpo and paste in same forest or domain in a different container"
      },
      {
        "date": "2020-08-11T22:04:00.000Z",
        "voteCount": 1,
        "content": "D, it is.."
      },
      {
        "date": "2020-05-25T10:35:00.000Z",
        "voteCount": 1,
        "content": "D is the correct answer, you cant do COPY with different forest"
      },
      {
        "date": "2020-02-15T19:24:00.000Z",
        "voteCount": 1,
        "content": "B is also correct, I have my exam next week so not sure which one is the most right answer.\n\nhttps://technet.microsoft.com/en-us/library/cc754682(v=ws.11).aspx (“When transferring the GPO to a new domain or forest, it may not always be desirable, or even possible, to use the same settings. You can use a migration table to reference users, groups, computers, and UNC paths in the source GPO to new values in the destination GPO.”)\nJust open an elevated command prompt and type: mtedit /domain:contoso.com /dc:dc1 (put your domain and DC)\nThen, after Migration Table Editor opens, go to Tools&gt;Populate from GPO/Backup (choose a GPO with UNC Path/Share to see the result)."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/751-exam-70-411-topic-1-question-23-discussion/",
    "body": "HOTSPOT -<br>You have a server named Server4 that runs Windows Server 2012 R2. Server4 has the Windows Deployment Services server role installed.<br>Server4 is configured as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02139/0005000001.jpg\" class=\"in-exam-image\"><br>To answer, complete each statement according to the information presented in the exhibit. Each correct selection is worth one point.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0005100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-05-25T14:49:00.000Z",
        "voteCount": 7,
        "content": "Answers\n1) BootImage1, BootImage2, and BootImage3\n2) BootImage2"
      },
      {
        "date": "2020-08-11T22:12:00.000Z",
        "voteCount": 1,
        "content": "1) BootImage1, BootImage2, and BootImage3\n2) BootImage2 only"
      },
      {
        "date": "2020-06-14T02:41:00.000Z",
        "voteCount": 3,
        "content": "https://www.briefmenow.org/microsoft/hot-area-232/"
      },
      {
        "date": "2020-12-07T19:22:00.000Z",
        "voteCount": 1,
        "content": "Be careful! In the comments they suggest the 2nd question may also be changed"
      },
      {
        "date": "2020-05-25T10:37:00.000Z",
        "voteCount": 1,
        "content": "ah, its under the solution but where's the answer?"
      },
      {
        "date": "2019-03-28T08:38:00.000Z",
        "voteCount": 1,
        "content": "Hi! What is the answer for this question please? Thanks!"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21313-exam-70-411-topic-1-question-25-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a member server named Server1. Server1 runs Windows Server<br>2012 R2 and has the Hyper-V server role installed.<br>Server1 hosts 10 virtual machines. A virtual machine named VM1 runs Windows Server 2012 R2 and hosts a processor-intensive application named App1.<br>Users report that App1 responds more slowly than expected.<br>You need to monitor the processor usage on VM1 to identify whether changes must be made to the hardware settings of VM1.<br>Which performance object should you monitor on Server1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProcessor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHyper-V Hypervisor Virtual Processor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHyper-V Hypervisor Logical Processor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHyper-V Hypervisor Root Virtual Processor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProcess"
    ],
    "answer": "C",
    "answerDescription": "In the simplest way of thinking the virtual processor time is cycled across the available logical processors in a round-robin type of fashion. Thus all the processing power gets used over time, and technically nothing ever sits idle.<br>To accurately measure the processor utilization of a guest operating system, use the \"\\Hyper-V Hypervisor Logical Processor (Total)\\% Total Run Time\" performance monitor counter on the Hyper-V host operating system.",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-03T23:07:00.000Z",
        "voteCount": 1,
        "content": "Yes, Virtual Processor it is.."
      },
      {
        "date": "2020-05-25T10:38:00.000Z",
        "voteCount": 2,
        "content": "i think its the virtual one"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/39170-exam-70-411-topic-1-question-29-discussion/",
    "body": "You have a server named Server1 that runs Windows Server 2012 R2.<br>An administrator creates a quota as shown in the Quota exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02139/0006000001.jpg\" class=\"in-exam-image\"><br>You run the dir command as shown in the Dir exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02139/0006000002.jpg\" class=\"in-exam-image\"><br>You need to ensure that D:\\Folder1 can only consume 100 MB of disk space.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom File Server Resource Manager, create a new quota.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom File Server Resource Manager, edit the existing quota.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Services console, set the Startup Type of the Optimize drives service to Automatic.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of drive D, enable quota management."
    ],
    "answer": "A",
    "answerDescription": "1. In Quota Management, click the Quota Templates node.<br>2. In the Results pane, select the template on which you will base your new quota.<br>3. Right-click the template and click Create Quota from Template (or select Create Quota from Template from the Actions pane). This opens the Create Quota dialog box with the summary properties of the quota template displayed.<br>4. Under Quota path, type or browse to the folder that the quota will apply to.<br>5. Click the Create quota on path option. Note that the quota properties will apply to the entire folder.<br>Note: To create an auto apply quota, click the Auto apply template and create quotas on existing and new subfolders option. For more information about auto apply quotas, see Create an Auto Apply Quota.<br>6. Under Drive properties from this quota template, the template you used in step 2 to create your new quota is preselected (or you can select another template from the list). Note that the template's properties are displayed under Summary of quota properties.<br>7. Click Create.<br>Create a new Quota on path, without using the auto apply template and create quota on existing and new subfolders.<br><img src=\"/assets/media/exam-media/02139/0006200001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02139/0006300001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02139/0006400001.jpg\" class=\"in-exam-image\"><br>Reference: http://technet.microsoft.com/en-us/library/cc755603(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-07T19:38:00.000Z",
        "voteCount": 1,
        "content": "Great explanation here https://www.briefmenow.org/microsoft/you-need-to-ensure-that-dfolder1-can-only-consume-100-mb-of-disk-space-2/"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/38517-exam-70-411-topic-1-question-35-discussion/",
    "body": "DRAG DROP -<br>You are a network administrator of an Active Directory domain named contoso.com.<br>You have a server named Server1 that runs Windows Server 2012 R2. Server1 has the Web Server (IIS) server role installed.<br>Server1 will host a web site at URL https: //secure.contoso.com. The application pool identity account of the web site will be set to a domain user account named<br>AppPool1.<br>You need to identify the setspn.exe command that you must run to configure the appropriate Service Principal Name (SPN) for the web site.<br>What should you run?<br>To answer, drag the appropriate objects to the correct location. Each object may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02139/0008000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0008100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note:<br>&gt;<br>Adds the specified SPN for the computer, after verifying that no duplicates exist.<br><br>Usage: setspn s SPN accountname -<br>For example, to register SPN \"http/daserver\" for computer \"daserver1\": setspn -S http/daserver daserver1 http://technet.microsoft.com/en-us/library/cc731241(v=ws.10).aspx<br>Attn: with Windows 2008 option is -a but with Windows 2012 it started to show -s<br><br>Definition of an SPN -<br>An SPN is the name by which a client uniquely identifies an instance of a service. If you install multiple instances of a service on computers throughout a forest, each service instance must have its own SPN. A particular service instance can have multiple SPNs if there are multiple names that clients might use for authentication. For example, an SPN always includes the name of the host computer on which the service instance is running. Therefore, a service instance might register an SPN for each name or alias of its host.<br><br>Adding SPNs -<br>To add an SPN, use the setspn -s service/namehostname command at a command prompt, where service/name is the SPN that you want to add and hostname is the actual host name of the computer object that you want to update. For example, if there is an Active Directory domain controller with the host name server1.contoso.com that requires an SPN for the Lightweight Directory Access Protocol (LDAP), type setspn -s ldap/server1.contoso.com server1, and then press<br>ENTER to add the SPN.<br><br>The HTTP service class -<br>The HTTP service class differs from the HTTP protocol. Both the HTTP protocol and the HTTPS protocol use the HTTP service class. The service class is the string that identifies the general class of service.<br>For example, the command may resemble the following command:<br>setspn S HTTP/iis6server1. mydomain.com mydomain\\appPool1<br>References:<br>http://support.microsoft.com/kb/929650/en-us<br>http://technet.microsoft.com/en-us/library/cc731241%28v=ws.10%29.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-08T15:17:00.000Z",
        "voteCount": 1,
        "content": "\"If anyone is wondering why HTTP and not HTTPS, it is because in the syntax of SETSPN, HTTP refers to the service class, which cover both HTTP and HTTPS protocols.\"  https://www.briefmenow.org/microsoft/you-need-to-identify-the-setspnexe-command-that-you-must-run-to-configure-the-appropriate-service-principal-name-spn-for-the-web-site-2"
      },
      {
        "date": "2020-12-02T11:41:00.000Z",
        "voteCount": 1,
        "content": "Because Server1 is hosting an HTTPS site instead of an HTTP one, it is supposed to be https/secure.contoso.com, not http/secure.contoso.com."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/9131-exam-70-411-topic-1-question-41-discussion/",
    "body": "Your network contains an Active Directory forest named contoso.com. The forest contains a single domain. All domain controllers run Windows Server 2012 R2.<br>The domain contains two domain controllers. The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02139/0008700001.png\" class=\"in-exam-image\"><br>Active Directory Recycle Bin is enabled.<br>You discover that a support technician accidentally removed 100 users from an Active Directory group named Group1 an hour ago.<br>You need to restore the membership of Group1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecover the items by using Active Directory Recycle Bin.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Recycled attribute of Group1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform tombstone reanimation.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform an authoritative restore."
    ],
    "answer": "A",
    "answerDescription": "Active Directory Recycle Bin helps minimize directory service downtime by enhancing your ability to preserve and restore accidentally deleted Active Directory objects without restoring Active Directory data from backups, restarting Active Directory Domain Services (AD DS), or rebooting domain controllers.<br>When you enable Active Directory Recycle Bin, all link-valued and non-link-valued attributes of the deleted Active Directory objects are preserved and the objects are restored in their entirety to the same consistent logical state that they were in immediately before deletion. For example, restored user accounts automatically regain all group memberships and corresponding access rights that they had immediately before deletion, within and across domains.",
    "votes": [],
    "comments": [
      {
        "date": "2019-11-25T23:35:00.000Z",
        "voteCount": 5,
        "content": "Admin did not delete user object, just group membership. AD bin doesn't support rollback function. I would go with the authoritative restore."
      },
      {
        "date": "2019-12-11T10:22:00.000Z",
        "voteCount": 5,
        "content": "User Objects were NOT deleted but just the Group Membership was removed, which won't be available in AD Recycle Bin.\n\nCorrect Answer:  D. Perform an authoritative restore."
      },
      {
        "date": "2020-08-03T23:32:00.000Z",
        "voteCount": 3,
        "content": "D. Perform an authoritative restore."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1842-exam-70-411-topic-1-question-44-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a domain controller named DC1 that runs Windows Server 2012 R2.<br>You create an Active Directory snapshot of DC1 each day.<br>You need to view the contents of an Active Directory snapshot from two days ago.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the dsamain.exe command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStop the Active Directory Domain Services (AD DS) service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart the Volume Shadow Copy Service (VSS).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the ntdsutil.exe command."
    ],
    "answer": "A",
    "answerDescription": "Dsamain.exe exposes Active Directory data that is stored in a snapshot or backup as a Lightweight Directory Access Protocol (LDAP) server.<br>Reference: http://technet.microsoft.com/en-us/library/cc772168.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-16T15:32:00.000Z",
        "voteCount": 5,
        "content": "My other response was slightly incorrect. You need NTDSUTIL to mount the AD snapshot. Then you can use dsamain to specify the mounted snapshot.\n\nFor the dbpath parameter, you must specify a mounted snapshot or a backup that you want to view along with the complete path to the Ntds.dit file, for example:\n/dbpath E:\\$SNAP_200704181137_VOLUMED$\\WINDOWS\\NTDS\\ntds.dit\n\n\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/cc772168(v=ws.11)"
      },
      {
        "date": "2020-08-11T22:30:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer: D"
      },
      {
        "date": "2020-05-25T10:46:00.000Z",
        "voteCount": 1,
        "content": "i agree, ntdsutil it is. dsmain will be the answer if it has \" as a LDAP server \"."
      },
      {
        "date": "2019-12-15T02:53:00.000Z",
        "voteCount": 1,
        "content": "Agreed to tigerz's comment/statement!\n\nCorrect Answer:  D. Run the ntdsutil.exe command."
      },
      {
        "date": "2019-06-16T15:29:00.000Z",
        "voteCount": 3,
        "content": "This is wrong. You must use NTDSUTIL FIRST to mount the snapshot THEN use dsamain to restore the objects from that snapshot."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21314-exam-70-411-topic-1-question-58-discussion/",
    "body": "Your network contains two servers named Server1 and Server2. Both servers run Windows Server 2012 R2 and have the DNS Server server role installed.<br>On Server1, you create a standard primary zone named contoso.com.<br>You need to ensure that Server2 can host a secondary zone for contoso.com.<br>What should you do from Server1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd Server2 as a name server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a trust anchor named Server2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConvert contoso.com to an Active Directory-integrated zone.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a zone delegation that points to Server2."
    ],
    "answer": "A",
    "answerDescription": "Typically, adding a secondary DNS server to a zone involves three steps:<br>1. On the primary DNS server, add the prospective secondary DNS server to the list of name servers that are authoritative for the zone.<br>2. On the primary DNS server, verify that the transfer settings for the zone permit the zone to be transferred to the prospective secondary DNS server.<br>3. On the prospective secondary DNS server, add the zone as a secondary zone.<br>You must add a new Name Server. To add a name server to the list of authoritative servers for the zone, you must specify both the server's IP address and its<br>DNS name. When entering names, click Resolve to resolve the name to its IP address prior to adding it to the list.<br>Secondary zones cannot be AD-integrated under any circumstances.<br>You want to be sure Server2 can host, you do not want to delegate a zone.<br>Secondary Domain Name System (DNS) servers help provide load balancing and fault tolerance. Secondary DNS servers maintain a read-only copy of zone data that is transferred periodically from the primary DNS server for the zone. You can configure DNS clients to query secondary DNS servers instead of (or in addition to) the primary DNS server for a zone, reducing demand on the primary server and ensuring that DNS queries for the zone will be answered even if the primary server is not available.<br>How-To: Configure a secondary DNS Server in Windows Server 2012<br>We need to tell our primary DNS that it is ok for this secondary DNS to pull information from it. Otherwise replication will fail and you will get this big red X.<br><img src=\"/assets/media/exam-media/02139/0010700001.jpg\" class=\"in-exam-image\"><br>Head over to your primary DNS server, launch DNS manager, expand Forward Lookup Zones, navigate to your primary DNS zone, right-click on it and go to<br>Properties.<br><img src=\"/assets/media/exam-media/02139/0010800001.jpg\" class=\"in-exam-image\"><br>Go to \"Zone Transfers\" tab, by default, for security reasons, the \"Allow zone transfers: \" is un- checked to protect your DNS information. We need to allow zone transfers, if you value your DNS records, you do not want to select \"To any server\" but make sure you click on \"Only to servers listed on the Name Servers tab\".<br><img src=\"/assets/media/exam-media/02139/0010900001.jpg\" class=\"in-exam-image\"><br>Head over to the \"Name Servers\" tab, click Add.<br><img src=\"/assets/media/exam-media/02139/0011000001.jpg\" class=\"in-exam-image\"><br>You will get \"New Name Server Record\" window, type in the name of your secondary DNS server. it is always better to validate by name not IP address to avoid future problems in case your IP addresses change. Once done, click OK.<br><img src=\"/assets/media/exam-media/02139/0011100001.jpg\" class=\"in-exam-image\"><br>You will see your secondary DNS server is now added to your name servers selection, click OK.<br><img src=\"/assets/media/exam-media/02139/0011200001.jpg\" class=\"in-exam-image\"><br>Now if you head back to your secondary DNS server and refresh, the big red X will go away and your primary zone data will populate.<br><img src=\"/assets/media/exam-media/02139/0011300001.jpg\" class=\"in-exam-image\"><br>Your secondary DNS is fully setup now. You cannot make any DNS changes from your secondary DNS. Secondary DNS is a read-only DNS, Any DNS changes have to be done from the primary DNS.<br>References:<br>http://technet.microsoft.com/en-us/library/cc816885%28v=ws.10%29.aspx http://technet.microsoft.com/en-us/library/cc816814%28v=ws.10%29.aspx http://blog.hyperexpert.com/how-to-configure-a-secondary-dns-server-in-windows-server-2012/ http://technet.microsoft.com/en-us/library/cc770984.aspx http://support.microsoft.com/kb/816101 http://technet.microsoft.com/en-us/library/cc753500.aspx http://technet.microsoft.com/en-us/library/cc771640(v=ws.10).aspx http://technet.microsoft.com/en-us/library/ee649280(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-25T11:03:00.000Z",
        "voteCount": 1,
        "content": "Name Server is correct is DNS is AD integrated but since its standard then the answer is Delegation, D."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/9124-exam-70-411-topic-1-question-60-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>All user accounts for the marketing department reside in an organizational unit (OU) named OU1. All user accounts for the finance department reside in an organizational unit (OU) named OU2.<br>You create a Group Policy object (GPO) named GPO1. You link GPO1 to OU2. You configure the Group Policy preference of GPO1 to add a shortcut named<br>Link1 to the desktop.<br>You discover that when a user signs in, the Link1 is not added to the desktop.<br>You need to ensure that when a user signs in, Link1 is added to the desktop.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnforce GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable loopback processing in GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Link1 shortcut preference of GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Security Filtering settings of GPO1."
    ],
    "answer": "D",
    "answerDescription": "Security filtering is a way of refining which users and computers will receive and apply the settings in a Group Policy object (GPO). Using security filtering, you can specify that only certain security principals within a container where the GPO is linked apply the GPO. Security group filtering determines whether the GPO as a whole applies to groups, users, or computers; it cannot be used selectively on different settings within a GPO.",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-21T07:56:00.000Z",
        "voteCount": 1,
        "content": "Answer is C .. User configurations &gt; Preferences &gt;Registry &gt; Shortcuts"
      },
      {
        "date": "2020-05-25T11:06:00.000Z",
        "voteCount": 1,
        "content": "I agree with the answer C. Creating the link again option is found there."
      },
      {
        "date": "2019-12-11T13:55:00.000Z",
        "voteCount": 2,
        "content": "Correct Answer:  C. Modify the Link1 shortcut preference of GPO1."
      },
      {
        "date": "2019-11-25T22:27:00.000Z",
        "voteCount": 1,
        "content": "This is a user setting the Loopback processing must be configured to merge or replace, otherwise the user settings will not apply. I would go with \"B\"."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37469-exam-70-411-topic-1-question-63-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. All domain controllers run Windows Server 2012 R2.<br>You have a Group Policy object (GPO) named GPO1 that contains hundreds of settings. GPO1 is linked to an organizational unit (OU) named OU1. OU1 contains<br>200 client computers.<br>You plan to unlink GPO1 from OU1.<br>You need to identify which GPO settings will be removed from the computers after GPO1 is unlinked from OU1.<br>Which two GPO settings should you identify? (Each correct answer presents part of the solution.<br>Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe managed Administrative Template settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe unmanaged Administrative Template settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe System Services security settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Event Log security settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Restricted Groups security settings"
    ],
    "answer": "AD",
    "answerDescription": "There are two kinds of Administrative Template policy settings: Managed and Unmanaged . The Group Policy service governs Managed policy settings and removes a policy setting when it is no longer within scope of the user or computer.<br>References:<br>http://technet.microsoft.com/en-us/library/cc778402(v=ws.10).aspx http://technet.microsoft.com/en-us/library/bb964258.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-21T08:08:00.000Z",
        "voteCount": 2,
        "content": "Correct answer AE"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21315-exam-70-411-topic-1-question-64-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. All domain controllers run Windows Server 2012 R2. The domain contains 500 client computers that run Windows 8.1 Enterprise and Microsoft Office 2013.<br>You implement a Group Policy central store.<br>You need to modify the default Microsoft Office 2013 Save As location for all client computers.<br>The solution must minimize administrative effort.<br>What should you configure in a Group Policy object (GPO)?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Group Policy preferences",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAn application control policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Administrative Templates",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Software Installation settings"
    ],
    "answer": "A",
    "answerDescription": "Group Policy preferences provide the means to simplify deployment and standardize configurations. They add to Group Policy a centralized system for deploying preferences (that is, settings that users can change later). You can also use Group Policy preferences to configure applications that are not Group Policy-aware.<br>By using Group Policy preferences, you can change or delete almost any registry setting, file or folder, shortcut, and more. You are not limited by the contents of<br>Administrative Template files.<br>Reference: http://technet.microsoft.com/en-us/library/dn581922.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-21T09:04:00.000Z",
        "voteCount": 2,
        "content": "Correct Answer is C ."
      },
      {
        "date": "2020-08-04T00:52:00.000Z",
        "voteCount": 2,
        "content": "Yes, Its Administrative Template"
      },
      {
        "date": "2020-05-25T11:09:00.000Z",
        "voteCount": 2,
        "content": "My answer here is Administrative Template"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1006-exam-70-411-topic-1-question-79-discussion/",
    "body": "DRAG DROP -<br>Your network contains an Active Directory domain named adatum.com. The domain contains a server named Server1 that runs Windows Server 2012 R2. Server1 is configured as a Network Policy Server (NPS) server and as a DHCP server.<br>You need to log all DHCP clients that have windows Firewall disabled.<br>Which three actions should you perform in sequence? To answer, move the three appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0015500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "<img src=\"/assets/media/exam-media/02139/0015600001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02139/0015700001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02139/0015800001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02139/0015900001.jpg\" class=\"in-exam-image\"><br>* With NPS, you can create client health policies using SHVs that allow NAP to detect, enforce, and remediate client computer configurations.<br>WSHA and WSHV provide the following functionality for NAP-capable computers:<br>The client computer has firewall software installed and enabled.<br>* Example measurements of health include:<br>The operational status of Windows Firewall. Is the firewall enabled or disabled?<br>In NAP terminology, verifying that a computer meets your defined health requirements is called health policy validation. NPS performs health policy validation for<br>NAP.<br>References:<br>http://technet.microsoft.com/es-es/library/dd314198(v=ws.10).aspx http://technet.microsoft.com/es-es/magazine/2009.05.goat.aspx http://technet.microsoft.com/es-es/library/dd314173(v=ws.10).aspx http://ripusudan.wordpress.com/2013/03/19/how-to-configure-nap-enforcement-for-dhcp/ http://technet.microsoft.com/es-es/magazine/2009.05.goat.aspx http://technet.microsoft.com/en-us/library/dd125379(v=ws.10).aspx http://technet.microsoft.com/en-us/library/cc772356(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-05-25T19:38:00.000Z",
        "voteCount": 10,
        "content": "Answers\nCreate A Windows Security Health Validator (WSHV) configuration.\nCreate a health policy\nCreate a network policy"
      },
      {
        "date": "2020-08-12T04:17:00.000Z",
        "voteCount": 2,
        "content": "Create A Windows Security Health Validator (WSHV) configuration.\nCreate a health policy\nCreate a network policy"
      },
      {
        "date": "2019-04-23T15:05:00.000Z",
        "voteCount": 1,
        "content": "Answer is unknown!!"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21316-exam-70-411-topic-1-question-81-discussion/",
    "body": "DRAG DROP -<br>You have a WIM file that contains an image of Windows Server 2012 R2.<br>Recently, a technician applied a Microsoft Standalone Update Package (MSU) to the image.<br>You need to remove the MSU package from the image.<br>Which three actions should you perform in sequence? To answer, move the appropriate three actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02139/0016200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0016300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note:<br>* At a command prompt, specify the package identity to remove it from the image. You can remove multiple packages on one command line.<br>DISM /Image: C:\\test\\offline /Remove-Package /PackageName: Microsoft.Windows.Calc. Demo~6595b6144ccf1df~x86~en~1.0.0.0 /PackageName: Micro<br>/Cleanup-Image<br>Performs cleanup or recovery operations on the image.",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-04T01:15:00.000Z",
        "voteCount": 2,
        "content": "Jb4 you're correct."
      },
      {
        "date": "2020-05-25T11:16:00.000Z",
        "voteCount": 2,
        "content": "can someone confirm the answer, i think its\n1. dism apply\n2. wusa uninstall\n3. dism capture"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17501-exam-70-411-topic-1-question-83-discussion/",
    "body": "You manage a server that runs Windows Server 2012 R2. The server has the Windows Deployment Services server role installed.<br>You start a virtual machine named VM1 as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02139/0016500001.png\" class=\"in-exam-image\"><br>You need to configure a pre-staged device for VM1 in the Windows Deployment Services console.<br>Which two values should you assign to the device ID? (Each correct answer presents a complete solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t979708BF-C04B-4525-9FE0-C4150BB6C618",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t00000000-0000-0000-0000-C4150BB6C618"
    ],
    "answer": "BD",
    "answerDescription": "Use client computer's media access control (MAC) address preceded with twenty zeros or the globally unique identifier (GUID) in the format: {XXXXXXXX-XXXX-<br>XXXX-XXX- XXXXXXXXXXXX}.<br>Reference: http://technet.microsoft.com/en-us/library/cc754469.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-19T06:46:00.000Z",
        "voteCount": 1,
        "content": "B and D is correct.\nB. 979708BF-C04B-4525-9FE0-C4150BB6C618\nD. 0000000000000000000000155D000F13\n\nUse the client computer's media access control (MAC) address preceded by twenty zeros or the global unique identifier (GUID) in the format: {XXXXXXXX-XXXX-XXXX-XXX- XXXXXXXXXXXX}.\nReference: http://technet.microsoft.com/en-us/library/cc754469.aspx"
      },
      {
        "date": "2020-03-25T17:17:00.000Z",
        "voteCount": 2,
        "content": "I think the \" E \" is not correct. It supposed to be 000....00 + MAC Address like 00000000-0000-0000-00155D000F13."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27279-exam-70-411-topic-1-question-84-discussion/",
    "body": "You have a server named Server1 that runs Windows Server 2012 R2.<br>On Server1, you configure a custom Data Collector Set (DCS) named DCS1. DCS1 is configured to store performance log data in C:\\Logs.<br>You need to ensure that the contents of C:\\Logs are deleted automatically when the folder reaches 100 MB in size.<br>What should you configure?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA File Server Resource Manager (FSRM) file screen on the C:\\Logs folder",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Data Manager settings of DCS1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA schedule for DCS1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA File Server Resource Manager (FSRM) quota on the C:\\Logs folder"
    ],
    "answer": "B",
    "answerDescription": "To configure data management for a Data Collector Set<br>1. In Windows Performance Monitor, expand Data Collector Sets and click User Defined.<br>2. In the console pane, right-click the name of the Data Collector Set that you want to configure and click Data Manager.<br>3. On the Data Manager tab, you can accept the default values or make changes according to your data retention policy. See the table below for details on each option.<br>When Minimum free disk or Maximum folders is selected, previous data will be deleted according to the Resource policy you choose (Delete largest or Delete oldest) when the limit is reached. When Apply policy before the data collector set starts is selected, previous data will be deleted according to your selections before the data collector set creates its next log file.<br>When Maximum root path size is selected, previous data will be deleted according to your selections when the root log folder size limit is reached.<br>4. Click the Actions tab. You can accept the default values or make changes. See the table below for details on each option.<br>5. When you have finished making your changes, click OK.",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-04T01:20:00.000Z",
        "voteCount": 2,
        "content": "I think it's - The Data Manager settings of DCS1"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/909-exam-70-411-topic-1-question-85-discussion/",
    "body": "HOTSPOT -<br>Your company has two offices. The offices are located in Montreal and Seattle.<br>The network contains an Active Directory domain named contoso.com. The domain contains servers named Server1 and Server2. Server1 is located in the Seattle office. Server2 is located in the Montreal office. Both servers run Windows Server 2012 R2 and have the Windows Server Update Services (WSUS) server role installed.<br>You need to configure Server2 to download updates that are approved on Server1 only.<br>What cmdlet should you run? To answer, select the appropriate options in the answer area.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02139/0016700001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-05-25T19:47:00.000Z",
        "voteCount": 7,
        "content": "Answer\nSet-WsusServerSynchronization -UssServerName Server1 -Replica"
      },
      {
        "date": "2019-04-12T14:58:00.000Z",
        "voteCount": 1,
        "content": "Where is the answer?!"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/39709-exam-70-411-topic-1-question-86-discussion/",
    "body": "You have Windows Server 2012 R2 installation media that contains a file named Install.wim.<br>You need to identify which images are present in Install.wim.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun imagex.exe and specify the /ref parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun dism.exe and specify the /get-mountedwiminfo parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun dism.exe and specify the /get-imageinfo parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun imagex.exe and specify the /verify parameter."
    ],
    "answer": "C",
    "answerDescription": "Option:<br>/Get-ImageInfo<br>Arguments:<br>/ImageFile: &lt;path_to_image.wim&gt;<br>[{/Index: &lt;Image_index&gt; | /Name: &lt;Image_name&gt;}]<br>Displays information about the images that are contained in the .wim, vhd or .vhdx file. When used with the Index or /Name argument, information about the specified image is displayed, which includes if an image is a WIMBoot image, if the image is Windows 8.1 Update, see Take Inventory of an Image or Component<br>Using DISM. The /Name argument does not apply to VHD files. You must specify /Index: 1 for VHD files.<br>References:<br>http://technet.microsoft.com/en-us/library/cc749447(v=ws.10).aspx http://technet.microsoft.com/en-us/library/dd744382(v=ws.10).aspx http://technet.microsoft.com/en-us/library/hh825224.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-12T15:13:00.000Z",
        "voteCount": 3,
        "content": "There are big debates on other sites - be very careful when answering this question.\n\nThat is a similar question\n“You need to identify the permissions of the mounted images in Install.wim.”\nAnswer: get-mountedwiminfo\n“You need to identify which images are present in Install.wim.”\nAnswer: get-wiminfo\n\nBoth have very similar question and answers."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21320-exam-70-411-topic-1-question-91-discussion/",
    "body": "Your company has a main office and two branch offices. The main office is located in Seattle. The two branch offices are located in Montreal and Miami. Each office is configured as an Active Directory site.<br>The network contains an Active Directory domain named contoso.com. Network traffic is not routed between the Montreal office and the Miami office.<br>You implement a Distributed File System (DFS) namespace named \\\\contoso.com\\public. The namespace contains a folder named Folder1. Folder1 has a folder target in each office.<br>You need to configure DFS to ensure that users in the branch offices only receive referrals to the target in their respective office or to the target in the main office.<br>Which two actions should you perform? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Ordering method of \\\\contoso.com\\public to Random order.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Advanced properties of the folder target in the Seattle office to Last among all targets.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Advanced properties of the folder target in the Seattle office to First among targets of equal cost.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Ordering method of \\\\contoso.com\\public to Exclude targets outside of the client's site.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Advanced properties of the folder target in the Seattle office to Last among targets of equal cost.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Ordering method of \\\\contoso.com\\public to Lowest cost."
    ],
    "answer": "CD",
    "answerDescription": "Exclude targets outside of the client's site<br>In this method, the referral contains only the targets that are in the same site as the client. These same-site targets are listed in random order. If no same-site targets exist, the client does not receive a referral and cannot access that portion of the namespace.<br>Note: Targets that have target priority set to \"First among all targets\" or \"Last among all targets\" are still listed in the referral, even if the ordering method is set to<br>Exclude targets outside of the client's site.<br>Note 2: Set the Ordering Method for Targets in Referrals<br>A referral is an ordered list of targets that a client computer receives from a domain controller or namespace server when the user accesses a namespace root or folder with targets. After the client receives the referral, the client attempts to access the first target in the list. If the target is not available, the client attempts to access the next target.",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-04T01:33:00.000Z",
        "voteCount": 1,
        "content": "Yes, B &amp; D"
      },
      {
        "date": "2020-05-25T11:28:00.000Z",
        "voteCount": 1,
        "content": "i think its B and D. any thoughts?"
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15211-exam-70-411-topic-1-question-99-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a domain controller named DC1.<br>You run ntdsutil as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02139/0018400001.jpg\" class=\"in-exam-image\"><br>You need to ensure that you can access the contents of the mounted snapshot.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the snapshot context of ntdsutil, run activate instance \"NTDS\".",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a command prompt, run dsamain.exe -dbpath c:\\$snap_201204131056_volumec$\\windows\\ntds\\ntds. dit -Idapport 389.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the snapshot context of ntdsutil, run mount {79f94f82-5926-4f44-8af0-2f56d827a57d}.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a command prompt, run dsamain.exe -dbpath c:\\$snap_201204131056_volumec$\\windows\\ntds\\ntds. dit -Idapport 33389."
    ],
    "answer": "D",
    "answerDescription": "By default, only members of the Domain Admins group and the Enterprise Admins group are allowed to view the snapshots because they contain sensitive AD DS data. If you want to access snapshot data from an old domain or forest that has been deleted, you can allow nonadministrators to access the data when you run<br>Dsamain.exe.<br>If you plan to view the snapshot data on a domain controller, specify ports that are different from the ports that the domain controller will use.<br>A client starts an LDAP session by connecting to an LDAP server, called a Directory System Agent (DSA), by default on TCP port and UDP [7] port 389. The client then sends an operation request to the server, and the server sends responses in return. With some exceptions, the client does not need to wait for a response before sending the next request, and the server may send the responses in any order. All information is transmitted using Basic Encoding Rules (BER).<br><img src=\"/assets/media/exam-media/02139/0018500001.jpg\" class=\"in-exam-image\"><br>References:<br>http://technet.microsoft.com/en-us/library/cc753609(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-04T09:10:00.000Z",
        "voteCount": 1,
        "content": "Question is \"..access the contents of the mounted snapshot..\". So, assumed the snapshot is mounted already. The answer provided is correct."
      },
      {
        "date": "2020-03-02T17:21:00.000Z",
        "voteCount": 2,
        "content": "The next thing to do should be ‘mount {79f94f82-5926-4f44-8af0-2f56d827a57d}’, then expose the snapshot using dsamain. The command line screenshot in the answer shows the whole process."
      }
    ],
    "examNameCode": "70-411",
    "topicNumber": "1"
  }
]