[
  {
    "topic": 9,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/59352-exam-dp-100-topic-8-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to correct the model fit issue.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04274/0046700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0046800001.png\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Augment the data -<br>Scenario: Columns in each dataset contain missing and null values. The datasets also contain many outliers.<br>Step 2: Add the Bayesian Linear Regression module.<br>Scenario: You produce a regression model to predict property prices by using the Linear Regression and Bayesian Linear Regression modules.<br>Step 3: Configure the regularization weight.<br>Regularization typically is used to avoid overfitting. For example, in L2 regularization weight, type the value to use as the weight for L2 regularization. We recommend that you use a non-zero value to avoid overfitting.<br>Scenario:<br>Model fit: The model shows signs of overfitting. You need to produce a more refined regression model that reduces the overfitting.<br>Incorrect Answers:<br>Multiclass Decision Jungle module:<br>Decision jungles are a recent extension to decision forests. A decision jungle consists of an ensemble of decision directed acyclic graphs (DAGs).<br>L-BFGS:<br>L-BFGS stands for \"limited memory Broyden-Fletcher-Goldfarb-Shanno\". It can be found in the wwo-Class Logistic Regression module, which is used to create a logistic regression model that can be used to predict two (and only two) outcomes.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/studio-module-reference/linear-regression",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-11T20:55:00.000Z",
        "voteCount": 1,
        "content": "Question keyword \"You produce a regression model to predict property prices by using the Linear Regression and Bayesian Linear Regression modules.\" --&gt; \nFirst block, sure for \"Augment the data\".\nThird block, sure for \"Configure the regulation weight.\"\nremain part, Second block, choose \"Add the Bayesian Linear Regression module\" based on question's keyword."
      },
      {
        "date": "2023-02-25T18:46:00.000Z",
        "voteCount": 1,
        "content": "given answer is ok"
      },
      {
        "date": "2023-02-25T18:46:00.000Z",
        "voteCount": 2,
        "content": "Augment the data to increase the size of the training set and potentially improve the model's ability to capture patterns in the data.\nAdd the Bayesian linear regression module, which may provide a better fit for the data than the standard linear regression module.\nConfigure the regularization weight to help prevent overfitting and improve generalization performance."
      },
      {
        "date": "2023-02-25T18:43:00.000Z",
        "voteCount": 1,
        "content": "Augment the data: This can help to increase the size and diversity of the training data, which may improve the performance of the model.\n\nConfigure the regularization weight: Regularization can help to prevent overfitting by adding a penalty term to the loss function. Adjusting the regularization weight can help to find an optimal balance between model complexity and generalization.\n\nDecrease the memory size for L-BFGS: This can help to reduce the computational resources required for training the model, which can improve the efficiency and speed of the training process.\n\nAdding the other modules (ordinal regression, two-class averaged perception, multiclass decision jungle) would not be appropriate for a regression problem, and adding the Bayesian Linear Regression module was already mentioned in the scenario."
      },
      {
        "date": "2021-08-05T22:40:00.000Z",
        "voteCount": 3,
        "content": "Augmentation and regularization is correct. but not sure for Bayesian model"
      },
      {
        "date": "2021-08-12T03:28:00.000Z",
        "voteCount": 1,
        "content": "What should be the answer then?"
      },
      {
        "date": "2021-10-28T08:38:00.000Z",
        "voteCount": 1,
        "content": "You must set up the experiment to cross-validate the Linear Regression and Bayesian Linear Regression modules to evaluate performance."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "8"
  }
]