[
  {
    "topic": 18,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47123-exam-dp-300-topic-18-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to implement the monitoring of SalesSQLDb1. The solution must meet the technical requirements.<br>How should you collect and stream metrics? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04275/0013400001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04275/0013400002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: The server, the elastic pool, and the database<br>Senario:<br>SalesSQLDb1 is in an elastic pool named SalesSQLDb1Pool.<br>Litware technical requirements include: all SQL Server and Azure SQL Database metrics related to CPU and storage usage and limits must be analyzed by using<br>Azure built-in functionality.<br><br>Box 2: Azure Event hubs -<br>Scenario: Migrate ManufacturingSQLDb1 to the Azure virtual machine platform.<br>Event hubs are able to handle custom metrics.<br>Incorrect Answers:<br><br>Azure Log Analytics -<br>Azure metric and log data are sent to Azure Monitor Logs, previously known as Azure Log Analytics, directly by Azure. Azure SQL Analytics is a cloud only monitoring solution supporting streaming of diagnostics telemetry for all of your Azure SQL databases.<br>However, because Azure SQL Analytics does not use agents to connect to Azure Monitor, it does not support monitoring of SQL Server hosted on-premises or in virtual machines.",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-06T06:56:00.000Z",
        "voteCount": 9,
        "content": "A: Elastic pool and databases\nB: Log Analytics\n\nStreaming to log analytics is possible:\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/metrics-diagnostic-telemetry-logging-streaming-export-configure?view=azuresql&amp;tabs=azure-portal\n\nYou can stream metrics and resource logs to a Log Analytics workspace in Azure Monitor. Data streamed here can be consumed by SQL Analytics (preview), which is a cloud only monitoring solution that provides intelligent monitoring of your databases that includes performance reports, alerts, and mitigation recommendations. Data streamed to a Log Analytics workspace can be analyzed with other monitoring data collected and also enables you to leverage other Azure Monitor features such as alerts and visualizations.\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/monitor-tune-overview?view=azuresql\n\nCollecting server metrics is not an option:\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/elastic-pool-resource-management?view=azuresql"
      },
      {
        "date": "2023-01-13T02:30:00.000Z",
        "voteCount": 2,
        "content": "Agree. \nLog Analytics is for inspecting metrics by Azure built-in tools (I guess MS wants to hear Kusto Query Language + set up alert based on the results). \nEvent Hubs -&gt; Stream metrics to other locations. Used to be integrated with other vendors tools\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/essentials/stream-monitoring-data-event-hubs"
      },
      {
        "date": "2021-03-21T10:59:00.000Z",
        "voteCount": 7,
        "content": "Further to my previous comment the below is in the scenario:\nAll SQL Server and Azure SQL Database metrics related to CPU and storage usage and limits must be analyzed by using Azure built-in functionality."
      },
      {
        "date": "2024-10-16T06:03:00.000Z",
        "voteCount": 1,
        "content": "To implement the monitoring of SalesSQLDb1 and meet the technical requirements, here's how you should configure the options:\n\nCollect metrics from:\n\nThe server, the elastic pool, and the database - This option will collect metrics at every layer, including the SQL Server instance, the elastic pool, and individual databases. This provides comprehensive coverage of all possible metrics across different levels.\nStream metrics to:\n\nAzure Log Analytics - This option allows you to stream metrics to a centralized service where you can analyze them in real time, create dashboards, and set up alerts. It is well-suited for in-depth analysis and is integrated into Azure Monitor, which aligns with the requirement to monitor SQL Server and Azure SQL Database metrics related to CPU and storage usage."
      },
      {
        "date": "2024-04-07T07:48:00.000Z",
        "voteCount": 1,
        "content": "Elastic pool and databases.\nLog Analytics. Allows the use of a single dashboard to monitor all metrics from Azure resources; and SalesSQLDB1 is in an Azure Elastic Pool."
      },
      {
        "date": "2021-08-01T09:51:00.000Z",
        "voteCount": 4,
        "content": "Because you need to collect and stream data, it has to go the destination of Azure Event Hub."
      },
      {
        "date": "2021-06-29T22:58:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct. We can set alerts on both elastic pool and database level, plus company has dbs on Azure VMs"
      },
      {
        "date": "2021-06-29T09:08:00.000Z",
        "voteCount": 3,
        "content": "Server does not have metrics, So its only \"Elastic pool and Database\""
      },
      {
        "date": "2021-06-13T05:35:00.000Z",
        "voteCount": 6,
        "content": "IMO, collecting 'basic' metric from the Elastic pool and the database to a Log Analytics Workspace is enough to meet the tech requirements."
      },
      {
        "date": "2021-08-12T13:53:00.000Z",
        "voteCount": 3,
        "content": "Log Analytics does not support monitoring of SQL Server hosted on-premises or in virtual machines."
      },
      {
        "date": "2021-03-26T03:58:00.000Z",
        "voteCount": 1,
        "content": "It is to 'Implement the monitoring of SalesSQLDb1', in which the SalesSQLDb1 is elastic pool, and can use cloud solution to monitor."
      },
      {
        "date": "2021-03-16T11:24:00.000Z",
        "voteCount": 4,
        "content": "Why not the server, the pool and the database?"
      },
      {
        "date": "2021-09-27T11:28:00.000Z",
        "voteCount": 2,
        "content": "Azure SQL Server has no diagnostics."
      },
      {
        "date": "2021-03-14T18:04:00.000Z",
        "voteCount": 3,
        "content": "Database only and Log Analytics"
      }
    ],
    "examNameCode": "dp-300",
    "topicNumber": "18"
  }
]