[
  {
    "topic": 9,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16582-exam-dp-201-topic-9-question-1-discussion/",
    "body": "What should you recommend to prevent users outside the Litware on-premises network from accessing the analytical data store?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta server-level virtual network rule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta database-level virtual network rule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta database-level firewall IP rule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta server-level firewall IP rule"
    ],
    "answer": "A",
    "answerDescription": "Scenario: Ensure that the analytical data store is accessible only to the company's on-premises network and Azure services.<br>Virtual network rules are one firewall security feature that controls whether the database server for your single databases and elastic pool in Azure SQL Database or for your databases in SQL Data Warehouse accepts communications that are sent from particular subnets in virtual networks.<br>Server-level, not database-level: Each virtual network rule applies to your whole Azure SQL Database server, not just to one particular database on the server. In other words, virtual network rule applies at the server-level, not at the database-level.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/sql-database/sql-database-vnet-service-endpoint-rule-overview",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-14T08:19:00.000Z",
        "voteCount": 55,
        "content": "I think that corrcet response should be D because this \"Litware does not plan to implement Azure ExpressRoute or a VPN between the on-premises network and Azure\""
      },
      {
        "date": "2020-04-10T11:53:00.000Z",
        "voteCount": 18,
        "content": "The answer should be A which is implementing VNet for SQL database server level. VNet is not \"Azure ExpressRoute or a VPN between the on-premises and Azure\"."
      },
      {
        "date": "2020-04-25T09:39:00.000Z",
        "voteCount": 8,
        "content": "Azure is a Paas and there is no way to implement vNet for a SQL database unless you're using a Private Link, which is not mentioned in the question. So the answer should be D."
      },
      {
        "date": "2021-04-29T13:42:00.000Z",
        "voteCount": 3,
        "content": "D. a server-level firewall IP rule"
      },
      {
        "date": "2021-04-23T00:07:00.000Z",
        "voteCount": 2,
        "content": "Ans : D\n\"By default, Azure service resources secured to virtual networks aren't reachable from on-premises networks. If you want to allow traffic from on-premises, you must also allow public (typically, NAT) IP addresses from your on-premises or ExpressRoute. You can add these IP addresses through the IP firewall configuration for Azure service resources.\"\n\nref: https://docs.microsoft.com/en-us/azure/virtual-network/virtual-network-service-endpoints-overview"
      },
      {
        "date": "2020-12-10T03:39:00.000Z",
        "voteCount": 1,
        "content": "Virtual network rules are one firewall security feature that controls whether the server for your databases and elastic pools in Azure SQL Database or for your databases in Azure Synapse accepts communications that are sent from particular subnets in virtual networks\nA is correct"
      },
      {
        "date": "2020-12-18T15:21:00.000Z",
        "voteCount": 3,
        "content": "but the requirement states that the company does not plan to implement a virtual network, D is correct"
      },
      {
        "date": "2020-09-30T15:47:00.000Z",
        "voteCount": 5,
        "content": "Don't read the above comments and get confused, given answer is correct,\nA. a server-level virtual network rule"
      },
      {
        "date": "2021-01-16T08:27:00.000Z",
        "voteCount": 4,
        "content": "No it's not. How would you peer you virtual network with the on premise network? You need someway to tie them together. Virtual network rule only makes sense if you have some gateway in azure as well. Or EspressRoute"
      },
      {
        "date": "2020-07-20T03:52:00.000Z",
        "voteCount": 9,
        "content": "As long as there is no VPN between On prim and azure , you should go for IP rule based , it should applied to Server\nso Answer is D"
      },
      {
        "date": "2020-07-14T00:46:00.000Z",
        "voteCount": 4,
        "content": "Azure Synapse only supports server-level IP firewall rules. It doesn't support database-level IP firewall rules. https://docs.microsoft.com/en-us/azure/azure-sql/database/firewall-configure"
      },
      {
        "date": "2021-04-30T00:35:00.000Z",
        "voteCount": 1,
        "content": "Azure Synapse does support server-level IP firewall. The link provided by you is common for both Azure SQL and Synapse."
      },
      {
        "date": "2021-04-30T00:36:00.000Z",
        "voteCount": 1,
        "content": "I mean it does support database-level IP firewall rule"
      },
      {
        "date": "2021-10-13T20:17:00.000Z",
        "voteCount": 1,
        "content": "Important\n\nThis article does not apply to Azure SQL Managed Instance. For information about network configuration, see Connect your application to Azure SQL Managed Instance.\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\nAzure Synapse only supports server-level IP firewall rules. It doesn't support database-level IP firewall rules."
      },
      {
        "date": "2020-07-13T02:36:00.000Z",
        "voteCount": 7,
        "content": "The Correct answer is D : \"A SERVER LEVEL IP FIREWALL RULE\""
      },
      {
        "date": "2020-07-05T11:13:00.000Z",
        "voteCount": 2,
        "content": "The answer is correct according to https://docs.microsoft.com/en-us/azure/azure-sql/database/vnet-service-endpoint-rule-overview.\nIn particular there is one point that says: On the firewall, IP address ranges do apply to the following networking items, but virtual network rules do not:\nSite-to-Site (S2S) virtual private network (VPN)\nOn-premises via ExpressRoute\nAnd the brief clearly said not to use Express Route and VPN"
      },
      {
        "date": "2020-06-22T17:46:00.000Z",
        "voteCount": 3,
        "content": "Vpn and Vnet are two different things, The former is a gateway to establish a secure and encrypted connection whereas Vnet is a logical isolation of the Azure cloud dedicated to your subscription and completely private. If 'outside users' implies the user over the public domain then Vnet is the right approach."
      },
      {
        "date": "2020-10-26T06:38:00.000Z",
        "voteCount": 1,
        "content": "How users from on-premises would connect to the database with server-level virtual network rule? Nowhere in the documentation it is said that VNet is a valid configuration to give the on-premises network access to the database? -&gt; D is the answer"
      },
      {
        "date": "2020-04-26T01:29:00.000Z",
        "voteCount": 4,
        "content": "The answer is correct. \nAccording to the scenario: \"Ensure that the analytical data store is accessible only to the company's on-premises network and Azure services.\"\nFor users outside on-premise, they should only access data through other Azure services. In that case, VNET rule should be better choice. It's difficult to use server level firewall rule to manage network access from other Azure services by IP addresses."
      },
      {
        "date": "2020-05-02T07:31:00.000Z",
        "voteCount": 8,
        "content": "To use vNet for on premise users, you need some kind of VPN solution - to join on premise network with Azure network. And as clear stated , no VPN here. So Server level firewall that will whitelist on premise address space will do."
      },
      {
        "date": "2020-05-18T23:12:00.000Z",
        "voteCount": 1,
        "content": "usinga server-level firewall IP rule, we can only restrict or allow specific IP. to ensure org only access we need vnet firewall"
      },
      {
        "date": "2021-01-16T08:28:00.000Z",
        "voteCount": 1,
        "content": "No it isn't. Just allow access from 0.0.0.0 to allow all Azure services."
      },
      {
        "date": "2020-04-21T12:37:00.000Z",
        "voteCount": 9,
        "content": "D should be the clear answer.\nIP firewall rules: Use this feature to explicitly allow connections from a specific IP address, for example from on-premises machines\nVirtual Network firewall rules: Use this feature to allow traffic from a specific Virtual Network within the Azure boundary\nhttps://docs.microsoft.com/en-us/azure/sql-database/sql-database-networkaccess-overview"
      },
      {
        "date": "2020-03-24T13:48:00.000Z",
        "voteCount": 5,
        "content": "Agree, it should be Server Level IP rule, https://docs.microsoft.com/en-us/azure/sql-database/sql-database-networkaccess-overview"
      }
    ],
    "examNameCode": "dp-201",
    "topicNumber": "9"
  },
  {
    "topic": 9,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/59818-exam-dp-201-topic-9-question-2-discussion/",
    "body": "DRAG DROP -<br>You discover that the highest chance of corruption or bad data occurs during nightly inventory loads.<br>You need to ensure that you can quickly restore the data to its state before the nightly load and avoid missing any streaming data.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03774/0021800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03774/0021900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Scenario: Daily inventory data comes from a Microsoft SQL server located on a private network.<br>Step 1: Before the nightly load, create a user-defined restore point<br>SQL Data Warehouse performs a geo-backup once per day to a paired data center. The RPO for a geo-restore is 24 hours. If you require a shorter RPO for geo- backups, you can create a user-defined restore point and restore from the newly created restore point to a new data warehouse in a different region.<br>Step 2: Restore the data warehouse to a new name on the same server.<br>Step 3: Swap the restored database warehouse name.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/sql-data-warehouse/backup-and-restore",
    "votes": [],
    "comments": [
      {
        "date": "2021-08-16T09:04:00.000Z",
        "voteCount": 2,
        "content": "Correct!"
      }
    ],
    "examNameCode": "dp-201",
    "topicNumber": "9"
  },
  {
    "topic": 9,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46893-exam-dp-201-topic-9-question-3-discussion/",
    "body": "What should you recommend using to secure sensitive customer contact information?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tdata sensitivity labels",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcolumn-level security",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\trow-level security",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransparent Data Encryption (TDE)"
    ],
    "answer": "A",
    "answerDescription": "Scenario: Limit the business analysts' access to customer contact information, such as phone numbers, because this type of data is not analytically relevant.<br>Labeling: You can apply sensitivity-classification labels persistently to columns by using new metadata attributes that have been added to the SQL Server database engine. This metadata can then be used for advanced, sensitivity-based auditing and protection scenarios.<br>Incorrect Answers:<br>D: Transparent Data Encryption (TDE) encrypts SQL Server, Azure SQL Database, and Azure Synapse Analytics data files, known as encrypting data at rest.<br>TDE does not provide encryption across communication channels.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/azure-sql/database/data-discovery-and-classification-overview https://docs.microsoft.com/en-us/azure/sql-database/sql-database-security-overview",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-13T07:53:00.000Z",
        "voteCount": 23,
        "content": "https://azure.microsoft.com/en-ca/updates/column-level-security-is-now-supported-in-azure-sql-data-warehouse/\nYou can use CLS to manage user access to specific columns in your tables in a simpler manner, without having to redesign your data warehouse. CLS eliminates the need to maintain access restriction logic away from the data in another application or introduce views for filtering out sensitive columns for a subset of users."
      },
      {
        "date": "2021-04-20T02:28:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/synapse-analytics/sql-data-warehouse/column-level-security"
      },
      {
        "date": "2021-03-23T05:51:00.000Z",
        "voteCount": 11,
        "content": "Wrong answer the correct one is B\nclassification used at the audit level, but does not hide any information."
      },
      {
        "date": "2021-06-06T05:42:00.000Z",
        "voteCount": 1,
        "content": "Should be column level security"
      },
      {
        "date": "2021-04-29T13:53:00.000Z",
        "voteCount": 4,
        "content": "B. column-level security"
      },
      {
        "date": "2021-03-13T07:51:00.000Z",
        "voteCount": 3,
        "content": "Data Discovery &amp; Classification provides basic capabilities for discovering, classifying, labeling, and reporting the sensitive data in your databases.\nI don't see words protect, encrypt..."
      }
    ],
    "examNameCode": "dp-201",
    "topicNumber": "9"
  },
  {
    "topic": 9,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/55630-exam-dp-201-topic-9-question-4-discussion/",
    "body": "DRAG DROP -<br>Which three actions should you perform in sequence to allow FoodPrep access to the analytical data store? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03774/0022100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03774/0022200001.png\" class=\"in-exam-image\">",
    "answerDescription": "Scenario: Litware will build a custom application named FoodPrep to provide store employees with the calculation results of how many prepared food items to produce every four hours.<br>Step 1: Register the FoodPrep application in Azure AD<br>You create your Azure AD application and service principal.<br>Step 2: Create a login for the service principal on the Azure SQL Server<br>Step 3: Create a user-defined database role that grant access.<br>To access resources in your subscription, you must assign the application to a role.<br>You can then assign the required permissions to the service principal.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/active-directory/develop/howto-create-service-principal-portal<br>Design for data security and compliance",
    "votes": [],
    "comments": [
      {
        "date": "2021-06-19T09:19:00.000Z",
        "voteCount": 4,
        "content": "I think it should create the contained user mapping with AAD\nGrant select access to the contained user"
      }
    ],
    "examNameCode": "dp-201",
    "topicNumber": "9"
  }
]