[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106094-exam-az-720-topic-2-question-33-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>A company connects their on-premises network by using Azure VPN Gateway. The on-premises environment includes three VPN devices that separately tunnel to the gateway by using Border Gateway Protocol (BGP).<br><br>A new subnet should be unreachable from the on-premises network.<br><br>You need to implement a solution.<br><br>Solution: Scale the gateway to Generation2.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-04-22T06:03:00.000Z",
        "voteCount": 1,
        "content": "NO.\nAs the question states, BGP is already configured and hence, it makes us believe the SKU is already Gen1 or above supporting BGP. No sense to upgrade given the goal outcome."
      },
      {
        "date": "2023-04-13T00:48:00.000Z",
        "voteCount": 1,
        "content": "Correct!\n\nBGP is not support in Basic SKU and based on the link below, you can use BGP already in Generation 1 VPN\n\nhttps://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-about-vpngateways"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/115921-exam-az-720-topic-2-question-5-discussion/",
    "body": "A company deploys an Azure Virtual Network gateway. The company connects to the gateway by using a site-to-site VPN connection.<br><br>The company's on-premises VPN gateway is reporting an issue with the Phase 1 proposal from the Azure Virtual Network gateway.<br><br>You need to troubleshoot the issue by reviewing the logs.<br><br>Which log should you analyze?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGatewayDiagnosticLog",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tP2SDiagnosticLog",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRouteDiagnosticLog",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIKEDiagnosticLog\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T01:35:00.000Z",
        "voteCount": 1,
        "content": "The Phase 1 proposal of a VPN connection refers to the initial setup in an IKE (Internet Key Exchange) negotiation, which establishes a secure, authenticated communication channel between two parties.\n\nThe IKEDiagnosticLog specifically records information about IKE and AuthIP (Authentication Protocol for Internet Protocol) main mode and quick mode negotiations, and logs errors associated with these processes.\n\nAnalyzing the IKEDiagnosticLog can provide details about what might be wrong with the Phase 1 proposal from the Azure Virtual Network gateway, helping to pinpoint the issue and correct it."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106093-exam-az-720-topic-2-question-31-discussion/",
    "body": "A company configures an Azure DNS delegated domain.<br><br>The DNS zone is marked as degraded.<br><br>You need to determine the root cause for the issue.<br><br>What are two potential causes for the issue? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe zone contains A records.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe zone contains only name server delegation records.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe zone contains only glue records.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe zone contains an MX record.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe zone is empty.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BE",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T01:40:00.000Z",
        "voteCount": 1,
        "content": "B. The zone contains only name server delegation records.\nE. The zone is empty.\n\nAzure DNS health issues might occur due to several reasons. In this case, the DNS zone being marked as \"degraded\" suggests an issue with the configuration.\n\nHere are the two options that could potentially cause this issue:\n\nB. The zone contains only name server delegation records. This suggests that the DNS zone is not hosting any actual records for the domain itself, but is merely delegating to other DNS servers. A DNS zone with only NS records might not be serving its intended purpose, leading Azure to mark it as \"degraded.\"\n\nE. The zone is empty. This means that the DNS zone does not contain any DNS records, including essential ones like A, AAAA, CNAME, MX, or even NS records. An empty DNS zone serves no practical function and would also be marked as \"degraded\" by Azure.\n\nPlease note that the presence of A records, MX records, or glue records (Options A, C, and D) should not cause a DNS zone to be marked as \"degraded.\" In fact, these types of records are typically necessary for a properly functioning DNS zone."
      },
      {
        "date": "2023-04-13T00:41:00.000Z",
        "voteCount": 1,
        "content": "C and E can't be the answer for sure.\nB we cannot know that (no context)\n\nTherefore, A and D could be true in this scenario.\n\nhttps://learn.microsoft.com/en-us/azure/dns/dns-troubleshoot"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104050-exam-az-720-topic-2-question-30-discussion/",
    "body": "A company uses an Azure Virtual Network (VNet) gateway named VNetGW1. VNetGW1 connects to a partner site by using a site-to-site VPN connection with dynamic routing.<br><br>The company observes that the VPN disconnects from time to time.<br><br>You need to troubleshoot the cause for the disconnections.<br><br>What should you verify?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe IP address of the local network gateway matches the partner's VPN device.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe partner's VPN device is enabled for Perfect forward secrecy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe partner's VPN device and VNetGW/1 are configured using the same shared key.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe partner's VPN device is configured for one VPN tunnel per subnet pair."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-27T02:09:00.000Z",
        "voteCount": 5,
        "content": "looks correct\nhttps://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-troubleshoot-site-to-site-disconnected-intermittently (step 7)"
      },
      {
        "date": "2023-04-13T00:36:00.000Z",
        "voteCount": 1,
        "content": "I agree with you."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/115922-exam-az-720-topic-2-question-8-discussion/",
    "body": "A company deploys ExpressRoute.<br><br>The company reports that there is an autonomous system (AS) number mismatch.<br><br>You need to identify the AS number of the circuit.<br><br>Which PowerShell cmdlet should you run?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitStats",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitPeeringConfig\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitRouteTable",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuit"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T01:52:00.000Z",
        "voteCount": 1,
        "content": "B. Get-AzExpressRouteCircuitPeeringConfig\n\nThe Get-AzExpressRouteCircuitPeeringConfig PowerShell cmdlet retrieves the configuration information about the ExpressRoute circuit peerings, including the Autonomous System (AS) number.\n\nThe AS number is a crucial part of the BGP configuration for the ExpressRoute circuit. In case of an AS number mismatch, this command can be used to verify the currently configured AS number on the Azure side. It's important to ensure that the AS number matches on both ends of the ExpressRoute connection to ensure proper routing."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106948-exam-az-720-topic-2-question-10-discussion/",
    "body": "HOTSPOT -<br><br>Case study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br>Background -<br>Contoso, Ltd. is a financial services company based in Boston, MA, United States. Contoso hires you to manage their Azure environment and resolve several operational issues.<br><br>Current environment -<br><br>General -<br>Contoso's Azure environment contains the following resources. All resources are associated with the same subscription and are located in the East US region:<br><img src=\"https://img.examtopics.com/az-720/image5.png\"><br>VPN users use Windows 10 computers with the built-in SSTP VPN client software.<br><br>Recent changes -<br>• You extend the IP address space of VNet1 and create subnets in the new IP address space.<br>• You allow users with computers that run the current version of MacOS to use the built-in VPN client for connecting to the point-to-site VPN.<br>• You enable a service endpoint on contosostorage1 to provide direct access to the storage content from all subnets in VNet1.<br>• You configure all business critical VM workloads to use encryption keys stored in all five key vaults.<br>• You enable a private endpoint on CosmosDB1 to provide direct access to its content from VNet1.<br>• The Contoso's data engineering team was recently tasked with using contosostorage1 blob storage to store database backups.<br>• You develop an automated process to deploy Azure VMs by using Azure Bicep. The passwords for the local administrator accounts are stored in the key vaults. You grant the team that initiates the deployment the Reader RBAC role to all key vaults.<br>• You deploy a multi-tier SharePoint Server environment into a subnet in VNet2. You implement network security groups (NSGs) to allow only specific ports between tiers in the subnet. You configure NSGs to use application security groups (ASGs) when designating the source and destination of cross-tier traffic.<br>• You deploy a secondary multi-tier SharePoint Server environment into a subnet in VNet3.<br>You create the following resources:<br><img src=\"https://img.examtopics.com/az-720/image6.png\"><br><br>Issues -<br><br>DNS issues -<br><br>Reverse DNS lookup -<br>• Reverse DNS lookups from VNet1 return two records. One DNS record is in the format [vmname].contoso.com and the other DNS record is in the format [vmname].internal.cloudapp.net.<br>• Reverse DNS lookups from VNet2 and VNet3 return DNS names in the format [vmname].internal.cloudapp.net.<br>• VMs on each virtual network can only resolve reverse DNS lookup names of VMs on the same virtual network.<br><br>Public DNS lookup -<br>You are notified that name resolution requests for www.contoso.com are using the DNS zone hosted by the DNS registrar where the zone was originally created.<br><br>Connectivity and routing issues -<br><br>Windows VPN -<br>Windows VPN clients cannot connect to Azure VMs on the subnets recently added to VNet1.<br><br>Sales department VPN -<br>The sales department users cannot connect by using the MacOS VPN client.<br><br>Azure Storage connectivity -<br>• Server Message Block (SMB)-mounts from VMs on VNet2 and VNet3 to file shares in contosostorage1 are failing.<br>• Azure Storage Explorer connections using access keys from on-premises computers to contosostorage1 are failing.<br><br>Cosmos DB connectivity -<br>You observe that connections to CosmosDB1 from the on-premises environment are using the CosmosDB1 public endpoint. However, connections to CosmosDB1 from the on-premises environment should be using the private endpoint. You verify that connections to CosmosDB1 from VNet1 are using the private endpoint.<br><br>VM1 routing -<br>Internet traffic from VM1 is routed directly to the Internet.<br><br>VM2 routing -<br>After configuring RT12 to route internet traffic from VM1 through VM2, traffic reaches VM2 but then it is dropped. You verify that routing for VM2 is configured correctly.<br><br>Azure and SharePoint issues -<br><br>Azure Key Vault -<br>Access attempts to Azure Key Vault by VM workloads intermittently fail with the HTTP response code 429.<br><br>SharePoint in VNet2 -<br>SharePoint traffic between tiers is blocked by NSGs which is causing application failures.<br><br>SharePoint in VNet3 -<br>ASGs used in the NSG rules associated with the VNet2 subnet are not visible when configuring NSG rules in VNet3.<br><br>Permission issues -<br><br>Data engineering team -<br>The Contoso data engineering team is unable to view the contosostorage1 account in the Azure portal.<br><br>Azure VM deployment -<br>Azure VM deployments that use Azure Bicep are failing with an authorization error. The error indicates there are insufficient access permissions to retrieve the password of the local administrator account in the key vault.<br><br>Requirements -<br><br>DNS requirements -<br><br>Reverse DNS lookup -<br>You must identify the reason for the differences between reverse DNS lookup results in the hub and the spoke networks and recommend a solution that provides the reverse DNS lookup in the format [vmname].contoso.com for all three virtual networks.<br><br>Public DNS lookup -<br>You must verify that the Azure public DNS zone is currently used to resolve DNS name requests for www.contoso.com and recommend a solution that uses the Azure public DNS zone.<br>Connectivity and routing requirements<br><br>Windows VPN -<br>You must verify if VPN client connectivity issues are related to routing and recommend a solution.<br><br>MacOS VPN -<br>You must verify if Remote ID and Local ID VPN client settings on the MacOS devices are properly configured.<br><br>Azure Storage connectivity -<br>You must resolve the issues with the SMB-mounts from VNet2 and VNet3 as well as ensure that on-premises connections to contosostorage1 are successful. Your solution must ensure that, whenever possible, network traffic does not traverse public internet.<br><br>Cosmos DB connectivity -<br>You must verify if on-premises connections to CosmosDB1 are using the CosmosDB1 public endpoint. You need to recommend a solution if connections are not using private endpoints.<br><br>VM1 routing -<br>RT12 must be configured to route internet traffic from VM1 through VM2.<br><br>VM2 routing -<br>VM2 must be configured to route internet traffic from VM1.<br>Azure and SharePoint requirements<br><br>Azure Key Vault -<br>You must identify the reason for the failures and recommend a solution.<br><br>SharePoint in VNet2 -<br>You need to identify the NSG rules that are blocking traffic. You also need to collect the data that is blocked by the NSG rules. The solution must minimize administrative effort.<br><br>SharePoint in VNet3 -<br>You need to create NSG rules for VNet3 with the same name, source and destination settings that are configured for the NSG associated with VNet2. The solution must minimize administrative effort.<br><br>Permission requirements -<br><br>Azure Bicep -<br>You must identify the minimum privileges required to provision Azure VMs using Azure Bicep.<br><br>Data engineering team -<br>You must identify the role-based access control (RBAC) roles required by the data engineering team to access the storage account by using Azure portal. They also require permission to backup and restore blobs in contosostorage1.<br><br>You need to troubleshoot the sales department issues.<br>How should you configure the system? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image9.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image10.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-21T13:02:00.000Z",
        "voteCount": 1,
        "content": "Correct! https://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-troubleshoot-point-to-site-osx-ikev2#VPNClient"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/92082-exam-az-720-topic-2-question-13-discussion/",
    "body": "HOTSPOT -<br>A company deploys an Azure Firewall. The company reports the following log entry:<br><img src=\"https://img.examtopics.com/az-720/image22.png\"><br>For each of the following questions, select Yes or No.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image23.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image24.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-05-03T05:48:00.000Z",
        "voteCount": 1,
        "content": "I would say answer is correct based upon this and similar articles. It's to do with the web category logging which isn't a feature listed for standard.\n\nhttps://github.com/MicrosoftDocs/azure-docs/blob/main/articles/firewall/premium-features.md"
      },
      {
        "date": "2023-04-19T04:40:00.000Z",
        "voteCount": 1,
        "content": "I think the last question should be yes. In the properties it says \"Web category: SearchEnginesAndPortals\" and web categories is a premium only feature."
      },
      {
        "date": "2023-04-22T02:49:00.000Z",
        "voteCount": 2,
        "content": "Azure FW standard also has Web Categories. so, I still stick to the NNN as the answer. :)\n\nhttps://learn.microsoft.com/en-us/azure/firewall/features"
      },
      {
        "date": "2023-04-17T05:22:00.000Z",
        "voteCount": 1,
        "content": "Should be NNN in my opinion.\nAzFW standard can also be used to generate Application Rule Log data - just checked on a lab environment."
      },
      {
        "date": "2023-03-12T16:31:00.000Z",
        "voteCount": 3,
        "content": "NNN\nApplicationRuleLog is available with Standard/Basic"
      },
      {
        "date": "2023-04-13T00:22:00.000Z",
        "voteCount": 2,
        "content": "I agree. I couldn't find specifically that it can only be done by Azure Premium Firewall.\n\nUseful source to check:\n\nhttps://learn.microsoft.com/en-us/azure/firewall/firewall-structured-logs"
      },
      {
        "date": "2022-12-19T06:15:00.000Z",
        "voteCount": 1,
        "content": "Seems okay"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/93642-exam-az-720-topic-2-question-14-discussion/",
    "body": "A company hosts a network virtual appliance (NVA) and Azure Route Server in different virtual networks (VNets). Border Gateway Protocol (BGP) peering is enabled between the NVA and the route server.<br>The company discovers that the NVA loses internet connectivity after it advertises the default route to the route server.<br>You need to resolve the problem with the NVA.<br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a unique autonomous system number (ASN) on the NV",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a user-defined route on the NVA subnet.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMove the route server to the same VNet as the NVA.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a public IP address on the route server."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T02:45:00.000Z",
        "voteCount": 1,
        "content": "The NVA losing internet connectivity after advertising the default route to the Route Server could be due to a routing loop or misconfigured routes. Since Azure Route Server automatically manages and propagates routes learned from the NVA to the connected subnets via BGP, it's crucial that the NVA's subnet has the correct routes defined to maintain internet connectivity."
      },
      {
        "date": "2023-01-06T11:16:00.000Z",
        "voteCount": 2,
        "content": "B is the right answer."
      },
      {
        "date": "2023-01-03T02:22:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/route-server/troubleshoot-route-server"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/92278-exam-az-720-topic-2-question-15-discussion/",
    "body": "HOTSPOT -<br>A company implements Windows and Linux VMs in an Azure Virtual Network. The company plans to apply routing changes to the virtual network.<br>You need to determine the impact of these changes on network latency affecting applications that use TCP and UDP traffic. The solution must provide the highest level of accuracy.<br>Which tools should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image25.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image26.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-02-24T13:02:00.000Z",
        "voteCount": 2,
        "content": "The given answer is correct according to the following article:\nhttps://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-test-latency#tools-for-testing"
      },
      {
        "date": "2023-01-03T04:12:00.000Z",
        "voteCount": 2,
        "content": "It is NTTTCP , not NTTCP. So, SOCKPERF should be right answer.                                                          https://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-bandwidth-testing            https://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-test-latency#test-vms-that-are-running-windows"
      },
      {
        "date": "2022-12-20T17:32:00.000Z",
        "voteCount": 1,
        "content": "SockPerf realiza o teste de conexão via API, questão não está  informado API, a resposta correta é nttcp"
      },
      {
        "date": "2022-12-20T17:34:00.000Z",
        "voteCount": 1,
        "content": "nttcp: https://linux.die.net/man/1/nttcp\nSockPerf: https://docs.nvidia.com/networking/pages/viewpage.action?pageId=19800142"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107227-exam-az-720-topic-2-question-16-discussion/",
    "body": "HOTSPOT -<br>A company creates an Azure resource group named RG1. RG1 has an Azure SQL Database logical server named sqlsvr1 that hosts the following resources:<br><img src=\"https://img.examtopics.com/az-720/image27.png\"><br>An administrator grants a user named User1 the Reader RBAC role in RG1. The administrator grants User2 the Contributor role in sqlsvr1.<br>User1 reports that they can connect to SQLDB1 from the IP address 155.127.95.212. User1 cannot connect to SQLDB2. User2 can connect to both SQLDB1 and SQLDB2 from the IP address 121.19.27.18. Both users can successfully connect to SQLDB1 and SQLDB2 from VM1.<br>You are helping the administrator troubleshoot the issue. You run the following PowerShell command:<br>Get-AzSqlServerFirewallRule -ResourceGroupName 'RG1' -ServerName 'sqlsvr1'<br>The following output displays:<br><br>ResourceGroupName: RG1 -<br><br>ServerName: sqlsvr1 -<br><br>StartIpAddress: 0.0.0.0 -<br><br>EndIpAddress: 0.0.0.0 -<br><br>FirewallRuleName: Rule01 -<br><br>ResourceGroupName: RG1 -<br><br>ServerName: sqlsvr1 -<br><br>StartIpAddress: 72.225.0.0 -<br><br>EndIpAddress: 72.225.255.255 -<br><br>FirewallRuleName: Rule02 -<br>You need to identify the cause for the reported issue and resolve User1’s issues. The solution must satisfy the principle of least privilege.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point. A company manages a solution that uses Azure Functions.<br><img src=\"https://img.examtopics.com/az-720/image28.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image29.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-21T02:54:00.000Z",
        "voteCount": 1,
        "content": "Use the Set-AzSqlServerFirewallRule cmdlet to modify the existing firewall rule or create a new firewall rule on sqlsvr1 to allow User1's IP address. Given the principle of least privilege, you should not give more access than necessary. Therefore, create a new rule that only allows User1's IP address, rather than modifying an existing rule to include a broader range."
      },
      {
        "date": "2023-07-21T02:59:00.000Z",
        "voteCount": 1,
        "content": "In my understanding creating or modifying SQL users and permissions using Transact-SQL won't resolve the connectivity issue, but feel free to prove me wrong."
      },
      {
        "date": "2023-04-23T10:19:00.000Z",
        "voteCount": 1,
        "content": "I believe given answers appear to be correct.\n\nThe Server Level FW allows access to both DBs, however since only DB1 can successfully be accessed by both users from different IPs but DB2 has issues when being accessed from IP 155.127.95.212 (regardless of user if you ask me - the RBAC role extra info seems to be just to throw us off), I think the issue is on Database level FW.\n\nMore can be read here:\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/firewall-configure?view=azuresql#use-transact-sql-to-manage-ip-firewall-rules\n\nttps://learn.microsoft.com/en-us/azure/azure-sql/database/firewall-configure?view=azuresql#database-level-ip-firewall-rules\n\n\"If you specify an IP address range in the database-level IP firewall rule that's outside the range in the server-level IP firewall rule, only those clients that have IP addresses in the database-level range can access the database.\""
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/93686-exam-az-720-topic-2-question-17-discussion/",
    "body": "A company manages a solution that uses Azure Functions.<br>A function returns the following error. Azure Functions Runtime is unreachable.<br>You need to troubleshoot the issue.<br>What are two possible causes of the issue? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe function key was deleted.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe storage account application settings were deleted.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe execution quota is full.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe company did not configure a timer trigger.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe storage account for the function was deleted.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "BE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BE",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T03:01:00.000Z",
        "voteCount": 1,
        "content": "B. The storage account application settings were deleted - The Azure Functions runtime requires certain application settings, including a reference to the Azure Storage account it uses for operations like managing triggers and logging function executions. If these settings were inadvertently deleted, the Functions runtime may not be able to operate properly.\n\nE. The storage account for the function was deleted - Azure Functions requires an Azure Storage account, which it uses for operations such as managing triggers and logging function executions. If the associated storage account is deleted, the Azure Functions Runtime would be unable to operate, leading to the error message you're seeing."
      },
      {
        "date": "2023-04-19T04:48:00.000Z",
        "voteCount": 1,
        "content": "Not sure about this question honestly. According to the document we have 3 correct answers not just 2. Daily execution quota is also a correct answer"
      },
      {
        "date": "2023-04-22T03:04:00.000Z",
        "voteCount": 1,
        "content": "yeah, I tend to agree with you, though the quota issue is only if the daily execution quota is configured (and, yes, it's not mentioned that this quota is configured or not), otherwise you wouldn't have any issues (if not config), but without a storage account or storage app settings, for sure the app won't work. I would still go with BE if this question should pop up. :)"
      },
      {
        "date": "2023-04-17T05:42:00.000Z",
        "voteCount": 1,
        "content": "I agree with BE after reading the same mentioned article.\n\nhttps://learn.microsoft.com/en-us/azure/azure-functions/functions-recover-storage-account#storage-account-was-deleted"
      },
      {
        "date": "2023-02-06T23:41:00.000Z",
        "voteCount": 3,
        "content": "Based on this reference B &amp; E : https://learn.microsoft.com/en-us/azure/azure-functions/functions-recover-storage-account"
      },
      {
        "date": "2023-01-03T04:14:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/azure-functions/functions-recover-storage-account"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/93688-exam-az-720-topic-2-question-18-discussion/",
    "body": "HOTSPOT -<br>A company named Contoso connects its on-premises resources to Azure by using ExpressRoute.<br>An administrator reports that the circuit is in a failed state.<br>You need to resolve the issue.<br>How should you complete the PowerShell commands? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image30.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image31.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-03T04:34:00.000Z",
        "voteCount": 3,
        "content": "$ckt = Get-AzExpressRouteCircuit -Name \"ExpressRouteARMCircuit\" -ResourceGroupName \"ExpressRouteResourceGroup\"\n\nSet-AzExpressRouteCircuit -ExpressRouteCircuit $ckt\n\nhttps://learn.microsoft.com/en-us/azure/expressroute/reset-circuit"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/91192-exam-az-720-topic-2-question-19-discussion/",
    "body": "A company uses an Azure VPN gateway to connect to their on-premises environment.<br>The company's on-premises VPN gateway is used by several services. One service is experiencing connectivity issues.<br>You need to minimize downtime for all services and resolve the connectivity issue.<br>Which three actions should you perform? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the hashing algorithm to be the same on both gateways.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the pre-shared key to be the same on the Azure VPN gateway and the on-premises VPN gateways.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the pre-shared key to be different on the Azure VPN gateway and the on-premises VPN gateways.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the hashing algorithm to be different on both gateways.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReset the VPN connection.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReset the VPN gateway.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "ABF",
    "answerDescription": "",
    "votes": [
      {
        "answer": "ABF",
        "count": 3,
        "isMostVoted": true
      },
      {
        "answer": "ABE",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-12-12T06:22:00.000Z",
        "voteCount": 7,
        "content": "my guess would be ABE"
      },
      {
        "date": "2023-07-21T03:04:00.000Z",
        "voteCount": 1,
        "content": "A. Configure the hashing algorithm to be the same on both gateways. - For a successful VPN tunnel, both ends of the tunnel should have the same settings including the hashing algorithm. If the hashing algorithms are not matching, it could cause connectivity issues.\n\nB. Configure the pre-shared key to be the same on the Azure VPN gateway and the on-premises VPN gateways. - The pre-shared key is used to authenticate the two ends of the VPN tunnel. If the keys don't match, it will cause connectivity problems.\n\nE. Reset the VPN connection. - Resetting the VPN connection can help clear any transient issues that might be causing connectivity problems. It is a non-disruptive action as it does not affect the underlying gateway and hence the other services using the gateway. This should be done after confirming correct configurations (i.e., pre-shared key and hashing algorithm).\n\nOption F, Reset the VPN gateway, should be avoided unless absolutely necessary as it can cause a temporary outage and affect all services using the gateway, not just the one experiencing issues."
      },
      {
        "date": "2023-04-17T06:02:00.000Z",
        "voteCount": 4,
        "content": "I would go with ABE if I want to have NO downtime to the other services. But if it be OK to have some minimal downtime, then I could go with ABF.\n\nA - Make sure the hash encryption is the same and correct on both ends\nB - Make sure the IKE Passphrase is the same and correct on both VPNGW and onprem FW/device\nE - Reset just the faulty/affected connection\n\nF- This would restart the active instance on the VPN GW and trigger the maintenance process of the second one to take over - something like 1-5 mins downtime.\n\nChoosing E will not impact the other connections and it should solve the issue with no impact to the other already established connections - and if not, then I would Restart the VPNGW.\n\nChoosing F to RESET the VPN GW itself - that will affect all connections, hence creating downtime for the ones that work. \n\nNot sure what MS really wants here, it's a tricky one. Dunno really what I would pick at the exam haha :) but I tend to go with ABE."
      },
      {
        "date": "2023-02-06T23:45:00.000Z",
        "voteCount": 3,
        "content": "https://learn.microsoft.com/en-us/azure/vpn-gateway/reset-gateway#reset-a-gateway\n\nVerify the following items before resetting your gateway:\n\n* The Internet IP addresses (VIPs) for both the Azure VPN gateway and the on-premises VPN gateway are configured correctly in both the Azure and the on-premises VPN policies.\n\n* The pre-shared key must be the same on both Azure and on-premises VPN gateways.\n\n*If you apply specific IPsec/IKE configuration, such as encryption, hashing algorithms, and PFS (Perfect Forward Secrecy), ensure both the Azure and on-premises VPN gateways have the same configurations."
      },
      {
        "date": "2023-04-13T00:29:00.000Z",
        "voteCount": 1,
        "content": "I agree on this one."
      },
      {
        "date": "2023-01-03T04:53:00.000Z",
        "voteCount": 1,
        "content": "When you reset the gateway, it reboots the gateway, and then reapplies the cross-premises configurations to it. So F is not answer.\n https://learn.microsoft.com/en-us/azure/vpn-gateway/reset-gateway"
      },
      {
        "date": "2023-01-08T09:14:00.000Z",
        "voteCount": 2,
        "content": "there are two gateways always at backend, even if you reset, it doesnt reboot both but just one. If you need to reboot both then you need to two resets successively"
      },
      {
        "date": "2023-02-01T22:56:00.000Z",
        "voteCount": 1,
        "content": "@Contactfornitish that is correct. per the document shared above, When you issue the command to reset the gateway, the current active instance of the Azure VPN gateway is rebooted immediately. There will be a brief gap during the failover from the active instance (being rebooted), to the standby instance. The gap should be less than one minute.\n\nIf the connection isn't restored after the first reboot, issue the same command again to reboot the second VM instance (the new active gateway). If the two reboots are requested back to back, there will be a slightly longer period where both VM instances (active and standby) are being rebooted. This will cause a longer gap on the VPN connectivity, up to 30 to 45 minutes for VMs to complete the reboots.\n\nResetting the gateway once will only reboot the instance which could be up to a minute."
      },
      {
        "date": "2023-02-01T22:57:00.000Z",
        "voteCount": 1,
        "content": "BEF are the correct answers."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107194-exam-az-720-topic-2-question-20-discussion/",
    "body": "A company has two virtual networks (VNets) that are configured to use peering. Several Azure virtual machines are connected to each network. An on-premises network is connected to one of the VNets by using Azure VPN Gateway.<br>An administrator reports that communication between applications across the VNets is failing.<br>You need to troubleshoot the issue.<br>Which two features can you use to achieve the goal? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIP flow verify\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNext hop",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzureNetworkWatchExtension",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork Watcher topology",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNSG flow logs\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AB",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AB",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "AE",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-14T13:09:00.000Z",
        "voteCount": 1,
        "content": "IP flow verify and Next hop to check security rules and routing."
      },
      {
        "date": "2023-05-24T12:45:00.000Z",
        "voteCount": 1,
        "content": "This should be 'AB'"
      },
      {
        "date": "2023-05-03T07:58:00.000Z",
        "voteCount": 1,
        "content": "AC\nhttps://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-troubleshoot-peering-issues#troubleshoot-a-connectivity-issue-between-two-peered-virtual-networks\n\nUse \"Connection Troubleshoot\" (C) and \"IP flow verify\" (A) from the source VM to the destination VM to determine whether there is an NSG or UDR that is causing interference in traffic flows.\n\nhttps://learn.microsoft.com/en-us/azure/network-watcher/network-watcher-connectivity-overview\n\n\"The connection troubleshoot feature of Azure Network Watcher\" (C)"
      },
      {
        "date": "2023-07-14T13:07:00.000Z",
        "voteCount": 1,
        "content": "C is AzureNetworkWatchExtension which is the VM extension used by some Network Watcher features. Connection troubleshoot is not among the available answers!"
      },
      {
        "date": "2023-04-23T07:49:00.000Z",
        "voteCount": 1,
        "content": "I going with AE here.\n\nI would have considered looking into the Next Hop effective routes if the faulty communication would have been between Azure and onprem but since it's between 2 peered VNETs, the default routing takes precedence anyway - unless we have UDRs but that is not mentioned. \n\nChecking packet behavior with IP Flow and traffic access logs from NSG flow logs would be the best approach here imho."
      },
      {
        "date": "2023-07-14T13:08:00.000Z",
        "voteCount": 1,
        "content": "The questions mentions failing communication, it's much easier to start with IP flow verify and Next hop to check security rules and routing."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/93690-exam-az-720-topic-2-question-21-discussion/",
    "body": "HOTSPOT -<br>A company connects an on-premises network to an Azure virtual network by using ExpressRoute.<br>The ExpressRoute connection is experiencing higher than normal latency.<br>You need to confirm the traffic flow.<br>How should you complete the PowerShell command? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image32.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image33.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-03T05:05:00.000Z",
        "voteCount": 3,
        "content": "The Get-AzExpressRouteCircuitStat cmdlet retrieves traffic statistics for an ExpressRoute circuit. The statistics include the number of bytes sent and received over both the primary and secondary routes.\nhttps://learn.microsoft.com/en-us/powershell/module/az.network/get-azexpressroutecircuitstat?view=azps-9.2.0"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/98267-exam-az-720-topic-2-question-22-discussion/",
    "body": "A company deploys an ExpressRoute circuit.<br>You need to verify accepted peering routes from the ExpressRoute circuit.<br>Which PowerShell cmdlet should you run?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuit",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitRouteTable\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitStats",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitPeeringConfig",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCrossConnectionPeering"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 6,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T03:13:00.000Z",
        "voteCount": 1,
        "content": "This command returns the route table associated with the specified Azure ExpressRoute circuit peering. It shows all the routes learned from the on-premises network."
      },
      {
        "date": "2023-04-23T10:24:00.000Z",
        "voteCount": 1,
        "content": "Yup, B it is\n\nhttps://learn.microsoft.com/en-us/powershell/module/az.network/get-azexpressroutecircuitroutetable?view=azps-9.3.0#description"
      },
      {
        "date": "2023-02-06T23:50:00.000Z",
        "voteCount": 4,
        "content": "Looks ok :\nhttps://learn.microsoft.com/en-us/powershell/module/az.network/get-azexpressroutecircuitroutetable?view=azps-9.3.0#description\n\nThe Get-AzExpressRouteCircuitRouteTable cmdlet retrieves a detailed route table of an ExpressRoute circuit. The route table will show all routes or can be filtered to show routes for a specific peering type. You can use the route table to validate your peering configuration and connectivity"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/94025-exam-az-720-topic-2-question-23-discussion/",
    "body": "HOTSPOT -<br>A company uses public Azure DNS zones.<br>The company reports DNS record creation and name resolution issues.<br>You need to troubleshoot the issues.<br>What are the causes of the issues? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image34.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image35.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-21T03:16:00.000Z",
        "voteCount": 1,
        "content": "Issue 1: Company cannot create a DNS zone.\n\nPossible Cause: The company reached the max number of DNS zones.\n\nAzure DNS has some limits including the number of DNS zones you can create. If this limit has been reached, it can prevent the creation of a new DNS zone. You can request to increase these limits by contacting Azure support.\n\nIssue 2: Company cannot create a DNS record.\n\nPossible Cause: Cname conflict with existing record set.\n\nA CNAME record can't coexist with any other data. In other words, if a CNAME record is present at a node, no other data can exist there, including MX records, TXT records, or even NS records. If there is a conflict with an existing record set, it can prevent the creation of a new CNAME record."
      },
      {
        "date": "2023-02-06T23:52:00.000Z",
        "voteCount": 3,
        "content": "https://learn.microsoft.com/en-us/azure/dns/dns-troubleshoot#i-cant-create-a-dns-zone\nYou may see an error \"You have reached or exceeded the maximum number of zones in subscription {subscription ID}.\" Either use a different Azure subscription, delete some zones, or contact Azure Support to raise your subscription limit\n\nhttps://learn.microsoft.com/en-us/azure/dns/dns-troubleshoot#i-cant-create-a-dns-zone\nDo you have a CNAME conflict? The DNS standards don't allow a CNAME record with the same name as a record of any other type. If you have an existing CNAME, creating a record with the same name of a different type fails. Likewise, creating a CNAME fails if the name matches an existing record of a different type. Remove the conflict by removing the other record or choosing a different record name."
      },
      {
        "date": "2023-01-05T06:55:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/dns/dns-troubleshoot#i-cant-create-a-dns-zone"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/98270-exam-az-720-topic-2-question-24-discussion/",
    "body": "A company plans to implement ExpressRoute by using the provider connectivity model.<br>The company creates an ExpressRoute circuit. You are unable to connect to resources through the circuit.<br>You need to determine the provisioning state of the service provider.<br>Which PowerShell cmdlet should you run?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitPeeringConfig",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitConnectionConfig",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitRouteTable",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuit\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-AzExpressRouteCircuitARPTable"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T03:19:00.000Z",
        "voteCount": 1,
        "content": "To determine the provisioning state of the service provider, you should run the Get-AzExpressRouteCircuit PowerShell cmdlet. This cmdlet gets one or more ExpressRoute circuits. Among other details, it provides the status of the circuit, including the provider's provisioning state."
      },
      {
        "date": "2023-04-23T10:24:00.000Z",
        "voteCount": 1,
        "content": "D is correct"
      },
      {
        "date": "2023-02-06T23:56:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/powershell/module/az.network/get-azexpressroutecircuit?view=azps-9.3.0#example-1-get-the-expressroute-circuit\n\nThe output of command Get-AzExpressRouteCircuit looks like this :\nName                             : test\nResourceGroupName                : testrg\nLocation                         : southcentralus\nId                               : /subscriptions/00000000-0000-0000-0000-000000000000/resourceGroups/testrg/pro\n                                   viders/Microsoft.Network/expressRouteCircuits/test\nEtag                             : W/\"00000000-0000-0000-0000-000000000000\"\nProvisioningState                : Succeeded"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107195-exam-az-720-topic-2-question-25-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>A company connects their on-premises network by using Azure VPN Gateway. The on-premises environment includes three VPN devices that separately tunnel to the gateway by using Border Gateway Protocol (BGP).<br>A new subnet should be unreachable from the on-premises network.<br>You need to implement a solution.<br>Solution: Configure a route table with route propagation disabled.<br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T03:23:00.000Z",
        "voteCount": 1,
        "content": "By disabling BGP route propagation on the route table associated with the subnet, the BGP routes advertised from your on-premises network via the VPN connection will not be propagated to this subnet. This means the new subnet will not have a route back to the on-premises network and will therefore be unreachable from the on-premises network."
      },
      {
        "date": "2023-04-23T07:59:00.000Z",
        "voteCount": 1,
        "content": "This is YES if the RT is configured with route propagation disabled on the new subnet.\n\nBut NO if the RT is configured with route propagation disabled on the VPNGW subnet\n\nNot enough info to really say YES or NO - I hope this doesn't show up on the exam. :))"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/115925-exam-az-720-topic-2-question-26-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>A company connects their on-premises network by using Azure VPN Gateway. The on-premises environment includes three VPN devices that separately tunnel to the gateway by using Border Gateway Protocol (BGP).<br>A new subnet should be unreachable from the on-premises network.<br>You need to implement a solution.<br>Solution: Configure subnet delegation.<br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T03:24:00.000Z",
        "voteCount": 1,
        "content": "Subnet delegation in itself does not control or influence reachability or connectivity to/from the on-premises network."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/102488-exam-az-720-topic-2-question-27-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>A company connects their on-premises network by using Azure VPN Gateway. The on-premises environment includes three VPN devices that separately tunnel to the gateway by using Border Gateway Protocol (BGP).<br>A new subnet should be unreachable from the on-premises network.<br>You need to implement a solution.<br>Solution: Disable peering on the virtual network.<br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T03:25:00.000Z",
        "voteCount": 1,
        "content": "Disabling peering on the virtual network would stop all communication between the peered networks, which could affect more than just the one new subnet you want to isolate."
      },
      {
        "date": "2023-04-17T06:40:00.000Z",
        "voteCount": 2,
        "content": "this question makes no sense! \n\nPeering from where? Are we imagining there are multiple VNETs here connected to the VPNGW VNET? If yes, why not mentioned and what topology exactly and also where is that new subnet created? \n\nThis question needs reported/flagged if it should be received in the exam in my opinion. I may be wrong, but it doesn't makes sense to me."
      },
      {
        "date": "2023-04-23T10:30:00.000Z",
        "voteCount": 1,
        "content": "If the new subnet would be created in a new VNET peered to the VNET where the subnet Gateway is, then yes, disabling the peering would achieve the goal - YES\n\nHowever, this is just guessing/imagining without more info about the design context."
      },
      {
        "date": "2023-03-13T02:52:00.000Z",
        "voteCount": 2,
        "content": "this is incorrect - the correct answer is not listed in this dump.\nScale the gateway to Generation2"
      },
      {
        "date": "2023-07-14T16:46:00.000Z",
        "voteCount": 2,
        "content": "You can't scale a gateway from Gen1 to Gen2. To change the generation, you need to delete and recreate it."
      },
      {
        "date": "2023-04-13T00:34:00.000Z",
        "voteCount": 1,
        "content": "You are right. The question would be as follows:\n\nA company connects their on-premises network by using Azure VPN Gateway. The on-premises\nenvironment includes three VPN devices that separately tunnel to the gateway by using Border Gateway\nProtocol (BGP).\nA new subnet should be unreachable from the on-premises network.\nYou need to implement a solution.\nSolution: Scale the gateway to Generation2.\nDoes the solution meet the goal?\nA. Yes\nB. No"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/115926-exam-az-720-topic-2-question-28-discussion/",
    "body": "A company has an Azure Active Directory (Azure AD) tenant. The company deploys Azure AD Connect to synchronize users from an Active Directory Domain Services (AD DS).<br><br>The synchronization of a user object is failing.<br><br>You need to troubleshoot the failing synchronization by using a built-in Azure AD Connect troubleshooting task.<br><br>Which two pieces of information should you collect before you start troubleshooting? Each correct answer presents part of the solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tObject common name",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tObject distinguished name\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure AD connector name",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAD connector name",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tObject globally unique identifier\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "BD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BE",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T03:28:00.000Z",
        "voteCount": 1,
        "content": "B. Object distinguished name - The distinguished name (DN) is a critical piece of information as it uniquely identifies the object in the Active Directory hierarchy. It includes the name of the domain where the object resides, the organizational unit (OU) that contains the object, and the common name (CN) of the object itself.\n\nE. Object globally unique identifier - The globally unique identifier (GUID) is a unique reference number used as an identifier in software. In the context of AD DS, the GUID is a unique value that remains with the object for its entire lifespan, even when the object is moved or renamed.\n\nI think D is wrong because the AD Connector name (Option D) is not usually required when troubleshooting a specific object synchronization issue in Azure AD Connect. Typically, issues with a specific object (like a user or a group) are investigated based on information related to the object itself (like its Distinguished Name or its GUID), rather than the name of the connector."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "2"
  }
]