[
  {
    "topic": 14,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16757-exam-dp-201-topic-14-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to design the encryption strategy for the tagging data and customer data.<br>What should you recommend? To answer, drag the appropriate setting to the correct drop targets. Each source may be used once, more than once, or not at all.<br>You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03774/0024700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03774/0024700002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "All cloud data must be encrypted at rest and in transit.<br>Box 1: Transparent data encryption<br>Encryption of the database file is performed at the page level. The pages in an encrypted database are encrypted before they are written to disk and decrypted when read into memory.<br><br>Box 2: Encryption at rest -<br>Encryption at Rest is the encoding (encryption) of data when it is persisted.<br>Reference:<br>https://docs.microsoft.com/en-us/sql/relational-databases/security/encryption/transparent-data-encryption?view=sql-server-2017 https://docs.microsoft.com/en-us/azure/security/azure-security-encryption-atrest<br>Design for data security and compliance",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-16T11:10:00.000Z",
        "voteCount": 86,
        "content": "Tagging data - Cosmos DB - encryption at resr\nCustomer data - SQL DWH - TDE / SSL (SSL enabled by default)"
      },
      {
        "date": "2020-06-10T01:55:00.000Z",
        "voteCount": 2,
        "content": "I agree with the data storage choices but not with the encryption methods because in the Security requirements:\nAll cloud data must be encrypted at rest and in transit.\n-&gt; Tagging data requires TDE and (*processed*) Customer data  requires Encryption at rest: So the answer is correct!\nWe only need Encryption at rest because the solution component=processed customer data and not all customer data,otherwhise I'd choose TDE"
      },
      {
        "date": "2020-12-06T06:53:00.000Z",
        "voteCount": 1,
        "content": "Cane explain why tagging data - Cosmos DB requires encryption at rest?"
      },
      {
        "date": "2021-05-22T21:24:00.000Z",
        "voteCount": 3,
        "content": "cosmos db does not have TDE, so encryption at rest"
      },
      {
        "date": "2021-06-23T01:22:00.000Z",
        "voteCount": 2,
        "content": "CosmosDB (Here, document db) - Does not support TDE"
      },
      {
        "date": "2021-06-23T01:24:00.000Z",
        "voteCount": 1,
        "content": "as per requirement, \"The tags must be stored in a document database\""
      },
      {
        "date": "2021-05-23T01:13:00.000Z",
        "voteCount": 3,
        "content": "I am agree with you totally, thanks!!"
      },
      {
        "date": "2020-08-02T03:14:00.000Z",
        "voteCount": 36,
        "content": "I was impressed by Dp-200 model questions and quality but the answers for DP-201 questions by examtopics is not even average.. most of the answers are creating confusion when checked the discussions and sometimes the discussions are really useful like below.. one with real subject only can crack these questions.."
      },
      {
        "date": "2020-08-27T16:27:00.000Z",
        "voteCount": 1,
        "content": "I totally agree with krisspark"
      },
      {
        "date": "2021-06-20T09:43:00.000Z",
        "voteCount": 1,
        "content": "I believe this questions and answers are too old and almost irrelevant. The current Microsoft Docs says \" With the release of encryption at rest for Cosmos DB, all your databases, media attachments, and backups are encrypted. Your data is now encrypted in transit (over the network) and at rest (nonvolatile storage), giving you end-to-end encryption.\" Meaning you don't need to do anything to encrypt data at rest and in transit for Cosmos DB."
      },
      {
        "date": "2021-06-12T19:46:00.000Z",
        "voteCount": 1,
        "content": "Answer is right. Combo DB gas TDE enabled by default. On synapse, we have to explicitly enable encryption at rest. It is not enable by default."
      },
      {
        "date": "2021-02-11T00:45:00.000Z",
        "voteCount": 1,
        "content": "in essence TDE is Encryption at rest. SQL has this option by default (https://docs.microsoft.com/en-us/azure/azure-sql/database/transparent-data-encryption-tde-overview?tabs=azure-portal).\n In cosmos Al data is by default encrypted at rest  ( but I do not think this is referred to as TDE: https://docs.microsoft.com/en-us/azure/cosmos-db/database-encryption-at-rest)\nSo The answers should be Reversed: Cosmos : Encrypt at rest; Sql: TDE"
      },
      {
        "date": "2020-12-24T19:33:00.000Z",
        "voteCount": 3,
        "content": "There seems to be some issues with the answers. Firstly, all user data stored in Azure Cosmos DB is encrypted at rest and in transport by default as per the link https://docs.microsoft.com/en-us/azure/cosmos-db/database-encryption-at-rest, so I believe we really don't need to do anything, and if we have to select an answer, it should be Encryption at rest. Secondly, for Azure SQL DB or managed instance, TDE is enabled by default to encrypt data at rest, so we need TLS to encrypt data in transit, but TLS is not in the selection list."
      },
      {
        "date": "2020-12-10T04:41:00.000Z",
        "voteCount": 2,
        "content": "Reverse/flip the options and it is correct"
      },
      {
        "date": "2020-11-05T03:33:00.000Z",
        "voteCount": 4,
        "content": "TDE is enabled by Default for CosmosDB and SQL DB. So both should be TDE. When you can get TDE by default why use Encryption at Rest?"
      },
      {
        "date": "2020-07-04T02:40:00.000Z",
        "voteCount": 5,
        "content": "Nehuu is right:\nEncryption at rest for Taggin data (Cosmos DB)\nTDE for customer information (SQL)"
      },
      {
        "date": "2020-06-23T04:58:00.000Z",
        "voteCount": 3,
        "content": "yes, it should be otherwise here. It's mentioned that tagging data should reside in document DB i.e. Cosmos DB, in that case, that is Encryption at rest. Customer data  in parallel processing architecture i.e synapse, which is TDE"
      },
      {
        "date": "2020-06-03T06:13:00.000Z",
        "voteCount": 7,
        "content": "I also agreed with Nehuuu"
      },
      {
        "date": "2020-04-06T03:18:00.000Z",
        "voteCount": 16,
        "content": "Agree with Nehuuu"
      }
    ],
    "examNameCode": "dp-201",
    "topicNumber": "14"
  }
]