[
  {
    "topic": 15,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/22238-exam-dp-201-topic-15-question-1-discussion/",
    "body": "What should you do to improve high availability of the real-time data processing solution?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy identical Azure Stream Analytics jobs to paired regions in Azure.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy a High Concurrency Databricks cluster.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy an Azure Stream Analytics job and use an Azure Automation runbook to check the status of the job and to start the job if it stops.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet Data Lake Storage to use geo-redundant storage (GRS)."
    ],
    "answer": "A",
    "answerDescription": "Guarantee Stream Analytics job reliability during service updates<br>Part of being a fully managed service is the capability to introduce new service functionality and improvements at a rapid pace. As a result, Stream Analytics can have a service update deploy on a weekly (or more frequent) basis. No matter how much testing is done there is still a risk that an existing, running job may break due to the introduction of a bug. If you are running mission critical jobs, these risks need to be avoided. You can reduce this risk by following Azure's paired region model.<br>Scenario: The application development team will create an Azure event hub to receive real-time sales data, including store number, date, time, product ID, customer loyalty number, price, and discount amount, from the point of sale (POS) system and output the data to data storage in Azure<br>Reference:<br>https://docs.microsoft.com/en-us/azure/stream-analytics/stream-analytics-job-reliability<br>Design for high availability and disaster recovery",
    "votes": [],
    "comments": [
      {
        "date": "2021-04-11T02:50:00.000Z",
        "voteCount": 10,
        "content": "Answer given is correct. Duplicate asa jobs to paired regions is common to continue processing real time data in case one region is out."
      },
      {
        "date": "2021-05-26T07:41:00.000Z",
        "voteCount": 3,
        "content": "so dont need D!\nanswer is CORRECT"
      },
      {
        "date": "2021-01-17T03:34:00.000Z",
        "voteCount": 8,
        "content": "Answer should be D. Data is output to data storage. High availability for data Storage: GRS. Scenario: The application development team will create an Azure event hub to receive real-time sales data, including store number, date, time, product ID, customer loyalty number, price, and discount amount, from the point of sale (POS) system and output the data to data storage in Azure."
      },
      {
        "date": "2021-05-29T12:54:00.000Z",
        "voteCount": 1,
        "content": "Redundancy is more for disaster recovery than high availability though"
      },
      {
        "date": "2021-02-11T00:48:00.000Z",
        "voteCount": 2,
        "content": "\"  real-time data processing solution \" sounds like Streaming to me. Hence Steam Analytics"
      },
      {
        "date": "2020-06-05T13:25:00.000Z",
        "voteCount": 2,
        "content": "'The tags must be stored in a document database, and be queried by SQL\" - CosmosDB"
      }
    ],
    "examNameCode": "dp-201",
    "topicNumber": "15"
  }
]