[
  {
    "topic": 4,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/50502-exam-dp-100-topic-4-question-1-discussion/",
    "body": "HOTSPOT -<br>You are a lead data scientist for a project that tracks the health and migration of birds. You create a multi-image classification deep learning model that uses a set of labeled bird photos collected by experts. You plan to use the model to develop a cross-platform mobile app that predicts the species of bird captured by app users.<br>You must test and deploy the trained model as a web service. The deployed model must meet the following requirements:<br>✑ An authenticated connection must not be required for testing.<br>✑ The deployed model must perform with low latency during inferencing.<br>✑ The REST endpoints must be scalable and should have a capacity to handle large number of requests when multiple end users are using the mobile application.<br>You need to verify that the web service returns predictions in the expected JSON format when a valid REST request is submitted.<br>Which compute resources should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04274/0037200001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0037300001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: ds-workstation notebook VM<br>An authenticated connection must not be required for testing.<br>On a Microsoft Azure virtual machine (VM), including a Data Science Virtual Machine (DSVM), you create local user accounts while provisioning the VM. Users then authenticate to the VM by using these credentials.<br><br>Box 2: gpu-compute cluster -<br>Image classification is well suited for GPU compute clusters<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/data-science-virtual-machine/dsvm-common-identity https://docs.microsoft.com/en-us/azure/architecture/reference-architectures/ai/training-deep-learning",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-14T07:28:00.000Z",
        "voteCount": 42,
        "content": "So the right answers should be gpu-cluster for test and AKS for production?"
      },
      {
        "date": "2022-04-29T03:50:00.000Z",
        "voteCount": 1,
        "content": "Why would you need a GPU cluster for testing? Isn't testing just comparing predictions with actual labels?"
      },
      {
        "date": "2022-04-29T04:01:00.000Z",
        "voteCount": 7,
        "content": "Nvm, you need cluster (or aks) for gpu support. \nhttps://docs.microsoft.com/en-gb/azure/machine-learning/concept-compute-target\n\nHow come a third of answers on this site are incorrect, and that I cannot delete my own comments from discussions"
      },
      {
        "date": "2021-04-19T13:14:00.000Z",
        "voteCount": 14,
        "content": "Why not AKS cluster?"
      },
      {
        "date": "2021-04-20T10:53:00.000Z",
        "voteCount": 7,
        "content": "I agree with the AKS cluster. The documentation says that AKS should be used for real-time inference, which is not supported by the GPU compute cluster.\nhttps://docs.microsoft.com/en-us/azure/machine-learning/concept-compute-target#deploy"
      },
      {
        "date": "2021-05-02T02:00:00.000Z",
        "voteCount": 2,
        "content": "Agree. Answer is AKS for both."
      },
      {
        "date": "2021-05-09T02:08:00.000Z",
        "voteCount": 4,
        "content": "If security isn't required for testing, shouldn't the gpu-compute cluster do the job here? AKS should be used for production only."
      },
      {
        "date": "2021-04-30T11:58:00.000Z",
        "voteCount": 1,
        "content": "in which?"
      },
      {
        "date": "2021-05-02T02:33:00.000Z",
        "voteCount": 3,
        "content": "I second this. It has to be AKS cluster as low latency and GPU are required in the question:\nhttps://docs.microsoft.com/en-us/azure/machine-learning/how-to-deploy-and-where?tabs=azcli#choose-a-compute-target"
      },
      {
        "date": "2023-12-31T11:43:00.000Z",
        "voteCount": 2,
        "content": "Correct answers: \n- Test: ds-workstation notebook VM\n- Production: AKS-compute cluster\n\nTest: ds-workstation notebook VM\nSince the requirement for the testing environment is that it must not require an authenticated connection, then none of the cluster options (CPU, AKS, GPU) would be fit for use as a Testing resource. This is because these online cluster resources do not recommend and highly discourage to have unauthenticated connection due to obvious security concerns. DSVM offers an isolated or controlled environment, where unauthenticated access is temporarily allowed, but this would be an exception rather than the norm.\n\nProduction: AKS-compute cluster\nThe AKS (Azure Kubernetes Service) cluster is better for both (1) low latency and (2) scalability, unlike GPU cluster which is designed for low latency not for scalability, which is a requirement for the PROD env."
      },
      {
        "date": "2023-12-09T02:20:00.000Z",
        "voteCount": 1,
        "content": "Another misleading question: there is no clue about cost requirements, which will lead to the proper answer..."
      },
      {
        "date": "2023-09-18T15:19:00.000Z",
        "voteCount": 4,
        "content": "Question like this one on 4-Sept-2023 exam"
      },
      {
        "date": "2023-07-26T11:54:00.000Z",
        "voteCount": 4,
        "content": "Test:\nA) ds-workstation notebook VM\n\nFor testing purposes, using a data science workstation notebook VM would be ideal. Since you're only testing the API responses and not focusing on large scale inferencing, a fully provisioned cluster would not be necessary.\n\nProduction:\nf) aks-compute cluster\n\nAzure Kubernetes Service (AKS) cluster is best suited for production deployment of your machine learning model. AKS offers capabilities like auto-scaling and load balancing, ensuring that your model can handle a large number of requests and perform with low latency during inferencing. It is also not necessary for the compute resource to have a GPU for inferencing, making the AKS cluster a cost-effective option."
      },
      {
        "date": "2023-03-27T10:05:00.000Z",
        "voteCount": 1,
        "content": "I would go for a cpu-compute cluster for testing"
      },
      {
        "date": "2023-02-22T08:52:00.000Z",
        "voteCount": 2,
        "content": "CB. \nExplanation:\nFor testing, a CPU-based compute cluster should be sufficient since the primary requirement is to verify that the web service returns predictions in the expected JSON format. A CPU-based compute cluster is relatively cheaper and can handle moderate to low traffic during testing.\n\nFor production, an AKS (Azure Kubernetes Service) cluster is recommended as it offers scalable and efficient orchestration of containers for high traffic applications. Since the mobile app is expected to receive multiple requests from end users, a scalable and reliable production environment is required. The AKS cluster provides an authenticated connection, and Kubernetes can scale the deployed model horizontally to handle a large number of requests.\n\nNote that GPU-based compute clusters may offer faster inferencing performance but are relatively expensive and may not be necessary for this specific project's requirements. Additionally, the deployment of GPU-based clusters may require additional configuration and setup, which may not be practical for testing and production."
      },
      {
        "date": "2022-09-07T05:36:00.000Z",
        "voteCount": 8,
        "content": "Box1: I think the answer is here: \"When using the Azure Machine Learning SDK v2 on a compute instance or on an Azure Virtual Machine, you can use a managed identity for Azure. This workflow allows the VM to connect to the workspace using the managed identity, without storing credentials in Python code or prompting the user to authenticate. Azure Machine Learning compute clusters can also be configured to use a managed identity to access the workspace when training models.\"\nSo VM sounds good, as we are talking about testing mode on an inference process\nhttps://docs.microsoft.com/en-us/azure/machine-learning/how-to-setup-authentication?tabs=sdk\n\nBox2: AKS. Definitely the best solution when dealing with low latency and scaling needs on inference process\n\nhttps://docs.microsoft.com/en-us/azure/machine-learning/concept-compute-target"
      },
      {
        "date": "2022-06-08T09:52:00.000Z",
        "voteCount": 4,
        "content": "PROD is AKS for sure, test 3 options \n-- local\n-- contain instance\n-- aks\nit does not required authentication, I will vote for local machine"
      },
      {
        "date": "2022-03-07T22:21:00.000Z",
        "voteCount": 3,
        "content": "\"Although compute targets like local, and Azure Machine Learning compute clusters support GPU for training and experimentation, using GPU for inference when deployed as a web service is supported only on AKS.\"\n\nhttps://docs.microsoft.com/en-us/azure/machine-learning/concept-compute-target#deploy"
      },
      {
        "date": "2022-03-02T22:36:00.000Z",
        "voteCount": 3,
        "content": "On 03 March 2022"
      },
      {
        "date": "2021-12-16T06:14:00.000Z",
        "voteCount": 12,
        "content": "Train: GPU, test: DS, Production: AKS"
      },
      {
        "date": "2022-02-24T20:26:00.000Z",
        "voteCount": 1,
        "content": "I agree"
      },
      {
        "date": "2021-12-08T03:37:00.000Z",
        "voteCount": 1,
        "content": "Azure compute cluster is not supporting real-time inference, only batch inference\nI think workstation notebook vm works with the question request\n\nhttps://docs.microsoft.com/en-gb/azure/machine-learning/concept-compute-target\n\nhttps://docs.microsoft.com/en-gb/azure/machine-learning/how-to-deploy-local-container-notebook-vm"
      },
      {
        "date": "2021-11-18T08:51:00.000Z",
        "voteCount": 1,
        "content": "what is the final good answer please?"
      },
      {
        "date": "2021-10-22T00:54:00.000Z",
        "voteCount": 1,
        "content": "So the correct answers are AKS for both?"
      },
      {
        "date": "2021-09-02T23:37:00.000Z",
        "voteCount": 2,
        "content": "on 2/9/21"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/48292-exam-dp-100-topic-4-question-2-discussion/",
    "body": "You create a deep learning model for image recognition on Azure Machine Learning service using GPU-based training.<br>You must deploy the model to a context that allows for real-time GPU-based inferencing.<br>You need to configure compute resources for model inferencing.<br>Which compute type should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Container Instance",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Kubernetes Service",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tField Programmable Gate Array",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMachine Learning Compute"
    ],
    "answer": "B",
    "answerDescription": "You can use Azure Machine Learning to deploy a GPU-enabled model as a web service. Deploying a model on Azure Kubernetes Service (AKS) is one option.<br>The AKS cluster provides a GPU resource that is used by the model for inference.<br>Inference, or model scoring, is the phase where the deployed model is used to make predictions. Using GPUs instead of CPUs offers performance advantages on highly parallelizable computation.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-deploy-inferencing-gpus",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-27T04:39:00.000Z",
        "voteCount": 19,
        "content": "Answer is correct. AKS -&gt; GPU support"
      },
      {
        "date": "2023-09-30T22:39:00.000Z",
        "voteCount": 1,
        "content": "B is correct!  AKS supports real-time GPU-based inferencing\nhttps://learn.microsoft.com/en-gb/azure/machine-learning/concept-compute-target?view=azureml-api-2"
      },
      {
        "date": "2023-07-26T11:57:00.000Z",
        "voteCount": 1,
        "content": "B. Azure Kubernetes Service\n\nAzure Kubernetes Service (AKS) provides an option to create a GPU-enabled node pool which would be suitable for real-time GPU-based inferencing. The other services listed do not provide the same level of GPU support necessary for such operations.\n\nKeep in mind that setting up and managing a Kubernetes cluster does require some additional skills and setup compared to other Azure services, but it provides a high level of control and scalability."
      },
      {
        "date": "2023-02-22T09:40:00.000Z",
        "voteCount": 2,
        "content": "The compute type that should be used for real-time GPU-based inferencing of a deep learning model is:\nD. Machine Learning Compute\n\nExplanation:\nTo enable GPU-based inferencing on a deployed model, Machine Learning Compute (MLC) should be used. MLC is a managed service provided by Azure Machine Learning that can provision compute resources for training and inferencing machine learning models. The service can be configured to allocate resources based on the required processing power, which can include GPU and CPU-based clusters.\n\nAzure Container Instance (A) is a compute service that allows for running containerized applications without managing the underlying infrastructure, but it does not provide GPU resources. Azure Kubernetes Service (B) is a container orchestration service that can be used to manage containerized applications but requires additional configuration to enable GPU-based inferencing. Field Programmable Gate Array (C) is a hardware device that can be used to implement specific logic circuits but is not a cloud-based compute resource."
      },
      {
        "date": "2022-02-20T11:22:00.000Z",
        "voteCount": 2,
        "content": "On 20Feb2022"
      },
      {
        "date": "2022-01-17T06:02:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct."
      },
      {
        "date": "2021-08-12T08:39:00.000Z",
        "voteCount": 1,
        "content": "looking for somebody to share contrib access pdf file with Q&amp;A &amp; discussion\nm a i l to me at dwight (at) existiert.net\nofc does not have to be free"
      },
      {
        "date": "2021-06-21T09:02:00.000Z",
        "voteCount": 3,
        "content": "Answer is B.\nGPU for inference when deployed as a web service is supported only on AKS.\nhttps://docs.microsoft.com/en-gb/azure/machine-learning/concept-compute-target"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/86095-exam-dp-100-topic-4-question-3-discussion/",
    "body": "You create a batch inference pipeline by using the Azure ML SDK. You run the pipeline by using the following code: from azureml.pipeline.core import Pipeline from azureml.core.experiment import Experiment pipeline = Pipeline(workspace=ws, steps=[parallelrun_step]) pipeline_run = Experiment(ws, 'batch_pipeline').submit(pipeline)<br>You need to monitor the progress of the pipeline execution.<br>What are two possible ways to achieve this goal? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the following code in a notebook: <img src=\"/assets/media/exam-media/04274/0037500001.png\" class=\"in-exam-image\">",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Inference Clusters tab in Machine Learning Studio.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Activity log in the Azure portal for the Machine Learning workspace.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the following code in a notebook: <img src=\"/assets/media/exam-media/04274/0037500002.png\" class=\"in-exam-image\">",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the following code and monitor the console output from the PipelineRun object: <img src=\"/assets/media/exam-media/04274/0037500003.png\" class=\"in-exam-image\">"
    ],
    "answer": "DE",
    "answerDescription": "A batch inference job can take a long time to finish. This example monitors progress by using a Jupyter widget. You can also manage the job's progress by using:<br>✑ Azure Machine Learning Studio.<br>✑ Console output from the PipelineRun object.<br>from azureml.widgets import RunDetails<br>RunDetails(pipeline_run).show()<br>pipeline_run.wait_for_completion(show_output=True)<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-use-parallel-run-step#monitor-the-parallel-run-job",
    "votes": [],
    "comments": [
      {
        "date": "2022-12-19T02:41:00.000Z",
        "voteCount": 7,
        "content": "After a lot of searching I have found examples of both D and E.\nIf I understand correctly, both types of logging point to the Portal with a link, where the run details can be inspected\n\nD: from azureml.widgets import RunDetails  \nRunDetails(pipeline_run).show()\n\nhttps://github.com/Azure/azureml-examples/blob/main/v1/python-sdk/tutorials/automl-with-azureml/classification-credit-card-fraud/auto-ml-classification-credit-card-fraud.ipynb \n\n\nE: pipeline = Pipeline(workspace=ws, steps=[batch_score_step])\npipeline_run = Experiment(ws, \"Tutorial-Batch-Scoring\").submit(pipeline)\n\n\n# This will output information of the pipeline run, including the link to the details page of **portal**. Wait the run for completion and show output log to console\npipeline_run.wait_for_completion(show_output=True)\nhttps://github.com/Azure/MachineLearningNotebooks/blob/master/tutorials/machine-learning-pipelines-advanced/tutorial-pipeline-batch-scoring-classification.ipynb"
      },
      {
        "date": "2022-12-19T02:51:00.000Z",
        "voteCount": 2,
        "content": "The solution under D uses a Widget in a Notebook to track the Pipeline progress"
      },
      {
        "date": "2022-12-19T03:07:00.000Z",
        "voteCount": 1,
        "content": "https://github.com/Azure/MachineLearningNotebooks/tree/master/how-to-use-azureml/machine-learning-pipelines/parallel-run show the use of both answers together"
      },
      {
        "date": "2022-10-20T23:35:00.000Z",
        "voteCount": 1,
        "content": "E is correct.\nhttps://learn.microsoft.com/zh-tw/python/api/azureml-pipeline-core/azureml.pipeline.core.run.pipelinerun?view=azure-ml-py\n\nD can show status but seems for training model.\nQuestion request is batch inference pipleline.\nBut in doc \"A widget is asynchronous and provides updates until training finishes.\"\nhttps://learn.microsoft.com/en-us/python/api/azureml-widgets/azureml.widgets.rundetails?view=azure-ml-py"
      },
      {
        "date": "2023-01-11T17:47:00.000Z",
        "voteCount": 1,
        "content": "E &amp; D correct.  Since it is a batch inference model D will work."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/51800-exam-dp-100-topic-4-question-4-discussion/",
    "body": "You train and register a model in your Azure Machine Learning workspace.<br>You must publish a pipeline that enables client applications to use the model for batch inferencing. You must use a pipeline with a single ParallelRunStep step that runs a Python inferencing script to get predictions from the input data.<br>You need to create the inferencing script for the ParallelRunStep pipeline step.<br>Which two functions should you include? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\trun(mini_batch)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmain()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tbatch()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tinit()\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tscore(mini_batch)"
    ],
    "answer": "AD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AD",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-05-04T07:47:00.000Z",
        "voteCount": 16,
        "content": "https://docs.microsoft.com/en-us/learn/modules/deploy-batch-inference-pipelines-with-azure-machine-learning/2-batch-inference-pipelines"
      },
      {
        "date": "2021-06-07T04:37:00.000Z",
        "voteCount": 11,
        "content": "Question was there in June 2021 Exam"
      },
      {
        "date": "2023-10-12T06:42:00.000Z",
        "voteCount": 1,
        "content": "run(mini_batch)\n\ninit()\n\nSee https://github.com/Azure/MachineLearningNotebooks/tree/master/how-to-use-azureml/machine-learning-pipelines/parallel-run"
      },
      {
        "date": "2023-07-26T17:03:00.000Z",
        "voteCount": 1,
        "content": "AD.\n\nBatch inferencing service requires a scoring script to load the model and use it to predict new values. It must include two functions:\ninit(): Called when the pipeline is initialized.\nrun(mini_batch): Called for each batch of data to be processed.\nTypically, you use the init function to load the model from the model registry, and use the run function to generate predictions from each batch of data and return the results. The following example script shows this pattern:"
      },
      {
        "date": "2023-06-03T08:23:00.000Z",
        "voteCount": 1,
        "content": "In Azure Machine Learning, the inference script is typically a Python script that defines two functions: init() and run(input_data). The init() function is called once when the model is loaded and can be used to perform any initialization tasks, such as loading additional libraries or setting up global variables. The run(input_data) function is called for each input data item and should apply the model to the input data and produce output data"
      },
      {
        "date": "2023-02-22T10:13:00.000Z",
        "voteCount": 1,
        "content": "A and D"
      },
      {
        "date": "2023-02-22T10:02:00.000Z",
        "voteCount": 1,
        "content": "A and E."
      },
      {
        "date": "2022-12-19T04:31:00.000Z",
        "voteCount": 2,
        "content": "Here's and example of a py script including init() and run(mini_batch):\nhttps://github.com/Azure/MachineLearningNotebooks/blob/master/how-to-use-azureml/machine-learning-pipelines/parallel-run/Code/digit_identification.py\n\nThis Python file is loaded by example notebook \nhttps://github.com/Azure/MachineLearningNotebooks/blob/master/how-to-use-azureml/machine-learning-pipelines/parallel-run/file-dataset-image-inference-mnist.ipynb"
      },
      {
        "date": "2022-06-17T17:49:00.000Z",
        "voteCount": 3,
        "content": "On exam 18-06-22"
      },
      {
        "date": "2022-04-11T12:10:00.000Z",
        "voteCount": 2,
        "content": "Given answer of A&amp;D is correct."
      },
      {
        "date": "2022-03-12T18:04:00.000Z",
        "voteCount": 1,
        "content": "A and D"
      },
      {
        "date": "2022-03-02T22:36:00.000Z",
        "voteCount": 3,
        "content": "On 03 March 2022"
      },
      {
        "date": "2021-11-06T16:03:00.000Z",
        "voteCount": 1,
        "content": "on exam 2021/11/05"
      },
      {
        "date": "2021-10-20T01:52:00.000Z",
        "voteCount": 1,
        "content": "on 19Oct2021"
      },
      {
        "date": "2021-07-11T06:16:00.000Z",
        "voteCount": 8,
        "content": "On exam 2021/7/10"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/54863-exam-dp-100-topic-4-question-5-discussion/",
    "body": "You deploy a model as an Azure Machine Learning real-time web service using the following code.<br><img src=\"/assets/media/exam-media/04274/0037600001.png\" class=\"in-exam-image\"><br>The deployment fails.<br>You need to troubleshoot the deployment failure by determining the actions that were performed during deployment and identifying the specific action that failed.<br>Which code segment should you run?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.get_logs()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.state",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.serialize()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.update_deployment_state()"
    ],
    "answer": "A",
    "answerDescription": "You can print out detailed Docker engine log messages from the service object. You can view the log for ACI, AKS, and Local deployments. The following example demonstrates how to print the logs.<br># if you already have the service object handy<br>print(service.get_logs())<br># if you only know the name of the service (note there might be multiple services with the same name but different version number) print(ws.webservices['mysvc'].get_logs())<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-troubleshoot-deployment",
    "votes": [],
    "comments": [
      {
        "date": "2021-06-08T00:03:00.000Z",
        "voteCount": 10,
        "content": "A is the correct answer."
      },
      {
        "date": "2022-06-17T17:49:00.000Z",
        "voteCount": 1,
        "content": "On exam 18-06-22"
      },
      {
        "date": "2022-03-18T01:46:00.000Z",
        "voteCount": 3,
        "content": "on exam 18/03/2022"
      },
      {
        "date": "2022-03-02T22:37:00.000Z",
        "voteCount": 1,
        "content": "On 03 March 2022"
      },
      {
        "date": "2021-11-06T15:05:00.000Z",
        "voteCount": 2,
        "content": "on Exam 6 Nov 2021"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/54789-exam-dp-100-topic-4-question-6-discussion/",
    "body": "HOTSPOT -<br>You deploy a model in Azure Container Instance.<br>You must use the Azure Machine Learning SDK to call the model API.<br>You need to invoke the deployed model using native SDK classes and methods.<br>How should you complete the command? To answer, select the appropriate options in the answer areas.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04274/0037800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0037900001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: from azureml.core.webservice import Webservice<br>The following code shows how to use the SDK to update the model, environment, and entry script for a web service to Azure Container Instances: from azureml.core import Environment from azureml.core.webservice import Webservice from azureml.core.model import Model, InferenceConfig<br>Box 2: predictions = service.run(input_json)<br>Example: The following code demonstrates sending data to the service: import json test_sample = json.dumps({'data': [<br>[1, 2, 3, 4, 5, 6, 7, 8, 9, 10],<br>[10, 9, 8, 7, 6, 5, 4, 3, 2, 1]<br>]})<br>test_sample = bytes(test_sample, encoding='utf8')<br>prediction = service.run(input_data=test_sample)<br>print(prediction)<br>Reference:<br>https://docs.microsoft.com/bs-latn-ba/azure/machine-learning/how-to-deploy-azure-container-instance https://docs.microsoft.com/en-us/azure/machine-learning/how-to-troubleshoot-deployment",
    "votes": [],
    "comments": [
      {
        "date": "2021-06-07T04:38:00.000Z",
        "voteCount": 12,
        "content": "Question was there in June 2021 Exam"
      },
      {
        "date": "2021-08-27T07:21:00.000Z",
        "voteCount": 9,
        "content": "given answer is correct"
      },
      {
        "date": "2022-04-17T22:42:00.000Z",
        "voteCount": 2,
        "content": "given answer is correct"
      },
      {
        "date": "2022-03-12T18:18:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct. \nhttps://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice(class)?view=azure-ml-py#azureml-core-webservice-run"
      },
      {
        "date": "2022-03-02T22:37:00.000Z",
        "voteCount": 5,
        "content": "On Exam: 03 March 2022"
      },
      {
        "date": "2021-10-20T01:52:00.000Z",
        "voteCount": 2,
        "content": "on 19Oct2021"
      },
      {
        "date": "2021-06-24T13:28:00.000Z",
        "voteCount": 5,
        "content": "First option is correct for sure but second is wrong \nYou deploy a model in Azure Container Instance so it is already deployed!\nYou must use the Azure Machine Learning SDK to call the model API so here ask is how to call ?\nYou need to invoke the deployed model using native SDK classes and methods ,again we need to invoke remember!\nso second answer should be prediction = requests.post(service.scoring_uri, input_json)"
      },
      {
        "date": "2022-04-11T12:19:00.000Z",
        "voteCount": 1,
        "content": "You are mistaken; requests is a python library, which is not part of zure ML SDK. Webservice is part of SDK. The run method of Webservice calls the Webservice with the provided input. And the input parameter is the data your machine learning model expects as an input to run predictions. Here in the correct answer, we feed the json data as the input."
      },
      {
        "date": "2021-11-14T13:57:00.000Z",
        "voteCount": 3,
        "content": "requests is not a native SDK class either"
      },
      {
        "date": "2021-06-26T03:49:00.000Z",
        "voteCount": 10,
        "content": "The Answer is already correct with Webservice and run()\n\nhttps://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice(class)?view=azure-ml-py\n\nin Webservice have method call run() to call webservice with an input. It should do the same functionality as requests.post(service.scoring_uri, input_json).\nI believe that prediction = requests.post(service.scoring_uri, input_json) should not work because of  the upper provided code is not include \"import requests\" to be able running post method."
      },
      {
        "date": "2021-07-16T09:42:00.000Z",
        "voteCount": 3,
        "content": "Given answer in correct: \nhttps://github.com/Azure/MachineLearningNotebooks/blob/master/how-to-use-azureml/deployment/deploy-to-cloud/model-register-and-deploy.ipynb"
      },
      {
        "date": "2022-06-09T09:21:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct!  WebService is not the same as normal web request, class definition here: https://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice(class)?view=azure-ml-py#azureml-core-webservice-run"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47455-exam-dp-100-topic-4-question-7-discussion/",
    "body": "You create a multi-class image classification deep learning model.<br>You train the model by using PyTorch version 1.2.<br>You need to ensure that the correct version of PyTorch can be identified for the inferencing environment when the model is deployed.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSave the model locally as a.pt file, and deploy the model as a local web service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy the model on computer that is configured to use the default Azure Machine Learning conda environment.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister the model with a .pt file extension and the default version property.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister the model, specifying the model_framework and model_framework_version properties.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-06-07T04:38:00.000Z",
        "voteCount": 10,
        "content": "Question was there in June 2021 Exam"
      },
      {
        "date": "2021-06-18T14:19:00.000Z",
        "voteCount": 8,
        "content": "You can view these two properties in the Model.register() section here, which takes model framework and framework version\nhttps://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.model.model?view=azure-ml-py#register-workspace--model-path--model-name--tags-none--properties-none--description-none--datasets-none--model-framework-none--model-framework-version-none--child-paths-none--sample-input-dataset-none--sample-output-dataset-none--resource-configuration-none-"
      },
      {
        "date": "2021-06-20T10:41:00.000Z",
        "voteCount": 1,
        "content": "I agree."
      },
      {
        "date": "2024-06-08T02:03:00.000Z",
        "voteCount": 1,
        "content": "D is correct:\npecifying the model_framework and model_framework_version properties when registering the model, you provide metadata that informs Azure Machine Learning about the specific framework and version used to train the model."
      },
      {
        "date": "2021-12-19T04:42:00.000Z",
        "voteCount": 3,
        "content": "I agree with D"
      },
      {
        "date": "2021-06-23T03:52:00.000Z",
        "voteCount": 2,
        "content": "The answer is correct.\n\nCheck API for model registering.\nhttps://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.run.run?view=azure-ml-py#register-model-model-name--model-path-none--tags-none--properties-none--model-framework-none--model-framework-version-none--description-none--datasets-none--sample-input-dataset-none--sample-output-dataset-none--resource-configuration-none----kwargs-"
      },
      {
        "date": "2021-05-02T02:14:00.000Z",
        "voteCount": 4,
        "content": "Answer is C. https://docs.microsoft.com/en-us/python/api/azureml-train-core/azureml.train.dnn.pytorch?view=azure-ml-py#default-version----1-4-"
      },
      {
        "date": "2021-04-12T21:36:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/python/api/azureml-train-core/azureml.train.dnn.pytorch?view=azure-ml-py"
      },
      {
        "date": "2021-03-16T20:33:00.000Z",
        "voteCount": 1,
        "content": "model_framework is Model's property\nhttps://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.model.model?view=azure-ml-py"
      },
      {
        "date": "2021-03-16T20:26:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice(class)?view=azure-ml-py#run-input-"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/50649-exam-dp-100-topic-4-question-8-discussion/",
    "body": "You train a machine learning model.<br>You must deploy the model as a real-time inference service for testing. The service requires low CPU utilization and less than 48 MB of RAM. The compute target for the deployed service must initialize automatically while minimizing cost and administrative overhead.<br>Which compute target should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Container Instance (ACI)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tattached Azure Databricks cluster",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Kubernetes Service (AKS) inference cluster",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Machine Learning compute cluster"
    ],
    "answer": "A",
    "answerDescription": "Azure Container Instances (ACI) are suitable only for small models less than 1 GB in size.<br>Use it for low-scale CPU-based workloads that require less than 48 GB of RAM.<br>Note: Microsoft recommends using single-node Azure Kubernetes Service (AKS) clusters for dev-test of larger models.<br>Reference:<br>https://docs.microsoft.com/id-id/azure/machine-learning/how-to-deploy-and-where",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-11T06:17:00.000Z",
        "voteCount": 7,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2023-10-12T01:12:00.000Z",
        "voteCount": 1,
        "content": "'minimizing cost' --&gt; use Azure Container Instance (ACI), not Azure Kubernetes Service (AKS).\n\n'minimizing administrative overhead' --&gt; use Docker/container, not Azure App Service.\n\nConclusion: Azure Container Instance (ACI)."
      },
      {
        "date": "2022-12-10T13:11:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/machine-learning/v1/how-to-deploy-azure-container-instance\n\n\"ACI is suitable only for small models that are under 1 GB in size. We recommend using single-node AKS to dev-test larger models.\""
      },
      {
        "date": "2022-03-02T22:37:00.000Z",
        "voteCount": 4,
        "content": "On Exam: 03 March 2022"
      },
      {
        "date": "2021-06-20T10:50:00.000Z",
        "voteCount": 3,
        "content": "Answer is correct.\nhttps://docs.microsoft.com/en-gb/azure/machine-learning/concept-compute-target"
      },
      {
        "date": "2021-05-17T23:32:00.000Z",
        "voteCount": 1,
        "content": "40MB -&gt; 48GB?"
      },
      {
        "date": "2021-05-06T10:08:00.000Z",
        "voteCount": 1,
        "content": "ACI are also suitable for small models less than 1 GB in size."
      },
      {
        "date": "2021-04-21T06:46:00.000Z",
        "voteCount": 1,
        "content": "Why not AKS Cluster as it's required for real-time inferencing?"
      },
      {
        "date": "2021-04-25T08:28:00.000Z",
        "voteCount": 6,
        "content": "I think it is because this is for testing and not production"
      },
      {
        "date": "2021-08-01T00:09:00.000Z",
        "voteCount": 1,
        "content": "I think because they mentioned low scaling and testing with min cost. Thats why ACI"
      },
      {
        "date": "2021-08-29T21:28:00.000Z",
        "voteCount": 2,
        "content": "Because AKS is the costliest deployment solution. And it only should use in production deployments"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37001-exam-dp-100-topic-4-question-9-discussion/",
    "body": "You register a model that you plan to use in a batch inference pipeline.<br>The batch inference pipeline must use a ParallelRunStep step to process files in a file dataset. The script has the ParallelRunStep step runs must process six input files each time the inferencing function is called.<br>You need to configure the pipeline.<br>Which configuration setting should you specify in the ParallelRunConfig object for the PrallelRunStep step?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tprocess_count_per_node= \"6\"",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tnode_count= \"6\"",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmini_batch_size= \"6\"\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\terror_threshold= \"6\""
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 13,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-11-14T07:51:00.000Z",
        "voteCount": 40,
        "content": "The answer should be C. For FileDataset input, this field is the number of files user script can process in one run() call."
      },
      {
        "date": "2020-11-15T06:54:00.000Z",
        "voteCount": 19,
        "content": "Answer is C, https://docs.microsoft.com/en-us/python/api/azureml-pipeline-steps/azureml.pipeline.steps.parallel_run_config.parallelrunconfig?view=azure-ml-py"
      },
      {
        "date": "2023-12-19T19:35:00.000Z",
        "voteCount": 1,
        "content": "mini_batch_size:  Number of files passed per scoring script run.\nhttps://learn.microsoft.com/en-us/training/modules/deploy-model-batch-endpoint/3-deploy-your-mlflow-model-batch-endpoint"
      },
      {
        "date": "2023-10-12T01:26:00.000Z",
        "voteCount": 1,
        "content": "ParallelRunStep means run parallel in single one node.\n\nQuestion keyword 'six input files each time the inferencing function is called'.\n\nAnswer keyword: mini_batch_size=\"6\" ."
      },
      {
        "date": "2023-02-22T11:36:00.000Z",
        "voteCount": 2,
        "content": "The ParallelRunStep step runs must process six input files each time the inferencing function is called, so the correct configuration setting to specify in the ParallelRunConfig object for the ParallelRunStep step is the mini_batch_size, which should be set to 6.\n\nTherefore, the correct answer is:\n\nC. mini_batch_size= \"6\""
      },
      {
        "date": "2023-02-07T05:28:00.000Z",
        "voteCount": 1,
        "content": "as stated in Microsoft Documentation this should be mini_batch_size: https://docs.microsoft.com/en-us/python/api/azureml-contrib-pipeline-steps/azureml.contrib.pipeline.steps.parallelrunconfig?view=azure-ml-py. @ExamTopic Can we please fix the answer."
      },
      {
        "date": "2023-01-23T06:12:00.000Z",
        "voteCount": 1,
        "content": "I believe the answer is C can we please fix the mistake? We are referring on the number of files here so why should be A?"
      },
      {
        "date": "2022-12-11T02:49:00.000Z",
        "voteCount": 3,
        "content": "Node count is about number of compute instances, servers etc.,"
      },
      {
        "date": "2022-06-09T13:36:00.000Z",
        "voteCount": 2,
        "content": "I am sure C is the answer, number of nodes = how many computer inst, number of processes = how many parallel running processes on a node, min_batch_size = min number of files processed"
      },
      {
        "date": "2022-04-11T12:51:00.000Z",
        "voteCount": 2,
        "content": "Correct answer is C. Question notes that the type of dateset to be used is a file dataset. Microsoft documentation says mini_batch_size: For FileDataset input, this field is the number of files a user script can process in one run() call\nhttps://docs.microsoft.com/en-us/python/api/azureml-pipeline-steps/azureml.pipeline.steps.parallel_run_config.parallelrunconfig?view=azure-ml-py"
      },
      {
        "date": "2021-12-14T06:02:00.000Z",
        "voteCount": 5,
        "content": "Answer is C"
      },
      {
        "date": "2021-10-20T01:53:00.000Z",
        "voteCount": 2,
        "content": "on 19Oct2021"
      },
      {
        "date": "2021-08-26T19:59:00.000Z",
        "voteCount": 1,
        "content": "the answer should be mini_batch_size\n\n\nmini_batch_size\nUnion[str, int]\nFor FileDataset input, this field is the number of files a user script can process in one run() call. For TabularDataset input, this field is the approximate size of data the user script can process in one run() call. Example values are 1024, 1024KB, 10MB, and 1GB. (optional, default value is 10 files for FileDataset and 1MB for TabularDataset.)"
      },
      {
        "date": "2021-07-11T06:17:00.000Z",
        "voteCount": 4,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2021-05-28T05:48:00.000Z",
        "voteCount": 4,
        "content": "This Q&amp;A model set has quite a few wrong answers... #Examtopics, kindly fix the wrong answers."
      },
      {
        "date": "2021-05-27T00:42:00.000Z",
        "voteCount": 1,
        "content": "Answer is C:\nRefer below code:\ndef run(mini_batch):\n    # This runs for each batch\n    resultList = []\n\n    # process each file in the batch\n    for f in mini_batch:\n        # Read comma-delimited data into an array\n        data = np.genfromtxt(f, delimiter=',')\n        # Reshape into a 2-dimensional array for model input\n        prediction = model.predict(data.reshape(1, -1))\n        # Append prediction to results\n        resultList.append(\"{}: {}\".format(os.path.basename(f), prediction[0]))\n    return resultList"
      },
      {
        "date": "2021-03-28T07:14:00.000Z",
        "voteCount": 5,
        "content": "mini_batch_size is correct"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47169-exam-dp-100-topic-4-question-10-discussion/",
    "body": "You deploy a real-time inference service for a trained model.<br>The deployed model supports a business-critical application, and it is important to be able to monitor the data submitted to the web service and the predictions the data generates.<br>You need to implement a monitoring solution for the deployed model using minimal administrative effort.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tView the explanations for the registered model in Azure ML studio.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Azure Application Insights for the service endpoint and view logged data in the Azure portal.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tView the log files generated by the experiment used to train the model.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an ML Flow tracking URI that references the endpoint, and view the data logged by ML Flow."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 5,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 3,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-10-12T02:04:00.000Z",
        "voteCount": 1,
        "content": "Question keyword 'it is important to be able to monitor \n\n- the data submitted to the web service and \n\n- the predictions the data generates'\n\nNew GUI is item 'Application Insights diagnostics' with toggle button 'Enabled'. You can practise with sample model Sample PyTorch model https://www.kaggle.com/code/xiedaicheng/download-pytorch-model/output\n , upload, then create new deployment, then see this option at step 2."
      },
      {
        "date": "2023-02-22T11:47:00.000Z",
        "voteCount": 2,
        "content": "B. To implement a monitoring solution for the deployed model that supports a business-critical application and requires minimal administrative effort, the best option is to enable Azure Application Insights for the service endpoint and view logged data in the Azure portal.\n\nOption B, to enable Azure Application Insights for the deployed model, provides a scalable and cost-effective way to monitor the data submitted to the web service and the predictions generated by the data. Azure Application Insights can be easily integrated into Azure Machine Learning and provides powerful analytics tools for tracking and analyzing usage, performance, and errors in real-time. With Azure Application Insights, you can quickly identify and troubleshoot issues, and you can set up alerts to notify you when specific events occur. ACD do not provide real-time monitoring capabilities for the deployed model."
      },
      {
        "date": "2023-01-12T18:25:00.000Z",
        "voteCount": 3,
        "content": "I don't think this can be B because App Insights will now show prediction information, only utilization/traffic etc.\n\nThe answer has to be D.  Review https://learn.microsoft.com/en-us/azure/machine-learning/v1/how-to-use-mlflow?tabs=azuremlsdk#track-runs-running-on-azure-machine-learning"
      },
      {
        "date": "2022-03-12T18:45:00.000Z",
        "voteCount": 4,
        "content": "B is the correct answer. Only App Insights can be used here. The question does not talk about MlfLow model. So D is not in question."
      },
      {
        "date": "2022-02-20T11:22:00.000Z",
        "voteCount": 1,
        "content": "On 20Feb2022"
      },
      {
        "date": "2022-01-25T01:59:00.000Z",
        "voteCount": 2,
        "content": "D is correct. B provides mostly telemetry data about the service itself."
      },
      {
        "date": "2021-03-15T05:14:00.000Z",
        "voteCount": 2,
        "content": "I think both B and D could work but B is easier to setup"
      },
      {
        "date": "2021-08-29T21:32:00.000Z",
        "voteCount": 1,
        "content": "I guess minimum administrative effort means that..."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/54940-exam-dp-100-topic-4-question-11-discussion/",
    "body": "HOTSPOT -<br>You use Azure Machine Learning to train and register a model.<br>You must deploy the model into production as a real-time web service to an inference cluster named service-compute that the IT department has created in the<br>Azure Machine Learning workspace.<br>Client applications consuming the deployed web service must be authenticated based on their Azure Active Directory service principal.<br>You need to write a script that uses the Azure Machine Learning SDK to deploy the model. The necessary modules have been imported.<br>How should you complete the code? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04274/0038500001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0038600001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: AksCompute -<br>Example:<br>aks_target = AksCompute(ws,\"myaks\")<br># If deploying to a cluster configured for dev/test, ensure that it was created with enough<br># cores and memory to handle this deployment configuration. Note that memory is also used by<br># things such as dependencies and AML components.<br>deployment_config = AksWebservice.deploy_configuration(cpu_cores = 1, memory_gb = 1) service = Model.deploy(ws, \"myservice\", [model], inference_config, deployment_config, aks_target)<br><br>Box 2: AksWebservice -<br><br>Box 3: token_auth_enabled=Yes -<br>Whether or not token auth is enabled for the Webservice.<br>Note: A Service principal defined in Azure Active Directory (Azure AD) can act as a principal on which authentication and authorization policies can be enforced in<br>Azure Databricks.<br>The Azure Active Directory Authentication Library (ADAL) can be used  to programmatically get an Azure AD access token for a user.<br>Incorrect Answers:<br>auth_enabled (bool): Whether or not to enable key auth for this Webservice. Defaults to True.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-deploy-azure-kubernetes-service https://docs.microsoft.com/en-us/azure/databricks/dev-tools/api/latest/aad/service-prin-aad-token",
    "votes": [],
    "comments": [
      {
        "date": "2021-07-11T06:18:00.000Z",
        "voteCount": 11,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2021-06-25T06:56:00.000Z",
        "voteCount": 10,
        "content": "given answer is correct\n\ntoken_auth_enabled\nbool\ndefault value: None\nWhether or not to enable Token auth for this Webservice. If this is enabled, users can access this Webservice by fetching an access token using their Azure Active Directory credentials. Defaults to False.\nhttps://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice.akswebservice?view=azure-ml-py\nService principal: You create a service principal account in Azure Active Directory, and use it to authenticate or get a token. A service principal is used when you need an automated process to authenticate to the service without requiring user interaction. For example, a continuous integration and deployment script that trains and tests a model every time the training code changes.\nhttps://docs.microsoft.com/en-us/azure/machine-learning/how-to-setup-authentication"
      },
      {
        "date": "2024-06-08T04:28:00.000Z",
        "voteCount": 1,
        "content": "amlcompute=&gt;training\nAkscompute=&gt;real time computing and scalable\nbatchcompute=&gt;non real time"
      },
      {
        "date": "2023-10-19T22:54:00.000Z",
        "voteCount": 1,
        "content": "Constructor azureml.core.compute.aks.AksCompute(workspace, name) \n\nhttps://learn.microsoft.com/en-us/python/api/azureml-core/azureml.core.compute.aks.akscompute?view=azure-ml-py#constructor\n\nazureml.core.webservice.aks.AksWebservice.deploy_configuration(...)\n\nhttps://learn.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice.aks.akswebservice?view=azure-ml-py#azureml-core-webservice-aks-akswebservice-deploy-configuration"
      },
      {
        "date": "2022-04-11T12:57:00.000Z",
        "voteCount": 6,
        "content": "Given answer is correct. The third one might be confusing for some people but here is what Microsoft documentation says:\ntoken_auth_enabled: Whether or not to enable Token auth for this Webservice. If this is enabled, users can access this Webservice by fetching an access token using their Azure Active Directory credentials. Defaults to False."
      },
      {
        "date": "2022-03-18T01:47:00.000Z",
        "voteCount": 3,
        "content": "on exam 18/03/2022"
      },
      {
        "date": "2022-03-02T23:55:00.000Z",
        "voteCount": 1,
        "content": "On Exam: 03 March 2022"
      },
      {
        "date": "2022-02-20T11:23:00.000Z",
        "voteCount": 1,
        "content": "On 20Feb2022"
      },
      {
        "date": "2022-01-15T03:03:00.000Z",
        "voteCount": 2,
        "content": "cpu_cores = 1, memory_gb=1 does not sound like AKS to me"
      },
      {
        "date": "2021-11-07T14:23:00.000Z",
        "voteCount": 2,
        "content": "on exam 05Nov 2021"
      },
      {
        "date": "2021-11-06T15:07:00.000Z",
        "voteCount": 2,
        "content": "on 6 Nov 2021"
      },
      {
        "date": "2021-10-20T01:53:00.000Z",
        "voteCount": 1,
        "content": "on 19Oct2021"
      },
      {
        "date": "2021-09-02T23:37:00.000Z",
        "voteCount": 2,
        "content": "on 2/9/21"
      },
      {
        "date": "2021-06-08T22:13:00.000Z",
        "voteCount": 5,
        "content": "Answer is correct!"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/55870-exam-dp-100-topic-4-question-12-discussion/",
    "body": "An organization creates and deploys a multi-class image classification deep learning model that uses a set of labeled photographs.<br>The software engineering team reports there is a heavy inferencing load for the prediction web services during the summer. The production web service for the model fails to meet demand despite having a fully-utilized compute cluster where the web service is deployed.<br>You need to improve performance of the image classification web service with minimal downtime and minimal administrative effort.<br>What should you advise the IT Operations team to do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new compute cluster by using larger VM sizes for the nodes, redeploy the web service to that cluster, and update the DNS registration for the service endpoint to point to the new cluster.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIncrease the node count of the compute cluster where the web service is deployed.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIncrease the minimum node count of the compute cluster where the web service is deployed.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIncrease the VM size of nodes in the compute cluster where the web service is deployed."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-06-22T17:00:00.000Z",
        "voteCount": 10,
        "content": "looks correct"
      },
      {
        "date": "2024-06-08T04:32:00.000Z",
        "voteCount": 1,
        "content": "anything that touches VM specs caused downtime, only increasing node count does not cause downtime. B is correct"
      },
      {
        "date": "2023-10-19T23:05:00.000Z",
        "voteCount": 1,
        "content": "'Increase the minimum node count of the compute cluster' . I choose C."
      },
      {
        "date": "2024-05-26T02:32:00.000Z",
        "voteCount": 1,
        "content": "The answer is incorrect because the heavy inferencing occurs only during the summer. The problem remains since we haven't upgraded the cluster's capabilities, leading to higher costs outside of summer due to always active nodes, even with no inferencing requests."
      },
      {
        "date": "2022-11-27T02:06:00.000Z",
        "voteCount": 2,
        "content": "Increasing the node count has the least administrative effort compared to option A which describes a heavier solution."
      },
      {
        "date": "2022-02-24T16:59:00.000Z",
        "voteCount": 1,
        "content": "this is correct as it requires lesser downtime and minimal administrative effort"
      },
      {
        "date": "2022-02-20T11:23:00.000Z",
        "voteCount": 3,
        "content": "On 20Feb2022"
      },
      {
        "date": "2022-02-19T21:53:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2021-10-15T10:33:00.000Z",
        "voteCount": 1,
        "content": "It is correct"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/44452-exam-dp-100-topic-4-question-13-discussion/",
    "body": "You use Azure Machine Learning designer to create a real-time service endpoint. You have a single Azure Machine Learning service compute resource.<br>You train the model and prepare the real-time pipeline for deployment.<br>You need to publish the inference pipeline as a web service.<br>Which compute type should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta new Machine Learning Compute resource",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Kubernetes Services\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHDInsight",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe existing Machine Learning Compute resource",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Databricks"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-11T06:18:00.000Z",
        "voteCount": 7,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2023-10-19T23:07:00.000Z",
        "voteCount": 1,
        "content": "B, for deployment phase, AKS. Not powerful computer for training model."
      },
      {
        "date": "2023-02-22T12:54:00.000Z",
        "voteCount": 2,
        "content": "D. the existing Machine Learning Compute resource\n\nSince you already have a single Azure Machine Learning service compute resource, it is recommended to use it to publish the inference pipeline as a web service. This will help you to minimize the cost and simplify the deployment process."
      },
      {
        "date": "2022-12-11T10:16:00.000Z",
        "voteCount": 3,
        "content": "AKS always the solution for these types of problems."
      },
      {
        "date": "2022-02-20T11:23:00.000Z",
        "voteCount": 1,
        "content": "On 20Feb2022"
      },
      {
        "date": "2021-06-20T23:33:00.000Z",
        "voteCount": 4,
        "content": "The answer is correct: Azure Kubernetes Service (AKS) is used for Real-time inference."
      },
      {
        "date": "2021-05-16T05:26:00.000Z",
        "voteCount": 1,
        "content": "Doesn't the question refer to which compute to use to deploy the pipeline, thus answer D being correct?"
      },
      {
        "date": "2021-08-01T00:26:00.000Z",
        "voteCount": 2,
        "content": "It says you need to publish the model, thus Aks"
      },
      {
        "date": "2021-02-10T17:06:00.000Z",
        "voteCount": 1,
        "content": "Why the existing compute can't be used?"
      },
      {
        "date": "2021-02-25T10:40:00.000Z",
        "voteCount": 6,
        "content": "As per https://docs.microsoft.com/en-us/azure/machine-learning/concept-compute-target only AKS can be used for real-time interference"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/55874-exam-dp-100-topic-4-question-14-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You train and register a machine learning model.<br>You plan to deploy the model as a real-time web service. Applications must use key-based authentication to use the model.<br>You need to deploy the web service.<br>Solution:<br>Create an AciWebservice instance.<br>Set the value of the ssl_enabled property to True.<br>Deploy the model to the service.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Instead use only auth_enabled = TRUE<br>Note: Key-based authentication.<br>Web services deployed on AKS have key-based auth enabled by default. ACI-deployed services have key-based auth disabled by default, but you can enable it by setting auth_enabled = TRUE when creating the ACI web service. The following is an example of creating an ACI deployment configuration with key-based auth enabled. deployment_config &lt;- aci_webservice_deployment_config(cpu_cores = 1, memory_gb = 1, auth_enabled = TRUE)<br>Reference:<br>https://azure.github.io/azureml-sdk-for-r/articles/deploying-models.html",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-06-22T18:12:00.000Z",
        "voteCount": 5,
        "content": "correct"
      },
      {
        "date": "2023-10-19T23:20:00.000Z",
        "voteCount": 1,
        "content": "azureml.core.webservice.aci.AciWebservice(.. ssl_enable = true...)\n\nhttps://learn.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice.aci.aciwebservice?view=azure-ml-py#variables\n\nkey-based and ssl_enable can work together.\n\nWeb services deployed on AKS have key-based auth enabled by default. ACI-deployed services have key-based auth disabled by default, but you can enable it by setting auth_enabled = TRUE when creating the ACI web service. The following is an example of creating an ACI deployment configuration with key-based auth enabled."
      },
      {
        "date": "2023-10-19T23:20:00.000Z",
        "voteCount": 1,
        "content": "deployment_config &lt;- aci_webservice_deployment_config(cpu_cores = 1, \n                                                      memory_gb = 1,\n                                                      auth_enabled = TRUE)\nTo fetch the auth keys, use get_webservice_keys(). To regenerate a key, use the generate_new_webservice_key() function:\n\n# Generate the primary auth key\nprimary_key &lt;- generate_new_webservice_key(service, key_type = \"Primary\")\n\n# Generate the secondary auth key\nsecondary_key &lt;- generate_new_webservice_key(service, key_type = \"Secondary\")\n\nhttps://azure.github.io/azureml-sdk-for-r/articles/deploying-models.html#key-based-authentication"
      },
      {
        "date": "2023-10-19T23:21:00.000Z",
        "voteCount": 1,
        "content": "I changed: missing step Generate auth_key. Choose B."
      },
      {
        "date": "2022-11-27T02:10:00.000Z",
        "voteCount": 2,
        "content": "False - SSL is transport-layer only, not application-level authentication."
      },
      {
        "date": "2022-09-14T02:59:00.000Z",
        "voteCount": 1,
        "content": "answer is YES!!"
      },
      {
        "date": "2021-11-06T15:08:00.000Z",
        "voteCount": 3,
        "content": "on 6 Nov 2021"
      },
      {
        "date": "2021-10-20T01:53:00.000Z",
        "voteCount": 2,
        "content": "on 19Oct2021"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/53427-exam-dp-100-topic-4-question-15-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You train and register a machine learning model.<br>You plan to deploy the model as a real-time web service. Applications must use key-based authentication to use the model.<br>You need to deploy the web service.<br>Solution:<br>Create an AciWebservice instance.<br>Set the value of the auth_enabled property to True.<br>Deploy the model to the service.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-06-23T19:43:00.000Z",
        "voteCount": 7,
        "content": "Yes, the correct answer is Option A. Because AKS is based on Key-value auth as default."
      },
      {
        "date": "2024-06-08T04:40:00.000Z",
        "voteCount": 1,
        "content": "It meets the requirements"
      },
      {
        "date": "2024-02-05T00:45:00.000Z",
        "voteCount": 1,
        "content": "The answer is No. The question is about AciWebservice. This option is not recommended for real-time inferencing: https://learn.microsoft.com/en-us/azure/cloud-adoption-framework/innovate/best-practices/ml-deployment-inference"
      },
      {
        "date": "2023-02-22T13:08:00.000Z",
        "voteCount": 2,
        "content": "B. No\nThe solution provided does not fully meet the goal. While creating an AciWebservice instance and deploying the model to the service are necessary steps, simply setting the value of the auth_enabled property to True does not provide a key-based authentication mechanism for the web service. Additional steps are required to generate and manage the authentication keys, such as creating an Azure Key Vault to store the keys and implementing code in the client applications to retrieve and use the keys for authentication."
      },
      {
        "date": "2022-11-27T02:09:00.000Z",
        "voteCount": 3,
        "content": "True - key-based authentication is exactly the solution here."
      },
      {
        "date": "2022-02-20T11:23:00.000Z",
        "voteCount": 2,
        "content": "On 20Feb2022"
      },
      {
        "date": "2021-11-06T15:08:00.000Z",
        "voteCount": 1,
        "content": "on 6 Nov 2021"
      },
      {
        "date": "2021-10-20T01:53:00.000Z",
        "voteCount": 3,
        "content": "on 19Oct2021"
      },
      {
        "date": "2021-06-25T08:03:00.000Z",
        "voteCount": 4,
        "content": "given answer is correct auth_enabled=True is used for Key-based authentication and token_auth_enabled =True is used for Token-based authentication\nhttps://docs.microsoft.com/en-us/azure/machine-learning/how-to-authenticate-web-service"
      },
      {
        "date": "2021-05-27T03:26:00.000Z",
        "voteCount": 3,
        "content": "I think A is correct. The requirements say : Applications must use key-based authentication to use the model. auth_enabled parameter is for key-based authentication (By default it's True for AKS) and token_auth_enabled is for token based authentication (not for key-based)."
      },
      {
        "date": "2021-05-23T09:52:00.000Z",
        "voteCount": 3,
        "content": "B: No\ntoken_auth_enabled=True\nhttps://docs.microsoft.com/en-us/python/api/azureml-core/azureml.core.webservice.akswebservice?view=azure-ml-py"
      },
      {
        "date": "2021-06-14T17:34:00.000Z",
        "voteCount": 4,
        "content": "The question says \"key-based\", not token_auth, so the correct answer is A."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/56150-exam-dp-100-topic-4-question-16-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You train and register a machine learning model.<br>You plan to deploy the model as a real-time web service. Applications must use key-based authentication to use the model.<br>You need to deploy the web service.<br>Solution:<br>Create an AciWebservice instance.<br>Set the value of the auth_enabled property to False.<br>Set the value of the token_auth_enabled property to True.<br>Deploy the model to the service.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Instead use only auth_enabled = TRUE<br>Note: Key-based authentication.<br>Web services deployed on AKS have key-based auth enabled by default. ACI-deployed services have key-based auth disabled by default, but you can enable it by setting auth_enabled = TRUE when creating the ACI web service. The following is an example of creating an ACI deployment configuration with key-based auth enabled. deployment_config &lt;- aci_webservice_deployment_config(cpu_cores = 1, memory_gb = 1, auth_enabled = TRUE)<br>Reference:<br>https://azure.github.io/azureml-sdk-for-r/articles/deploying-models.html",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-19T23:24:00.000Z",
        "voteCount": 1,
        "content": "Web services deployed on AKS have key-based auth enabled by default. ACI-deployed services have key-based auth disabled by default, but you can enable it by setting auth_enabled = TRUE when creating the ACI web service. The following is an example of creating an ACI deployment configuration with key-based auth enabled.\n\nhttps://azure.github.io/azureml-sdk-for-r/articles/deploying-models.html#key-based-authentication\n\nBut missing step generate auth_key --&gt; no meet requirement --&gt; choose B. No."
      },
      {
        "date": "2023-02-22T13:11:00.000Z",
        "voteCount": 1,
        "content": "B. No.\n\nThe solution does not meet the goal as it specifies setting the auth_enabled property to False, which means that there will be no authentication for accessing the web service. Additionally, the token_auth_enabled property is set to True, but it requires a token for authentication, which is contradictory to the previous property. To meet the goal of key-based authentication, the auth_enabled property should be set to True and the token_auth_enabled property should be set to False. Additionally, other configurations related to key-based authentication such as primary_key or secondary_key should be specified."
      },
      {
        "date": "2022-11-27T02:08:00.000Z",
        "voteCount": 1,
        "content": "Falsch - token and key-based are different authentication methods."
      },
      {
        "date": "2022-02-20T11:24:00.000Z",
        "voteCount": 1,
        "content": "On 20Feb2022"
      },
      {
        "date": "2021-10-20T01:53:00.000Z",
        "voteCount": 3,
        "content": "on 19Oct2021"
      },
      {
        "date": "2021-07-02T22:31:00.000Z",
        "voteCount": 4,
        "content": "The answer is correct. Refer Key-Based vs Token-Based https://docs.microsoft.com/en-us/azure/machine-learning/how-to-authenticate-web-service"
      },
      {
        "date": "2021-06-27T00:10:00.000Z",
        "voteCount": 4,
        "content": "The answer is FALSE\n\nhttps://azure.github.io/azureml-sdk-for-r/articles/deploying-models.html\n\nin aks there can be set authentication two way\nkey ==&gt; auth_enabled = TRUE\ntoken ==&gt; token_auth_enabled = TRUE\nproblem specified with must  authenticated by key-based"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64159-exam-dp-100-topic-4-question-17-discussion/",
    "body": "You use the following Python code in a notebook to deploy a model as a web service: from azureml.core.webservice import AciWebservice from azureml.core.model import InferenceConfig inference_config = InferenceConfig(runtime='python', source_directory='model_files', entry_script='score.py', conda_file='env.yml') deployment_config = AciWebservice.deploy_configuration(cpu_cores=1, memory_gb=1) service = Model.deploy(ws, 'my-service', [model], inference_config, deployment_config) service.wait_for_deployment(True)<br>The deployment fails.<br>You need to use the Python SDK in the notebook to determine the events that occurred during service deployment an initialization.<br>Which code segment should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.state",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.get_logs()\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.serialize()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice.environment"
    ],
    "answer": "B",
    "answerDescription": "The first step in debugging errors is to get your deployment logs. In Python: service.get_logs()<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-troubleshoot-deployment",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-20T02:16:00.000Z",
        "voteCount": 1,
        "content": "from azureml.core.webservice import AciWebservice\nfrom azureml.core.model import InferenceConfig \n\ninference_config = InferenceConfig(runtime = 'python', source_directory = 'model_files', entry_script = 'score.py', conda_file = 'env.yml')\ndeployment_config = AciWebservice.deploy_configuration(cpu_cores = 1, memory_gb = 1)\nservice = Model.deploy(ws, 'my-service', [model], inference_config, deployment_config) service.wait_for_deployment(True)\n\nlogging like this\n\nml_client.online_deployments.get_logs(name = \"&lt;deployment-name&gt;\", endpoint_name = \"&lt;endpoint-name&gt;\", lines=100)\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-troubleshoot-online-endpoints?view=azureml-api-2&amp;tabs=python#get-container-logs"
      },
      {
        "date": "2022-06-17T17:50:00.000Z",
        "voteCount": 1,
        "content": "On exam 18-06-22"
      },
      {
        "date": "2022-04-11T17:39:00.000Z",
        "voteCount": 1,
        "content": "Duplicate question"
      },
      {
        "date": "2022-03-02T23:56:00.000Z",
        "voteCount": 3,
        "content": "On Exam: 03 March 2022"
      },
      {
        "date": "2021-10-15T10:42:00.000Z",
        "voteCount": 2,
        "content": "Correct answer B"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/55752-exam-dp-100-topic-4-question-18-discussion/",
    "body": "You use the Azure Machine Learning Python SDK to define a pipeline that consists of multiple steps.<br>When you run the pipeline, you observe that some steps do not run. The cached output from a previous run is used instead.<br>You need to ensure that every step in the pipeline is run, even if the parameters and contents of the source directory have not changed since the previous run.<br>What are two possible ways to achieve this goal? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse a PipelineData object that references a datastore other than the default datastore.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the regenerate_outputs property of the pipeline to True.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the allow_reuse property of each step in the pipeline to False.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRestart the compute cluster where the pipeline experiment is configured to run.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the outputs property of each step in the pipeline to True."
    ],
    "answer": "BC",
    "answerDescription": "B: If regenerate_outputs is set to True, a new submit will always force generation of all step outputs, and disallow data reuse for any step of this run. Once this run is complete, however, subsequent runs may reuse the results of this run.<br>C: Keep the following in mind when working with pipeline steps, input/output data, and step reuse.<br>✑ If data used in a step is in a datastore and allow_reuse is True, then changes to the data change won't be detected. If the data is uploaded as part of the snapshot (under the step's source_directory), though this is not recommended, then the hash will change and will trigger a rerun.<br>Reference:<br>https://docs.microsoft.com/en-us/python/api/azureml-pipeline-core/azureml.pipeline.core.pipelinestep https://github.com/Azure/MachineLearningNotebooks/blob/master/how-to-use-azureml/machine-learning-pipelines/intro-to-pipelines/aml-pipelines-getting- started.ipynb",
    "votes": [
      {
        "answer": "BC",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-11T06:19:00.000Z",
        "voteCount": 9,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2022-11-27T02:15:00.000Z",
        "voteCount": 1,
        "content": "The other answers an nonsensical."
      },
      {
        "date": "2022-03-18T01:47:00.000Z",
        "voteCount": 3,
        "content": "on exam 18/03/2022"
      },
      {
        "date": "2022-01-25T02:46:00.000Z",
        "voteCount": 2,
        "content": "correct"
      },
      {
        "date": "2021-11-06T15:10:00.000Z",
        "voteCount": 1,
        "content": "on 6 Nov 2021"
      },
      {
        "date": "2021-06-22T18:15:00.000Z",
        "voteCount": 3,
        "content": "correct"
      },
      {
        "date": "2021-06-21T06:57:00.000Z",
        "voteCount": 4,
        "content": "seems correct!"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27447-exam-dp-100-topic-4-question-19-discussion/",
    "body": "You train a model and register it in your Azure Machine Learning workspace. You are ready to deploy the model as a real-time web service.<br>You deploy the model to an Azure Kubernetes Service (AKS) inference cluster, but the deployment fails because an error occurs when the service runs the entry script that is associated with the model deployment.<br>You need to debug the error by iteratively modifying the code and reloading the service, without requiring a re-deployment of the service for each code update.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the AKS service deployment configuration to enable application insights and re-deploy to AKS.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure Container Instances (ACI) web service deployment configuration and deploy the model on ACI.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a breakpoint to the first line of the entry script and redeploy the service to AKS.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a local web service deployment configuration and deploy the model to a local Docker container.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister a new version of the model and update the entry script to load the new version of the model from its registered path."
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-08-05T13:41:00.000Z",
        "voteCount": 50,
        "content": "The right answer is D.\n\nDeployment and runtime errors can be easier to diagnose by deploying the service as a container in a local Docker instance, like this:\nfrom azureml.core.webservice import LocalWebservice\n\ndeployment_config = LocalWebservice.deploy_configuration(port=8890)\nservice = Model.deploy(ws, 'test-svc', [model], inference_config, deployment_config)\n\nYou can then troubleshoot runtime issues by making changes to the scoring file that is referenced in the inference configuration, and reloading the service without redeploying it (something you can only do with a local service):\n\nservice.reload()\nprint(service.run(input_data = json_data))"
      },
      {
        "date": "2024-05-16T22:38:00.000Z",
        "voteCount": 1,
        "content": "will this violates the requirement \"without requiring a re-deployment of the service for each code update\""
      },
      {
        "date": "2020-08-29T09:08:00.000Z",
        "voteCount": 19,
        "content": "D: If you encounter problems deploying a model to ACI or AKS, try deploying it as a local web service. Using a local web service makes it easier to troubleshoot problems. The Docker image containing the model is downloaded and started on your local system.\n\nhttps://docs.microsoft.com/en-us/azure/machine-learning/how-to-troubleshoot-deployment"
      },
      {
        "date": "2024-05-29T11:08:00.000Z",
        "voteCount": 1,
        "content": "you need to test and debug locally before deploying to prod. Check this link: https://learn.microsoft.com/en-us/azure/machine-learning/how-to-debug-managed-online-endpoints-visual-studio-code?view=azureml-api-2&amp;tabs=cli"
      },
      {
        "date": "2023-08-22T05:47:00.000Z",
        "voteCount": 2,
        "content": "On exam Aug 18 2023"
      },
      {
        "date": "2023-08-22T05:47:00.000Z",
        "voteCount": 2,
        "content": "On exam Aug 18 2023"
      },
      {
        "date": "2023-07-26T17:51:00.000Z",
        "voteCount": 1,
        "content": "D. D. Create a local web service deployment configuration and deploy the model to a local Docker container.\n\nThis option provides a flexible and quick environment for debugging and testing. Using a local Docker container, you can quickly change the code in your entry script and immediately see the effect of your changes without going through the entire deployment process on Azure Kubernetes Service (AKS) or Azure Container Instances (ACI). Once you've debugged your entry script locally, you can then deploy it to AKS."
      },
      {
        "date": "2023-02-22T14:39:00.000Z",
        "voteCount": 1,
        "content": "C. Add a breakpoint to the first line of the entry script and redeploy the service to AKS.\nAdding a breakpoint to the first line of the entry script and redeploying the service to AKS will allow you to iteratively modify and test the code without requiring a re-deployment of the service for each code update. This will enable you to identify and fix the error in the entry script, without having to repeatedly deploy the service, saving time and resources. You can use tools like Visual Studio Code or PyCharm to attach a debugger to the running service, set a breakpoint on the first line of the entry script, and then use the debugger to step through the code and identify the error. Once you have identified and fixed the error, you can update the code, remove the breakpoint, and redeploy the service to AKS."
      },
      {
        "date": "2022-11-18T15:16:00.000Z",
        "voteCount": 1,
        "content": "The right answer is D."
      },
      {
        "date": "2022-04-11T17:42:00.000Z",
        "voteCount": 2,
        "content": "If you encounter problems deploying a model to ACI or AKS, try deploying it as a local web service."
      },
      {
        "date": "2021-07-11T06:19:00.000Z",
        "voteCount": 4,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2021-02-10T17:00:00.000Z",
        "voteCount": 3,
        "content": "Correct answer should be D"
      },
      {
        "date": "2021-01-31T09:26:00.000Z",
        "voteCount": 3,
        "content": "D, agreed. ACI is for production of low resource models. 1GB size and 48 GB ram or less"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35978-exam-dp-100-topic-4-question-20-discussion/",
    "body": "You use Azure Machine Learning designer to create a training pipeline for a regression model.<br>You need to prepare the pipeline for deployment as an endpoint that generates predictions asynchronously for a dataset of input data values.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClone the training pipeline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a batch inference pipeline from the training pipeline.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a real-time inference pipeline from the training pipeline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReplace the dataset in the training pipeline with an Enter Data Manually module."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 16,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-11-03T18:00:00.000Z",
        "voteCount": 54,
        "content": "The answer should be B :\nasync : Create a batch inference pipeline from the training pipeline"
      },
      {
        "date": "2020-11-09T19:45:00.000Z",
        "voteCount": 19,
        "content": "Should be B. \n .... batch inferencing is used to apply a predictive model to multiple cases asynchronously - usually writing the results to a file or database.\nhttps://docs.microsoft.com/en-us/learn/modules/deploy-batch-inference-pipelines-with-azure-machine-learning/1-introduction"
      },
      {
        "date": "2024-06-08T05:09:00.000Z",
        "voteCount": 1,
        "content": "asynchronously ==&gt;batch"
      },
      {
        "date": "2024-05-29T11:36:00.000Z",
        "voteCount": 1,
        "content": "use this link to help you answer this question: https://learn.microsoft.com/en-us/azure/machine-learning/concept-endpoints-batch?view=azureml-api-2#pipeline-component-deployment"
      },
      {
        "date": "2024-02-19T19:08:00.000Z",
        "voteCount": 1,
        "content": "Real time inference??? it is Batch inference."
      },
      {
        "date": "2023-10-03T21:09:00.000Z",
        "voteCount": 1,
        "content": "I think that the answer is B"
      },
      {
        "date": "2023-08-17T04:28:00.000Z",
        "voteCount": 1,
        "content": "Async= B"
      },
      {
        "date": "2023-07-26T17:54:00.000Z",
        "voteCount": 1,
        "content": "B.B. Create a batch inference pipeline from the training pipeline.\n\nAsynchronous predictions are typically done with batch inferencing. Azure Machine Learning provides the batch inference pipeline, which is suited for large volumes of data where the results aren't needed in real-time. This differs from a real-time inference pipeline, which provides synchronous, real-time predictions. So, to generate predictions asynchronously for a dataset of input data values, you should create a batch inference pipeline from the training pipeline."
      },
      {
        "date": "2023-02-23T07:56:00.000Z",
        "voteCount": 1,
        "content": "B and C."
      },
      {
        "date": "2023-02-07T05:40:00.000Z",
        "voteCount": 1,
        "content": "we are talking to get Asynch response so it should be Batch Inference"
      },
      {
        "date": "2023-01-23T06:42:00.000Z",
        "voteCount": 5,
        "content": "Another one wrong this should be B, please correct this answer I have paid for it to be sure the answers are correct."
      },
      {
        "date": "2022-10-13T10:23:00.000Z",
        "voteCount": 2,
        "content": "Examtopic should try to review all these wrong answer choices. It is obvious that the word to focus on in this question is \"\"asynchronous\". The answer is B - batch inferencing"
      },
      {
        "date": "2022-06-10T08:42:00.000Z",
        "voteCount": 4,
        "content": "Async = batch\nSync = realtime"
      },
      {
        "date": "2022-04-11T17:44:00.000Z",
        "voteCount": 4,
        "content": "\"asynchronously\" is the key word here. Asynchronous predictions means batch inferencing"
      },
      {
        "date": "2022-03-12T19:56:00.000Z",
        "voteCount": 4,
        "content": "B. Asynchronous predictions = Batch inferencing"
      },
      {
        "date": "2022-03-02T23:57:00.000Z",
        "voteCount": 2,
        "content": "Similar question On Exam: 03 March 2022"
      },
      {
        "date": "2021-07-11T06:20:00.000Z",
        "voteCount": 3,
        "content": "On exam 2021/7/10"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43144-exam-dp-100-topic-4-question-21-discussion/",
    "body": "You retrain an existing model.<br>You need to register the new version of a model while keeping the current version of the model in the registry.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister a model with a different name from the existing model and a custom property named version with the value 2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister the model with the same name as the existing model.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSave the new model in the default datastore with the same name as the existing model. Do not register the new model.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the existing model and register the new one with the same name."
    ],
    "answer": "B",
    "answerDescription": "Model version: A version of a registered model. When a new model is added to the Model Registry, it is added as Version 1. Each model registered to the same model name increments the version number.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/databricks/applications/mlflow/model-registry",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-01-23T14:00:00.000Z",
        "voteCount": 11,
        "content": "Answer is correct.\nModel version: A version of a registered model. When a new model is added to the Model Registry, it is added as Version 1. Each model registered to the same model name increments the version number."
      },
      {
        "date": "2021-07-11T06:20:00.000Z",
        "voteCount": 7,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2024-06-08T05:10:00.000Z",
        "voteCount": 1,
        "content": "registering a model with the same name as an existing model will automatically create a new version of that model. Each time you register a model with the same name, the version number increments by one."
      },
      {
        "date": "2022-02-20T11:24:00.000Z",
        "voteCount": 1,
        "content": "On 20Feb2022"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/36440-exam-dp-100-topic-4-question-22-discussion/",
    "body": "You use the Azure Machine Learning SDK to run a training experiment that trains a classification model and calculates its accuracy metric.<br>The model will be retrained each month as new data is available.<br>You must register the model for use in a batch inference pipeline.<br>You need to register the model and ensure that the models created by subsequent retraining experiments are registered only if their accuracy is higher than the currently registered model.<br>What are two possible ways to achieve this goal? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSpecify a different name for the model each time you register it.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister the model with the same name each time regardless of accuracy, and always use the latest version of the model in the batch inferencing pipeline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSpecify the model framework version when registering the model, and only register subsequent models if this value is higher.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSpecify a property named accuracy with the accuracy metric as a value when registering the model, and only register subsequent models if their accuracy is  higher than the accuracy property value of the currently registered model.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSpecify a tag named accuracy with the accuracy metric as a value when registering the model, and only register subsequent models if their accuracy is higher than the accuracy tag value of the currently registered model.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "DE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "DE",
        "count": 9,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-03-18T22:38:00.000Z",
        "voteCount": 33,
        "content": "I agree, D and E"
      },
      {
        "date": "2020-11-08T01:34:00.000Z",
        "voteCount": 15,
        "content": "DE is correct"
      },
      {
        "date": "2024-06-08T05:14:00.000Z",
        "voteCount": 1,
        "content": "D, E are both correct"
      },
      {
        "date": "2024-02-05T13:53:00.000Z",
        "voteCount": 1,
        "content": "model_framework is used to filter the result based on the framework used to train the model (such as pytorch or tensorflow). So, definitely, D and E are the answers."
      },
      {
        "date": "2023-02-07T05:45:00.000Z",
        "voteCount": 5,
        "content": "I wonder why those question are not fixed. I paid for the subscription but it is not worth if solutions are not correct."
      },
      {
        "date": "2023-01-23T06:50:00.000Z",
        "voteCount": 3,
        "content": "Another One to fix, Can wee please correct for the future customers?"
      },
      {
        "date": "2022-10-13T10:27:00.000Z",
        "voteCount": 3,
        "content": "C'mon ExamTopic, the answers are obvious here! D and E are the answers."
      },
      {
        "date": "2022-06-11T06:04:00.000Z",
        "voteCount": 2,
        "content": "Is C missing something, does not sounds like an answer"
      },
      {
        "date": "2022-04-11T05:29:00.000Z",
        "voteCount": 3,
        "content": "DE are the only ones which take into account the accuracy value hence the correct answers."
      },
      {
        "date": "2022-03-02T23:57:00.000Z",
        "voteCount": 2,
        "content": "On Exam: 03 March 2022"
      },
      {
        "date": "2021-12-14T10:01:00.000Z",
        "voteCount": 3,
        "content": "I agree with DE"
      },
      {
        "date": "2021-11-21T10:22:00.000Z",
        "voteCount": 3,
        "content": "agree on D&amp;E"
      },
      {
        "date": "2021-07-16T02:23:00.000Z",
        "voteCount": 5,
        "content": "I agree with D and E"
      },
      {
        "date": "2020-11-14T08:34:00.000Z",
        "voteCount": 11,
        "content": "I go for DE"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/57625-exam-dp-100-topic-4-question-23-discussion/",
    "body": "You are a data scientist working for a hotel booking website company. You use the Azure Machine Learning service to train a model that identifies fraudulent transactions.<br>You must deploy the model as an Azure Machine Learning real-time web service using the Model.deploy method in the Azure Machine Learning SDK. The deployed web service must return real-time predictions of fraud based on transaction data input.<br>You need to create the script that is specified as the entry_script parameter for the InferenceConfig class used to deploy the model.<br>What should the entry script do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister the model with appropriate tags and properties.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Conda environment for the web service compute and install the necessary Python packages.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLoad the model and use it to predict labels from input data.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart a node on the inference cluster where the web service is deployed.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSpecify the number of cores and the amount of memory required for the inference compute."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 10,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-11T06:21:00.000Z",
        "voteCount": 11,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2022-05-06T01:46:00.000Z",
        "voteCount": 7,
        "content": "Following the given link, the workflow to deploy a model is:\n\n1. Register the model.\n2. Prepare an entry script.\n3. Prepare an inference configuration.\n4. Deploy the model locally to ensure everything works.\n5. Choose a compute target.\n6. Deploy the model to the cloud.\n7. Test the resulting web service.\n\nWe are in interested in step 2., and this step can be divided in:\n2.1. LOADING YOUR MODEL (using a function called init())\n2.2. Running your model on input data (using a function called run())"
      },
      {
        "date": "2024-06-22T02:20:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct"
      },
      {
        "date": "2023-03-27T11:52:00.000Z",
        "voteCount": 2,
        "content": "on exam 2023-03-27"
      },
      {
        "date": "2022-03-12T20:03:00.000Z",
        "voteCount": 3,
        "content": "Given answer C is correct"
      },
      {
        "date": "2021-11-06T15:11:00.000Z",
        "voteCount": 3,
        "content": "on 6 Nov 2021"
      },
      {
        "date": "2021-07-28T06:29:00.000Z",
        "voteCount": 4,
        "content": "This answer is correct."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/49618-exam-dp-100-topic-4-question-24-discussion/",
    "body": "DRAG DROP -<br>You use Azure Machine Learning to deploy a model as a real-time web service.<br>You need to create an entry script for the service that ensures that the model is loaded when the service starts and is used to score new data as it is received.<br>Which functions should you include in the script? To answer, drag the appropriate functions to the correct actions. Each function may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04274/0039800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0039800002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: init()<br>The entry script has only two required functions, init() and run(data). These functions are used to initialize the service at startup and run the model using request data passed in by a client. The rest of the script handles loading and running the model(s).<br>Box 2: run()<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-deploy-existing-model",
    "votes": [],
    "comments": [
      {
        "date": "2021-07-11T06:21:00.000Z",
        "voteCount": 6,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2023-10-20T02:26:00.000Z",
        "voteCount": 1,
        "content": "init(): Called once at the beginning of the process, so use for any costly or common preparation like loading the model.\n\nrun(): Called for each mini batch to perform the scoring.\n\nhttps://learn.microsoft.com/en-us/training/modules/deploy-model-batch-endpoint/4-deploy-custom-model-batch-endpoint#create-the-scoring-script"
      },
      {
        "date": "2023-08-18T22:54:00.000Z",
        "voteCount": 1,
        "content": "Idk keksl"
      },
      {
        "date": "2022-03-02T23:57:00.000Z",
        "voteCount": 4,
        "content": "On Exam: 03 March 2022"
      },
      {
        "date": "2022-02-20T11:24:00.000Z",
        "voteCount": 1,
        "content": "On 20Feb2022"
      },
      {
        "date": "2021-09-02T23:38:00.000Z",
        "voteCount": 2,
        "content": "on 2/9/21"
      },
      {
        "date": "2021-07-29T17:00:00.000Z",
        "voteCount": 3,
        "content": "Given answer is correct as per link\n\nhttps://docs.microsoft.com/en-us/learn/modules/deploy-batch-inference-pipelines-with-azure-machine-learning/2-batch-inference-pipelines"
      },
      {
        "date": "2021-04-08T08:57:00.000Z",
        "voteCount": 1,
        "content": "Having checked the link provided, it seems init() and predict() are more appropriate ?"
      },
      {
        "date": "2021-04-11T05:33:00.000Z",
        "voteCount": 16,
        "content": "No. Answer is correct. init() and run(). Predict() is not used to score new data."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/36439-exam-dp-100-topic-4-question-25-discussion/",
    "body": "You develop and train a machine learning model to predict fraudulent transactions for a hotel booking website.<br>Traffic to the site varies considerably. The site experiences heavy traffic on Monday and Friday and much lower traffic on other days. Holidays are also high web traffic days.<br>You need to deploy the model as an Azure Machine Learning real-time web service endpoint on compute that can dynamically scale up and down to support demand.<br>Which deployment compute option should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tattached Azure Databricks cluster",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Container Instance (ACI)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Kubernetes Service (AKS) inference cluster\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Machine Learning Compute Instance",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tattached virtual machine in a different region"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 8,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-11-08T01:23:00.000Z",
        "voteCount": 64,
        "content": "C. AKS inference cluster"
      },
      {
        "date": "2021-01-23T14:53:00.000Z",
        "voteCount": 20,
        "content": "C as\nAKS autoscales and support real time and can manage heavy traffic\nWhy not D - because it doesn't support real time and doesn't autoscale"
      },
      {
        "date": "2024-02-19T19:28:00.000Z",
        "voteCount": 1,
        "content": "had compute cluster as an option, then what would have been the answers? compute cluster or AKS?"
      },
      {
        "date": "2023-10-20T02:27:00.000Z",
        "voteCount": 1,
        "content": "'scale up and scale down' --&gt; choose AKS. I choose C."
      },
      {
        "date": "2023-10-03T21:40:00.000Z",
        "voteCount": 1,
        "content": "I thinks the answer is C!"
      },
      {
        "date": "2023-02-07T05:59:00.000Z",
        "voteCount": 2,
        "content": "Another one to fix. Can we please fix it? This should be 100% AKS"
      },
      {
        "date": "2023-01-05T02:37:00.000Z",
        "voteCount": 4,
        "content": "AKS - always for these kind of questions"
      },
      {
        "date": "2022-03-12T20:07:00.000Z",
        "voteCount": 3,
        "content": "AKS inference cluster"
      },
      {
        "date": "2022-02-20T11:25:00.000Z",
        "voteCount": 1,
        "content": "On 20Feb2022"
      },
      {
        "date": "2021-10-20T01:53:00.000Z",
        "voteCount": 1,
        "content": "on 19Oct2021"
      },
      {
        "date": "2021-07-16T02:25:00.000Z",
        "voteCount": 2,
        "content": "I agree with C"
      },
      {
        "date": "2021-07-11T06:22:00.000Z",
        "voteCount": 6,
        "content": "On exam 2021/7/10"
      },
      {
        "date": "2021-06-25T23:50:00.000Z",
        "voteCount": 3,
        "content": "it should be C since AKS with inference cluster can autoscale and support realtime"
      },
      {
        "date": "2021-06-21T19:17:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/azure/machine-learning/concept-compute-instance\nFor production grade model training, use an Azure Machine Learning compute cluster with multi-node scaling capabilities. For production grade model deployment, use Azure Kubernetes Service cluster.\nI will go for C for sure"
      },
      {
        "date": "2021-03-18T23:10:00.000Z",
        "voteCount": 3,
        "content": "the answer is 'C' : \nUse for high-scale production deployments. Provides fast response time and autoscaling of the deployed service.\nhttps://docs.microsoft.com/fr-fr/azure/machine-learning/how-to-deploy-and-where?tabs=azcli"
      },
      {
        "date": "2020-11-27T00:25:00.000Z",
        "voteCount": 2,
        "content": "The key word there is automatically scaling up and down, so its compute instance"
      },
      {
        "date": "2020-12-03T14:51:00.000Z",
        "voteCount": 7,
        "content": "A compute instance does not automatically scale down, so make sure to stop the resource to prevent ongoing charges. Therefore, compute instance is not the right answer"
      },
      {
        "date": "2020-12-03T14:51:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/azure/machine-learning/how-to-create-manage-compute-instance?tabs=python"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/70548-exam-dp-100-topic-4-question-26-discussion/",
    "body": "You use the designer to create a training pipeline for a classification model. The pipeline uses a dataset that includes the features and labels required for model training.<br>You create a real-time inference pipeline from the training pipeline. You observe that the schema for the generated web service input is based on the dataset and includes the label column that the model predicts. Client applications that use the service must not be required to submit this value.<br>You need to modify the inference pipeline to meet the requirement.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a Select Columns in Dataset module to the inference pipeline after the dataset and use it to select all columns other than the label.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the dataset from the training pipeline and recreate the real-time inference pipeline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the Web Service Input module from the inference pipeline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReplace the dataset in the inference pipeline with an Enter Data Manually module that includes data for the feature columns but not the label column."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-03-12T20:10:00.000Z",
        "voteCount": 5,
        "content": "Given answer A is correct"
      },
      {
        "date": "2022-01-25T05:57:00.000Z",
        "voteCount": 1,
        "content": "correct"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/70550-exam-dp-100-topic-4-question-27-discussion/",
    "body": "You use the Azure Machine Learning designer to create and run a training pipeline. You then create a real-time inference pipeline.<br>You must deploy the real-time inference pipeline as a web service.<br>What must you do before you deploy the real-time inference pipeline?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the real-time inference pipeline.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a batch inference pipeline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClone the training pipeline.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure Machine Learning compute cluster."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 17,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 15,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-04-12T11:41:00.000Z",
        "voteCount": 10,
        "content": "The given answer is correct. A compute target such as AKS needs to be created in order to do inferencing real-time."
      },
      {
        "date": "2023-02-17T16:52:00.000Z",
        "voteCount": 1,
        "content": "Agreed. Azure Machine Learning endpoints can be used for either Real-time inference or Batch inference.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/concept-compute-target"
      },
      {
        "date": "2022-03-16T06:35:00.000Z",
        "voteCount": 7,
        "content": "A is the correct answer"
      },
      {
        "date": "2023-02-08T17:42:00.000Z",
        "voteCount": 2,
        "content": "I do not quite get this. The question asks what you must do before you deploy the real-time inference pipeline, and A is to run the real-time inference pipeline. If A is right, you must run the real-time inference pipeline before you deploy the real-time inference pipeline. That cannot be right, can it?"
      },
      {
        "date": "2024-06-08T05:26:00.000Z",
        "voteCount": 1,
        "content": "Answer is D, A has nothing to do before deploy"
      },
      {
        "date": "2024-05-10T07:49:00.000Z",
        "voteCount": 2,
        "content": "D is correct, because it says about deployment, this means we have think about deployment only not about whether person has run the inference-pipeline for testing"
      },
      {
        "date": "2023-12-19T07:02:00.000Z",
        "voteCount": 1,
        "content": "A for me. \n\"You use the Azure Machine Learning designer to create and run a training pipeline\" means you have run training pipeline but it doesn't mean you have run Inferencing Pipeline. You must run inferencing pipeline at least once before deployment."
      },
      {
        "date": "2023-09-07T10:54:00.000Z",
        "voteCount": 1,
        "content": "A is the one"
      },
      {
        "date": "2023-07-31T22:05:00.000Z",
        "voteCount": 4,
        "content": "To deploy a real-time inference pipeline, you have to run the pipeline at least once (submit before you deploy it) \nhttps://learn.microsoft.com/en-us/azure/machine-learning/tutorial-designer-automobile-price-deploy?view=azureml-api-1"
      },
      {
        "date": "2023-07-26T18:35:00.000Z",
        "voteCount": 2,
        "content": "D. Create an Azure Machine Learning compute cluster.\n\nIn order to deploy a real-time inference pipeline as a web service in Azure Machine Learning, you need to have a compute target, and this can be an Azure Machine Learning Compute Cluster. This is where your model will be hosted and run when you deploy it. The other options are not necessary before deploying the inference pipeline. Running the pipeline or creating a batch inference pipeline isn't required before deployment. Cloning the training pipeline also has no direct bearing on deploying the real-time inference pipeline."
      },
      {
        "date": "2023-07-01T06:26:00.000Z",
        "voteCount": 2,
        "content": "\"You use the Azure Machine Learning designer to create and run a training pipeline. You then create a real-time inference pipeline\". This means that you already ran the training pipeline, because otherwise you would not have been able to create a real-time inferencing pipeline. So the only logical in my view would be D."
      },
      {
        "date": "2023-04-26T19:08:00.000Z",
        "voteCount": 2,
        "content": "I think the given answer is correct"
      },
      {
        "date": "2023-03-08T04:30:00.000Z",
        "voteCount": 1,
        "content": "Exactly this question was on exam 07/March/2023"
      },
      {
        "date": "2023-02-23T12:02:00.000Z",
        "voteCount": 1,
        "content": "D. Create an Azure Machine Learning compute cluster."
      },
      {
        "date": "2022-10-13T00:24:00.000Z",
        "voteCount": 1,
        "content": "AKS is not given as one of the options, so i'd vote for A"
      },
      {
        "date": "2022-06-17T17:51:00.000Z",
        "voteCount": 2,
        "content": "On exam 18-06-22"
      },
      {
        "date": "2022-06-11T06:10:00.000Z",
        "voteCount": 4,
        "content": "A is correct!  You must have a target already, so you can train a pipeline, which is a given"
      },
      {
        "date": "2022-03-27T04:35:00.000Z",
        "voteCount": 2,
        "content": "Correct answer is D. Read the link provided. After creating the real time inference cluster, a compute cluster must be created to run the inference."
      },
      {
        "date": "2022-03-12T13:30:00.000Z",
        "voteCount": 2,
        "content": "Answer is A. Run the real-time inference pipeline.\n\nRelated words: \"Submit the inference pipeline as a new experiment named mslearn-designer-predict-diabetes on the compute cluster you used for training. This may take a while!\"\n\nREF: https://microsoftlearning.github.io/mslearn-dp100/instructions/03-azureml-designer.html"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/72267-exam-dp-100-topic-4-question-28-discussion/",
    "body": "You create an Azure Machine Learning workspace named ML-workspace. You also create an Azure Databricks workspace named DB-workspace. DB-workspace contains a cluster named DB-cluster.<br>You must use DB-cluster to run experiments from notebooks that you import into DB-workspace.<br>You need to use ML-workspace to track MLflow metrics and artifacts generated by experiments running on DB-cluster. The solution must minimize the need for custom code.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DB-cluster, configure the Advanced Logging option.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DB-workspace, configure the Link Azure ML workspace option.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom ML-workspace, create an attached compute.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom ML-workspace, create a compute cluster."
    ],
    "answer": "B",
    "answerDescription": "Connect your Azure Databricks and Azure Machine Learning workspaces:<br>Linking your ADB workspace to your Azure Machine Learning workspace enables you to track your experiment data in the Azure Machine Learning workspace.<br>To link your ADB workspace to a new or existing Azure Machine Learning workspace<br>1. Sign in to Azure portal.<br>2. Navigate to your ADB workspace's Overview page.<br>3. Select the Link Azure Machine Learning workspace button on the bottom right.<br><img src=\"/assets/media/exam-media/04274/0040200001.jpg\" class=\"in-exam-image\"><br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-use-mlflow-azure-databricks",
    "votes": [],
    "comments": [
      {
        "date": "2022-03-02T23:58:00.000Z",
        "voteCount": 8,
        "content": "On Exam: 03 March 2022"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/70054-exam-dp-100-topic-4-question-29-discussion/",
    "body": "HOTSPOT -<br>You create an Azure Machine Learning workspace.<br>You need to detect data drift between a baseline dataset and a subsequent target dataset by using the DataDriftDetector class.<br>How should you complete the code segment? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04274/0040300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0040400001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: create_from_datasets -<br>The create_from_datasets method creates a new DataDriftDetector object from a baseline tabular dataset and a target time series dataset.<br><br>Box 2: backfill -<br>The backfill method runs a backfill job over a given specified start and end date.<br>Syntax: backfill(start_date, end_date, compute_target=None, create_compute_target=False)<br>Incorrect Answers:<br>List and update do not have datetime parameters.<br>Reference:<br>https://docs.microsoft.com/en-us/python/api/azureml-datadrift/azureml.datadrift.datadriftdetector(class)",
    "votes": [],
    "comments": [
      {
        "date": "2022-03-02T23:58:00.000Z",
        "voteCount": 5,
        "content": "On Exam: 03 March 2022"
      },
      {
        "date": "2023-12-31T13:25:00.000Z",
        "voteCount": 1,
        "content": "Given answer is correct: create_from_datasets  and   backfill\n\n# Instantiate a DataDriftDetector object with the necessary parameters for data drift detection\nmonitor = DataDriftDetector.create_from_datasets(ws, 'drift-monitor', baseline, \n                                                 target, compute_target='cpu-cluster', \n                                                 frequency='Week', feature_list=None, \n                                                 drift_threshold=6, latency=24)\n\n# Run the data drift analysis over the specified time period from the start date to today\ncomplete = monitor.backfill(datetime(2021, 1, 1), datetime.today())"
      },
      {
        "date": "2023-10-20T02:36:00.000Z",
        "voteCount": 1,
        "content": "azureml.datadrift.DataDriftDetector.backfill() --&gt; Run a backfill job over a given specified start and end date.\n\nazureml.datadrift.DataDriftDetector.create_from_dataset() --&gt; Create a new DataDriftDectector object from baseline tabular dataset and set a target time series dataset.\n\nhttps://learn.microsoft.com/en-us/python/api/azureml-datadrift/azureml.datadrift.datadriftdetector.datadriftdetector?view=azure-ml-py#methods\n\nchoose 1) create_from_datasets(...) 2) backfill(...) . Very clear."
      },
      {
        "date": "2022-01-15T03:54:00.000Z",
        "voteCount": 4,
        "content": "Agree with answer."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/69010-exam-dp-100-topic-4-question-30-discussion/",
    "body": "You are planning to register a trained model in an Azure Machine Learning workspace.<br>You must store additional metadata about the model in a key-value format. You must be able to add new metadata and modify or delete metadata after creation.<br>You need to register the model.<br>Which parameter should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tdescription",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmodel_framework",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ttags\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tproperties"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 21,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-01-02T13:33:00.000Z",
        "voteCount": 10,
        "content": "Tags can be deleted but properties cannot."
      },
      {
        "date": "2022-04-12T12:10:00.000Z",
        "voteCount": 6,
        "content": "The correct answer is C. To clarify things for everybody: tags and properties are both key value pairs . But here is the important difference: tags can be changed later; but properties can't be changed after the model is registered."
      },
      {
        "date": "2023-10-20T02:42:00.000Z",
        "voteCount": 1,
        "content": "Tag key-value pairs for model\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-manage-models?view=azureml-api-2&amp;tabs=python%2Cuse-local#update\n\nhttps://learn.microsoft.com/en-us/python/api/azureml-core/azureml.core.model.model?view=azure-ml-py#parameters"
      },
      {
        "date": "2023-02-23T12:39:00.000Z",
        "voteCount": 1,
        "content": "Seems C."
      },
      {
        "date": "2022-03-27T19:13:00.000Z",
        "voteCount": 1,
        "content": "Tags can be deleted or changed.\n\nhttps://docs.microsoft.com/en-us/azure/azure-resource-manager/management/tag-resources?tabs=json"
      },
      {
        "date": "2021-12-29T15:31:00.000Z",
        "voteCount": 4,
        "content": "Should be tags because those can be deleted."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/70056-exam-dp-100-topic-4-question-31-discussion/",
    "body": "You have a Python script that executes a pipeline. The script includes the following code: from azureml.core import Experiment pipeline_run = Experiment(ws, 'pipeline_test').submit(pipeline)<br>You want to test the pipeline before deploying the script.<br>You need to display the pipeline run details written to the STDOUT output when the pipeline completes.<br>Which code segment should you add to the test script?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tpipeline_run.get.metrics()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tpipeline_run.wait_for_completion(show_output=True)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tpipeline_param = PipelineParameter(name=\"stdout\", default_value=\"console\")",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tpipeline_run.get_status()"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-10T11:26:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is B"
      },
      {
        "date": "2022-04-12T12:21:00.000Z",
        "voteCount": 3,
        "content": "Confirmed, given answer is correct."
      },
      {
        "date": "2022-03-18T01:48:00.000Z",
        "voteCount": 4,
        "content": "on exam 18/03/2022"
      },
      {
        "date": "2022-03-12T21:42:00.000Z",
        "voteCount": 1,
        "content": "Given answer B is correct"
      },
      {
        "date": "2022-01-15T03:58:00.000Z",
        "voteCount": 2,
        "content": "agree with answer \"when the pipeline completes\" is key"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81322-exam-dp-100-topic-4-question-32-discussion/",
    "body": "You train and register a machine learning model. You create a batch inference pipeline that uses the model to generate predictions from multiple data files.<br>You must publish the batch inference pipeline as a service that can be scheduled to run every night.<br>You need to select an appropriate compute target for the inference service.<br>Which compute target should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Machine Learning compute instance",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Machine Learning compute cluster\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Kubernetes Service (AKS)-based inference cluster\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Container Instance (ACI) compute target"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 5,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-01-12T19:18:00.000Z",
        "voteCount": 9,
        "content": "I think the confusion here is real-time vs batch.  A real-time inference pipeline should use AKS.  This is a BATCH inference pipeline.  The answer is B."
      },
      {
        "date": "2023-01-29T04:58:00.000Z",
        "voteCount": 2,
        "content": "I agree the answer is B. Indeed, in the example notebook: Create a Batch Inferencing Service\nhttps://github.com/MicrosoftLearning/mslearn-dp100/blob/main/10%20-%20Create%20a%20Batch%20Inferencing%20Service.ipynb\nExisting compute cluster resource is checked and set as pipeline compute target:\ntry:\n    # Check for existing compute target\n    inference_cluster = ComputeTarget(workspace=ws, name=cluster_name)\n...\nparallel_run_config = ParallelRunConfig(\n    source_directory=experiment_folder,\n    entry_script=\"batch_diabetes.py\",\n    mini_batch_size=\"5\",\n    error_threshold=10,\n    output_action=\"append_row\",\n    environment=batch_env,\n    compute_target=inference_cluster,\n    node_count=2)"
      },
      {
        "date": "2024-06-09T00:41:00.000Z",
        "voteCount": 1,
        "content": "C is for real time B for batch"
      },
      {
        "date": "2024-05-29T17:24:00.000Z",
        "voteCount": 1,
        "content": "based on the SDK V2 Doc: https://learn.microsoft.com/en-us/azure/machine-learning/concept-compute-target?view=azureml-api-2#compute-targets-for-inference"
      },
      {
        "date": "2023-08-24T08:34:00.000Z",
        "voteCount": 1,
        "content": "Azure Kubernetes Service (AKS) is a managed Kubernetes service that simplifies the deployment and management of a Kubernetes cluster in Azure1. An AKS-based inference cluster can be used to deploy machine learning models for real-time inferencing, but it is not the best choice for running batch inference jobs. For batch inference, you would want to use a compute target that can distribute the processing of large amounts of data across multiple nodes in the cloud"
      },
      {
        "date": "2023-01-12T19:18:00.000Z",
        "voteCount": 3,
        "content": "Voting B"
      },
      {
        "date": "2022-12-15T03:23:00.000Z",
        "voteCount": 3,
        "content": "I think the answer B is indeed correct! There is no wording about a \"production-level\" or \"heavy-workload\" deployment (this would always hint to AKS), and according to the documentation: \n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/concept-compute-target\n\na compute-cluster supports job-scheduling aka scheduling to run every night, and scales up and down depending on the configuration."
      },
      {
        "date": "2022-11-15T22:48:00.000Z",
        "voteCount": 1,
        "content": "Yes, Answer should be AKS"
      },
      {
        "date": "2022-10-23T19:23:00.000Z",
        "voteCount": 3,
        "content": "Answer should be AKS.\n\nCompute targets for inference:\n1.Local web service\n2.Azure Machine Learning endpoints\n3.Azure Machine Learning Kubernetes\n4.Azure Container Instances (SDK/CLI v1 only)\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/concept-compute-target"
      },
      {
        "date": "2023-04-26T19:22:00.000Z",
        "voteCount": 1,
        "content": "I agree with you"
      },
      {
        "date": "2022-10-18T04:35:00.000Z",
        "voteCount": 3,
        "content": "It should be aks !"
      },
      {
        "date": "2022-09-08T23:49:00.000Z",
        "voteCount": 2,
        "content": "why not AKS?"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81061-exam-dp-100-topic-4-question-33-discussion/",
    "body": "DRAG DROP -<br>You train and register a model by using the Azure Machine Learning SDK on a local workstation. Python 3.6 and Visual Studio Code are installed on the workstation.<br>When you try to deploy the model into production as an Azure Kubernetes Service (AKS)-based web service, you experience an error in the scoring script that causes deployment to fail.<br>You need to debug the service on the local workstation before deploying the service to production.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04274/0040700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0040800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Install Docker on the workstation<br>Prerequisites include having a working Docker installation on your local system.<br>Build or download the dockerfile to the compute node.<br>Step 2: Create an AksWebservice deployment configuration and deploy the model to it<br>To deploy a model to Azure Kubernetes Service, create a deployment configuration that describes the compute resources needed.<br># If deploying to a cluster configured for dev/test, ensure that it was created with enough<br># cores and memory to handle this deployment configuration. Note that memory is also used by<br># things such as dependencies and AML components.<br>deployment_config = AksWebservice.deploy_configuration(cpu_cores = 1, memory_gb = 1) service = Model.deploy(ws, \"myservice\", [model], inference_config, deployment_config, aks_target) service.wait_for_deployment(show_output = True) print(service.state) print(service.get_logs())<br>Step 3: Create a LocalWebservice deployment configuration for the service and deploy the model to it<br>To deploy locally, modify your code to use LocalWebservice.deploy_configuration() to create a deployment configuration. Then use Model.deploy() to deploy the service.<br>Step 4: Debug and modify the scoring script as necessary. Use the reload() method of the service after each modification.<br>During local testing, you may need to update the score.py file to add logging or attempt to resolve any problems that you've discovered. To reload changes to the score.py file, use reload(). For example, the following code reloads the script for the service, and then sends data to it.<br>Incorrect Answers:<br>✑ AciWebservice: The types of web services that can be deployed are LocalWebservice, which will deploy a model locally, and AciWebservice and<br>AksWebservice, which will deploy a model to Azure Container Instances (ACI) and Azure Kubernetes Service (AKS), respectively.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/machine-learning/how-to-deploy-azure-kubernetes-service https://docs.microsoft.com/en-us/azure/machine-learning/how-to-troubleshoot-deployment-local",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-23T21:39:00.000Z",
        "voteCount": 30,
        "content": "My answer:\n1.Install Docker on the workstation\nCreate a LocalWebservice deployment configuration for the service and deploy the mode to it\n3.Debug and modify the scroing script as necessary. use the reload() method of the service after earch modification.\n4.Creae an AksWebservice deployment configuration for the service and deploy the model to it\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-deploy-managed-online-endpoints?tabs=python"
      },
      {
        "date": "2024-02-05T19:11:00.000Z",
        "voteCount": 1,
        "content": "I agree with this answer but i want to know if the following sequence is also correct:\n1. Create localwebservice\n2. debug and modify the scoring script\n3. install docker\n4. Create Akswebserice"
      },
      {
        "date": "2022-09-07T19:01:00.000Z",
        "voteCount": 8,
        "content": "Logically, \"Create AksWebService\" should be the last step."
      },
      {
        "date": "2022-10-21T06:46:00.000Z",
        "voteCount": 2,
        "content": "agree with you, you redeploy to aks after finished to debug."
      },
      {
        "date": "2023-02-23T16:43:00.000Z",
        "voteCount": 2,
        "content": "Install Docker on the workstation \nCreate a LocalWebservice deployment configuration for the service and deploy the model to it (C)\nDebug and modify the scoring script as necessary. Use the reload() method of the service after each modification \nCreate an AksWebservice deployment configuration and deploy the model to it"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80913-exam-dp-100-topic-4-question-34-discussion/",
    "body": "DRAG DROP -<br>You create an Azure Machine Learning workspace and a new Azure DevOps organization. You register a model in the workspace and deploy the model to the target environment.<br>All new versions of the model registered in the workspace must automatically be deployed to the target environment.<br>You need to configure Azure Pipelines to deploy the model.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04274/0040900002.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04274/0041000001.png\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Create an Azure DevOps project<br>Step 2: Create a release pipeline<br>1. Sign in to your Azure DevOps organization and navigate to your project.<br>2. Go to Pipelines, and then select New pipeline.<br>Step 3: Install the Machine Learning extension for Azure Pipelines<br>You must install and configure the Azure CLI and ML extension.<br>Step 4: Create a service connection<br>How to set up your service connection<br><img src=\"/assets/media/exam-media/04274/0041100001.jpg\" class=\"in-exam-image\"><br>Select AzureMLWorkspace for the scope level, then fill in the following subsequent parameters.<br><img src=\"/assets/media/exam-media/04274/0041200001.jpg\" class=\"in-exam-image\"><br>Note: How to enable model triggering in a release pipeline<br>✑ Go to your release pipeline and add a new artifact. Click on AzureML Model artifact then select the appropriate AzureML service connection and select from the available models in your workspace.<br>✑ Enable the deployment trigger on your model artifact as shown here. Every time a new version of that model is registered, a release pipeline will be triggered.<br>Reference:<br>https://marketplace.visualstudio.com/items?itemName=ms-air-aiagility.vss-services-azureml https://docs.microsoft.com/en-us/azure/devops/pipelines/targets/azure-machine-learning",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-24T21:08:00.000Z",
        "voteCount": 20,
        "content": "From CI/CD pipeline perspective, the e2e process should be:\n1. Create a project.\n2. Create service connections.\n3. Create build pipeline.\n4. Create release pipeline.\nI don't think it's necessary to install ml extension as a separate step since it's in pipeline script code.\n\nhttps://www.azuredevopslabs.com/labs/vstsextend/aml/"
      },
      {
        "date": "2023-04-26T19:36:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/azure/devops/pipelines/targets/azure-machine-learning?view=azure-devops\nI agree with you"
      },
      {
        "date": "2024-02-05T03:47:00.000Z",
        "voteCount": 1,
        "content": "The extension is for Azure pipelines, part of Azure devops, and this reference says it is a prerequisite for the steps you describe here: https://learn.microsoft.com/en-us/azure/machine-learning/how-to-devops-machine-learning?view=azureml-api-2&amp;viewFallbackFrom=azure-devops&amp;tabs=arm"
      },
      {
        "date": "2022-09-07T06:32:00.000Z",
        "voteCount": 14,
        "content": "Looking at the doc below, the correct sequence should be:\n1) create devops project [STEP 2]\n2) create service connection [STEP 3]\n3) create release pipeline [STEP 4]\n4) install SDK extension [STEP 6]\n\nhttps://docs.microsoft.com/en-us/azure/devops/pipelines/targets/azure-machine-learning?view=azure-devops"
      },
      {
        "date": "2023-01-16T02:43:00.000Z",
        "voteCount": 1,
        "content": "Why would install ML extension be the last step? @bbigwolf's answer seems correct."
      },
      {
        "date": "2024-02-17T09:54:00.000Z",
        "voteCount": 1,
        "content": "Agree but 3) should be replaced by \"create build pipeline\" that correlates with steps 4 and 5 from azure website article. The main task is to configure azure pipelines. so create release pipeline will be the discarded step.\nThe main task is to configure azure pipelines. so create release pipeline will be the discarded step."
      },
      {
        "date": "2024-10-14T18:08:00.000Z",
        "voteCount": 1,
        "content": "1.\tCreate an Azure DevOps project: This is the first step, where you set up a new Azure DevOps project to manage your build and release pipelines.\n\t2.\tInstall the Machine Learning extension for Azure Pipelines: This step ensures that the necessary tools are in place for working with Azure Machine Learning in your DevOps environment.\n\t3.\tCreate a service connection: This creates the link between Azure DevOps and your Azure Machine Learning workspace, allowing the pipelines to interact with your models and other resources.\n\t4.\tCreate a release pipeline: This pipeline is used to automate the deployment of the model to the target environment whenever a new model version is registered."
      },
      {
        "date": "2024-05-30T02:15:00.000Z",
        "voteCount": 1,
        "content": "To configure Azure Pipelines to deploy a model from an Azure Machine Learning workspace, you should follow a specific sequence of actions. Here's the correct order based on the provided options:\n\nCreate an Azure DevOps project: This is the initial step where you set up the project in Azure DevOps.\nInstall the Machine Learning extension for Azure Pipelines: This step ensures that you have the necessary tools to work with Azure Machine Learning in your pipeline.\nCreate a service connection: This step involves creating a connection to the Azure Machine Learning workspace so that the pipeline can interact with it.\nCreate a build pipeline: This is where you define the build process, which includes steps to register the model.\nCreate a release pipeline: Finally, set up the release pipeline to deploy the registered model to the target environment."
      },
      {
        "date": "2023-03-27T11:45:00.000Z",
        "voteCount": 3,
        "content": "On exam 2023-03-27"
      },
      {
        "date": "2023-02-23T17:02:00.000Z",
        "voteCount": 3,
        "content": "Create a service connection: A service connection is required to connect Azure DevOps to Azure Machine Learning workspace.\nInstall the Machine learning extension for Azure pipelines: This extension is required to use the Azure Machine Learning tasks in the release pipeline.\nCreate a build pipeline: This step is optional, but it can be useful to create a build pipeline to build and package the model.\nCreate a release pipeline: This step is essential to create a release pipeline that deploys the model to the target environment. \n\nCreate an Azure DevOps project is not necessary since you have already created an Azure DevOps organization."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/86307-exam-dp-100-topic-4-question-35-discussion/",
    "body": "You use the Azure Machine Learning designer to create and run a training pipeline.<br>The pipeline must be run every night to inference predictions from a large volume of files. The folder where the files will be stored is defined as a dataset.<br>You need to publish the pipeline as a REST service that can be used for the nightly inferencing run.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a batch inference pipeline\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the compute target for the pipeline to an inference cluster",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a real-time inference pipeline",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClone the pipeline"
    ],
    "answer": "A",
    "answerDescription": "Azure Machine Learning Batch Inference targets large inference jobs that are not time-sensitive. Batch Inference provides cost-effective inference compute scaling, with unparalleled throughput for asynchronous applications. It is optimized for high-throughput, fire-and-forget inference over large collections of data.<br>You can submit a batch inference job by pipeline_run, or through REST calls with a published pipeline.<br>Reference:<br>https://github.com/Azure/MachineLearningNotebooks/blob/master/how-to-use-azureml/machine-learning-pipelines/parallel-run/README.md",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-01-14T03:58:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2022-10-23T22:04:00.000Z",
        "voteCount": 2,
        "content": "Correct."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 36,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104052-exam-dp-100-topic-4-question-36-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create an Azure Machine Learning model to include model files and a scoring script.<br><br>You must deploy the model. The deployment solution must meet the following requirements:<br><br>•\tProvide near real-time inferencing.<br>•\tEnable endpoint and deployment level cost estimates.<br>•\tSupport logging to Azure Log Analytics.<br><br>You need to configure the deployment solution.<br><br>What should you configure? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image437.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image438.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-09T00:55:00.000Z",
        "voteCount": 1,
        "content": "Endpoint type: Kubernetes online\nDeployment component: Azure Kubernetes Service (AKS) cluster"
      },
      {
        "date": "2024-02-19T20:38:00.000Z",
        "voteCount": 1,
        "content": "answers are correct:\n\nA Docker image can be used for real-time inferencing of ML models, depending on the deployment solution and the requirements. For example, you can use a Docker image to create a web service that exposes your model via a REST API and responds to requests with predictions in near real-time1. Alternatively, you can use a Docker image to deploy your model to a cloud platform such as Amazon SageMaker2 or Azure Machine Learning3 that provides managed online endpoints for real-time inferencing. However, using a Docker image for real-time inferencing may also introduce some challenges, such as ensuring the compatibility and security of the image, synchronizing the image with the online feature store, and scaling the image to handle the traffic and latency demands4. Therefore, you should carefully evaluate the trade-offs and best practices of using a Docker image for real-time inferencing of ML models."
      },
      {
        "date": "2024-02-18T07:23:00.000Z",
        "voteCount": 1,
        "content": "Deployment component asnwer might be docker image! Because:\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-deploy-online-endpoints?view=azureml-api-2&amp;tabs=azure-cli#define-the-deployment\nDefine the deployment: \nA deployment is a set of resources required for hosting the model that does the actual inferencing. To deploy a model, you must have: (among others)\n- An environment in which your model runs. The environment can be a Docker image with Conda dependencies or a Dockerfile."
      },
      {
        "date": "2023-08-25T02:13:00.000Z",
        "voteCount": 1,
        "content": "both managed online endpoints and AKS-based online endpoints can be used to deploy machine learning models for real-time inferencing in Azure Machine Learning. Managed online endpoints are fully managed by Azure Machine Learning and provide a simple and cost-effective way to deploy models for real-time inferencing. They also provide out-of-the-box monitoring and logging powered by Azure Monitor and Log Analytics, which includes key metrics and log tables for endpoints and deployments. On the other hand, AKS-based online endpoints provide more flexibility and control, but require more user responsibility to set up and manage. \n\nSo the only reason I would go for managed online is the mentioning of Azure Log Analytics directly. \n\nSecond one should be Azure Kubernetes Service (AKS) for deployment. \n\nSaM"
      },
      {
        "date": "2023-06-04T03:32:00.000Z",
        "voteCount": 2,
        "content": "To enable endpoint and deployment level cost estimates, you can use managed online endpoints. Managed online endpoints work with powerful CPU and GPU machines in Azure in a scalable, fully managed way. They take care of serving, scaling, securing, and monitoring your models, freeing you from the underlying infrastructure management.\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/concept-endpoints-online?view=azureml-api-2#managed-online-endpoints-vs-kubernetes-online-endpoints"
      },
      {
        "date": "2023-04-26T19:59:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/machine-learning/concept-endpoints?view=azureml-api-2\nmanaged online can provide deployment level cost estimates"
      },
      {
        "date": "2023-04-26T20:06:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/aks/monitor-aks#analyze-log-data-with-log-analytics\nThere is a 'Analyze log data with Log Analytics' part, maybe this is the evidence that we can choose AKS for the second question. If anyone find better evidence please let me know"
      },
      {
        "date": "2023-03-28T18:58:00.000Z",
        "voteCount": 2,
        "content": "I would go for EndpointType: managed online, Deployment component: AKS cluster"
      },
      {
        "date": "2023-03-27T11:48:00.000Z",
        "voteCount": 4,
        "content": "Was on exam 2023-03-27"
      },
      {
        "date": "2023-03-27T02:36:00.000Z",
        "voteCount": 1,
        "content": "Is it correct?"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 37,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104684-exam-dp-100-topic-4-question-37-discussion/",
    "body": "You are developing a machine learning model.<br><br>You must inference the machine learning model for testing.<br><br>You need to use a minimal cost compute target.<br><br>Which two compute targets should you use? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Machine Learning Kubernetes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Databricks",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemote VM",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLocal web service",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Container Instances"
    ],
    "answer": "DE",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-12-19T07:47:00.000Z",
        "voteCount": 2,
        "content": "C &amp; D. \nBased on my exp, most expensive is Databricks, AKS/ACI with GPU support are the next one, then AKS/ACI w/o GPU, last one is VM. \nAll of them are available as a compute target for Auto ML/ML pipelines [https://learn.microsoft.com/en-us/azure/machine-learning/concept-compute-target?view=azureml-api-2], so I will choose CD for minimal cost."
      },
      {
        "date": "2023-04-26T20:09:00.000Z",
        "voteCount": 3,
        "content": "https://learn.microsoft.com/en-us/azure/machine-learning/concept-compute-target?view=azureml-api-2#compute-targets-for-inference\nI think the given answer is correct"
      },
      {
        "date": "2023-03-31T20:26:00.000Z",
        "voteCount": 4,
        "content": "The inference is for testing. We do not need a Web Service. Answer should be C and E"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 38,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104114-exam-dp-100-topic-4-question-38-discussion/",
    "body": "You train and publish a machine learning model.<br><br>You need to run a pipeline that retrains the model based on a trigger from an external system.<br><br>What should you configure?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Data Catalog",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Batch",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Logic App\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-08-31T00:59:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2024-02-05T03:58:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct. Here is a reference: https://learn.microsoft.com/en-us/azure/machine-learning/how-to-trigger-published-pipeline?view=azureml-api-1&amp;viewFallbackFrom=azureml-api-2"
      },
      {
        "date": "2023-06-04T03:40:00.000Z",
        "voteCount": 2,
        "content": "To run a pipeline that retrains a machine learning model based on a trigger from an external system, you can use Azure Logic App. Azure Logic App is an event-driven platform that can be used to trigger applications, processes, or CI/CD workflows based on Azure Machine Learning events[1]. You can set up a Logic App to be triggered by a Machine Learning event, such as a pipeline run, and then perform an action based on that trigger[1].\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-use-event-grid?view=azureml-api-2"
      },
      {
        "date": "2023-03-27T11:50:00.000Z",
        "voteCount": 2,
        "content": "On exam 2023-03-27"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 39,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106001-exam-dp-100-topic-4-question-39-discussion/",
    "body": "You create an Azure Machine Learning workspace.<br><br>You must configure an event handler to send an email notification when data drift is detected in the workspace datasets. You must minimize development efforts.<br><br>You need to configure an Azure service to send the notification.<br><br>Which Azure service should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Logic Apps\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Automation runbook",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Function apps",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure DevOps pipeline"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-12-31T13:31:00.000Z",
        "voteCount": 1,
        "content": "A is correct.\n\nAzure Logic Apps: Azure Logic Apps is an ideal choice for setting up automated workflows, like sending email notifications in response to specific triggers or events. In this case, an event handler can be configured in Azure Logic Apps to monitor data drift in Azure Machine Learning workspace datasets. When data drift is detected, the logic app can automatically send an email notification. This approach is efficient and requires minimal development effort, aligning with the requirement to minimize development efforts.\n\nAzure Automation runbook: operations management and process automation within Azure environments. They are not the most direct or efficient method for setting up email notifications in response to data drift events in Azure Machine Learning.\n\nAzure Function apps: could technically be used to detect data drift and send email notifications, it would require more development effort compared to using Azure Logic Apps. \n\nAzure DevOps pipeline: primarily used for CI/CD processes, not typically used for monitoring data drift or sending email notifications."
      },
      {
        "date": "2023-04-12T00:31:00.000Z",
        "voteCount": 1,
        "content": "imo correct"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 40,
    "url": "https://www.examtopics.com/discussions/microsoft/view/109154-exam-dp-100-topic-4-question-40-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create an Azure Machine Learning dataset. You use the Azure Machine Learning designer to transform the dataset by using an Execute Python Script component and custom code.<br><br>You must upload the script and associated libraries as a script bundle.<br><br>You need to configure the Execute Python Script component.<br><br>Which configurations should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image439.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image440.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-02-05T04:13:00.000Z",
        "voteCount": 2,
        "content": "Right and zip. Reference: https://learn.microsoft.com/en-us/azure/machine-learning/component-reference/execute-python-script?view=azureml-api-2"
      },
      {
        "date": "2023-08-25T02:25:00.000Z",
        "voteCount": 1,
        "content": "Right, and zip \n\nSaM"
      },
      {
        "date": "2023-07-27T05:14:00.000Z",
        "voteCount": 2,
        "content": "Right port, zip"
      },
      {
        "date": "2023-06-04T03:47:00.000Z",
        "voteCount": 2,
        "content": "To include new Python packages or code, connect the zipped file that contains these custom resources to Script bundle port. Or if your script is larger than 16 KB, use the Script Bundle port to avoid errors like CommandLine exceeds the limit of 16597 characters.\n\nBundle the script and other custom resources to a zip file.\nUpload the zip file as a File Dataset to the studio.\nDrag the dataset component from the Datasets list in the left component pane in the designer authoring page.\nConnect the dataset component to the Script Bundle port of Execute Python Script component.\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/component-reference/execute-python-script?view=azureml-api-2"
      },
      {
        "date": "2023-05-13T05:03:00.000Z",
        "voteCount": 2,
        "content": "Right Port &amp; Zip.\n https://learn.microsoft.com/en-us/azure/machine-learning/how-to-designer-python?view=azureml-api-2"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 41,
    "url": "https://www.examtopics.com/discussions/microsoft/view/103425-exam-dp-100-topic-4-question-41-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create a list of movie descriptions in text data format.<br><br>You must analyze the movie descriptions with automated machine learning.<br><br>You need to use the Azure Machine Learning for Python SDK v1 to configure a job with the specific natural language processing (NLP) task function for AutoML jobs.<br><br>Which functions should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image441.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image442.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-20T16:35:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/machine-learning/how-to-auto-train-nlp-models?tabs=cli#named-entity-recognition-ner"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 42,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104054-exam-dp-100-topic-4-question-42-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You create an Azure Machine Learning pipeline named pipeline1 with two steps that contain Python scripts. Data processed by the first step is passed to the second step.<br><br>You must update the content of the downstream data source of pipeline1 and run the pipeline again.<br><br>You need to ensure the new run of pipeline1 fully processes the updated content.<br><br>Solution: Set the allow_reuse parameter of the PythonScriptStep object of both steps to False.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-08-25T02:53:00.000Z",
        "voteCount": 2,
        "content": "Yes, the solution meets the goal. Setting the allow_reuse parameter of the PythonScriptStep object of both steps to False will ensure that the new run of pipeline1 fully processes the updated content. When the allow_reuse parameter is set to False, the step will always be re-run, even if its inputs and parameters have not changed. This means that when you update the content of the downstream data source of pipeline1 and run the pipeline again, both steps will be re-run and the updated content will be fully processed. \n\nSaM"
      },
      {
        "date": "2023-08-21T04:42:00.000Z",
        "voteCount": 1,
        "content": "Actually I don't get the question as they talk about changing data downstream of pipeline1 in which case there is no reason at all to run the pipeline again. But still, If ensuring that the pipeline runs is the aim, \"yes\" is the correct answer."
      },
      {
        "date": "2023-06-04T03:57:00.000Z",
        "voteCount": 1,
        "content": "ChatGPT-3.5\n\nThe correct solution in this case would be to set the allow_reuse parameter of the PythonScriptStep object of both steps to False.\n\nSetting allow_reuse to False ensures that the outputs of the previous run of each step are not reused in subsequent runs. This is important because, in this scenario, the content of the downstream data source has been updated. If allow_reuse is set to True, the pipeline run would reuse the outputs of the previous run, which means it would not fully process the updated content.\n\nBy setting allow_reuse to False, the pipeline ensures that each step is re-executed, starting from the updated data source. This guarantees that the new run of pipeline1 fully processes the updated content and incorporates the changes made to the downstream data source."
      },
      {
        "date": "2023-06-04T04:05:00.000Z",
        "voteCount": 4,
        "content": "But I think it is not true. the regenerate_outputs solution focuses on the overall pipeline run and regenerating all outputs, while the allow_reuse solution focuses on individual steps and ensuring their outputs are not reused. In the context of updating the downstream data source and running the pipeline again to fully process the updated content, setting regenerate_outputs to True at the pipeline run submission level would be the appropriate solution. Thuse, the answer is NO."
      },
      {
        "date": "2024-03-05T18:51:00.000Z",
        "voteCount": 1,
        "content": "Actually the job of both the parameters are same but are used in different object. allow_reuse is used in PythonScriptStep and regenerate_output is used in Pipeline.submit"
      },
      {
        "date": "2023-05-16T00:18:00.000Z",
        "voteCount": 4,
        "content": "Should be yes"
      },
      {
        "date": "2023-03-28T19:07:00.000Z",
        "voteCount": 2,
        "content": "It should be Yes"
      },
      {
        "date": "2023-03-27T02:59:00.000Z",
        "voteCount": 1,
        "content": "Should not it be yes?"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 43,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104300-exam-dp-100-topic-4-question-43-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You create an Azure Machine Learning pipeline named pipeline1 with two steps that contain Python scripts. Data processed by the first step is passed to the second step.<br><br>You must update the content of the downstream data source of pipeline1 and run the pipeline again.<br><br>You need to ensure the new run of pipeline1 fully processes the updated content.<br><br>Solution: Set the regenerate_outputs parameter of the pipeline1 experiment’s run submit method to True.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-07-10T03:53:00.000Z",
        "voteCount": 1,
        "content": "The answer is Yes\n\"regenerate_outputs: Whether to force regeneration of all step outputs and disallow data reuse for this run, default is False.\"\n\nhttps://learn.microsoft.com/en-us/python/api/azureml-pipeline-core/azureml.pipeline.core.pipeline.pipeline?view=azure-ml-py&amp;viewFallbackFrom=azure-ml-pyregenerate_outputs"
      },
      {
        "date": "2023-04-29T12:51:00.000Z",
        "voteCount": 2,
        "content": "Answer is Correct:\nhttps://learn.microsoft.com/en-us/python/api/azureml-pipeline-core/azureml.pipeline.core.pipeline.pipeline?view=azure-ml-py\nregenerate_outputs\nbool\ndefault value: False\nIndicates whether to force regeneration of all step outputs and disallow data reuse for this run. If False, this run may reuse results from previous runs and subsequent runs may reuse the results of this run."
      },
      {
        "date": "2023-03-31T09:47:00.000Z",
        "voteCount": 2,
        "content": "this should be no"
      },
      {
        "date": "2023-04-29T12:52:00.000Z",
        "voteCount": 1,
        "content": "The Answers is A."
      },
      {
        "date": "2023-03-28T19:08:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 44,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104301-exam-dp-100-topic-4-question-44-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You create an Azure Machine Learning pipeline named pipeline1 with two steps that contain Python scripts. Data processed by the first step is passed to the second step.<br><br>You must update the content of the downstream data source of pipeline1 and run the pipeline again.<br><br>You need to ensure the new run of pipeline1 fully processes the updated content.<br><br>Solution: Change the value of the compute_target parameter of the PythonScriptStep object in the two steps.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-28T19:11:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 45,
    "url": "https://www.examtopics.com/discussions/microsoft/view/103680-exam-dp-100-topic-4-question-45-discussion/",
    "body": "HOTSPOT<br> -<br><br>You are authoring a pipeline by using the Azure Machine Learning SDK for Python. You implement code to import all relevant classes, configure the workspace, and define all pipeline steps.<br><br>You need to initiate pipeline execution.<br><br>How should you complete the code? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image443.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image444.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-10-07T09:12:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2023-03-23T08:40:00.000Z",
        "voteCount": 2,
        "content": "Correct: https://learn.microsoft.com/en-us/azure/machine-learning/v1/how-to-create-machine-learning-pipelines#submit-the-pipeline"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 46,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104302-exam-dp-100-topic-4-question-46-discussion/",
    "body": "DRAG DROP<br> -<br><br>You have an Azure Machine Learning workspace that contains a training cluster and an inference cluster.<br><br>You plan to create a classification model by using the Azure Machine Learning designer.<br><br>You need to ensure that client applications can submit data as HTTP requests and receive predictions as responses.<br><br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/dp-100/image445.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image446.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-11T19:05:00.000Z",
        "voteCount": 17,
        "content": "Answer should be\n1.create training pipeline\n2.create inference pipeline\n3.deploy to inference cluster"
      },
      {
        "date": "2023-07-27T08:30:00.000Z",
        "voteCount": 2,
        "content": "The correct sequence of actions to ensure that client applications can submit data as HTTP requests and receive predictions as responses is:\n\nb) Create a pipeline that trains a classification model and run the pipeline on the compute cluster. You first need to create and run a training pipeline in the Azure Machine Learning Designer. This pipeline should train a classification model on your data.\nd) Create a real-time inference pipeline and run the pipeline on the compute cluster. After the model is trained, you can create a real-time inference pipeline. This type of pipeline will use your trained model to make predictions on new data in real time.\na) Deploy a service to the inference cluster. The last step is to deploy your real-time inference pipeline as a service to the inference cluster. This service will allow client applications to send data as HTTP requests and receive predictions as HTTP responses"
      },
      {
        "date": "2023-03-28T19:13:00.000Z",
        "voteCount": 1,
        "content": "Create pipeline that trains classification model -&gt; deploy service to the inference cluster -&gt; create real time inference pipeline"
      },
      {
        "date": "2023-04-04T20:03:00.000Z",
        "voteCount": 3,
        "content": "Shouldn't the third step be the second step in your answer?"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 47,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104161-exam-dp-100-topic-4-question-47-discussion/",
    "body": "You create an MLflow model.<br><br>You must deploy the model to Azure Machine Learning for batch inference.<br><br>You need to create the batch deployment.<br><br>Which two components should you use? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnvironment",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModel files\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOnline endpoint",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tKubernetes online endpoint",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCompute target\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "BE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BE",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "AE",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-03-27T20:33:00.000Z",
        "voteCount": 6,
        "content": "Correct (I think)\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-mlflow-batch?tabs=cli\n\nMLflow models don't require you to indicate an environment or a scoring script when creating the deployments as it is created for you. However, you can specify them if you want to customize how the deployment does inference."
      },
      {
        "date": "2023-10-27T17:59:00.000Z",
        "voteCount": 1,
        "content": "I think that is AE"
      },
      {
        "date": "2023-11-25T03:04:00.000Z",
        "voteCount": 1,
        "content": "The MLflow model already describes the required environment, so there is no need to define it once again\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-deploy-mlflow-models?view=azureml-api-2&amp;tabs=azureml"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 48,
    "url": "https://www.examtopics.com/discussions/microsoft/view/103319-exam-dp-100-topic-4-question-48-discussion/",
    "body": "You create an Azure Machine Learning workspace. The workspace contains a dataset named sample_dataset, a compute instance, and a compute cluster.<br><br>You must create a two-stage pipeline that will prepare data in the dataset and then train and register a model based on the prepared data.<br><br>The first stage of the pipeline contains the following code:<br><br><img src=\"https://img.examtopics.com/dp-100/image447.png\"><br><br>You need to identify the location containing the output of the first stage of the script that you can use as input for the second stage.<br><br>Which storage location should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tworkspaceblobstore datastore",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tworkspacefilestore datastore",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcompute instance",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcompute_cluster"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-27T08:38:00.000Z",
        "voteCount": 1,
        "content": "The OutputFileDatasetConfig(\"stagel data\") in the first stage of the pipeline is used to configure a location in the workspace's default datastore to store the output from the step. The Azure Machine Learning workspace default datastore is typically an Azure blob storage, known as workspaceblobstore, and it is used to store the intermediate and output data of the pipeline stages.\n\nTherefore, the correct answer is:\n\nA. workspaceblobstore datastore"
      },
      {
        "date": "2023-03-19T17:14:00.000Z",
        "voteCount": 3,
        "content": "Selected Answer: A\nWhen you create a workspace, an Azure blob container and an Azure file share are automatically registered as datastores to the workspace. They're named workspaceblobstore and workspacefilestore, respectively. The workspaceblobstore is used to store workspace artifacts and your machine learning experiment logs. It's also set as the default datastore and can't be deleted from the workspace. The workspacefilestore is used to store notebooks and R scripts authorized via compute instance.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/v1/how-to-access-data"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 49,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106795-exam-dp-100-topic-4-question-49-discussion/",
    "body": "DRAG DROP<br> -<br><br>You are developing a machine learning solution by using the Azure Machine Learning designer.<br><br>You need to create a web service that applications can use to submit data feature values and retrieve a predicted label.<br><br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/dp-100/image471.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image472.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-19T23:13:00.000Z",
        "voteCount": 11,
        "content": "answer should be\n1.Create and run training pipeline\n2.Create and run a real-time inference pipeline\n3.Deploy a serivce to an inference cluster\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/tutorial-designer-automobile-price-deploy"
      },
      {
        "date": "2024-07-10T04:09:00.000Z",
        "voteCount": 1,
        "content": "Thanks for the info!\n\nI have one question. Why does it have to be a real-time inference pipeline? This was mentioned nowhere in the question. Can it be a batch inference pipeline instead?"
      },
      {
        "date": "2023-07-27T09:25:00.000Z",
        "voteCount": 3,
        "content": "Create and run a training pipeline. This is the first step because before you can create a prediction model, you need to train it with existing data. This is done by creating and running a training pipeline, which takes in your data, applies a machine learning algorithm, and outputs a model that can be used to make predictions.\nCreate and run a real-time inference pipeline. Once the model has been trained, it's time to use it for prediction. This is done by creating a real-time inference pipeline. The inference pipeline takes in new data, applies the trained model, and outputs predictions.\nDeploy a service to an inference cluster. After you have a working inference pipeline, you can deploy it as a web service to an inference cluster. This allows applications to send data to the service and receive predictions in return. This is the last step because you need a trained model and a working inference pipeline before you can deploy a service."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 50,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107558-exam-dp-100-topic-4-question-50-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create an Azure Machine Learning workspace and install the MLflow library.<br><br>You need to log different types of data by using the MLflow library.<br><br>Which method should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image473.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image474.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-27T09:32:00.000Z",
        "voteCount": 3,
        "content": "Log matlotlib plot or image file---mlflow.log_figure(fig, \"figure.png\")\nLog numpy metrics or PIL image objects\tmlflow.log_image(img, \"figure.png\")\nLog a boolean value---mlflow.log_metric(\"my_metric\", 0).\nso given answer is correct!"
      },
      {
        "date": "2023-04-26T03:44:00.000Z",
        "voteCount": 2,
        "content": "Looks right\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-view-metrics?view=azureml-api-2&amp;tabs=interactive#logging-images"
      },
      {
        "date": "2023-07-07T09:04:00.000Z",
        "voteCount": 2,
        "content": "According to you link:\nmatlotlib --&gt; log image\nBoolean --&gt; log metric"
      },
      {
        "date": "2024-08-31T02:15:00.000Z",
        "voteCount": 1,
        "content": "Actually, if you really look at the documentation properly you would notice that log_image is for \" numpy metrics or PIL image objects\" while log_figure is for \"matlotlib plot or image file\" under the section of Log Images.\nSo, the answer is correct:\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-view-metrics?view=azureml-api-2&amp;tabs=interactive#log-images"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 51,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107559-exam-dp-100-topic-4-question-51-discussion/",
    "body": "DRAG DROP<br> -<br><br>You create an Azure Machine Learning workspace. You are training a classification model with no-code AutoML in Azure Machine Learning studio.<br><br>The model must predict if a client of a financial institution will subscribe to a fixed-term deposit. You must preview the data profile in Azure Machine Learning studio once the dataset is created.<br><br>You need to train the model.<br><br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/dp-100/image475.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image476.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-31T12:55:00.000Z",
        "voteCount": 1,
        "content": "If you follow along closely with the steps detailed in the link provided by paperflying:\nCreate an Automated Machine Learning job \nCreate and load a dataset as a data asset ( I would pick tabular as this is the default and only option supported by Auto ML. Also you can preview the data at this step)\ncreate an experiment ( part of the configure job task)\ncreate compute target ( part of the configure job task)\nAgain this is strictly following the steps outlined in the doc and you don't need to agree."
      },
      {
        "date": "2024-05-31T13:08:00.000Z",
        "voteCount": 1,
        "content": "In the newest UI, you specify the experiment name in the \"Basic settings\" step, which comes before the \"Task type &amp; data\". So you just have to decide the orders yourself."
      },
      {
        "date": "2023-08-25T03:39:00.000Z",
        "voteCount": 2,
        "content": "Create a tabular dataset.\nCreate a compute cluster.\nCreate an experiment.\nCreate an automated ML job.\n\nFirst, you need to create a tabular dataset that contains the data you want to use to train the model. You can do this by uploading a file or connecting to an external data source in Azure Machine Learning studio. Once the dataset is created, you can preview the data profile in Azure Machine Learning studio.\n\nNext, you need to create a compute cluster that will be used to run the automated ML job. \n\nAfter creating the compute cluster, you need to create an experiment to track the runs of your automated ML job. An experiment is a named container for a series of related runs.\n\nFinally, you need to create an automated ML job \n\nSaM"
      },
      {
        "date": "2024-01-10T03:36:00.000Z",
        "voteCount": 1,
        "content": "I need to make corrections here. I went through it myself. The first thing you will do on Azure Ml is going to Azure Auto ML job, then it asks you for a name for the experiment (so create the experiment), then you can import data where you can see the data as well, indeed a preview of the dataset. Finally, you will create or choose the compute cluster and  then you will submit the experiment. So, I still don't know what this question is asking specifically, but I would go with the order I mentioned in the updated comment. \n\nSaM"
      },
      {
        "date": "2024-02-24T08:15:00.000Z",
        "voteCount": 1,
        "content": "you are right but i think as you are creating automated ML job you need to select the dataset, environment, then select compute cluster. That means these objects should have already been created. Therefore, logically, your earlier answer seems to be correct  for me."
      },
      {
        "date": "2023-07-27T09:41:00.000Z",
        "voteCount": 4,
        "content": "Create a tabular dataset\nCreate a compute cluster\nCreate an experiment\nCreate an automated ML job"
      },
      {
        "date": "2023-05-13T04:32:00.000Z",
        "voteCount": 1,
        "content": "Automated ML only supports Tabular dataset\nhttps://learn.microsoft.com/en-us/azure/machine-learning/v1/how-to-create-register-datasets?view=azureml-api-1"
      },
      {
        "date": "2023-04-27T15:33:00.000Z",
        "voteCount": 1,
        "content": "Upload the file and preview.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/tutorial-first-experiment-automated-ml?view=azureml-api-2"
      },
      {
        "date": "2023-04-26T03:48:00.000Z",
        "voteCount": 1,
        "content": "Why not tabular dataset?"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 52,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106796-exam-dp-100-topic-4-question-52-discussion/",
    "body": "You create an Azure Machine Learning workspace. You use Azure Machine Learning designer to create a pipeline within the workspace.<br><br>You need to submit a pipeline run from the designer.<br><br>What should you do first?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an experiment.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an attached compute resource.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a compute cluster.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect a model."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 4,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 3,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-05-25T18:54:00.000Z",
        "voteCount": 2,
        "content": "I think answer is A.\nreference:https://learn.microsoft.com/en-us/azure/machine-learning/how-to-create-component-pipelines-ui?view=azureml-api-2#submit-pipeline"
      },
      {
        "date": "2024-05-31T13:34:00.000Z",
        "voteCount": 1,
        "content": "agreed. You won't be able to get to the next step without selecting existing or Create new experiment."
      },
      {
        "date": "2023-12-22T09:50:00.000Z",
        "voteCount": 1,
        "content": "After click \"Designer\", you must set \"Default compute target\" or there will be a red warning showing on the panel. After fixing this, you will be able to access Designer Experiment. So I will take C."
      },
      {
        "date": "2023-11-02T11:12:00.000Z",
        "voteCount": 1,
        "content": "ChatGPT sounds reasonable:  To submit a pipeline run from Azure Machine Learning designer, you should first:\n\nC. Create a compute cluster.\n\nIn Azure Machine Learning, you need a compute cluster to run the pipeline. Compute clusters provide the necessary compute resources for training and running machine learning models as part of your pipeline. Once you have a compute cluster set up, you can then create an experiment within the workspace (Option A) and design your pipeline using the Azure Machine Learning designer. After the pipeline is designed, you can submit a pipeline run using the compute cluster you've created.\n\nOptions B and D are not the first steps for submitting a pipeline run; they come into play after you've created the compute cluster and designed the pipeline."
      },
      {
        "date": "2023-10-27T18:17:00.000Z",
        "voteCount": 1,
        "content": "Answer is A"
      },
      {
        "date": "2023-08-29T05:29:00.000Z",
        "voteCount": 1,
        "content": "Could it aslo be B?"
      },
      {
        "date": "2023-05-01T03:59:00.000Z",
        "voteCount": 3,
        "content": "of course it is C - compute cluster"
      },
      {
        "date": "2023-04-20T07:21:00.000Z",
        "voteCount": 1,
        "content": "Answer should be A"
      },
      {
        "date": "2023-04-19T23:37:00.000Z",
        "voteCount": 2,
        "content": "answer should be C. Create a compute cluster.\n\"To run a pipeline, you first have to set default compute target to run the pipeline on.\"\nhttps://learn.microsoft.com/en-us/azure/machine-learning/samples-designer\n\n\nCompute cluster is the compute target supported by Designer."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 53,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114441-exam-dp-100-topic-4-question-53-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create an Azure Machine learning workspace. The workspace contains a folder named src. The folder contains a Python script named script1.py.<br><br>You use the Azure Machine Learning Python SDK v2 to create a control script. You must use the control script to run script1.py as part of a training job.<br><br>You need to complete the section of script that defines the job parameters.<br><br>How should you complete the script? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image526.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image527.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-12-20T19:48:00.000Z",
        "voteCount": 2,
        "content": "from azure.ai.ml import command\n\n# configure job\njob = command(\n    code=\"./src\",\n    command=\"python train.py --training_data diabetes.csv\",\n    environment=\"AzureML-sklearn-0.24-ubuntu18.04-py37-cpu@latest\",\n    compute=\"aml-cluster\",\n    display_name=\"train-model\",\n    experiment_name=\"train-classification-model\"\n    )"
      },
      {
        "date": "2023-11-25T04:08:00.000Z",
        "voteCount": 1,
        "content": "Command + Code\n\nhttps://learn.microsoft.com/en-us/training/modules/run-training-script-command-job-azure-machine-learning/3-run-script-command-job"
      },
      {
        "date": "2023-07-07T10:08:00.000Z",
        "voteCount": 2,
        "content": "Answers: command and path\n\nmy_job_inputs = {\n    \"input_data\": Input(\n            type=AssetTypes.MLTABLE,\n            path=filedataset_asset,\n            mode=InputOutputModes.EVAL_MOUNT"
      },
      {
        "date": "2023-07-07T10:09:00.000Z",
        "voteCount": 1,
        "content": "my_job_inputs = {\n    \"input_data\": Input(\n            type=AssetTypes.MLTABLE,\n            path=filedataset_asset,\n            mode=InputOutputModes.EVAL_MOUNT\n    )\n}\n\njob = command(\n    code=\"./src\",  # Local path where the code is stored\n    command=\"ls ${{inputs.input_data}}\",\n    inputs=my_job_inputs,\n    environment=\"&lt;environment_name&gt;:&lt;version&gt;\",\n    compute=\"cpu-cluster\","
      },
      {
        "date": "2023-07-07T10:10:00.000Z",
        "voteCount": 3,
        "content": "Sorry, correct answer: command and code\njob = command(\n    code=\"./src\",  # Local path where the code is stored\n    command=\"ls ${{inputs.input_data}}\",\n    inputs=my_job_inputs,\n    environment=\"&lt;environment_name&gt;:&lt;version&gt;\",\n    compute=\"cpu-cluster\","
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 54,
    "url": "https://www.examtopics.com/discussions/microsoft/view/116613-exam-dp-100-topic-4-question-54-discussion/",
    "body": "HOTSPOT<br> -<br><br>You manage an Azure Machine Learning workspace. You submit a training job with the Azure Machine Learning Python SDK v2. You must use MLflow to log metrics, model parameters, and model artifacts automatically when training a model.<br><br>You start by writing the following code segment:<br><br>import mlflow<br>mlflow.autolog(log_models=False, exclusive=True)<br><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br><br><img src=\"https://img.examtopics.com/dp-100/image528.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image529.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-08-25T04:14:00.000Z",
        "voteCount": 5,
        "content": "Y,N,Y\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-view-metrics?view=azureml-api-2&amp;tabs=interactive#logging-images\n\nWhen you use the mlflow.autolog function, it enables automatic logging of metrics, parameters, and artifacts to a user-created run in MLflow. This means that the autologged content will be logged to a run that was created by the user, rather than being logged to a system-generated run. \n\nSaM"
      },
      {
        "date": "2023-07-27T10:09:00.000Z",
        "voteCount": 5,
        "content": "https://mlflow.org/docs/latest/python_api/mlflow.html#mlflow.autolog\n\nNo, No, No"
      },
      {
        "date": "2024-07-10T04:26:00.000Z",
        "voteCount": 1,
        "content": "Correct! No, No, No\n\nFrom your link https://mlflow.org/docs/latest/python_api/mlflow.html#mlflow.autolog\n\n--&gt; log_models – If True, trained models are logged as MLflow model artifacts. If False, trained models are not logged. Input examples and model signatures, which are attributes of MLflow models, are also omitted when log_models is False.\n\n--&gt; exclusive – If True, autologged content is not logged to user-created fluent runs. If False, autologged content is logged to the active fluent run, which may be user-created."
      },
      {
        "date": "2024-05-30T17:26:00.000Z",
        "voteCount": 1,
        "content": "The exclusive=True parameter ensures that only MLflow logging will be used, preventing conflicts with other loggers that might be active. this means that the first one should be YES"
      },
      {
        "date": "2024-01-23T00:49:00.000Z",
        "voteCount": 2,
        "content": "log_models – If True, trained models are logged as MLflow model artifacts. If False, trained models are not logged. Input examples and model signatures, which are attributes of MLflow models, are also omitted when log_models is False.\nexclusive – If True, autologged content is not logged to user-created fluent runs. If False, autologged content is logged to the active fluent run, which may be user-created\nhttps://mlflow.org/docs/latest/python_api/mlflow.html#mlflow.autolog"
      },
      {
        "date": "2024-04-11T02:07:00.000Z",
        "voteCount": 1,
        "content": "So N N N"
      },
      {
        "date": "2023-12-04T18:58:00.000Z",
        "voteCount": 3,
        "content": "No No Yes, Based n below 2 link"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 55,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114444-exam-dp-100-topic-4-question-55-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You train and register an Azure Machine Learning model.<br><br>You plan to deploy the model to an online endpoint.<br><br>You need to ensure that applications will be able to use the authentication method with a non-expiring artifact to access the model.<br><br>Solution: Create a managed online endpoint and set the value of its auth_mode parameter to aml_token. Deploy the model to the online endpoint.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-07T10:21:00.000Z",
        "voteCount": 2,
        "content": "Correct.\nWhen consuming an online endpoint from a client, you can use either a key or a token. Keys don't expire, tokens do.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-authenticate-online-endpoint?view=azureml-api-2&amp;tabs=python"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 56,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114445-exam-dp-100-topic-4-question-56-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You train and register an Azure Machine Learning model.<br><br>You plan to deploy the model to an online endpoint.<br><br>You need to ensure that applications will be able to use the authentication method with a non-expiring artifact to access the model.<br><br>Solution: Create a managed online endpoint and set the value of its auth_mode parameter to key. Deploy the model to the online endpoint.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-07T10:21:00.000Z",
        "voteCount": 4,
        "content": "Correct.\nWhen consuming an online endpoint from a client, you can use either a key or a token. Keys don't expire, tokens do.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-authenticate-online-endpoint?view=azureml-api-2&amp;tabs=python"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 57,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114194-exam-dp-100-topic-4-question-57-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You train and register an Azure Machine Learning model.<br><br>You plan to deploy the model to an online endpoint.<br><br>You need to ensure that applications will be able to use the authentication method with a non-expiring artifact to access the model.<br><br>Solution: Create a managed online endpoint with the default authentication settings. Deploy the model to the online endpoint.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 3,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-07-27T10:16:00.000Z",
        "voteCount": 5,
        "content": "A) Yes. https://github.com/MicrosoftDocs/azure-docs/blob/main/articles/machine-learning/how-to-authenticate-online-endpoint.md"
      },
      {
        "date": "2024-06-23T02:15:00.000Z",
        "voteCount": 2,
        "content": "The default authentication method when creating a managed online endpoint is a key, which does not expire unless explicitly regenerated. This satisfies the requirement of using a non-expiring artifact for authentication.\n\nThus, the solution of creating a managed online endpoint with the default authentication settings and deploying the model to the online endpoint meets the goal."
      },
      {
        "date": "2024-06-12T03:27:00.000Z",
        "voteCount": 1,
        "content": "No, the solution does not meet the goal.\nThe default authentication settings for a managed online endpoint typically use Azure Active Directory (AAD) tokens, which do expire and are not non-expiring artifacts.\n\nTo ensure that applications can use an authentication method with a non-expiring artifact, you should use a key-based authentication method, such as API keys, which do not expire unless explicitly regenerated."
      },
      {
        "date": "2024-03-03T13:15:00.000Z",
        "voteCount": 1,
        "content": "A- Yes, Key is default if not specified \nhttps://learn.microsoft.com/en-us/python/api/azure-ai-ml/azure.ai.ml.entities.managedonlineendpoint?view=azure-python"
      },
      {
        "date": "2023-11-02T11:38:00.000Z",
        "voteCount": 1,
        "content": "Should be YES. The default value is 'key'."
      },
      {
        "date": "2023-08-22T20:46:00.000Z",
        "voteCount": 1,
        "content": "Chat pgt said it is No. But the link said it is YES"
      },
      {
        "date": "2023-07-05T10:12:00.000Z",
        "voteCount": 3,
        "content": "The answer appears to be Yes as the default value is key. \nhttps://github.com/MicrosoftDocs/azure-docs/blob/main/articles/machine-learning/how-to-authenticate-online-endpoint.md"
      },
      {
        "date": "2023-07-07T10:22:00.000Z",
        "voteCount": 3,
        "content": "Agree.\nWhen consuming an online endpoint from a client, you can use either a key or a token. Keys don't expire, tokens do.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-authenticate-online-endpoint?view=azureml-api-2&amp;tabs=python"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 58,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114446-exam-dp-100-topic-4-question-58-discussion/",
    "body": "You use the Azure Machine Learning SDK v2 for Python and notebooks to train a model. You use Python code to create a compute target, an environment, and a training script.<br><br>You need to prepare information to submit a training job.<br><br>Which class should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMLClient",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBuildContext",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEndpointConnection",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcommand"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-23T02:20:00.000Z",
        "voteCount": 1,
        "content": "D is correct"
      },
      {
        "date": "2024-02-06T19:57:00.000Z",
        "voteCount": 1,
        "content": "i overlooked word \"preparing\" and thought to submit.  Anyway after the preparation, to submit the for job run, the required class in ml_client. \ncorrect answer is command, which is class to prepare or configure a run."
      },
      {
        "date": "2023-07-27T10:50:00.000Z",
        "voteCount": 2,
        "content": "command.\n\nTo run this script, you'll use a command that executes main.py Python script located under ./sdk/python/jobs/single-step/lightgbm/iris/src/. The command will be run by submitting it as a job to Azure ML."
      },
      {
        "date": "2023-07-07T10:26:00.000Z",
        "voteCount": 2,
        "content": "Correct.\n#import required libraries\nfrom azure.ai.ml import MLClient, command\nfrom azure.ai.ml.entities import Environment\nfrom azure.identity import DefaultAzureCredential\n\n#connect to the workspace\nml_client = MLClient.from_config(DefaultAzureCredential())\n\n# set up pytorch environment\nenv = Environment(\n    image=\"mcr.microsoft.com/azureml/openmpi3.1.2-ubuntu18.04\",\n    conda_file=\"pytorch-env.yml\",\n    name=\"pytorch-env\"\n)\n\n# define the command\ncommand_job = command(\n    code=\"./src\",\n    command=\"train.py\",\n    environment=env,\n    compute=\"cpu-cluster\",\n)\n\nreturned_job = ml_client.jobs.create_or_update(command_job)\nreturned_job"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 59,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114447-exam-dp-100-topic-4-question-59-discussion/",
    "body": "You manage an Azure Machine Learning workspace.<br><br>You build a custom model you must log with MLflow. The custom model includes the following:<br><br>•\tThe model is not natively supported by MLflow.<br>•\tThe model cannot be serialized in Pickle format.<br>•\tThe model source code is complex.<br>•\tThe Python library for the model must be packaged with the model.<br><br>You need to create a custom model flavor to enable logging with MLflow.<br><br>What should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmodel loader\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tartifacts",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmodel wrapper",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcustom signatures"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-23T02:22:00.000Z",
        "voteCount": 1,
        "content": "A is correct"
      },
      {
        "date": "2024-05-25T20:17:00.000Z",
        "voteCount": 1,
        "content": "A. model loader\nreference:\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-mlflow-models?view=azureml-api-2&amp;tabs=loader#logging-custom-models"
      },
      {
        "date": "2023-08-17T05:55:00.000Z",
        "voteCount": 3,
        "content": "See comments by phdykd and damaldon. A is correct."
      },
      {
        "date": "2023-07-27T10:53:00.000Z",
        "voteCount": 1,
        "content": "A. https://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-mlflow-models?view=azureml-api-2&amp;tabs=loader"
      },
      {
        "date": "2023-07-07T10:34:00.000Z",
        "voteCount": 2,
        "content": "Ans. A\nSometimes your model logic is complex and there are several source files that your model loads on inference time. This would be the case when you have a Python library for your model for instance. In this scenario, you want to package the library all along with your model so it can move as a single piece.\n\nUse this method when:\n\n    Your model can't be serialized in Pickle format or there is a better format available for that.\n    Your model artifacts can be stored in a folder where all the requiered artifacts are placed.\n    Your model source code is complex and it requires multiple Python files. Potentially, there is a library that supports your model.\n    You want to customize the way the model is loaded and how the predict function works.\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-mlflow-models?view=azureml-api-2&amp;tabs=loader"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 60,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114448-exam-dp-100-topic-4-question-60-discussion/",
    "body": "You create an Azure Machine Learning workspace.<br><br>You must use the Python SDK v2 to implement an experiment from a Jupyter notebook in the workspace. The experiment must log string metrics.<br><br>You need to implement the method to log the string metrics.<br><br>Which method should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log_artifact()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log.dict()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log_metric()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log_text()"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-07T10:39:00.000Z",
        "voteCount": 2,
        "content": "Correct.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-view-metrics?view=azureml-api-2&amp;tabs=interactive#logging-metrics"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 61,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114449-exam-dp-100-topic-4-question-61-discussion/",
    "body": "You manage an Azure Machine Learning workspace. You develop a machine learning model.<br><br>You must deploy the model to use a low-priority VM with a pricing discount.<br><br>You need to deploy the model.<br><br>Which compute target should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Kubernetes Service (AKS)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Machine Learning compute clusters\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Container Instances (ACI)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLocal deployment"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-23T02:26:00.000Z",
        "voteCount": 1,
        "content": "Azure Machine Learning compute clusters: This option allows you to use low-priority VMs, which are VMs with a significant pricing discount. Low-priority VMs are less expensive than dedicated VMs, but they come with the risk of being preempted if Azure needs the capacity for higher-priority tasks. This makes them a cost-effective option for non-critical workloads or those that can handle interruptions."
      },
      {
        "date": "2023-07-07T10:41:00.000Z",
        "voteCount": 1,
        "content": "Correct.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-use-low-priority-batch?view=azureml-api-2&amp;tabs=sdk#creating-batch-deployments-with-low-priority-vms"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 62,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114450-exam-dp-100-topic-4-question-62-discussion/",
    "body": "HOTSPOT<br> -<br><br>You use an Azure Machine Learning workspace, Azure Data Factory pipeline, and a dataset monitor that runs on a schedule to detect data drift.<br><br>You need to implement an automated workflow to trigger when the dataset monitor detects data drift and launch the Azure Data Factory pipeline to update the dataset. The solution must minimize the effort to configure the workflow.<br><br>How should you configure the workflow? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image530.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image531.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-09T18:52:00.000Z",
        "voteCount": 1,
        "content": "On exam March 2024"
      },
      {
        "date": "2023-09-28T15:46:00.000Z",
        "voteCount": 4,
        "content": "On Sept-4-2023 exam"
      },
      {
        "date": "2023-07-07T10:47:00.000Z",
        "voteCount": 1,
        "content": "Correct."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 63,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114451-exam-dp-100-topic-4-question-63-discussion/",
    "body": "DRAG DROP<br> -<br><br>You train and register a model by using the Azure Machine Learning Python SDK v2 on a local workstation. Python 3.7 and Visual Studio Code are installed on the workstation.<br><br>When you try to deploy the model into production to a Kubernetes online endpoint, you experience an error in the scoring script that causes deployment to fail.<br><br>You need to debug the service on the local workstation before deploying the service to production.<br><br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/dp-100/image532.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image533.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-07T10:55:00.000Z",
        "voteCount": 2,
        "content": "Correct.\nml_client.begin_create_or_update(online_deployment, local=True)\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-troubleshoot-online-endpoints?view=azureml-api-2&amp;tabs=python"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 64,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114454-exam-dp-100-topic-4-question-64-discussion/",
    "body": "DRAG DROP<br> -<br><br>You create a multi-class image classification deep learning model.<br><br>The model must be retrained monthly with the new image data fetched from a public web portal. You create an Azure Machine Learning pipeline to fetch new data, standardize the size of images, and retrain the model.<br><br>You need to use the Azure Machine Learning Python SDK v2 to configure the schedule for the pipeline. The schedule should be defined by using the frequency and interval properties, with frequency set to “month\" and interval set to \"1\".<br><br>Which three classes should you instantiate in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/dp-100/image534.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image535.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-07T11:44:00.000Z",
        "voteCount": 5,
        "content": "Correct.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-schedule-pipeline-job?view=azureml-api-2&amp;tabs=python#schedule-a-pipeline-job"
      },
      {
        "date": "2024-06-01T11:01:00.000Z",
        "voteCount": 1,
        "content": "The link provided by damaldon tells everything you need to know. Click on the studio UI table and you will see everything become clearer.\nWhen you have a pipeline job with satisfying performance and outputs, you can set up a schedule to automatically trigger this job on a regular basis..."
      },
      {
        "date": "2024-06-01T11:02:00.000Z",
        "voteCount": 1,
        "content": "*tab not table"
      },
      {
        "date": "2023-12-19T13:49:00.000Z",
        "voteCount": 1,
        "content": "A\nB - This is a wired answer, it is a pipeline trigger, but doesn't have \"frequency and interval\" parameters, it uses Cron expression. I will take this one only coz question says 3 answers.\nE\nI didn't find any docs showing Pipeline is available as a trigger.\nhttps://learn.microsoft.com/en-us/python/api/azure-ai-ml/azure.ai.ml.entities.pipelinejob?view=azure-python"
      },
      {
        "date": "2023-12-22T10:07:00.000Z",
        "voteCount": 2,
        "content": "Pipeline Job is not a Obj, it's a schema in json, answer should be D-E-A."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 65,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114455-exam-dp-100-topic-4-question-65-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You train and register an Azure Machine Learning model.<br><br>You plan to deploy the model to an online endpoint.<br><br>You need to ensure that applications will be able to use the authentication method with a non-expiring artifact to access the model.<br><br>Solution: Create a Kubernetes online endpoint and set the value of its auth_mode parameter to aml_token. Deploy the model to the online endpoint.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-17T19:58:00.000Z",
        "voteCount": 2,
        "content": "aml_token expired key deesnt"
      },
      {
        "date": "2023-07-07T11:46:00.000Z",
        "voteCount": 3,
        "content": "Correct, keys don't expire, tokens do"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 66,
    "url": "https://www.examtopics.com/discussions/microsoft/view/118485-exam-dp-100-topic-4-question-66-discussion/",
    "body": "You manage an Azure Machine Learning workspace.<br><br>You must provide explanations for the behavior of the models with feature importance measures.<br><br>You need to configure a Responsible AI dashboard in Azure Machine Learning.<br><br>Which dashboard component should you configure?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCounterfactual what-if",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCasual inference",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFairness assessment",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInterpretability\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-17T19:43:00.000Z",
        "voteCount": 1,
        "content": "correct D"
      },
      {
        "date": "2023-08-19T06:18:00.000Z",
        "voteCount": 1,
        "content": "Correct - D\nhttps://learn.microsoft.com/en-us/azure/machine-learning/concept-responsible-ai-dashboard?view=azureml-api-2"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 67,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114456-exam-dp-100-topic-4-question-67-discussion/",
    "body": "You create an Azure Machine Learning workspace.<br><br>You must use the Python SDK v2 to implement an experiment from a Jupyter notebook in the workspace. The experiment must log a list of numeral metrics.<br><br>You need to implement a method to log a list of numeral metrics.<br><br>Which method should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log_metric()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log.batch()\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log_image()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmlflow.log_artifact()"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-17T07:58:00.000Z",
        "voteCount": 5,
        "content": "B. log_batch"
      },
      {
        "date": "2024-05-17T19:42:00.000Z",
        "voteCount": 1,
        "content": "A is Correct!"
      },
      {
        "date": "2024-04-10T05:32:00.000Z",
        "voteCount": 1,
        "content": "Answer is B to Log a list of metrics.   A would be for only logging 1 metric"
      },
      {
        "date": "2024-02-29T02:08:00.000Z",
        "voteCount": 1,
        "content": "correct .CHTGPT :To log a list of numeral metrics in your Azure Machine Learning experiment using the Python SDK v2, you should use the following method:\n\nmlflow.log_metric(metric_name, metric_value): This method allows you to log a numerical value (such as accuracy, loss, or any other metric) to the run with the given name. The metric will be stored in the run record within the experiment."
      },
      {
        "date": "2023-11-25T11:16:00.000Z",
        "voteCount": 2,
        "content": "... log a list of numeric metrics ..\nThe answer is B\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-view-metrics?view=azureml-api-2&amp;tabs=interactive#logging-metrics"
      },
      {
        "date": "2023-07-07T11:58:00.000Z",
        "voteCount": 1,
        "content": "Correct.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-view-metrics?view=azureml-api-2&amp;tabs=interactive#logging-metrics"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 68,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114458-exam-dp-100-topic-4-question-68-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create an Azure Machine Learning workspace.<br><br>You plan to write an Azure Machine Learning SDK for Python v2 script that logs an image for an experiment. The logged image must be available from the images tab in Azure Machine Learning Studio.<br><br>You need to complete the script.<br><br>Which code segments should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/dp-100/image552.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/dp-100/image553.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-20T12:03:00.000Z",
        "voteCount": 1,
        "content": "why not log_image()?"
      },
      {
        "date": "2024-04-10T05:36:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2023-07-07T12:06:00.000Z",
        "voteCount": 1,
        "content": "Correct.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-log-view-metrics?view=azureml-api-2&amp;tabs=interactive#logging-images"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 69,
    "url": "https://www.examtopics.com/discussions/microsoft/view/123918-exam-dp-100-topic-4-question-69-discussion/",
    "body": "You run Azure Machine Learning training experiments. The training scripts directory contains 100 files that includes a file named .amlignore. The directory also contains subdirectories named ./outputs and ./logs.<br><br>There are 20 files in the training scripts directory that must be excluded from the snapshot to the compute targets. You create a file named .gitignore in the root of the directory. You add the names of the 20 files to the .gitignore file. These 20 files continue to be copied to the compute targets.<br><br>You need to exclude the 20 files.<br><br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCopy the contents of the file named .gitignore to the file named .amlignore.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMove the file named .gitignore to the ./outputs directory.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMove the file named .gitignore to the ./logs directory.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd the contents of the file named .amlignore to the file named .gitignore."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-17T18:25:00.000Z",
        "voteCount": 1,
        "content": "I think it is A.  Based on the reference, if there are both .amlignore and .gitignore existing, .amlignore would be used instead of the .gitignore.\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-set-up-training-targets?view=azureml-api-1"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 70,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114459-exam-dp-100-topic-4-question-70-discussion/",
    "body": "You build a data pipeline in an Azure Machine Learning workspace by using the Azure Machine Learning SDK for Python.<br><br>You need to run a Python script as a pipeline step.<br><br>Which two classes could you use? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPythonScriptStep\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAutoMLStep",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCommandStep\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStepRun"
    ],
    "answer": "AC",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AC",
        "count": 6,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-23T02:43:00.000Z",
        "voteCount": 1,
        "content": "AC is the correct answer."
      },
      {
        "date": "2024-02-19T12:14:00.000Z",
        "voteCount": 1,
        "content": "AC is the correct answer. StepRun is used for the submitted pipeline."
      },
      {
        "date": "2024-02-16T18:18:00.000Z",
        "voteCount": 1,
        "content": "A and C\npython_script_step: Contains functionality to create an Azure ML Pipeline step that runs Python script.\ncommand_step: Contains functionality to create an Azure ML Pipeline step that runs commands.\nfrom azureml.pipeline.steps import CommandStep\ntrainStep = CommandStep(name='train step',\n                    command='python train.py arg1 arg2',\n                    source_directory=project_folder,\n                    compute_target=compute_target)"
      },
      {
        "date": "2023-08-22T21:27:00.000Z",
        "voteCount": 1,
        "content": "chatgpt says AC"
      },
      {
        "date": "2023-08-17T06:19:00.000Z",
        "voteCount": 3,
        "content": "A, C\n\npython_script_step , CommandStep"
      },
      {
        "date": "2023-07-27T11:37:00.000Z",
        "voteCount": 2,
        "content": "A, C\n\npython_script_step , CommandStep"
      },
      {
        "date": "2023-07-25T11:18:00.000Z",
        "voteCount": 1,
        "content": "AB\npython_script_step\tContains functionality to create an Azure ML Pipeline step that runs Python script.\nautoml_step\tContains functionality for adding and managing an automated ML pipeline step in Azure Machine Learning."
      },
      {
        "date": "2023-07-07T12:22:00.000Z",
        "voteCount": 1,
        "content": "Ans. AB\nhttps://learn.microsoft.com/en-us/python/api/azureml-pipeline-steps/?view=azure-ml-py"
      },
      {
        "date": "2023-11-25T11:25:00.000Z",
        "voteCount": 2,
        "content": "Nope, the answer is A + C\nWhile B = AutoMLStep is a valid option for the pipeline step, it doesn't solve the task of \"...You need to run a Python script as a pipeline step....\""
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 71,
    "url": "https://www.examtopics.com/discussions/microsoft/view/134694-exam-dp-100-topic-4-question-71-discussion/",
    "body": "You have an Azure Machine Learning workspace.<br><br>You plan to run a job to train a model as an MLflow model output.<br><br>You need to specify the output mode of the MLflow model.<br><br>Which three modes can you specify? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\trw_mount\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tro_mount",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tupload\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tdownload",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tdirect\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "ACE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "ACE",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-07-10T07:25:00.000Z",
        "voteCount": 1,
        "content": "RW_mount\nuplaod\ndirect       https://learn.microsoft.com/en-us/azure/machine-learning/how-to-manage-inputs-outputs-pipeline?view=azureml-api-2&amp;tabs=cli"
      },
      {
        "date": "2024-06-23T02:44:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2024-05-17T19:33:00.000Z",
        "voteCount": 2,
        "content": "correct answer: \nA. rw_mount\nB. ro_mount\nC. upload"
      },
      {
        "date": "2024-06-15T14:13:00.000Z",
        "voteCount": 3,
        "content": "Based on what? \nStop providing fake answers if they are not supported by a reference."
      },
      {
        "date": "2024-02-26T03:32:00.000Z",
        "voteCount": 3,
        "content": "Seems correct:\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-manage-inputs-outputs-pipeline?view=azureml-api-2&amp;tabs=cli#path-and-mode-for-data-inputsoutputs"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 72,
    "url": "https://www.examtopics.com/discussions/microsoft/view/136605-exam-dp-100-topic-4-question-72-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You have an Azure Machine Learning workspace. You connect to a terminal session from the Notebooks page in Azure Machine Learning studio.<br><br>You plan to add a new Jupyter kernel that will be accessible from the same terminal session.<br><br>You need to perform the task that must be completed before you can add the new kernel.<br><br>Solution: Create an environment.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-03-19T04:49:00.000Z",
        "voteCount": 2,
        "content": "I think the correct answer is to create a new environment.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-access-terminal?view=azureml-api-2#add-new-kernels"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 73,
    "url": "https://www.examtopics.com/discussions/microsoft/view/136606-exam-dp-100-topic-4-question-73-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You have an Azure Machine Learning workspace. You connect to a terminal session from the Notebooks page in Azure Machine Learning studio.<br><br>You plan to add a new Jupyter kernel that will be accessible from the same terminal session.<br><br>You need to perform the task that must be completed before you can add the new kernel.<br><br>Solution: Delete the Python 3.6 – AzureML kernel.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-03-19T04:51:00.000Z",
        "voteCount": 1,
        "content": "I think the correct answer is to create a new environment.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-access-terminal?view=azureml-api-2#add-new-kernels"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 74,
    "url": "https://www.examtopics.com/discussions/microsoft/view/136607-exam-dp-100-topic-4-question-74-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You have an Azure Machine Learning workspace. You connect to a terminal session from the Notebooks page in Azure Machine Learning studio.<br><br>You plan to add a new Jupyter kernel that will be accessible from the same terminal session.<br><br>You need to perform the task that must be completed before you can add the new kernel.<br><br>Solution: Delete the Python 3.8 – AzureML kernel.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-17T19:26:00.000Z",
        "voteCount": 1,
        "content": "add new compute instance resource is mandatory"
      },
      {
        "date": "2024-03-19T04:51:00.000Z",
        "voteCount": 3,
        "content": "I think the correct answer is to create a new environment.\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-access-terminal?view=azureml-api-2#add-new-kernels"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 75,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140810-exam-dp-100-topic-4-question-75-discussion/",
    "body": "You are a data scientist working for a hotel booking website company. You use the Azure Machine Learning service to train a model that identifies fraudulent transactions.<br><br>You must deploy the model as an Azure Machine Learning online endpoint by using the Azure Machine Learning Python SDK v2. The deployed model must return real-time predictions of fraud based on transaction data input.<br><br>You need to create the script that is specified as the scoring_script parameter for the CodeConfiguration class used to deploy the model.<br><br>What should the entry script do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister the model with appropriate tags and properties.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Conda environment for the online endpoint compute and install the necessary Python packages.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLoad the model and use it to predict labels from input data.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart a node on the inference cluster where the model is deployed.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSpecify the number of cores and the amount of memory required for the online endpoint compute."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-17T19:15:00.000Z",
        "voteCount": 2,
        "content": "C is correct"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 76,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140809-exam-dp-100-topic-4-question-76-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You have an Azure Machine Learning workspace. You connect to a terminal session from the Notebooks page in Azure Machine Learning studio.<br><br>You plan to add a new Jupyter kernel that will be accessible from the same terminal session.<br><br>You need to perform the task that must be completed before you can add the new kernel.<br><br>Solution: Create a compute instance.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-06-23T02:59:00.000Z",
        "voteCount": 1,
        "content": "The correct solution would likely involve preparing the Python environment for the new kernel within the existing compute instance, rather than creating a new compute instance."
      },
      {
        "date": "2024-06-01T20:47:00.000Z",
        "voteCount": 1,
        "content": "The compute instance needs to be created first before you can even have a terminal session"
      },
      {
        "date": "2024-05-17T19:12:00.000Z",
        "voteCount": 1,
        "content": "This does the job"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 77,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142588-exam-dp-100-topic-4-question-78-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You have an Azure Machine Learning workspace named Workspace1. Workspace1 has a registered MLflow model named model1 with PyFunc flavor.<br><br>You plan to deploy model1 to an online endpoint named endpoint1 without egress connectivity by using Azure Machine Learning Python SDK v2.<br><br>You have the following code:<br><br><img src=\"https://img.examtopics.com/dp-100/image571.png\"><br><br>You need to add a parameter to the ManagedOnlineDeployment object to ensure the model deploys successfully.<br><br>Solution: Add the scoring_script parameter.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-28T02:03:00.000Z",
        "voteCount": 2,
        "content": "B.\n\nTo deploy an MLflow model to an online endpoint in Azure Machine Learning without egress connectivity, you can use model packaging. Here’s how:\n\nFirst, ensure that your workspace has no public network access.\nPackage your MLflow model using the --with-package flag:\n\naz ml online-deployment create --with-package --endpoint-name $ENDPOINT_NAME -f blue-deployment.yml --all-traffic\n\nReplace $ENDPOINT_NAME with your desired endpoint name.\n\nThis approach allows you to avoid the need for an internet connection while deploying MLflow models.\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-deploy-mlflow-models-online-endpoints?view=azureml-api-2&amp;tabs=cli"
      },
      {
        "date": "2024-06-15T11:34:00.000Z",
        "voteCount": 1,
        "content": "The ManagedOnlineDeployment class requires the following parameters:\n\nname: str: Name of the deployment resource.\nmodel: str | Model | None: Model entity for the endpoint deployment, defaults to None.\ncode_configuration: CodeConfiguration | None: Code Configuration, defaults to None.\nenvironment: str | Environment | None: Environment entity for the endpoint deployment, defaults to None.\nThese are the minimum required parameters to create an instance of the ManagedOnlineDeployment class. All other parameters are optional and have default values. Please note that while model, code_configuration, and environment are optional in the constructor, they are typically necessary for a successful deployment. If not provided in the constructor, they should be set before deployment."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 78,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142587-exam-dp-100-topic-4-question-79-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You have an Azure Machine Learning workspace named Workspace1. Workspace1 has a registered MLflow model named model1 with PyFunc flavor.<br><br>You plan to deploy model1 to an online endpoint named endpoint1 without egress connectivity by using Azure Machine Learning Python SDK v2.<br><br>You have the following code:<br><br><img src=\"https://img.examtopics.com/dp-100/image571.png\"><br><br>You need to add a parameter to the ManagedOnlineDeployment object to ensure the model deploys successfully.<br><br>Solution: Add the environment parameter.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-28T02:01:00.000Z",
        "voteCount": 1,
        "content": "To deploy an MLflow model to an online endpoint in Azure Machine Learning without egress connectivity, you can use model packaging. Here’s how:\n\nFirst, ensure that your workspace has no public network access.\nPackage your MLflow model using the --with-package flag:\n\naz ml online-deployment create --with-package --endpoint-name $ENDPOINT_NAME -f blue-deployment.yml --all-traffic\n\nReplace $ENDPOINT_NAME with your desired endpoint name.\n\nThis approach allows you to avoid the need for an internet connection while deploying MLflow models.\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-deploy-mlflow-models-online-endpoints?view=azureml-api-2&amp;tabs=cli"
      },
      {
        "date": "2024-06-15T11:34:00.000Z",
        "voteCount": 1,
        "content": "The ManagedOnlineDeployment class requires the following parameters:\n\nname: str: Name of the deployment resource.\nmodel: str | Model | None: Model entity for the endpoint deployment, defaults to None.\ncode_configuration: CodeConfiguration | None: Code Configuration, defaults to None.\nenvironment: str | Environment | None: Environment entity for the endpoint deployment, defaults to None.\nThese are the minimum required parameters to create an instance of the ManagedOnlineDeployment class. All other parameters are optional and have default values. Please note that while model, code_configuration, and environment are optional in the constructor, they are typically necessary for a successful deployment. If not provided in the constructor, they should be set before deployment."
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 79,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142586-exam-dp-100-topic-4-question-80-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You have an Azure Machine Learning workspace named Workspace1. Workspace1 has a registered MLflow model named model1 with PyFunc flavor.<br><br>You plan to deploy model1 to an online endpoint named endpoint1 without egress connectivity by using Azure Machine Learning Python SDK v2.<br><br>You have the following code:<br><br><img src=\"https://img.examtopics.com/dp-100/image571.png\"><br><br>You need to add a parameter to the ManagedOnlineDeployment object to ensure the model deploys successfully.<br><br>Solution: Add the with_package parameter.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "Answer:",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-28T02:04:00.000Z",
        "voteCount": 1,
        "content": "A.\n\nTo deploy an MLflow model to an online endpoint in Azure Machine Learning without egress connectivity, you can use model packaging. Here’s how:\n\nFirst, ensure that your workspace has no public network access.\nPackage your MLflow model using the --with-package flag:\n\naz ml online-deployment create --with-package --endpoint-name $ENDPOINT_NAME -f blue-deployment.yml --all-traffic\n\nReplace $ENDPOINT_NAME with your desired endpoint name.\n\nThis approach allows you to avoid the need for an internet connection while deploying MLflow models.\n\nhttps://learn.microsoft.com/en-us/azure/machine-learning/how-to-deploy-mlflow-models-online-endpoints?view=azureml-api-2&amp;tabs=cli"
      },
      {
        "date": "2024-06-15T11:35:00.000Z",
        "voteCount": 2,
        "content": "The ManagedOnlineDeployment class requires the following parameters:\n\nname: str: Name of the deployment resource.\nmodel: str | Model | None: Model entity for the endpoint deployment, defaults to None.\ncode_configuration: CodeConfiguration | None: Code Configuration, defaults to None.\nenvironment: str | Environment | None: Environment entity for the endpoint deployment, defaults to None.\nThese are the minimum required parameters to create an instance of the ManagedOnlineDeployment class. All other parameters are optional and have default values. Please note that while model, code_configuration, and environment are optional in the constructor, they are typically necessary for a successful deployment. If not provided in the constructor, they should be set before deployment."
      },
      {
        "date": "2024-06-15T11:32:00.000Z",
        "voteCount": 1,
        "content": "Sorry, scoring_script is optional. Copilot response:\n\nWhen using the ManagedOnlineDeployment class with the pyfunc flavor, the parameters remain the same. However, the model and code_configuration parameters are particularly important:\n\nmodel: str | Model | None: This should be an instance of mlflow.pyfunc.PyFuncModel or the URI of the model saved with mlflow.pyfunc.save_model1.\ncode_configuration: CodeConfiguration | None: This should be an instance of CodeConfiguration where the code_flavor is set to pyfunc."
      },
      {
        "date": "2024-06-15T11:22:00.000Z",
        "voteCount": 2,
        "content": "B. No\nScoring script is a requirement for managedonlinedeployment"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 80,
    "url": "https://www.examtopics.com/discussions/microsoft/view/149191-exam-dp-100-topic-4-question-83-discussion/",
    "body": "You manage an Azure Machine Learning workspace.<br><br>You plan to train a natural language processing (NLP) text classification model in multiple languages by using Azure Machine Learning Python SDK v2.<br><br>You need to configure the language of the text classification job by using automated machine learning.<br><br>Which method of the TextClassificationJob class should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tset_data",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tset_featurization",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tset_sweep",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tset_training_parameters"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-10-12T08:37:00.000Z",
        "voteCount": 1,
        "content": "B is the correct answer.\n\nhttps://learn.microsoft.com/en-us/python/api/azure-ai-ml/azure.ai.ml.automl.textclassificationjob?view=azure-python#azure-ai-ml-automl-textclassificationjob-set-training-parameters"
      }
    ],
    "examNameCode": "dp-100",
    "topicNumber": "4"
  }
]