[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107130-exam-az-720-topic-6-question-51-discussion/",
    "body": "Case study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br>Background -<br>Fabrikam Inc. runs an online reservation service that allows agents to manage online registrations for various hotels, vacation rentals, and customers.<br><br>Current environment -<br><br>Environments -<br>The company has on-premises infrastructure and services that are hosted in Azure. The on-premises infrastructure includes servers that run Active Directory Domain Services (AD DS). Azure services include virtual machines (VMs) that are in one subscription and the following environments: development, testing, and production. Each environment is located in a different virtual network (VNet).<br>The company has a perimeter network that supports connections to the internet. The perimeter network is also hosted in a separate VNet. All of the VNets are connected by using virtual network peering.<br><img src=\"https://img.examtopics.com/az-720/image88.png\"><br><br>Virtual machines -<br>The company's subscription contains the following Azure virtual machines (VMs):<br><img src=\"https://img.examtopics.com/az-720/image89.png\"><br>The Web Server (IIS) role is installed on VM4. The operating system firewall for each VM allows inbound ping requests.<br><br>Network security groups -<br>The company's subscription includes the following network security groups (NSGs):<br><img src=\"https://img.examtopics.com/az-720/image90.png\"><br><br>Security rules -<br>NSG1, NSG2, NSGS, and NSG5 use the default inbound security rules. NSG4, NSG5, and NSG10 use the default outbound security rules.<br>NSG4 has the following inbound security rule:<br><img src=\"https://img.examtopics.com/az-720/image91.png\"><br>NSG10 has the following inbound security rules:<br><img src=\"https://img.examtopics.com/az-720/image92.png\"><br><br>Virtual network peering -<br>The virtual network peering connections are in the following table:<br><img src=\"https://img.examtopics.com/az-720/image93.png\"><br><br>Virtual network gateway -<br>A virtual network gateway named VNetGW is provisioned in the perimeter network. The virtual network gateway will provide:<br>• Network routing to customer data centers using site-to-site VPN connections.<br>• Network routing to Azure for the scheduling agents and sales employees using a point-to-site VPN connection.<br>Information about the virtual network gateway is shown in the following table:<br><img src=\"https://img.examtopics.com/az-720/image94.png\"><br><br>Site-to-site VPN connections -<br>The company's site-to-site VPN connections with customers are shown in the following table:<br><img src=\"https://img.examtopics.com/az-720/image95.png\"><br><br>Point-to-site VPN configuration -<br>The point-to-site VPN is configured as shown in the following table:<br><img src=\"https://img.examtopics.com/az-720/image96.png\"><br><br>Users and groups -<br>The company's user and group memberships are shown in the following table:<br><img src=\"https://img.examtopics.com/az-720/image97.png\"><br>The scheduling agents, warehouse, and sales groups are members of the self-service password reset (SSPR) group named SSPR-group.<br><br>Azure AD Connect -<br>Azure AD Connect is installed on an on-premises server named SRV1. In addition:<br>• The server uses a pass-through authentication agent.<br>• The SSPR feature is enabled.<br>• The SSPR feature is applied only to a group named SSPR-group.<br><br>Network policy server -<br>Network Policy Server (NPS) is installed on an on-premises server named SRV2. The NPS extension for Azure AD multi-factor authentication (MFA) is configured on the server as well.<br><br>Requirements -<br><br>Business requirements -<br>• The scheduling agents' internet connectivity should be blocked when connected to the point-to-site VPN.<br>• Sales employees must use the default VPN client on MacOS computers to connect to Azure.<br>• Azure AD Connect must synchronize all user accounts from AD DS to Azure AD.<br><br>Technical requirements -<br>• Pass-through authentication is required for all users.<br>• Azure AD multi-factor authentication (MFA) is required for all users.<br>• All admin user accounts must be in an organizational unit (OU) named Admins.<br><br>Issues -<br><br>Resource issues -<br>• You discover during testing that scheduling agents are experiencing latency when accessing resources at the Alpine Ski House. You suspect that the issue is related to TCP latency.<br>• You receive reports that VM1 is unable to access resources at Contoso Suites.<br>• Users report issues connecting from VM3 to resources at Margie's Travel. The administrator for Margie's Travel has verified that their VPN gateway is working correctly. You need to verify whether the Fabrikam virtual network gateway is available.<br>• The administrator of a partner company named Blue Yonder Airlines reports VPN disconnections and IPSec failure to connect errors.<br>• You receive the following error on SRV1 only when trying to synchronize an administrator named Admin1: 8344 Insufficient access rights to perform the operation<br>• MFA requests on SRV2 are failing with a security token error.<br>• You are unable to ping VM10 from VM1.<br><br>User issues -<br>• A scheduling agent named User1 reports that they can access the internet when connected to the point-to-site VPN.<br>• A user named User2 reports the following error when registering for SSPR: Your administrator has not enabled you to use this feature.<br>• Sales team employees report that they are unable to connect by using point-to-site VPN.<br>• A scheduling agent named Agent1 reports issues authenticating to Azure AD.<br>• An administrator named Admin2 reports they cannot connect to the web server public IP address on VM4 from VM2.<br>You need to resolve the issue with VM10.<br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd an outbound security rule to NSG1 that allows outbound traffic from ASG1 to ASG10. Configure the rule to use a priority of 100.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the NSG10 inbound security rule that has a priority of 100, change the destination to ASG10.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the NSG10 inbound security rule that has a priority of 100, change the protocol to Any.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn NSG10, remove the inbound security rule that has a priority of 100."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-04-23T03:24:00.000Z",
        "voteCount": 2,
        "content": "Correct - The protocol of the NSG10 rule is set to TCP and would either need to also allow ICMP or simply set to ANY."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107136-exam-az-720-topic-6-question-52-discussion/",
    "body": "A company configures an Azure site-to-site VPN between an on-premises network and an Azure virtual network.<br>The company reports that after completing the configuration, the VPN connection cannot be established.<br>You need to troubleshoot the connection issue.<br>What should you do first?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIdentify the shared key by running this PowerShell cmdlet: Get-AzVirtualNetworkGatewayConnectionSharedKey.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIdentify the shared key by running the PowerShell cmdlet: Get -AzVirtualNetworkGatewayConnectionVpnDeviceConfigScript",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify the AzureRoot.cer file exists.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify the AzureClient.pfx file exists."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-21T07:35:00.000Z",
        "voteCount": 1,
        "content": "The most common reason for a site-to-site VPN connection not being established is a mismatch in the pre-shared keys (shared secrets) on both ends of the connection. This is often the first thing that should be checked when a VPN connection fails to establish. \n\nTherefore, the correct answer should be:\n\nA. Identify the shared key by running this PowerShell cmdlet: Get-AzVirtualNetworkGatewayConnectionSharedKey.\n\nThis cmdlet retrieves the pre-shared key for the specified Azure site-to-site VPN connection, which can then be compared with the pre-shared key configured on the on-premises VPN device to ensure they match. If the keys don't match, the VPN connection will fail to establish. \n\nThe other options are not as relevant:\n\n- Option B, the cmdlet Get-AzVirtualNetworkGatewayConnectionVpnDeviceConfigScript, is used to generate a configuration script for the on-premises VPN device, which is useful, but not the first step in troubleshooting.\n\n- Options C and D refer to certificate files that are relevant in certificate-based authentication scenarios, not a pre-shared key (PSK) authentication scenario, which is typically used in site-to-site VPNs."
      },
      {
        "date": "2023-04-23T03:34:00.000Z",
        "voteCount": 1,
        "content": "A is correct.\n\nhttps://learn.microsoft.com/en-us/powershell/module/az.network/get-azvirtualnetworkgatewayconnectionsharedkey?view=azps-9.6.0"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107138-exam-az-720-topic-6-question-53-discussion/",
    "body": "HOTSPOT -<br>A company is deploying Azure Bastion to provide secure clientless access to its Azure VMs. The company configures a network security group named NSG1.<br>During deployment, the following error displays: Network security group NSG1 does not have necessary rules for Azure Bastion Subnet AzureBastionSubnet.<br>You need to fix the inbound rules for NSG1.<br>How should you complete the configuration? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image98.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image99.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-23T03:38:00.000Z",
        "voteCount": 2,
        "content": "Correct\n\nhttps://learn.microsoft.com/en-us/azure/bastion/bastion-nsg#apply"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107140-exam-az-720-topic-6-question-54-discussion/",
    "body": "HOTSPOT -<br>A company attempts to implement just-in-time (JIT) access for a virtual machine (VM) named VM1.<br>The company reports that they are unable to complete the process.<br>You need to implement JIT access and test the deployment.<br>Which PowerShell cmdlets should you run? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/az-720/image101.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image102.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-23T03:41:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct.\n\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/just-in-time-access-usage#powershell"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107141-exam-az-720-topic-6-question-55-discussion/",
    "body": "A company deploys Azure Bastion to connect to their virtual machine (VM) infrastructure.<br>An engineer attempts to connect to a Windows VM by using Remote Desktop Protocol (RDP). The connection fails.<br>You need to troubleshoot the issue.<br>Which two actions should you perform? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMonitor traffic with the following PowerShell cmdlet New-AzNetworkWatcherFlowlog.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApply a network security group on the same subnet as Azure Bastion.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMonitor traffic with the following PowerShell cmdlet Test-AzNetworkWatcherConnectivity.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure Azure Bastion with static assignment.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Network Watcher Connection troubleshoot service.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "CE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "CE",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-04-23T08:27:00.000Z",
        "voteCount": 1,
        "content": "Given answers are correct"
      },
      {
        "date": "2023-04-23T03:48:00.000Z",
        "voteCount": 1,
        "content": "Seems right - basically both answer do about the same thing anyway, in a real life I would just go with the Connection Troubleshooter.\n\nC - https://learn.microsoft.com/en-us/powershell/module/az.network/test-aznetworkwatcherconnectivity?view=azps-9.6.0\n\nE - https://learn.microsoft.com/en-us/azure/bastion/troubleshoot#connectivity"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107143-exam-az-720-topic-6-question-57-discussion/",
    "body": "DRAG DROP -<br><br>A company uses ExpressRoute to connect an on-premises datacenter to Azure. You deploy two virtual machines (VMs) named VM1 and VM2 in Azure. You configure Internet Information Services (IIS) on VM1.<br><br>Users experience the following connection issues from on-premises:<br><br>•\tUnable to connect to IIS on VM1<br>•\tLatency connection issues with VM2<br><br>You need to troubleshoot the issues.<br><br>Which cmdlets should you use? To answer, drag the appropriate cmdlets to the correct target VMs. Each cmdlet may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-720/image112.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image113.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-23T04:08:00.000Z",
        "voteCount": 1,
        "content": "given answer is correct.\n\nGet-AzureNetworkAvailability - https://github.com/Azure/NetworkMonitoring/blob/main/AzureCT/AvailabilityTesting.md#fast-start\n\n Get-LinkPerformance - https://learn.microsoft.com/en-us/azure/expressroute/expressroute-troubleshooting-network-performance#azurect---the-azure-connectivity-toolkit"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106097-exam-az-720-topic-6-question-58-discussion/",
    "body": "A company enables just-in-time (JIT) virtual machine (VM) access in Azure.<br><br>An administrator observes a list of VMs on the Unsupported tab of the JIT VM access page in the Microsoft Defender for Cloud portal.<br><br>You need to determine why some VMs are not supported for JIT VM access.<br><br>What should you conclude?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe client firewall does not allow port 3389 on the VMs.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe administrator is using the Microsoft Defender for Cloud free tier.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA network security group is not associated with the VMs.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe client firewall does not allow port 22 on the VMs."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-04-23T04:13:00.000Z",
        "voteCount": 2,
        "content": "C is the answer.\n\nFor any JIT rule access to work it needs to be added into an associated NSG to the VM subnet/NIC OR if there is an AZFW active in the environment, that also works, but in our case it's the NSG.\n\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/just-in-time-access-usage#work-with-jit-vm-access-using-microsoft-defender-for-cloud"
      },
      {
        "date": "2023-04-13T01:48:00.000Z",
        "voteCount": 3,
        "content": "A and D can't because Bastion / JiT works on Port 443.\nB is a stupid answer so the answer would be C."
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/107145-exam-az-720-topic-6-question-59-discussion/",
    "body": "DRAG DROP -<br><br>A company has an Azure virtual network (VNet). An administrator creates a subnet in the VNet named AzureBastionSubnet. The administrator deploys Azure Bastion to AzureBastionSubnet.<br><br>The administrator creates a network security group named nsg-Bastion. The following error message displays when the administrator attempts to assign nsg-Bastion to AzureBastionSubnet:<br><br>Network security group nsg-Bastion does not have necessary rules for Azure Bastion Subnet AzureBastionSubnet<br><br>You need to resolve the issues with the inbound security rules.<br><br>Which port or set of ports should you configure? To answer, drag the appropriate port or set of ports to the correct sources. Each port or set of ports may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-720/image114.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-720/image115.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-23T04:15:00.000Z",
        "voteCount": 1,
        "content": "Given answer is correct.\n\nhttps://learn.microsoft.com/en-us/azure/bastion/bastion-nsg#apply"
      }
    ],
    "examNameCode": "az-720",
    "topicNumber": "6"
  }
]