[
  {
    "topic": 8,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74647-exam-dp-203-topic-8-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to design a data ingestion and storage solution for the Twitter feeds. The solution must meet the customer sentiment analytics requirements.<br>What should you include in the solution? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04259/0028200004.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04259/0028300001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Configure Evegent Hubs partitions<br>Scenario: Maximize the throughput of ingesting Twitter feeds from Event Hubs to Azure Storage without purchasing additional throughput or capacity units.<br>Event Hubs is designed to help with processing of large volumes of events. Event Hubs throughput is scaled by using partitions and throughput-unit allocations.<br>Incorrect Answers:<br>✑ Event Hubs Dedicated: Event Hubs clusters offer single-tenant deployments for customers with the most demanding streaming needs. This single-tenant offering has a guaranteed 99.99% SLA and is available only on our Dedicated pricing tier.<br>✑ Auto-Inflate: The Auto-inflate feature of Event Hubs automatically scales up by increasing the number of TUs, to meet usage needs.<br>Event Hubs traffic is controlled by TUs (standard tier). Auto-inflate enables you to start small with the minimum required TUs you choose. The feature then scales automatically to the maximum limit of TUs you need, depending on the increase in your traffic.<br>Box 2: An Azure Data Lake Storage Gen2 account<br>Scenario: Ensure that the data store supports Azure AD-based access control down to the object level.<br>Azure Data Lake Storage Gen2 implements an access control model that supports both Azure role-based access control (Azure RBAC) and POSIX-like access control lists (ACLs).<br>Incorrect Answers:<br>✑ Azure Databricks: An Azure administrator with the proper permissions can configure Azure Active Directory conditional access to control where and when users are permitted to sign in to Azure Databricks.<br>✑ Azure Storage supports using Azure Active Directory (Azure AD) to authorize requests to blob data.<br>You can scope access to Azure blob resources at the following levels, beginning with the narrowest scope:<br>- An individual container. At this scope, a role assignment applies to all of the blobs in the container, as well as container properties and metadata.<br>- The storage account. At this scope, a role assignment applies to all containers and their blobs.<br>- The resource group. At this scope, a role assignment applies to all of the containers in all of the storage accounts in the resource group.<br>- The subscription. At this scope, a role assignment applies to all of the containers in all of the storage accounts in all of the resource groups in the subscription.<br>- A management group.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/event-hubs/event-hubs-features https://docs.microsoft.com/en-us/azure/storage/blobs/data-lake-storage-access-control",
    "votes": [],
    "comments": [
      {
        "date": "2022-04-28T09:40:00.000Z",
        "voteCount": 16,
        "content": "Answer looks correct to me:\n1)Configure Event Hubs partition - The description says: \"Maximize the throughput of ingesting Twitter feeds from Event Hubs to Azure Storage without purchasing additional throughput or capacity units.\"\n\n2) An Azure Data Lake Storage Gen2 account.\nDatabricks cluster has nothing to do with storage, and a Data lake fits the needs"
      },
      {
        "date": "2022-08-13T07:25:00.000Z",
        "voteCount": 8,
        "content": "correct!"
      },
      {
        "date": "2024-06-26T07:46:00.000Z",
        "voteCount": 2,
        "content": "For me the correct answer is: \n1. Azure Event Hubs Dedicated: In most streaming scenarios, data is lightweight, typically less than 1 MB, and requires high throughput. \nref: https://learn.microsoft.com/en-us/azure/event-hubs/event-hubs-dedicated-overview#supports-streaming-large-messages\n2. An Azure Data Lake Storage Gen2 account"
      },
      {
        "date": "2023-09-01T00:39:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2022-04-26T22:45:00.000Z",
        "voteCount": 1,
        "content": "Box one is Enable auto-inflate\nBox two Data Lake account"
      },
      {
        "date": "2022-06-28T19:07:00.000Z",
        "voteCount": 4,
        "content": "Enable auto-inflate is for scale up Azure Event Hubs throughput units, so given answer by xamtopics are correct."
      }
    ],
    "examNameCode": "dp-203",
    "topicNumber": "8"
  }
]