[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/62692-exam-dp-203-topic-6-question-1-discussion/",
    "body": "HOTSPOT -<br>Which Azure Data Factory components should you recommend using together to import the daily inventory data from the SQL server to Azure Data Lake Storage?<br>To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04259/0013900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04259/0014000001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Self-hosted integration runtime<br>A self-hosted IR is capable of running copy activity between a cloud data stores and a data store in private network.<br><br>Box 2: Schedule trigger -<br><br>Schedule every 8 hours -<br><br>Box 3: Copy activity -<br>Scenario:<br>✑ Customer data, including name, contact information, and loyalty number, comes from Salesforce and can be imported into Azure once every eight hours. Row modified dates are not trusted in the source table.<br>✑ Product data, including product ID, name, and category, comes from Salesforce and can be imported into Azure once every eight hours. Row modified dates are not trusted in the source table.",
    "votes": [],
    "comments": [
      {
        "date": "2022-12-03T22:02:00.000Z",
        "voteCount": 27,
        "content": "Agreed with the given answers.\n\nBox1: Self-hosted integration runtime\nWhy not Azure-SSIS integration rutime? SSIS is not mentioned, and the ETL tool in use is ADF. \nWhy not Azure integration runtime? On-premise SQL Server database is used.\n\nBox2: Schedule trigger \nWhy not event-based trigger? Schedule runs every 8 hours \nWhy not tumbling window schedule? There is no requirement for a tumbling window schedule. If the ETL jobs run close to 8 hours, a tumbling window schedule may be required. If jobs need to automatically re-run on failures, a tumbling window schedule may be required. Those requirements are not there. Schedule trigger fits for purpose.\n\nBox3: Copy activity\nNo need for explanation"
      },
      {
        "date": "2023-02-16T13:01:00.000Z",
        "voteCount": 2,
        "content": "agree with you"
      },
      {
        "date": "2021-11-05T11:48:00.000Z",
        "voteCount": 23,
        "content": "Should be Tumbling Window in my opinion. Since Inventory data should be updated in real time as close as possible.  Only Customer &amp; Product data are available every 8 hours."
      },
      {
        "date": "2022-02-21T16:09:00.000Z",
        "voteCount": 3,
        "content": "I also think it should be a Tumbling Window. Because it said 'Litware will build a custom application named FoodPrep to provide store employees with the calculation results of how many prepared food items to produce every four hours.'"
      },
      {
        "date": "2023-07-28T02:18:00.000Z",
        "voteCount": 2,
        "content": "I think you are mixing up different requirements. Daily inventory, should be ingested daily, I would say and for that schedule trigger makes sense. It would make less sense to use a thumbling window, not to mention that you can't even use \"day\" as the first argument (time interval) for the tumbling window function when coding, only hour as the biggest measurement unit"
      },
      {
        "date": "2023-09-09T02:45:00.000Z",
        "voteCount": 1,
        "content": "Self-hosted,Schedule ,Copy data"
      },
      {
        "date": "2023-01-13T02:12:00.000Z",
        "voteCount": 2,
        "content": "The below link refers to the (a) Azure Integration Runtime: https://learn.microsoft.com/en-us/azure/data-factory/tutorial-managed-virtual-network-on-premise-sql-server"
      },
      {
        "date": "2023-07-12T05:03:00.000Z",
        "voteCount": 1,
        "content": "the link you provided clearly states that virtual networks should be in place whereas the task says \"Litware does not plan to implement Azure ExpressRoute or a VPN between the on-premises network and Azure.\" Therefore self-hosted integration runtime is the answer (as ExamTopics suggested)"
      },
      {
        "date": "2022-09-18T01:49:00.000Z",
        "voteCount": 2,
        "content": "I think it should be SSIS integration runtime... Because currently there are SSIS pipelines which does the data integration"
      },
      {
        "date": "2022-08-13T07:11:00.000Z",
        "voteCount": 3,
        "content": "In opinion the given answer is correct since its daily inventory data, i.e. will be loaded once daily."
      },
      {
        "date": "2021-12-29T14:50:00.000Z",
        "voteCount": 2,
        "content": "Answers are correct because 'Daily inventory data comes from a Microsoft SQL server located on a private network.'."
      },
      {
        "date": "2021-11-28T03:21:00.000Z",
        "voteCount": 8,
        "content": "I believe a Microsoft SQL server located on a private network means on Azure not on premises, which means the integration run time should be azure not self hosted."
      },
      {
        "date": "2021-12-16T20:53:00.000Z",
        "voteCount": 1,
        "content": "Should it be Self-hosted as Microsoft SQL server, not Azure though?"
      },
      {
        "date": "2022-06-24T21:37:00.000Z",
        "voteCount": 2,
        "content": "maybe.... even if it is an azure resource, but in private network, we need  SelfHosted"
      },
      {
        "date": "2021-10-25T18:41:00.000Z",
        "voteCount": 18,
        "content": "The answers are correct."
      },
      {
        "date": "2021-09-24T20:15:00.000Z",
        "voteCount": 3,
        "content": "Shouldn't it be event based?"
      },
      {
        "date": "2021-11-03T08:25:00.000Z",
        "voteCount": 3,
        "content": "It is confusing cos at the top it says they want the inventory as real time as possible , but then further down it says every 8 hours. Conflicting info"
      },
      {
        "date": "2022-11-17T07:37:00.000Z",
        "voteCount": 1,
        "content": "read carefully - import every 8 hours for customer date, not inventory data. Evenet triggers can be used only with storage account, so Event based is for sure wrong. It's tumbling windows"
      },
      {
        "date": "2022-12-01T09:06:00.000Z",
        "voteCount": 1,
        "content": "It says: \"Daily inventory data comes from a Microsoft SQL server located on a private network.\" So the answer is as given: Self-hosted, Schedule, Copy"
      },
      {
        "date": "2021-09-27T02:37:00.000Z",
        "voteCount": 5,
        "content": "Schedule trigger - because daily. so the given answer is correct"
      }
    ],
    "examNameCode": "dp-203",
    "topicNumber": "6"
  }
]