[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20072-exam-70-412-topic-2-question-7-discussion/",
    "body": "You have a server named Server1 that runs Windows Server 2012 R2. Server1 has a single volume that is encrypted by using BitLocker Drive Encryption<br>(BitLocker).<br>BitLocker is configured to save encryption keys to a Trusted Platform Module (TPM). Server1 is configured to perform a daily system image backup.<br>The motherboard on Server1 is upgraded.<br>After the upgrade, Windows Server 2012 R2 on Server1 fails to start.<br>You need to start the operating system on Server1 as soon as possible.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart Server1 from the installation media. Run startrec.exe.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMove the disk to a server that has a model of the old motherboard. Start the server from the installation media. Run bcdboot.exe.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMove the disk to a server that has a model of the old motherboard. Start the server. Run tpm.msc.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart Server1 from the installation media. Perform a system image recovery."
    ],
    "answer": "C",
    "answerDescription": "By moving the hard drive to server with that has a model of the old motherboard the system would be able to start. As BitLocker was configured to save encryption keys to a Trusted Platform Module (TPM), we can use tpm.msc to access the TPM settings.<br>Note: After you replaced the motherboard, you need to repopulate the TPM with new information regarding the encryption of the hard disk.<br>We use these commands to repopulate the information in the TPM (without PIN): manage-bde delete -protectors C: -type TPM manage-bde protectors add C: -tpm<br>Incorrect:<br>Not D. After the system image recovery you would still have the new motherboard installed. The problem would return.<br>Reference: BitLocker - New motherboard replacement",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-06T11:18:00.000Z",
        "voteCount": 1,
        "content": "I'll go with D, assuming they have the recovery key"
      },
      {
        "date": "2020-07-06T20:02:00.000Z",
        "voteCount": 1,
        "content": "*Hardware HASH*"
      },
      {
        "date": "2020-07-06T20:01:00.000Z",
        "voteCount": 1,
        "content": "Disagree here Wazmac. Sys Img will have drivers for the chipset &amp; hardware of the old motherboard, plush the hardware has would invalidate the product key of the OS due to significant changes. Sys Img is actually a .VHD file, so if you don't have a machine with a copy of the old motherboard, you could mount the .VHD as a volume in Disk Management &amp; cherry-pick files, as it IS unencrypted. Tech should have turned off Bitlocker pre-upgrade. I believe \"C\" is correct."
      },
      {
        "date": "2020-05-08T22:10:00.000Z",
        "voteCount": 4,
        "content": "Answer should be D - \n\"When drives, folders, and files are backed up by the server, an unencrypted version is saved to the server. During full system restore, this unencrypted version is copied to the computer. After a successful full system restore, you have to reactivate BitLocker on the server.\"\n\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-storage-solutions/hh211414(v=ws.11)?redirectedfrom=MSDN"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24958-exam-70-412-topic-2-question-9-discussion/",
    "body": "Your network contains two servers named Server1 and Server2 that run Windows Server 2012 R2. Server1 and Server2 have the Hyper-V server role installed.<br>Server1 and Server2 are configured as Hyper-V replicas of each other.<br>Server2 hosts a virtual machine named VM5. VM5 is replicated to Server1.<br>You need to verify whether the replica of VM5 on Server1 is functional. The solution must ensure that VM5 remains accessible to clients.<br>What should you do from Hyper-V Manager?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, execute a Planned Failover.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, execute a Test Failover.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, execute a Planned Failover.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, execute a Test Failover."
    ],
    "answer": "B",
    "answerDescription": "Test Failover (TFO) is an operation initiated on your replica virtual machine (in this scenario on Server1) which allows you to test the sanity of the virtualized workload without interrupting your production workload or ongoing replication.<br>TFO is performed on the replica virtual machine by right-clicking on the VM and choosing the Test Failover operation (either from the Hyper-V Manager or from the<br>Failover Clustering Manager).<br>Reference: Types of failover operations in Hyper-V Replica  Part I  Test Failover.",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-06T20:06:00.000Z",
        "voteCount": 4,
        "content": "https://docs.microsoft.com/en-us/virtualization/community/team-blog/2012/20120725-types-of-failover-operations-in-hyper-v-replica-part-i-test-failover"
      },
      {
        "date": "2020-08-05T13:01:00.000Z",
        "voteCount": 2,
        "content": "Thanks!"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11441-exam-70-412-topic-2-question-15-discussion/",
    "body": "DRAG DROP -<br>Your network contains two Active Directory forests named contoso.com and adatum.com. All domain controllers run Windows Server 2012 R2.<br>A federated trust exists between adatum.com and contoso.com. The trust provides adatum.com users with access to contoso.com resources.<br>You need to configure Active Directory Federation Services (AD FS) claim rules for the federated trust.<br>The solution must meet the following requirements:<br>✑ In contoso.com, replace an incoming claim type named Group with an outgoing claim type named Role.<br>✑ In adatum.com, allow users to receive their tokens for the relying party by using their Active Directory group membership as the claim type.<br>The AD FS claim rules must use predefined templates.<br>Which rule types should you configure on each side of the federated trust?<br>To answer, drag the appropriate rule types to the correct location or locations. Each rule type may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0013100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "* Acceptance transform rule set<br>A set of claim rules that you use on a particular claims provider trust to specify the incoming claims that will be accepted from the claims provider organization and the outgoing claims that will be sent to the relying party trust.<br><br>Used on: Claims provider trusts -<br>* Issuance Authorization Rule Set<br>A set of claim rules that you use on a relying party trust to specify the claims that will be issued to the relying party.<br><br>Used on: Relying party trusts -<br>Reference: The Role of Claim Rules<br>http://technet.microsoft.com/zh-cn/library/ee913586(v=WS.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-05T09:17:00.000Z",
        "voteCount": 2,
        "content": "CORRECT ANSWER:\nClaims Provider trust: An acceptance transform rule\nRelying Party trust: An issuance authorization rule"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37379-exam-70-412-topic-2-question-16-discussion/",
    "body": "You have a datacenter that contains six servers. Each server has the Hyper-V server role installed and runs Windows Server 2012 R2. The servers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0013200001.png\" class=\"in-exam-image\"><br>Host4 and Host5 are part of a cluster named Cluster1. Cluster1 hosts a virtual machine named VM1.<br>You need to move VM1 to another Hyper-V host. The solution must minimize the downtime of VM1.<br>To which server and by which method should you move VM1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTo Host3 by using a storage migration",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTo Host6 by using a storage migration",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTo Host2 by using a live migration",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTo Host1 by using a quick migration"
    ],
    "answer": "A",
    "answerDescription": "With Hyper-V live migration, you can move running VMs from one Hyper-V physical host to another without any disruption of service or perceived downtime.<br>Host3 has an Intel processer, as does Host4 and Host5 in Cluster1, so the migration will work fine.<br>Incorrect:<br>Not B, not C. The migration of a virtual machine between physical computers is only supported on computers that have the same processor steppings or are from the same vendor. Therefore you cannot move a virtual machine from a Hyper-V host on an Intel-based server to a Hyper-V Host on an AMD-based server.<br>Not D. Quick Migration saves, moves and restores VMs, which results in some downtime.<br>Reference: Hyper-V Migration Guide<br>http://technet.microsoft.com/en-us/library/ee849855(v=WS.10).aspx<br>Reference: Virtual Machine Storage Migration Overview<br>http://technet.microsoft.com/en-us/library/hh831656.aspx<br>Reference: Windows Server 2008 R2 &amp; Microsoft Hyper-V Server 2008 R2 - Hyper-V Live Migration Overview &amp; Architecture (http://www.microsoft.com/en-us/ download/details.aspx? id=12601)",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-20T05:10:00.000Z",
        "voteCount": 1,
        "content": "I think answer A is not correct. You can perform storage migration on the same host. For example when the host has two disks and the VM is stored on Disk1 you can perform a live storage migration to Disk2. You cannot perform storage migration between two hosts, especially when they do not share a common storage.\nReference: https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh831656(v=ws.11)"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33864-exam-70-412-topic-2-question-19-discussion/",
    "body": "HOTSPOT -<br>Your network contains two Web servers named Server1 and Server2. Both servers run Windows Server 2012 R2.<br>Server1 and Server2 are nodes in a Network Load Balancing (NLB) cluster. The NLB cluster contains an application named App1 that is accessed by using the<br>URL http://app1.contoso.com.<br>You deploy a new server named Server3 that runs Windows Server 2012 R2. The contoso.com DNS zone contains the records shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0013700001.png\" class=\"in-exam-image\"><br>You need to add Server3 to the NLB cluster.<br>What command should you run?<br>To answer, select the appropriate options in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0013800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0013900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "* The Add-NlbClusterNode cmdlet adds a new node to the NLB cluster. Once the new node settings are circulated through all of the NLB cluster node, the new cluster node will be in a running state in the cluster.<br>* The Get-NlbClusterNode cmdlet retrieves information about a node in the NLB cluster.<br>* EXAMPLE: This command adds host node2 to the cluster on node1.<br>C:\\PS&gt;<br>Get-NlbCluster node1 | Add-NlbClusterNode -NewNodeName node2 -NewNodeInterface vlan-3<br>Name                State               Interface           HostID<br>----                -----               ---------           ------ node2               Converged           vlan-3              2<br>Reference: Get-NlbClusterNode; Add-NlbClusterNode",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-06T19:43:00.000Z",
        "voteCount": 1,
        "content": "Get-Cluster -Name cluster1 | Add-ClusterNode -Name node3\n\nhttps://docs.microsoft.com/en-us/powershell/module/failoverclusters/add-clusternode?view=win10-ps"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24959-exam-70-412-topic-2-question-20-discussion/",
    "body": "DRAG DROP -<br>Your network contains an Active Directory domain named contoso.com. The domain contains four member servers named Server1, Server2, Server3, and<br>Server4. All servers run Windows Server 2012 R2.<br>Server1 and Server3 are located in a site named Site1. Server2 and Server4 are located in a site named Site2. The servers are configured as nodes in a failover cluster named Cluster1.<br>Dynamic quorum management is disabled.<br>Cluster1 is configured to use the Node Majority quorum configuration.<br>You need to ensure that users in Site2 can access Cluster1 if the network connection between the two sites becomes unavailable.<br>What should you run from Windows PowerShell?<br>To answer, drag the appropriate commands to the correct location. Each command may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0014100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "NodeWeight settings are used during quorum voting to support disaster recovery and multi-subnet scenarios for AlwaysOn Availability Groups and SQL Server<br>Failover Cluster Instances.<br>Example (Powershell)<br>The following example changes the NodeWeight setting to remove the quorum vote for the \"AlwaysOnSrv1\" node.<br><br>Import-Module FailoverClusters -<br>$node = \"AlwaysOnSrv1\"<br>(Get-ClusterNode $node).NodeWeight = 0<br>Reference: Configure Cluster Quorum NodeWeight Settings.",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-06T20:53:00.000Z",
        "voteCount": 3,
        "content": "Get-ClusterNode Server1 | $_.NodeWeight = 0\n[Leaves both nodes in Site 2 with a vote &amp; only one node in Site 1, so Site 2 will stay up]\n\nhttps://docs.microsoft.com/en-us/windows-server/failover-clustering/manage-cluster-quorum"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14335-exam-70-412-topic-2-question-26-discussion/",
    "body": "You have a server named Server1 that runs Windows Server 2012 R2. Server1 is located in the perimeter network and has the DNS Server server role installed.<br>Server1 has a zone named contoso.com.<br>You App1y a security template to Server1.<br>After you App1y the template, users report that they can no longer resolve names from contoso.com. On Server1, you open DNS Manager as shown in the DNS exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0015300001.jpg\" class=\"in-exam-image\"><br>On Server1, you open Windows Firewall with Advanced Security as shown in the Firewall exhibit.<br>(Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0015400001.jpg\" class=\"in-exam-image\"><br>You need to ensure that users can resolve contoso.com names.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows Firewall with Advanced Security, disable the DNS (TCP, Incoming) rule and the DNS (UDP, Incoming) rule.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS Manager, modify the Zone Transfers settings of the contoso.com zone.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS Manager, unsign the contoso.com zone.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS Manager, modify the Start of Authority (SOA) of the contoso.com zone.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows Firewall with Advanced Security, modify the profiles of the DNS (TCP, Incoming) rule and the DNS (UDP, Incoming) rule."
    ],
    "answer": "E",
    "answerDescription": "To configure Windows Firewall on a managed DNS server<br>1. On the Server Manager menu, click Tools and then click Windows Firewall with Advanced Security.<br>2. Right-click Inbound Rules, and then click New Rule. The New Inbound Rule Wizard will launch.<br>3. In Rule Type, select Predefined, choose DNS Service from the list, and then click Next.<br>4. In Predefined Rules, under Rules, select the checkboxes next to the following rules:<br>✑ RPC (TCP, Incoming)<br>✑ DNS (UDP, Incoming)<br>✑ DNS (TCP, Incoming)<br>✑ RPC Endpoint Mapper (TCP, Incoming)<br>5. Click Next, choose Allow the connection, and then click Finish.<br>6. Right-click Inbound Rules, and then click New Rule. The New Inbound Rule Wizard will launch. etc.<br>Reference: Manually Configure DNS Access Settings",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-11T12:06:00.000Z",
        "voteCount": 3,
        "content": "Or because they're only allowed for the Private profile..."
      },
      {
        "date": "2020-02-17T12:53:00.000Z",
        "voteCount": 1,
        "content": "Anyone has an idea why you would need to edit the already enabled DNS rules?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/981-exam-70-412-topic-2-question-28-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two member servers named Server1 and Server2.<br>You install the DHCP Server server role on Server1 and Server2. You install the IP Address Management (IPAM) Server feature on Server1.<br>You notice that you cannot discover Server1 or Server2 in IPAM.<br>You need to ensure that you can use IPAM to discover the DHCP infrastructure.<br>Which two actions should you perform? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, create an IPv4 scope.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, run the Add-IpamServerInventory cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, run the Add-DhcpServerInDc cmdlet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn both Server1 and Server2, run the Add-DhcpServerv4Policy cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, uninstall the DHCP Server server role."
    ],
    "answer": "BC",
    "answerDescription": "B. The Add-IpamServerInventory cmdlet adds a new infrastructure server to the IP Address Management (IPAM) server inventory. Use the fully qualified domain name (FQDN) of the server to add to the server inventory.<br>C. The Add-DhcpServerInDC cmdlet adds the computer running the DHCP server service to the list of authorized Dynamic Host Configuration Protocol (DHCP) server services in the Active Directory (AD). A DHCP server service running on a domain joined computer needs to be authorized in AD so that it can start leasing<br>IP addresses on the network.<br>Reference: Add-IpamServerInventory; Add-DhcpServerInDC",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-13T19:16:00.000Z",
        "voteCount": 6,
        "content": "\"In its recommended configuration, IPAM is installed on a standalone server. If IPAM is installed on the same server with the DHCP Server role service, automatic discovery of DHCP servers on the network will be disabled.\"\n\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/hh831353(v=ws.11)?redirectedfrom=MSDN"
      },
      {
        "date": "2020-08-19T17:15:00.000Z",
        "voteCount": 3,
        "content": "tested on my lab as well wazmac is 100% correct ipam provisioning wont work when you have dhcp,dns and dc on same server need to install ipam on non domain server."
      },
      {
        "date": "2021-01-10T14:08:00.000Z",
        "voteCount": 2,
        "content": "Answer \"A\" and \"E\".\n...Problem: A DHCP server is not discovered.\n\nSolution: Verify that the DHCP server role is not installed on the IPAM server. Verify that at least one IPv4 scope is configured on a DHCP server...\n\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj878309(v=ws.11)"
      },
      {
        "date": "2021-01-07T11:59:00.000Z",
        "voteCount": 1,
        "content": "C and E are correct, please go through this link and explanation.\nhttp://technet.microsoft.com/en-us/library/jj590712.aspx\nAdd-DhcpServerInDC\nAdds the computer running the DHCP server service to the list of authorized Dynamic Host Configuration\nProtocol (DHCP) server services in Active Directory (AD).\nIPAM should not be installed on a DHCP server.\nhttp://technet.microsoft.com/en-us/library/jj878312.aspx\nIPAM must be installed on a domain member computer. You cannot install IPAM on a domain\ncontroller. If IPAM is installed on the same server with DHCP, then DHCP server discovery will be\ndisabled."
      },
      {
        "date": "2020-10-31T04:19:00.000Z",
        "voteCount": 1,
        "content": "C and E it is."
      },
      {
        "date": "2020-09-04T06:56:00.000Z",
        "voteCount": 2,
        "content": "Flowbro and wazmac are both correct. As the question states: \"You need to ensure that you can use IPAM to discover the DHCP infrastructure.\"\nThe only correct answer would be A and E (as flowbro stated earlier)"
      },
      {
        "date": "2020-08-10T19:19:00.000Z",
        "voteCount": 1,
        "content": "I believe they are giving us the preferred method of dealing with IPAM server inventory when IPAM must be installed on a DHCP server, rather than best practices for IPAM when the number of servers available to use is not an issue."
      },
      {
        "date": "2019-12-15T21:01:00.000Z",
        "voteCount": 2,
        "content": "A and E would be my vote.  You can have DHCP installed on an IPAM server and you need to have an authorized DHCP server with at least one scope"
      },
      {
        "date": "2019-06-27T05:33:00.000Z",
        "voteCount": 4,
        "content": "imo, answer is C and E. you have ti uninstall DHCP from Server1"
      },
      {
        "date": "2019-04-19T05:48:00.000Z",
        "voteCount": 1,
        "content": "I believe you cannot install IPAM on a server with dhcp installed......so answer is wrong"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14109-exam-70-412-topic-2-question-29-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a server named Server1 that runs Windows Server 2012 R2 and has the DHCP Server server role installed. Server1 has an IPv6 scope named Scope1.<br>You implement an additional DHCP server named Server2 that runs Windows Server 2012 R2.<br>You need to provide high availability for Scope1. The solution must minimize administrative effort.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall and configure Network Load Balancing (NLB) on Server1 and Server2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a scope on Server2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure DHCP failover on Server1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall and configure Failover Clustering on Server1 and Server2."
    ],
    "answer": "C",
    "answerDescription": "Overview: Configure DHCP failover using the DHCP console<br>To configure DHCP failover using the DHCP console, right-click a DHCP scope or right-click IPv4 and then click Configure Failover.<br><img src=\"/assets/media/exam-media/02140/0015800001.jpg\" class=\"in-exam-image\"><br>The Configure Failover wizard guides you through configuring DHCP failover on the selected scope.<br>Note: The DHCP server failover feature, available in Windows Server 2012 and later, provides the ability to have two DHCP servers provide IP addresses and option configuration to the same subnet or scope, providing for continuous availability of DHCP service to clients.<br>Incorrect:<br>Not A. NLB is not related to DHCP scope availability.<br>Not B. DHCP failover requirements include:<br>DHCP Scopes requirement:<br>At least one IPv4 DHCP scope must be configured on the primary DHCP server.<br>The same DHCP scope ID, or an overlapping scope, must not be configured on the failover partner.<br>Not D. Failover clustering is possibly, but would not minimize administration.<br>Reference: Deploy DHCP Failover",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-13T22:36:00.000Z",
        "voteCount": 5,
        "content": "i vote for B. Create a scope on Server2. \nfailover is not applicable for the IPv6 scopes."
      },
      {
        "date": "2020-10-12T02:27:00.000Z",
        "voteCount": 1,
        "content": "DHCP failover is not supported for Internet Protocol version 6 (IPv6) scopes. Network adapters using IPv6 typically determine their own IPv6 address using stateless IP auto-configuration. In this mode, the DHCP server delivers only the DHCP option configuration, and the server does not maintain any lease state information. A high availability deployment for stateless DHCPv6 is possible by simply setting up two servers with identical option configuration. Even in a stateful DHCPv6 deployment, the scopes do not run under high address utilization, which makes split scope a viable solution for high availability."
      },
      {
        "date": "2020-07-11T12:33:00.000Z",
        "voteCount": 3,
        "content": "Anton is correct about IPv6 not being compatible with DHCP Failover ( https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/dn338983(v=ws.11) ) - However, the \"answer\" clearly shows IPv4 selected, so the *question* is most likely a typo."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/13234-exam-70-412-topic-2-question-30-discussion/",
    "body": "Your network contains two Active Directory forests named contoso.com and corp.contoso.com.<br><img src=\"/assets/media/exam-media/02140/0015900001.png\" class=\"in-exam-image\"><br>User1 is a member of the DnsAdmins domain local group in contoso.com.<br>User1 attempts to create a conditional forwarder to corp.contoso.com but receive an error message shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0016000001.jpg\" class=\"in-exam-image\"><br>You need to configure bi-directional name resolution between the two forests.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd User1 to the DnsUpdateProxy group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the zone to be Active Directory-integrated.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Advanced view from DNS Manager.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the New Delegation Wizard."
    ],
    "answer": "B",
    "answerDescription": "The zone must be Active Directory-integrated.",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-31T18:15:00.000Z",
        "voteCount": 4,
        "content": "The graphic isn't really showing an \"error message.\" It's showing a configuration dialogue box. While I agree with the answer, the picture used in the question is a very poor choice or the wrong one."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2044-exam-70-412-topic-2-question-32-discussion/",
    "body": "Your network contains two Active Directory forests named contoso.com and adatum.com. Each forest contains one domain. Contoso.com has a two-way forest trust to adatum.com. Selective authentication is enabled on the forest trust.<br>Contoso contains 10 servers that have the File Server role service installed. Users successfully access shared folders on the file servers by using permissions granted to the Authenticated Users group.<br>You migrate the file servers to adatum.com.<br>Contoso users report that after the migration, they are unable to access shared folders on the file servers.<br>You need to ensure that the Contoso users can access the shared folders on the file servers.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable selective authentication on the existing forest trust.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable SID filtering on the existing forest trust.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun netdom and specify the /quarantine attribute.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReplace the existing forest trust with an external trust."
    ],
    "answer": "B",
    "answerDescription": "Although it is not recommended, you can use this procedure to disable security identifier (SID) filter quarantining for an external trust with the Netdom.exe tool.<br>You should consider disabling SID filter quarantining only in the following situations:<br>* Users have been migrated to the trusted domain with their SID histories preserved, and you want to grant those users access to resources in the trusting domain<br>(the former domain of the migrated users) based on the sIDHistory attribute.<br>Etc.<br>Reference: Disabling SID filter quarantining<br>http://technet.microsoft.com/en-us/library/cc794713(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-27T05:45:00.000Z",
        "voteCount": 10,
        "content": "correct answer is A. SID filtering is for users, question says migrating servers."
      },
      {
        "date": "2020-08-19T21:46:00.000Z",
        "voteCount": 1,
        "content": "very true demetris."
      },
      {
        "date": "2020-10-31T04:27:00.000Z",
        "voteCount": 1,
        "content": "A it is."
      },
      {
        "date": "2020-02-13T22:43:00.000Z",
        "voteCount": 1,
        "content": "agree with @demetris"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7756-exam-70-412-topic-2-question-35-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a server named Server1 that runs a Server Core installation of<br>Windows Server 2012 R2.<br>You need to deploy a certification authority (CA) to Server1. The CA must support the auto-enrollment of certificates.<br>Which two cmdlets should you run? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd-CAAuthoritylnformationAccess",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall-AdcsCertificationAuthority",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd-WindowsFeature",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall-AdcsOnlineResponder",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall-AdcsWebEnrollment"
    ],
    "answer": "BE",
    "answerDescription": "Explanation -<br>B. The Install-AdcsCertificationAuthority cmdlet performs installation and configuration of the AD CS CA role service. It can be used to install a root CA.<br>Example:<br>Install-AdcsCertificationAuthority CAType StandaloneRootCA CACommonName \"ContosoRootCA\" KeyLength 2048 HashAlgorithm SHA1<br>CryptoProviderName \"RSA#Microsoft Software Key Storage Provider\"<br>E: The Install-AdcsWebEnrollment cmdlet performs initial installation and configuration of the Certification Authority Web Enrollment role service.<br>Note: Prior to the availability of Certificate Enrollment Web Services, AD CS required that client computers configured for certificate auto-enrollment be connected directly to the corporate network. Certificate Enrollment Web Services allows organizations to enable AD CS using a perimeter network. This allows users and computers outside the corporate network to enroll for certificates.<br><img src=\"/assets/media/exam-media/02140/0016600001.png\" class=\"in-exam-image\"><br>Certificate Enrollment web service<br>Reference: Deploying AD CS Using Windows PowerShell",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-31T04:32:00.000Z",
        "voteCount": 1,
        "content": "B and C it is"
      },
      {
        "date": "2019-11-06T10:43:00.000Z",
        "voteCount": 3,
        "content": "Answer should be :\n\n– Add-WindowsFeature (install adcs binaries)\n– Install-AdcsCertificationAuthority (install ADCS with the needed cert auto-enroll"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17468-exam-70-412-topic-2-question-38-discussion/",
    "body": "Your network contains an Active Directory forest. The forest contains one domain named adatum.com. The domain contains four domain controllers. The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0016800001.png\" class=\"in-exam-image\"><br>DC2 has all of the domain-wide operations master roles. DC3 has all of the forest-wide operation master roles.<br>You need to ensure that you can use Password Settings objects (PSOs) in the domain.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUninstall Active Directory from DC1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange the domain functional level.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransfer the domain-wide operations master roles.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransfer the forest-wide operations master roles."
    ],
    "answer": "A",
    "answerDescription": "In Windows Server 2008 and later, you can use fine-grained password policies to specify multiple password policies and apply different password restrictions and account lockout policies to different sets of users within a single domain.<br>Note: In Microsoft Windows 2000 and Windows Server 2003 Active Directory domains, you could apply only one password and account lockout policy, which is specified in the domain's Default Domain Policy, to all users in the domain. As a result, if you wanted different password and account lockout settings for different sets of users, you had to either create a password filter or deploy multiple domains. Both options were costly for different reasons.<br>Reference: AD DS Fine-Grained Password and Account Lockout Policy Step-by-Step Guide",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-03T06:50:00.000Z",
        "voteCount": 4,
        "content": "The question states \"What should you do first?\". First you uninstall Active Directory from DC1, then you change domain functional level. So provided answer is correct (A)."
      },
      {
        "date": "2020-03-24T21:53:00.000Z",
        "voteCount": 3,
        "content": "The answer should be B, because to use PSO's The domain functional level must be at least Windows Server 2008."
      },
      {
        "date": "2020-05-03T06:39:00.000Z",
        "voteCount": 2,
        "content": "Wrong/contradicting answer. Correct answer is A as PSO is a 2008 feature. \n\nYou need the domain function level at minimum 2008 thus you would 1st remove the 2003 Domain Controller running ADDS and then raise the domain function level to 2008."
      },
      {
        "date": "2020-06-13T19:53:00.000Z",
        "voteCount": 2,
        "content": "I stand corrected, that makes more sense, thanks Sweemz &amp; nikogovic. :)"
      },
      {
        "date": "2020-08-20T16:04:00.000Z",
        "voteCount": 1,
        "content": "wazmac is absolutely correct, please visit this link for confirmation https://www.tech-coffee.net/fine-grained-password-policy-active-directory/"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/10420-exam-70-412-topic-2-question-43-discussion/",
    "body": "HOTSPOT -<br>Your company has a main office and a branch office. An Active Directory site exists for each office.<br>The network contains an Active Directory forest named contoso.com. The contoso.com domain contains three member servers named Server1, Server2, and<br>Server3. All servers run Windows Server 2012 R2.<br>In the main office, you configure Server1 as a file server that uses BranchCache.<br>In the branch office, you configure Server2 and Server3 as BranchCache hosted cache servers.<br>You are creating a Group Policy for the branch office site.<br>Which two Group Policy settings should you configure?<br>To answer, select the appropriate two settings in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0017800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0017900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "To use Group Policy to configure clients for hosted cache mode<br>Step x: In the Turn on BranchCache dialog box, click Enabled, and then click OK.<br>Step x+1: In the Group Policy Management Editor console, ensure that BranchCache is still selected, and then in the details pane double-click Set BranchCache<br>Hosted Cache mode. The Set BranchCache Hosted Cache mode dialog box opens.<br>Reference: Use Group Policy to configure domain member clients for hosted cache mode http://technet.microsoft.com/en-us/library/ee649153(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-16T19:17:00.000Z",
        "voteCount": 5,
        "content": "Answer is wrong - \n“Set BranchCache Hosted Cache mode” has limitation of only one hosted cache server. Since we have 2 hosted cache servers in branch office, the answer is “Configure Hosted Cache Servers”\nWhat flowbro said is true also."
      },
      {
        "date": "2020-08-14T20:28:00.000Z",
        "voteCount": 1,
        "content": "Using SCP discovery requires Win 8/8.1 Enterprise or Win 10 Education/Enterprise per the link shared by a_iqbal, and given a Server 2012 environment and no specification of workstation OS, we can't assume the question is designed to exclude Win 7 clients. Therefore I have to agree with Wazmac, configure the servers.\nFirst paragraph or two of the below: \nhttps://docs.microsoft.com/en-us/windows-server/networking/core-network-guide/cncg/bc-hcm/10-bc-client-by-scp"
      },
      {
        "date": "2020-12-16T22:51:00.000Z",
        "voteCount": 1,
        "content": "So does \"configure hosted cache servers\". Flowbro is right. Bad question."
      },
      {
        "date": "2020-08-14T00:13:00.000Z",
        "voteCount": 1,
        "content": "Correct Answers:\n1. Turn on BranchCache\n2. Enable Automatic Hosted Cache Discovery by Service Connection Point\nReference: https://docs.microsoft.com/en-us/windows-server/networking/core-network-guide/cncg/bc-hcm/10-bc-client-by-scp"
      },
      {
        "date": "2020-08-02T10:01:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/windows-server/networking/core-network-guide/cncg/bc-hcm/5-bc-feature-scp"
      },
      {
        "date": "2019-12-15T21:43:00.000Z",
        "voteCount": 4,
        "content": "Bad question. Depends on the client versions being 7 or 8"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6005-exam-70-412-topic-2-question-46-discussion/",
    "body": "HOTSPOT -<br>You have a server that runs Windows Server 2012 R2 and has the iSCSI Target Server role service installed.<br>You run the New-IscsiVirtualDisk cmdlet as shown in the New-IscsiVirtualDisk exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0018300001.jpg\" class=\"in-exam-image\"><br>To answer, complete each statement according to the information presented in the exhibits. Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0018400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0018500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "* From the exhibit we see that the size is 10737418240 bytes. This is roughly 10 GB.<br>* From the exhibit we also see 'Status: Not connected'.<br>Note: Target: It is an object which allows the iSCSI initiator to make a connection. The Target keeps track of the initiators which are allowed to be connected to it.<br>The Target also keeps track of the iSCSI virtual disks which are associated with it. Once the initiator establishes the connection to the Target, all the iSCSI virtual disks associated with the Target will be accessible by the initiator.<br>Reference: Introduction of iSCSI Target in Windows Server 2012 http://blogs.technet.com/b/filecab/archive/2012/05/21/introduction-of-iscsi-target-in-windows-server-2012.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-02T21:09:00.000Z",
        "voteCount": 1,
        "content": "Its 4mb as its dynamic"
      },
      {
        "date": "2020-08-06T01:28:00.000Z",
        "voteCount": 2,
        "content": "Answer is 10GB, command creates a fixed VHDX with 10GB in size.\n\nNew-IscsiVirtualDisk:\nhttps://docs.microsoft.com/en-us/powershell/module/iscsitarget/new-iscsivirtualdisk?view=winserver2012r2-ps&amp;redirectedfrom=MSDN\n\n\nDisk Type = Dynamic Disk\n\nBasic and Dynamic Disks:\nhttps://docs.microsoft.com/en-us/windows/win32/fileio/basic-and-dynamic-disks"
      },
      {
        "date": "2020-02-13T23:24:00.000Z",
        "voteCount": 2,
        "content": "I go for 4 MB because the disk is dynamic."
      },
      {
        "date": "2019-10-02T16:50:00.000Z",
        "voteCount": 4,
        "content": "I think disk2.vhdx is using 4 MB of disk space on drive C because the DiskType property is dynamic."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/10421-exam-70-412-topic-2-question-50-discussion/",
    "body": "Your network contains an Active Directory domain named adatum.com. The domain contains two domain controllers that run Windows Server 2012 R2. The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0018800001.png\" class=\"in-exam-image\"><br>You log on to DC1 by using a user account that is a member of the Domain Admins group, and then you create a new user account named User1.<br>You need to prepopulate the password for User1 on DC2.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConnect to DC2 from Active Directory Users and Computers.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd DC2 to the Allowed RODC Password Replication Policy group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd the User1 account to the Allowed RODC Password Replication Policy group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun Active Directory Users and Computers as a member of the Enterprise Admins group."
    ],
    "answer": "D",
    "answerDescription": "To prepopulate the password cache for an RODC by using Active Directory Users and Computers (see step 1 below).<br>Administrative credentials: To prepopulate the password cache for an RODC, you must be a member of the Domain Admins group.<br>Click Start, click Administrative Tools, and then click Active Directory Users and Computers.<br><img src=\"/assets/media/exam-media/02140/0018800002.png\" class=\"in-exam-image\"><br>✑ Ensure that Active Directory Users and Computers points to the writable domain controller that is running Windows Server 2008, and then click Domain<br>Controllers.<br>✑  In the details pane, right-click the RODC computer account, and then click Properties.<br>✑  Click the Password Replication Policy tab.<br>✑  Click Advanced.<br>✑  Click Prepopulate Passwords.<br>✑  Type the name of the accounts whose passwords you want to prepopulate in the cache for the RODC, and then click OK.<br>✑  When you are asked if you want to send the passwords for the accounts to the RODC, click Yes.<br>Note: You can prepopulate the password cache for an RODC with the passwords of user and computer accounts that you plan to authenticate to it. When you prepopulate the RODC password cache, you trigger the RODC to replicate and cache the passwords for users and computers before the accounts try to log on in the branch office.<br>Incorrect:<br>Not C. You don't need to add User1 to the Allowed RODC Password Replication Policy group. As a first step you should run Active Directory Users and<br>Computers as a member of the Domain/Enterprise Admins group.-<br>Reference: Password Replication Policy Administration<br>http://technet.microsoft.com/en-us/library/cc753470(v=ws.10).aspx#BKMK_pre",
    "votes": [],
    "comments": [
      {
        "date": "2019-12-15T21:58:00.000Z",
        "voteCount": 5,
        "content": "Believe this should be C.  You are already a domain admin"
      },
      {
        "date": "2020-11-18T01:52:00.000Z",
        "voteCount": 3,
        "content": "Answer is c confirmed please check the link below.\nhttps://www.faqforge.com/windows-server-2016/prepopulate-passwords-cache-read-domain-controller-windows-server-2016/"
      },
      {
        "date": "2020-11-02T21:16:00.000Z",
        "voteCount": 2,
        "content": "C it is.."
      },
      {
        "date": "2020-07-04T20:06:00.000Z",
        "voteCount": 2,
        "content": "I have to agree with flowbro, you are already logged in as a Domain Admin, why would you log out and log back in with Enterprise Admin to do the same thing.\nI have checked other sites it's such a contentious question I hope it does not appear in my exam in a few weeks time.."
      },
      {
        "date": "2020-06-29T18:58:00.000Z",
        "voteCount": 1,
        "content": "The reason it's D is because you don't have to add the user account to the  Allowed RODC Password Replication Policy group, that gets done automatically as part of the prepopulation process. Neither A nor B are relevant' so D is the only thing left that is a possible first step that would work. That being given, the answer choice here is pretty lame, because a Domain Admin could do it also, and you're already logged in as a Domain Admin. Trickety."
      },
      {
        "date": "2020-02-13T23:38:00.000Z",
        "voteCount": 1,
        "content": "Dump question. we do not have to do anything with the EA account. You only need pre-populate RODC with the password.\nAllowed RODC Password Replication Group is Domain Local. Members in this group can have their passwords replicated to all read-only domain controllers in the domain"
      },
      {
        "date": "2020-01-31T18:45:00.000Z",
        "voteCount": 1,
        "content": "Is the account automatially added to the Allowed RODC Password Replication Policy group when you pre-poulated it to the RODC?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/13237-exam-70-412-topic-2-question-56-discussion/",
    "body": "DRAG DROP -<br>Your network contains two Active Directory forests named contoso.com and adatum.com. Each forest contains an Active Directory Rights Management Services<br>(AD RMS) root cluster. All servers run Windows Server 2012 R2.<br>You need to ensure that the rights account certificates issued in adatum.com are accepted by the AD RMS root cluster in contoso.com.<br>What should you do in each forest?<br>To answer, drag the appropriate actions to the correct forests. Each action may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0019500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "A trusted user domain, often referred as a TUD, is a trust between AD RMS clusters that instructs a licensing server to accept rights account certificates (the certificates identifying users) from another AD RMS server in a different Active Directory forest. An AD RMS trust is not the same as an Active Directory trust, but it is similar in that it refers to the ability of one environment to accept identities from another environment as valid subjects.<br>Illustration:<br><img src=\"/assets/media/exam-media/02140/0019600001.png\" class=\"in-exam-image\"><br>Reference: Trusted User Domain",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-31T19:18:00.000Z",
        "voteCount": 2,
        "content": "Actually, reading this ( https://books.google.com/books?id=G9Y5DwAAQBAJ&amp;pg=PA387&amp;lpg=PA387#v=onepage&amp;q&amp;f=false )[Ecerpt from MCSA Guide to Identity with Windows Server 2016, Exam 70-742] it sounds like Adatum wi=ould issue the SLC as part of the TUD, and Contoso would be adding the TUD so that it would be accessible to the server that needs access to the SLC. Some clarification in the answer would be greatly appreciated."
      },
      {
        "date": "2020-01-31T19:10:00.000Z",
        "voteCount": 3,
        "content": "The graphic does NOT show which action is done by which domain. Given the scenario and diagram below the *almost* answer, I'm gussing that Adatum issues the TUD &amp; Contoso isssues the SLC. It would be great if the answer image was updated to show the action assigned to the appropriate domain."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "2"
  }
]