[
  {
    "topic": 3,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17505-exam-70-412-topic-3-question-3-discussion/",
    "body": "You have a server named Server1 that runs Windows Server 2012 R2. From Server Manager, you install the Active Directory Certificate Services server role on<br>Server1.<br>A domain administrator named Admin1 logs on to Server1.<br>When Admin1 runs the Certification Authority console, Admin1 receive the following error message.<br><img src=\"/assets/media/exam-media/02140/0020000001.jpg\" class=\"in-exam-image\"><br>You need to ensure that when Admin1 opens the Certification Authority console on Server1, the error message does not appear.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Install-AdcsCertificationAuthority cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the Active Directory Certificate Services (AD CS) tools.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the PATH system variable.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd Admin1 to the Cert Publishers group."
    ],
    "answer": "B",
    "answerDescription": "* Cannot manage Active Directory Certificate Services<br>The error message is related to missing role configuration.<br>* Cannot Manage Active Directory Certificate Services<br>Resolution: configure the two Certification Authority and Certification Authority Web Enrollment Roles.<br>* Active Directory Certificate Services (AD CS) is an Active Directory tool that lets administrators customize services in order to issue and manage public key certificates.<br>AD CS included:<br>CA Web enrollment - connects users to a CA with a Web browser Certification authorities (CAs) - manages certificate validation and issues certificates Etc.<br>Incorrect:<br>Not A. The CA is installed, it just need to be configured correctly.<br>Note: Install-AdcsCertificationAuthority<br>The Install-AdcsCertificationAuthority cmdlet performs installation and configuration of the AD CS CA role service.<br>Reference: Cannot manage Active Directory Certificate Services in Server 2012 Error 0x800070002; Active Directory Certificate Services (AD CS) Definition http://searchwindowsserver.techtarget.com/definition/Active-Directory-Certificate-Services-AD-CS",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-02T21:31:00.000Z",
        "voteCount": 1,
        "content": "A it is"
      },
      {
        "date": "2020-08-21T22:09:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct as if you check this command in powershell you will get an error stating the ca is already installed, if you are trying to reinstall the role you must first uninstall it. so the answer is b missing configuration."
      },
      {
        "date": "2020-12-17T06:20:00.000Z",
        "voteCount": 1,
        "content": "Answer is A. That is powershell equivalent of the post-install configuration in server manager."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2048-exam-70-412-topic-3-question-4-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a file server named Server1. The File Server Resource Manager role service is installed on Server1. All servers run Windows Server 2012 R2.<br>A Group Policy object (GPO) named GPO1 is linked to the organizational unit (OU) that contains Server1. The following graphic shows the configured settings in<br>GPO1.<br><img src=\"/assets/media/exam-media/02140/0020100001.jpg\" class=\"in-exam-image\"><br>Server1 contains a folder named Folder1. Folder1 is shared as Share1.<br>You attempt to configure access-denied assistance on Server1, but the Enable access-denied assistance option cannot be selected from File Server Resource<br>Manager.<br>You need to ensure that you can configure access-denied assistance on Server1 manually by using File Server Resource Manager.<br>Which two actions should you perform?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Enable access-denied assistance on client for all file types policy setting to Disabled for GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Customize message for Access Denied errors policy setting to Not Configured for GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Enable access-denied assistance on client for all file types policy setting to Enabled for GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Customize message for Access Denied errors policy setting to Enabled for GPO1."
    ],
    "answer": "CD",
    "answerDescription": "C. To configure access-denied assistance for all file types by using Group Policy<br>✑ Open Group Policy Management. In Server Manager, click Tools, and then click Group Policy Management.<br>✑ Right-click the appropriate Group Policy, and then click Edit.<br>✑ Click Computer Configuration, click Policies, click Administrative Templates, click System, and then click Access-Denied Assistance.<br>✑ Right-click Enable access-denied assistance on client for all file types, and then click Edit.<br>✑ Click Enabled, and then click OK.<br>D. To configure access-denied assistance by using Group Policy (see step 5)<br>✑ Open Group Policy Management. In Server Manager, click Tools, and then click Group Policy Management.<br>✑ Right-click the appropriate Group Policy, and then click Edit.<br>✑ Click Computer Configuration, click Policies, click Administrative Templates, click System, and then click Access-Denied Assistance.<br>✑ Right-click Customize message for Access Denied errors, and then click Edit.<br>✑ Select the Enabled option.<br><br>Etc -<br>Reference: Deploy Access-Denied Assistance (Demonstration Steps) http://technet.microsoft.com/en-us/library/hh831402.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-27T23:57:00.000Z",
        "voteCount": 5,
        "content": "it's B and C."
      },
      {
        "date": "2020-11-03T02:37:00.000Z",
        "voteCount": 1,
        "content": "B and C it is"
      },
      {
        "date": "2020-07-11T17:44:00.000Z",
        "voteCount": 2,
        "content": "I think the point is the GPO is blocking it from being configured in FSRM..."
      },
      {
        "date": "2019-12-17T18:32:00.000Z",
        "voteCount": 2,
        "content": "B and C.  It says you need to manually configure the message via FSRM not do it via a GPO"
      },
      {
        "date": "2019-08-16T08:50:00.000Z",
        "voteCount": 1,
        "content": "I agree B and C will work..........but C and D would also work!"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27519-exam-70-412-topic-3-question-9-discussion/",
    "body": "HOTSPOT -<br>You have a server named Server1 that runs Windows Server 2012 R2. The volumes on Server1 are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0020800001.png\" class=\"in-exam-image\"><br>A new corporate policy states that backups must use Windows Azure Online Backup whenever possible.<br>You need to identify which backup methods you must use to back up Server1. The solution must use Windows Azure Online Backup whenever possible.<br>Which backup type should you identify for each volume?<br>To answer, select the appropriate backup type for each volume in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0020900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0021000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Windows Server Backup -<br>Volume1 is NTFS and on a fixed disk, but Bitlocker is used.<br>Windows Azure Online Backup cannot backup volume that has Bitlocker.<br>Box 2: Windows Azure Online Backup<br>Volume2 is NTFS, on a fixed disk, and Bitlocker is not used.<br>Windows Azure Online Backup can be used.<br><br>Box 3: Windows Server Backup -<br>Volume3 is not on a fixed disk. It is on a USB disk.<br>Additionally bitlocker is used.<br>Windows Azure Online Backup cannot be used.<br><br>Box 4: Windows Server Backup -<br>Volume3 is not on a fixed disk. It is on a USB disk.<br>Windows Azure Online Backup cannot be used.<br>Note: You can use Microsoft Azure Backup to back up content stored on fixed NTFS volumes. It cannot be used in the following situations:<br>Volume is locked by BitLocker Drive Encryption. If BitLocker is enabled on the volume, the volume must be unlocked before it can be backed up.<br>Drive type is not fixed.<br>Volume is not formatted with NTFS.<br>Volume is read-only.<br>Volume is not currently online.<br>Volume is on a network share.<br>Reference: Azure Backup Overview<br>https://msdn.microsoft.com/en-us/library/azure/hh831419.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-15T15:19:00.000Z",
        "voteCount": 6,
        "content": "https://docs.microsoft.com/en-us/azure/backup/backup-support-matrix-mars-agent#supported-file-types-for-backup"
      },
      {
        "date": "2020-08-06T09:12:00.000Z",
        "voteCount": 5,
        "content": "Volume 1 is Azure\nVolume 2 is Azure\nVolume 3 is Windows Server Backup\nVolume 4 is Windows Server Backup"
      },
      {
        "date": "2020-11-03T02:47:00.000Z",
        "voteCount": 1,
        "content": "JanvL i agree with you"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/13240-exam-70-412-topic-3-question-12-discussion/",
    "body": "DRAG DROP -<br>You have a file server named Server1 that runs Windows Server 2012 R2. The folders on Server1 are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0021300001.png\" class=\"in-exam-image\"><br>A new corporate policy states that backups must use Windows Azure Online Backup whenever possible.<br>You need to identify which technology you must use to back up Server1. The solution must use Windows Azure Online Backup whenever possible.<br>What should you identify?<br>To answer, drag the appropriate backup type to the correct location or locations. Each backup type may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0021400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "* NTFS encrypted<br><br>Azure Backup supported -<br>* NTFS compressed<br><br>Azure Backup supported -<br>* At this time you cannot backup entire Azure Virtual Machines or perform a system state backup of Azure Virtual Machines using Azure Backup.<br>Note: * NTFS encrypted + NTFS compressed<br><br>Azure Backup not supported -<br>Reference: Azure Backup Frequently Asked Questions (FAQ)<br>http://msdn.microsoft.com/en-us/library/azure/jj573031.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-31T20:34:00.000Z",
        "voteCount": 8,
        "content": "Both files encrypted with NTFS EFS &amp; NTFS compressed files ARE supported for Azure backup. System States, however, are NOT supported by Azure backup. Only the last option requires Windows Server Backup because it's a system state backup. https://docs.microsoft.com/en-us/azure/backup/backup-support-matrix-mars-agent#supported-file-types-for-backup"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/42102-exam-70-412-topic-3-question-16-discussion/",
    "body": "DRAG DROP -<br>Your network contains an Active Directory domain named contoso.com. The domain contains two DHCP servers named DHCP1 and DHCP2 that run Windows<br>Server 2012 R2.<br>You install the IP Address Management (IPAM) Server feature on a member server named Server1 and you run the Run Invoke-IpamGpoProvisioning cmdlet.<br>You need to manage the DHCP servers by using IPAM on Server1.<br>Which three actions should you perform?<br>To answer, move the three appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02140/0022000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0022100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "<img src=\"/assets/media/exam-media/02140/0022200001.jpg\" class=\"in-exam-image\"><br>Reference: Checklist: Deploy IPAM Server",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-11T20:03:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj878325(v=ws.11)"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14824-exam-70-412-topic-3-question-17-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named contoso.com. All servers run Windows Server 2012 R2.<br>The domain contains two domain controllers. The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0022300001.png\" class=\"in-exam-image\"><br>On DC1, you create an Active Directory-integrated zone named Zone1. You verify that Zone1 replicates to DC2.<br>You use DNSSEC to sign Zone1.<br>You discover that the updates to Zone1 fail to replicate to DC2.<br>You need to ensure that Zone1 replicates to DC2.<br>What should you configure on DC1?<br>To answer, select the appropriate tab in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0022400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0022600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "We most allow and configure zone transfers.<br>To modify zone transfer settings using the Windows interface<br>✑ Open DNS Manager.<br>✑ Right-click a DNS zone, and then click Properties.<br>✑ On the Zone Transfers tab, do one of the following:<br>- To disable zone transfers, clear the Allow zone transfers check box.<br>- To allow zone transfers, select the Allow zone transfers check box.<br>✑ If you allowed zone transfers, do one of the following:<br>- To allow zone transfers to any server, click To any server.<br>- To allow zone transfers only to the DNS servers that are listed on the Name Servers tab, click Only to servers listed on the Name Servers tab.<br>- To allow zone transfers only to specific DNS servers, click Only to the following servers, and then add the IP address of one or more DNS servers.<br>Reference: Modify Zone Transfer Settings",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-30T19:38:00.000Z",
        "voteCount": 1,
        "content": "Wazmac, thank you. Also for reference the original Microsoft Technet link is below. The zo ne transfers must be manually allowed because of how an RODC treats a DNSSEC-protected zone: http://www.briefmenow.org/microsoft/what-should-you-configure-on-dc1/"
      },
      {
        "date": "2020-07-03T18:57:00.000Z",
        "voteCount": 2,
        "content": "Thanks DanStafford. :)"
      },
      {
        "date": "2020-03-27T21:57:00.000Z",
        "voteCount": 2,
        "content": "Hi Dan, found an explanation on this link - http://www.briefmenow.org/microsoft/what-should-you-configure-on-dc1/"
      },
      {
        "date": "2020-02-24T19:01:00.000Z",
        "voteCount": 1,
        "content": "I'm a little confused by the answer. If the zone is Active Directory-integrated, doesn't zone change replication happen through AD replication? I thought zone transfers were not performed when replicating AD-integrated zones between DC's running DNS server?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104-exam-70-412-topic-3-question-20-discussion/",
    "body": "HOTSPOT -<br>Your network contains two application servers that run Windows Server 2012 R2. The application servers have the Network Load Balancing (NLB) feature installed.<br>You create an NLB cluster that contains the two servers.<br>You plan to deploy an application named App1 to the nodes in the cluster. App1 uses TCP port 8080 and TCP port 8081.<br>Clients will connect to App1 by using HTTP and HTTPS via a single reverse proxy. App1 does not use session state information.<br>You need to configure a port rule for Appl. The solution must ensure that connections to App1 are distributed evenly between the nodes.<br>Which port rule should you use?<br>To answer, select the appropriate rule in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0023500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0023700001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "*Only the TCP Protocol is needed<br>* Only a Single host is required.<br>Reference: Create a new Network Load Balancing Port Rule",
    "votes": [],
    "comments": [
      {
        "date": "2019-01-24T23:53:00.000Z",
        "voteCount": 15,
        "content": "When I search this question on the web, all other exam preparation websites have the same answer, but I believe it is wrong. The question is giving you this 2 restrictions: \"App1 does not use session state information\" and \"The solution must ensure that connections to App1 are distributed evenly between the nodes\"\n\nThis means that \"Single host\" cannot be an answer because it would not allow traffic to be distributed evenly across the nodes. The correct answer should be:\n\nFiltering mode: Multiple Hosts   (because we need load balancing)\nAffinity: None   (because the app does not use session state information)"
      },
      {
        "date": "2020-02-15T01:31:00.000Z",
        "voteCount": 3,
        "content": "Agree with Oliver, Multiple Hosts with Affinity None."
      },
      {
        "date": "2020-08-15T16:30:00.000Z",
        "voteCount": 2,
        "content": "I have seen several articles while researching this that compare load balancing to a reverse proxy, inluding some indications that the NLB *can act as the reverse proxy* - in which case the single host affinity rule kind of makes sense. The idea of a reverse proxy is that any clients hitting the web app see responses back from a single IP - so here it would be the IP of the single NLB host. If I see \"single reverse proxy\"\" on the test I'm going with Single Host affinity &amp; praying I got it right. This whole topic is about as obscure, back-end, buried in the mud as I have seen in all of Windows Server, and trying to find an solid answer is like looking for sunshine unicorns in Antartica."
      },
      {
        "date": "2020-08-15T16:12:00.000Z",
        "voteCount": 1,
        "content": "mrcombo any links to that? I have been searching for 30 minutes &amp; can't find anything speficic to Single Reverse Proxy &amp; NLB port rules in combination."
      },
      {
        "date": "2020-07-19T05:00:00.000Z",
        "voteCount": 1,
        "content": "Answer is Multiple host Affinity Single.\nThe question is confusing and there are 2 types of this question. How i remember is \nin Question \"Single Reverse Proxy mentioned\" then \"Multiple host Affinity Single\"\nIf not mentioned then \"Multiple host Affinity None\"\nI have research multiple site. This is the correct answer."
      },
      {
        "date": "2020-02-24T18:51:00.000Z",
        "voteCount": 1,
        "content": "Agree with Oliver. Single host will not share traffic evenly across nodes. Unless the answer is wrong in the Microsoft exam itself, this answer is misleading."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14405-exam-70-412-topic-3-question-21-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named contoso.com. The domain contains two member servers named Server1 and Server2. All servers run<br>Windows Server 2012 R2.<br>Server1 and Server2 have the Hyper-V server role installed. The servers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0023800001.png\" class=\"in-exam-image\"><br>You add a third server named Server3 to the network. Server3 has Intel processors.<br>You need to move VM3 and VM6 to Server3. The solution must minimize downtime on the virtual machines.<br>Which method should you use to move each virtual machine?<br>To answer, select the appropriate method for each virtual machine in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0023900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0024000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "VM3: export/import is the only option due to different processor manufacturers<br>VM6: Live migration can be used as both have Intel CPU's<br>Live Storage Migration requires same processor manufacturers<br>Live migration requires same processor manufacturers<br>Incorrect:<br><br>Quick migration has downtime -<br>Reference: Migrating Virtual Machines and Storage Overview<br>http://technet.microsoft.com/en-us/library/jj628158.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-12T00:46:00.000Z",
        "voteCount": 1,
        "content": "The answer must be VM3: export and import and VM6: export and import ... In the official book of 712 this is written: \"Neither live migration nor rapid migration is supported between hosts with processors from different manufacturers. \""
      },
      {
        "date": "2020-10-02T11:05:00.000Z",
        "voteCount": 2,
        "content": "Both server 2 and 3 have Intel processors. \n VM6 was generated on a host with an Intel processor so live migration should work."
      },
      {
        "date": "2020-02-24T19:26:00.000Z",
        "voteCount": 4,
        "content": "Live migration doesn't require clustering in SRV 2012 if the VM storage is on an SMB share: https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/hh831435(v=ws.11)?redirectedfrom=MSDN"
      },
      {
        "date": "2020-02-18T10:36:00.000Z",
        "voteCount": 1,
        "content": "I think vm6 needs to use storage migration as the servers are not clustered?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17626-exam-70-412-topic-3-question-27-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a file server named Server1 that runs Windows Server 2012 R2.<br>You create a user account named User1 in the domain.<br>You need to ensure that User1 can use Windows Server Backup to back up Server1. The solution must minimize the number of administrative rights assigned to<br>User1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd User1 to the Backup Operators group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd User1 to the Power Users group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign User1 the Backup files and directories user right and the Restore files and directories user right.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign User1 the Backup files and directories user right."
    ],
    "answer": "D",
    "answerDescription": "Backup Operators have these permissions by default:<br><img src=\"/assets/media/exam-media/02140/0025300001.png\" class=\"in-exam-image\"><br>However the question explicitly says we need to minimize administrative rights. Since the requirement is for backing up the data only--no requirement to restore or shutdown--then assigning the \"Back up files and directories user right\" would be the correct answer.<br><img src=\"/assets/media/exam-media/02140/0025400001.png\" class=\"in-exam-image\"><br><br>Reference: Default local groups -<br>http://technet.microsoft.com/en-us/library/cc787956(v=ws.10).aspx http://technet.microsoft.com/en-us/library/cc756898(v=ws.10).aspx http://technet.microsoft.com/en-us/library/cc771990.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-28T21:22:00.000Z",
        "voteCount": 3,
        "content": "Answer should be A = Add User1 to the Backup Operators group.\n\"You must be a member of the Administrators group or Backup Operators group to use Windows Server Backup.\"\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/cc732091(v=ws.11)?redirectedfrom=MSDN"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24551-exam-70-412-topic-3-question-29-discussion/",
    "body": "Your network contains an Active Directory domain named adatum.com. You create a new Group Policy object (GPO) named GPO1.<br>You need to verify that GPO1 was replicated to all of the domain controllers.<br>Which tool should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGpupdate",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGpresult",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGroup Policy Management",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Sites and Services"
    ],
    "answer": "C",
    "answerDescription": "In Windows Server 2012, the Group Policy Management Console (GPMC) was enhanced to provide a report for the overall health state of the Group Policy infrastructure for a domain, or to scope the health view to a single GPO.<br>Reference: Check Group Policy Infrastructure Status<br>http://technet.microsoft.com/en-us/library/jj134176.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-01T10:18:00.000Z",
        "voteCount": 6,
        "content": "The reason why it's Group Policy Management and not GPResult is because GPResult looks at the status on one machine at a time - the auditor would have to individually query every machine in the domain, which is highly inefficient &amp; error-prone.\n\nhttps://docs.microsoft.com/en-us/windows-server/administration/windows-commands/gpresult"
      },
      {
        "date": "2020-11-21T12:23:00.000Z",
        "voteCount": 2,
        "content": "Thanks DanStafford  for elaboration of answers."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/42298-exam-70-412-topic-3-question-41-discussion/",
    "body": "DRAG DROP -<br>You plan to deploy a failover cluster that will contain two nodes that run Windows Server 2012 R2.<br>You need to configure a witness disk for the failover cluster.<br>How should you configure the witness disk?<br>To answer, drag the appropriate configurations to the correct location or locations. Each configuration may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02140/0026900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0027000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Disk witness requirements include:<br>* Basic disk with a single volume<br>* Can be formatted with NTFS or ReFS<br>Reference: Configure and Manage the Quorum in a Windows Server 2012 Failover Cluster osoft.com/en-us/library/jj612870.aspx#BKMK_witness",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-13T19:21:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/windows-server/failover-clustering/manage-cluster-quorum"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14203-exam-70-412-topic-3-question-44-discussion/",
    "body": "DRAG DROP -<br>Your network contains an Active Directory domain named adatum.com. The domain contains three servers. The servers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0027600002.png\" class=\"in-exam-image\"><br>Server1 is configured as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0027700001.jpg\" class=\"in-exam-image\"><br>Template1 contains custom cryptography settings that are required by the corporate security team.<br>On Server2, an administrator successfully installs a certificate based on Template1.<br>The administrator reports that Template1 is not listed in the Certificate Enrollment wizard on Server3, even after selecting the Show all templates check box.<br>You need to ensure that you can install a server authentication certificate on Server3. The certificate must comply with the cryptography requirements.<br>Which three actions should you perform in sequence?<br>To answer, move the appropriate three actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02140/0027800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0027900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note:<br>Duplicate an existing template, modify the Compatibility Settings (to Windows Server 2008), and modify the Request Handling settings.",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-17T08:40:00.000Z",
        "voteCount": 1,
        "content": "Problem with that is you issue new template from Certificate Templates not Certificate Authority."
      },
      {
        "date": "2020-07-17T18:16:00.000Z",
        "voteCount": 3,
        "content": "Me too - Last box issue the new template."
      },
      {
        "date": "2020-07-01T11:26:00.000Z",
        "voteCount": 2,
        "content": "I thought the same thing as @antonskd"
      },
      {
        "date": "2020-02-15T08:31:00.000Z",
        "voteCount": 2,
        "content": "Not agree with the last block. We should issue a new template that we just copied."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14247-exam-70-412-topic-3-question-48-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named contoso.com. The domain contains a domain controller named DC1 and a member server named<br>Server1. All servers run Windows Server 2012 R2.<br>You install the IP Address Management (IPAM) Server feature on Server1.<br>From the Provision IPAM wizard, you select the Group Policy Based provisioning method and enter a GPO name prefix of IPAM1.<br>You need to provision IPAM by using Group Policy.<br>What command should you run on Server1 to complete the process?<br>To answer, select the appropriate options in the answer area.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0028300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "The Invoke-IpamGpoProvisioning cmdlet creates and links three group policies specified in the Domain parameter for provisioning required access settings on the server roles managed by the computer running the IP Address Management (IPAM) server.<br>Reference: Invoke-IpamGpoProvisioning",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-16T01:57:00.000Z",
        "voteCount": 8,
        "content": "Invoke-IpamGpoProvisioning -Domain Contoso.com"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24817-exam-70-412-topic-3-question-49-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two servers named Server1 and Server2. Both servers have the IP<br>Address Management (IPAM) Server feature installed.<br>You have a support technician named Tech1. Tech1 is a member of the IPAM Administrators group on Server1 and Server2.<br>You need to ensure that Tech1 can use Server Manager on Server1 to manage IPAM on Server2.<br>To which group on Server2 should you add Tech1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIPAM MSM Administrators",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIPAM Administrators",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\twinRMRemoteWMIUsers_",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemote Management Users"
    ],
    "answer": "C",
    "answerDescription": "If you are accessing the IPAM server remotely using Server Manager IPAM client RSAT, then you must be a member of the WinRMRemoteWMIUsers group on the IPAM server, in addition to being a member of the appropriate IPAM security group (or local Administrators group).<br>Reference: IPAM Deployment Planning, IPAM specifications",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-25T21:50:00.000Z",
        "voteCount": 1,
        "content": "as per this doc the provided answer is correct , https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/jj878312(v=ws.11)?redirectedfrom=MSDN"
      },
      {
        "date": "2020-12-17T08:54:00.000Z",
        "voteCount": 1,
        "content": "wazmac is correct."
      },
      {
        "date": "2020-07-05T19:54:00.000Z",
        "voteCount": 4,
        "content": "The answer is wrong it should be \"Remote Management Users\" as \"winRMRemoteWMIUsers_\" is used for remote access with PowerShell, see my comments on question 80 also see this link - \nhttps://www.briefmenow.org/microsoft/which-group-on-server2-should-you-add-tech1-13/"
      },
      {
        "date": "2020-07-17T11:28:00.000Z",
        "voteCount": 1,
        "content": "yes. Answer D.\nhttps://social.technet.microsoft.com/Forums/ie/en-US/de8c6dba-955f-4e1a-ae7a-7d85dde3e5b3/winrmremotewmiusers-vs-remote-management-users?forum=winservermanager"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2052-exam-70-412-topic-3-question-56-discussion/",
    "body": "You have a failover cluster named Cluster1 that contains four nodes. All of the nodes run Windows Server 2012 R2.<br>You need to force every node in Cluster1 to contact immediately the Windows Server Update Services (WSUS) server on your network for updates.<br>Which tool should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Add-CauClusterRole cmdlet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Wuauclt command",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Wusa command",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Invoke-CauScan cmdlet"
    ],
    "answer": "A",
    "answerDescription": "The Add-CauClusterRole cmdlet adds the Cluster-Aware Updating (CAU) clustered role that provides the self-updating functionality to the specified cluster. When the CAU clustered role has been added to a cluster, the failover cluster can update itself on the schedule that is specified by the user, without requiring an external computer to coordinate the cluster updating process.<br>Incorrect:<br>Not B. The wuauclt utility allows you some control over the functioning of the Windows Update Agent. It is updated as part of Windows Update.<br>The following are the command line for wuauclt.<br><br>Option Description -<br>/a /ResetAuthorization<br>Initiates an asynchronous background search for applicable updates. If Automatic Updates is disabled, this option has no effect.<br>/r /ReportNow<br>Sends all queued reporting events to the server asynchronously.<br>/? /h /help<br>Shows this help information.<br>Not D.<br>The Invoke-CauScan cmdlet performs a scan of cluster nodes for applicable updates and returns a list of the initial set of updates that would be applied to each node in a specified cluster.<br>Note: The Invoke-CauRun cmdlet performs a scan of cluster nodes for applicable updates and installs those updates via an Updating Run on the specified cluster.<br><br>Reference: Add-CauClusterRole -<br>http://technet.microsoft.com/en-us/library/hh847235(v=wps.620).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-04T03:55:00.000Z",
        "voteCount": 1,
        "content": "D it is.."
      },
      {
        "date": "2020-02-29T14:36:00.000Z",
        "voteCount": 4,
        "content": "A: http://www.briefmenow.org/microsoft/which-tool-should-you-use-1410/ ; I'm seeing (and have seen) multiple other sites stipulating \"A\" as the answer. I believe the pertinent portion of the question is \"for updates.\" I would take that to mean that the updates are intended to be installed. Also it can't be assumed that the role is already installed on the cluster, and you can specify the update schedule to start immediately in the command options. I don't believe the Invoke-cauScan cmdlet would run if the role were not installed. Also, even if the schedule wasn't set to run immediately but already existed, re-running option A would allow you to change the schedule to run the scan and update immediately, especially with the -Force argument. I'm going to have to go with option \"A\" here."
      },
      {
        "date": "2019-12-22T17:11:00.000Z",
        "voteCount": 1,
        "content": "You are right correct answer is  d on other web sites"
      },
      {
        "date": "2019-06-28T06:15:00.000Z",
        "voteCount": 2,
        "content": "correct answer is D, does not mention install updates. just to contact WSUS server."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/26067-exam-70-412-topic-3-question-64-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory forest.<br>You implement Dynamic Access Control in the forest.<br>You have the claim types shown in the Claim Types exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0030000001.jpg\" class=\"in-exam-image\"><br>The properties of a user named User1 are configured as shown in the User1 exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0030100001.jpg\" class=\"in-exam-image\"><br>The output of Whoami /claims for a user named User2 is shown in the Whoami exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0030200001.jpg\" class=\"in-exam-image\"><br>Select Yes if the statement can be shown to be true based on the available information; otherwise select No. Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0030300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0030400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-08T19:47:00.000Z",
        "voteCount": 6,
        "content": "CAREFUL: There are TWO Users, User 1 &amp; User 2. Once you pay close attention to that, the answer makes sense."
      },
      {
        "date": "2021-01-13T21:05:00.000Z",
        "voteCount": 1,
        "content": "you really saved the day"
      },
      {
        "date": "2020-07-18T15:01:00.000Z",
        "voteCount": 5,
        "content": "This question has me confused. The user's department attribute is clearly set to \"Finance\" and the \"whoami\" output shows no claims."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/26673-exam-70-412-topic-3-question-67-discussion/",
    "body": "DRAG DROP -<br>Your network contains an Active Directory domain named contoso.com. The domain contains four member servers named Server1, Server2, Server3, and<br>Server4. Server1 and Server2 run Windows Server 2008 R2.<br>Server1 and Server2 have the Hyper-V server role and the Failover Clustering feature installed. Failover<br>Clustering is configured to provide highly available virtual machines by using a cluster named Cluster1.<br>Cluster1 hosts 10 virtual machines.<br>Server3 and Server4 run Windows Server 2012 R2.<br>You install the Hyper-V server role and the Failover Clustering feature on Server3 and Server4. You create a cluster named Cluster2.<br>You need to migrate cluster resources from Cluster1 to Cluster2. The solution must minimize downtime on the virtual machines.<br>Which five actions should you perform?<br>To answer, move the appropriate five actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02140/0031100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0031200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "1. Move Highly Available (Clustered) VMs to Windows Server 2012 with the Cluster Migration Wizard<br>On the Windows Server 2012 cluster  the target cluster - from the Failover Cluster Manger, select a cluster and then use the  More Actions | Migrate Roles menu to launch the Cluster Migration Wizard:<br><img src=\"/assets/media/exam-media/02140/0031300001.jpg\" class=\"in-exam-image\"><br>2. Shutdown all VMs on the source Windows Server 2008 R2 cluster that have been migrated.<br>3. Unmask the common shared storage (LUNs) so that they are not presented to the Windows Server 2008 R2source cluster<br>4. Mask the common<br>shared storage (LUNs) to the Windows Server 2012 target cluster.<br>5. Start all VMs on the target Windows Server 2012 cluster.<br>Reference: Best practices for migration of cluster windows 2008 R2 / 2012 http://blogs.technet.com/b/hugofe/archive/2012/12/06/best-practices-for-migration-of-cluster-windows-2008-r2-2012-as-melhores-praticas-para-migrar-um-cluster- de-windows-2008-para-windows-2012.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-26T14:03:00.000Z",
        "voteCount": 1,
        "content": "these drag and drop and hot spot questions are not to be missed please, exam is full of these questions, it came in my first attempt of this exam."
      },
      {
        "date": "2020-08-04T00:37:00.000Z",
        "voteCount": 2,
        "content": "From @Bob on https://www.briefmenow.org/microsoft/which-five-actions-should-you-perform-15/:\n\nThe given answer is correct (First Mask and after that unmask)...\n\nIf you look at the link provided: https://docs.microsoft.com/en-us/archive/blogs/hugofe/best-practices-for-migration-of-cluster-windows-2008-r2-2012-as-melhores-praticas-para-migrar-um-cluster-de-windows-2008-para-windows-2012, the steps they provide are wrong.\nIf the section “Migration for Highly Available (Clustered) Hyper-V VMs” They say to mask and then unmask the storage in the sense that mask means hide the storage and unmask means unhide the storage. In the section “Walk Through: Migrating a HA VM from Windows Server 2008 R2 to Windows Server 2012” towards the bottom, it uses unmask first and mask second. I think this is a typo because here they are using it in the sense that unmask means to hide the storage and mask means to unhide the storage.\n\nI believe the given answer is correct because mask means to hide and unmask means to unhide, or present."
      },
      {
        "date": "2020-07-26T06:34:00.000Z",
        "voteCount": 1,
        "content": "Sorry... sorry..., it must be: 3- Unmask the shared storage and 4- Mask te shared storage.\nI believe the given answer is correct because unmask means to unhide, or present and mask means to hide.\n\nhttps://docs.microsoft.com/en-us/archive/blogs/hugofe/best-practices-for-migration-of-cluster-windows-2008-r2-2012-as-melhores-praticas-para-migrar-um-cluster-de-windows-2008-para-windows-2012"
      },
      {
        "date": "2020-07-25T23:39:00.000Z",
        "voteCount": 1,
        "content": "- From failover cluster manager in cluster2, run the migrate a cluster wizard\n\n- Shut down all of the vm’s in cluster1\n\n- Mask the shared storage to prevent the storage from being accessed by cluster1\n\n- Unmask the shared storage to present the storage to cluster2\n\n- Start the vm's in cluster2"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15043-exam-70-412-topic-3-question-73-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named adatum.com. All servers run Windows Server 2012 R2. All domain controllers have the DNS Server server role installed.<br>You have a domain controller named DC1.<br>On DC1, you create an Active Directory-integrated zone named adatum.com and you sign the zone by using DNSSEC.<br>You deploy a new read-only domain controller (RODC) named RODC1.<br>You need to ensure that the contoso.com zone replicates to RODC1.<br>What should you configure on DC1?<br>To answer, select the appropriate tab in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0033200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0033300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "For additional servers to host a zone, zone transfers are required to replicate and synchronize all copies of the zone used at each server configured to host the zone.<br><img src=\"/assets/media/exam-media/02140/0033400001.jpg\" class=\"in-exam-image\"><br>Reference: Understanding zones and zone transfer<br>http://technet.microsoft.com/en-us/library/cc781340(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-01T13:39:00.000Z",
        "voteCount": 2,
        "content": "** As found out in a previous similar question, even if a zone is AD-integrated, if you sign it with DNSSEC, RODC's will load it as a standard secondary zone, and zone transfers must be configured for replication to take place. The key here is the zone was signed with DNSSEC **\n\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/dn593674(v=ws.11)"
      },
      {
        "date": "2020-02-29T15:43:00.000Z",
        "voteCount": 3,
        "content": "TRICKY! \"On DC1, you create an Active Directory-integrated zone named adatum.com and you sign the zone by using DNSSEC.\nYou deploy a new read-only domain controller (RODC) named RODC1.\nYou need to ensure that the *** contoso.com *** zone replicates to RODC1.\"\n\nThe Adatum.com zone is the AD-Integrated zone. I'm assuming here that *** Contoso.com *** is NOT an AD-Integrated zone, but rather a standard Primary zone, which would necessitate zone transfer options to be configured. Close-reading is a must!!"
      },
      {
        "date": "2020-02-29T15:38:00.000Z",
        "voteCount": 1,
        "content": "https://serverfault.com/questions/90350/read-only-domain-controllers-and-dns-zone-updates"
      },
      {
        "date": "2020-02-29T15:33:00.000Z",
        "voteCount": 1,
        "content": "https://social.technet.microsoft.com/wiki/contents/articles/4031.how-read-only-domain-controllers-and-dns-works.aspx"
      },
      {
        "date": "2020-02-29T15:26:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/active-directory-integrated-dns-zones"
      },
      {
        "date": "2020-02-29T15:25:00.000Z",
        "voteCount": 1,
        "content": "https://activedirectorypro.com/windows-dns-zones-explained/"
      },
      {
        "date": "2020-02-29T15:24:00.000Z",
        "voteCount": 1,
        "content": "The problem that I have with this question is that the zone clearly shows as an Active Directory-Integrated zone. With AD-Integrated zones, the zone and its updates are replicated through Active Directory replication, not through zone transfers. If the zone were a standard Primary zone, and the RODC were a standard Secondary zone, I would agree absolutely with the Zone Transfers tab options needing to be configured, but this zone is shown as AD-Integrated. Either the graphics are wrong for the question, or the question is invalid because of the AD-Integrated zone."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17842-exam-70-412-topic-3-question-80-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named contoso.com. The domain contains two servers named Server1 and Server2. Both servers have the IP<br>Address Management (IPAM) Server feature installed.<br>You have a support technician named Tech1. Tech1 is a member of the IPAM Administrators group on Server1 and Server2. You need to ensure that Tech1 can use Server Manager on Server1 to manage IPAM on Server2. To which group on Server2 should you add Tech1? To answer, select the appropriate group in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0035900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0036100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "If you are accessing the IPAM server remotely using Server Manager IPAM client RSAT, then you must be a member of the WinRMRemoteWMIUsers group on the IPAM server, in addition to being a member of the appropriate IPAM security group (or local Administrators group).<br>Reference: Understand and Troubleshoot IP Address Management (IPAM) in Windows Server \"8\" Beta.",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-05T19:27:00.000Z",
        "voteCount": 6,
        "content": "This article indicates that the answer has to be “Remote Management Users”:\nhttps://technet.microsoft.com/enus/library/dn579255.aspx#BKMK_WinRMRemoteWMIUsers_\nQuote from article above:\n“The WinRMRemoteWMIUsers_ group allows running Windows PowerShell commands remotely whereas the Remote Management Users group is generally used to allow users to manage servers by using the Server Manager console.”\n\nQuestion states:\n“You need to ensure that Tech1 can use Server Manager on SERVER1 to manage IPAM on SERVER2.”"
      },
      {
        "date": "2020-07-05T19:51:00.000Z",
        "voteCount": 5,
        "content": "Also this question is the same as Volume C Question 49 which would also be wrong.\nCheck out the last comment on this link - https://www.briefmenow.org/microsoft/which-group-on-server2-should-you-add-tech1-13/\nI watched the CBT Nuggets video again as stated in the above link and James Conrad clearly states that the winRMRemoteWMIUsers_ is for use with PowerShell."
      },
      {
        "date": "2021-01-09T14:13:00.000Z",
        "voteCount": 3,
        "content": "I think someone should make the final decision on the RIGHT ANSWERS - This will help the New Technicians who need to practice and Pass the Exams.  The discussion is ok for the experienced engineers."
      },
      {
        "date": "2020-07-01T14:16:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/windows/win32/winrm/authentication-for-remote-connections"
      },
      {
        "date": "2020-07-01T14:13:00.000Z",
        "voteCount": 1,
        "content": "WinRMremoteWMIusers"
      },
      {
        "date": "2020-04-03T20:49:00.000Z",
        "voteCount": 2,
        "content": "I think the answer is wrong as the qeustion has already mentioned that “Tech1 is a member of the IPAM Administrators group on \"SERVER1 and SERVER2” so all we need in this case is to ensure that Tech1 can use Server Manager on SERVER1 to manage SERVER2. the answer has to be “Remote Management Users”, what do you guys think?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2053-exam-70-412-topic-3-question-81-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two member servers named Server1 and Server2 that run Windows<br>Server 2012 R2. Both servers have the Hyper-V server role installed.<br>The network contains an enterprise certification authority (CA). All servers are enrolled automatically for a certificate-based on the Computer certificate template.<br>On Server1, you have a virtual machine named VM1. VM1 is replicated to Server2.<br>You need to encrypt the replication of VM1.<br>Which two actions should you perform? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, modify the Hyper-V Settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, modify the settings of VM1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, modify the Hyper-V Settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, modify the settings of VM1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, modify the settings of the virtual switch to which VM1 is connected.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, modify the settings of the virtual switch to which VM1 is connected."
    ],
    "answer": "BC",
    "answerDescription": "B. Each virtual machine that is to be replicated must be enabled for replication (on the replica server  Server2).<br>C. To configure the Replica server (here Server2)<br>✑ In Hyper-V Manager, click Hyper-V Settings in the Actions pane.<br>In the Hyper-V Settings dialog, click Replication Configuration.<br><img src=\"/assets/media/exam-media/02140/0036200002.png\" class=\"in-exam-image\"><br>✑ In the Details pane, select Enable this computer as a Replica server.<br>✑ In the Authentication and ports section, select the authentication method. For either authentication method, specify the port to be used (the default ports are<br>80 for Kerberos over HTTP and 443 for certificate-based authentication over HTTPS).<br>✑ If you are using certificate-based authentication, click Select Certificate and provide the request certificate information.<br><br>Etc -<br>Reference: Deploy Hyper-V Replica Step 2: Enable Replication",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-28T05:11:00.000Z",
        "voteCount": 1,
        "content": "I think B &amp; D\nThe question shows replication is already enabled and certificates already issued. So all you need to do now is change HTTP to HTTPS and choose the required certificate for the VM on both hosts"
      },
      {
        "date": "2020-11-26T11:07:00.000Z",
        "voteCount": 1,
        "content": "Any explanation why c and d?"
      },
      {
        "date": "2021-01-15T10:12:00.000Z",
        "voteCount": 1,
        "content": "\"On Server 1, you need to enable VM1 for replication. This is done by clicking on VM1, and going to Enable Replication. Here you can choose with replica server you want to replicate to.\"\n- https://www.briefmenow.org/microsoft/which-two-actions-should-you-perform-1081/"
      },
      {
        "date": "2021-01-24T16:40:00.000Z",
        "voteCount": 1,
        "content": "Also from the same link - \n\"Server 2 needs to be enabled for replication. This is done in the Hyper-V settings. When you tick “Enable this computer as a Replica server”, you expose the options to use Kerberos (HTTP) or Certificate Based (HTTPS) authentication. HTTPS (SSL) is encrypted.\""
      },
      {
        "date": "2020-11-10T21:10:00.000Z",
        "voteCount": 1,
        "content": "Yes C &amp; D"
      },
      {
        "date": "2019-06-28T09:38:00.000Z",
        "voteCount": 4,
        "content": "correct answer is C and D."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/26129-exam-70-412-topic-3-question-84-discussion/",
    "body": "HOTSPOT -<br>Your network contains three application servers that run Windows Server 2012 R2. The application servers have the Network Load Balancing (NLB) feature installed.<br>You create an NLB cluster that contains the three servers.<br>You plan to deploy an application named App1 to the nodes in the cluster. App1 uses TCP port 8080 and TCP port 8081.<br>Clients will connect to App1 by using HTTP and HTTPS. When clients connect to App1 by using HTTPS, session state information will be retained locally by the cluster node that responds to the client request.<br>You need to configure a port rule for Appl.<br>Which port rule should you use?<br>To answer, select the appropriate rule in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0036700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0036900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "* Filtering Mode: Multiple hosts<br>The Multiple hosts parameter specifies that multiple hosts in the cluster will handle network traffic for the associated port rule. This filtering mode provides scaled performance and fault tolerance by distributing the network load among multiple hosts. You can specify that the load be equally distributed among the hosts or that each host will handle a specified load weight.<br>* Affinity<br>Select Affinity Single or Network to ensure that all network traffic from a particular client is directed to the same host.",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-19T04:48:00.000Z",
        "voteCount": 1,
        "content": "Incorrect Answer. Answer should be Multiple host and affinity none"
      },
      {
        "date": "2020-09-07T04:02:00.000Z",
        "voteCount": 4,
        "content": "The given answer is correct. For loadbalancing we need Multiple host.\nThe question states that \"session state information will be retained locally by the cluster node that responds to the client request\". This means we need Affinity Single, otherwise the session state will not be retained correctly."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24946-exam-70-412-topic-3-question-86-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a server named Server1 that runs Windows Server 2012 R2.<br>Server1 has an enterprise root certification authority (CA) for contoso.com.<br>You deploy another member server named Server2 that runs Windows Server 2012 R2 and has the Web Server (IIS) server role installed.<br>You need to designate a website on Server1 as the certificate revocation list (CRL) distribution point for the CA. The solution must ensure that CRLs are published automatically to Server2.<br>Which two actions should you perform? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an http:// CRL distribution point (CDP) entry.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a CA exit module.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a file:// CRL distribution point (CDP) entry.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a CA policy module.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure an enrollment agent."
    ],
    "answer": "AD",
    "answerDescription": "A. To specify CRL distribution points in issued certificates<br>✑ Open the Certification Authority snap-in.<br>✑ In the console tree, click the name of the CA.<br>✑ On the Action menu, click Properties , and then click the Extensions tab. Confirm that Select extension is set to CRL Distribution Point (CDP).<br>✑ Do one or more of the following. (The list of CRL distribution points is in the Specify locations from which users can obtain a certificate revocation list<br>(CRL) box.)<br>/ To indicate that you want to use a URL as a CRL distribution point Click the CRL distribution point, select the Include in the CDP extension of issued certificates check box, and then click OK .<br>✑ Click Yes to stop and restart Active Directory Certificate Services (AD CS).<br>D. You can specify CRL Distribution Points (CDPs) in CAPolicy.inf. Note that any CDP in CAPolicy.inf will take precedence for certificate verifiers over the CDP's specified in the CA policy module.<br>Note:<br><br>CRLDistributionPoint -<br>You can specify CRL Distribution Points (CDPs) for a root CA certificate in the CAPolicy.inf. This section does not configure the CDP for the CA itself. After the CA has been installed you can configure the CDP URLs that the CA will include in each certificate that it issues. The URLs specified in this section of the CAPolicy.inf file are included in the root CA certificate itself.<br>Example:<br>[CRLDistributionPoint]<br>URL=http://pki.wingtiptoys.com/cdp/WingtipToysRootCA.crl",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-04T21:16:00.000Z",
        "voteCount": 1,
        "content": "I agree with DanStafford"
      },
      {
        "date": "2020-07-18T17:18:00.000Z",
        "voteCount": 4,
        "content": "Actually given answers are correct according to that link, Wazmac... (https://www.briefmenow.org/microsoft/which-two-actions-should-you-perform-815/)"
      },
      {
        "date": "2020-07-06T14:31:00.000Z",
        "voteCount": 2,
        "content": "Answer should be A &amp; C.\nhttps://www.briefmenow.org/microsoft/which-two-actions-should-you-perform-815/"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2059-exam-70-412-topic-3-question-87-discussion/",
    "body": "Your company has a main office and a remote office. The remote office is used for disaster recovery. The network contains an Active Directory domain named contoso.com. The domain contains member servers named Server1, Server2, Server3, and Server4. All servers run Windows Server 2012 R2.<br>Server1 and Server2 are located in the main office. Server3 and Server4 are located in the remote office.<br>All servers have the Failover Clustering feature installed. The servers are configured as nodes in a failover cluster named Cluster1. Storage is replicated between the main office and the remote site.<br>You need to ensure that Cluster1 is available if two nodes in the same office fail. What are two possible quorum configurations that achieve the goal? (Each correct answer presents a complete solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo Majority: Disk Only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNode Majority",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNode and File Share Majority",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNode and Disk Majority"
    ],
    "answer": "AB",
    "answerDescription": "Depending on the quorum configuration option that you choose and your specific settings, the cluster will be configured in one of the following quorum modes:<br>* (A) No majority (disk witness only)<br>* (B) Node majority (no witness)<br>* Node majority with witness (disk or file share)<br>Reference: Configure and Manage the Quorum in a Windows Server 2012 R2 Failover Cluster",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-29T00:38:00.000Z",
        "voteCount": 7,
        "content": "i think answer here is C and D"
      },
      {
        "date": "2020-02-29T16:31:00.000Z",
        "voteCount": 2,
        "content": "Totally agree, C &amp; D: https://docs.microsoft.com/en-us/windows-server/failover-clustering/manage-cluster-quorum"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14216-exam-70-412-topic-3-question-89-discussion/",
    "body": "You have a cluster named Cluster1 that contains two nodes. Both nodes run Windows Server 2012 R2. Cluster1 hosts a virtual machine named VM1 that runs<br>Windows Server 2012 R2.<br>You configure a custom service on VM1 named Service1.<br>You need to ensure that VM1 will be moved to a different node if Service1 fails.<br>Which cmdlet should you run on Cluster1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd-ClusterVmMonitoredItem",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ClusterResourceDependency",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable- VmResourceMetering",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd-ClusterGenericServiceRole"
    ],
    "answer": "A",
    "answerDescription": "* The Add-ClusterVMMonitoredItem cmdlet configures monitoring for a service or an Event Tracing for Windows (ETW) event so that it is monitored on a virtual machine. If the service fails or the event occurs, then the system responds by taking an action based on the failover configuration for the virtual machine resource.<br>For example, the configuration might specify that the virtual machine be restarted or failover.<br>* The decision on whether to failover or restart on the same node is configurable and determined by the failover properties for the virtual machine.<br>Reference: Add-ClusterVMMonitoredItem",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-03T21:58:00.000Z",
        "voteCount": 1,
        "content": "I believe the given answer is correct I had the same question in my 70-411 exam."
      },
      {
        "date": "2020-02-15T10:38:00.000Z",
        "voteCount": 1,
        "content": "I vote for Add-ClusterGenericServiceRole :\nThe Add-ClusterGenericServiceRole cmdlet configures high availability for a service that was not originally designed to run in a failover cluster. The cluster software will start the service, then periodically query the Service Controller, which is a feature of the operating system, to determine whether the service appears to be running. If so, then it is presumed to be online, and will not be restarted or failed over.\nhttps://docs.microsoft.com/en-us/powershell/module/failoverclusters/add-clustergenericservicerole?view=win10-ps"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17845-exam-70-412-topic-3-question-90-discussion/",
    "body": "You have a server named Server1 that runs Windows Server 2012 R2. Server1 has the File Server Resource Manager role service installed.<br>You are creating a file management task as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0037600001.jpg\" class=\"in-exam-image\"><br>You need to ensure that the Include all folders that store the following kinds of data list displays an entry named Corporate Data.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new file group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new classification property.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the properties of the System Files file group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Folder Usage classification property."
    ],
    "answer": "B",
    "answerDescription": "Classification properties are used to assign values to files.<br>Reference: Working with File Classification",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-04T21:21:00.000Z",
        "voteCount": 1,
        "content": "B is correct"
      },
      {
        "date": "2020-10-14T03:48:00.000Z",
        "voteCount": 1,
        "content": "I vote for \"D\" \n\nThe Folder Usage property is used when running classification and file management tasks. Folders can be classified as Application Files, Backup &amp; Archival Files, Group Files, and User Files. This allows you to run different classification rules against different types of files which enables you eliminate areas like archives or software shares from your file classification schedules since those files, most likely, don't need to be scanned.\n\nhttps://4sysops.com/archives/file-server-resource-manager-fsrm-part-6-classification-management/\nhttps://4sysops.com/wp-content/uploads/2013/04/Folder-Usage-property.png"
      },
      {
        "date": "2020-04-03T22:41:00.000Z",
        "voteCount": 4,
        "content": "Answer should be - D. Modify the Folder Usage classification property. Try it yourself in FSRM."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15045-exam-70-412-topic-3-question-92-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two member servers named Server1 and Server2. All servers run<br>Windows Server 2012 R2.<br>Server1 and Server2 have the Failover Clustering feature installed. The servers are configured as nodes in a failover cluster named Cluster1. Cluster1 has access to four physical disks. The disks are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0037800001.png\" class=\"in-exam-image\"><br>You need to ensure that all of the disks can be added to a Cluster Shared Volume (CSV). Which two actions should you perform? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFormat Disk2 to use NTFS.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFormat Disk3 to use NTFS.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable BitLocker on Disk4.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable BitLocker on Disk1."
    ],
    "answer": "AD",
    "answerDescription": "A. In Windows Server 2012 R2, a disk or storage space for a CSV volume must be a basic disk that is partitioned with NTFS or ReFS, but you cannot use a disk for a CSV that is formatted with FAT or FAT32.<br>D. CSV supports bitlocker, but you would have to enable it on all nodes in the cluster. Therefore we need to disable bitlocker on Disk1.<br>Incorrect:<br>Not B. ReFS would work fine. In Windows Server 2012 R2, a disk or storage space for a CSV volume must be a basic disk that is partitioned with NTFS or ReFS.<br>Not C. Bitlocker must be enabled on all disks for it to work for a CSV.<br>Reference: Use Cluster Shared Volumes in a Failover Cluster<br>https://technet.microsoft.com/en-us/library/jj612868.aspx<br>Reference: How to Configure BitLocker Encrypted Clustered Disks in Windows Server 2012 http://blogs.msdn.com/b/clustering/archive/2012/07/20/10332169.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-03T22:50:00.000Z",
        "voteCount": 2,
        "content": "Nice one Dan, thanks. :)"
      },
      {
        "date": "2020-02-29T16:42:00.000Z",
        "voteCount": 4,
        "content": "BE AWARE: If the question had stipulated Server 2012 and NOT Server 2012 R2, ReFS would not be supported on the Cluster Shared Volume. ReFS is ONLY supported for the CSV on Server 2012 R2 or higher. It's right in the previously-referenced doc. ( https://technet.microsoft.com/en-us/library/jj612868.aspx )"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/26688-exam-70-412-topic-3-question-93-discussion/",
    "body": "You configure the nodes to use the port rule shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0037900001.jpg\" class=\"in-exam-image\"><br>You need to configure the NLB cluster to meet the following requirements:<br>HTTPS connections must be directed to Server1 if Serverl is available.<br><img src=\"/assets/media/exam-media/02140/0037900002.png\" class=\"in-exam-image\"><br>✑ HTTP connections must be load balanced between the two nodes.<br>Which three actions should you perform? {Each correct answer presents part of the solution. Choose three.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the host properties of Server2, set the Handling priority of the existing port rule to 2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a port rule for TCP port 80. Set the Filtering mode to Multiple host and set the Affinity to None.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an additional port rule for TCP port 443. Set the Filtering mode to Multiple host and set the Affinity to Single.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the host properties of Server1, set the Handling priority of the existing port rule to 2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the host properties of Server2, set the Priority (Unique host ID) value to 1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the host properties of Server1, set the Handling priority of the existing port rule to 1."
    ],
    "answer": "ABF",
    "answerDescription": "Multiple hosts. This parameter specifies that multiple hosts in the cluster handle network traffic for the associated port rule. This filtering mode provides scaled performance in addition to fault tolerance by distributing the network load among multiple hosts. You can specify that the load be equally distributed among the hosts or that each host handle a specified load weight.<br>Note: Handling priority: When Single host filtering mode is being used, this parameter specifies the local host's priority for handling the networking traffic for the associated port rule. The host with the highest handling priority (lowest numerical value) for this rule among the current members of the cluster will handle all of the traffic for this rule. The allowed values range from 1, the highest priority, to the maximum number of hosts allowed (32). This value must be unique for all hosts in the cluster.<br>Reference: Network Load Balancing parameters.",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-11T01:54:00.000Z",
        "voteCount": 1,
        "content": "Yes, answer is correct"
      },
      {
        "date": "2020-11-04T21:30:00.000Z",
        "voteCount": 3,
        "content": "ABF is correct"
      },
      {
        "date": "2020-07-26T05:58:00.000Z",
        "voteCount": 1,
        "content": "Question is: Your network contains two Web servers named Server1 and Server2. Server1 and Server2 are nodes in a Network Load Balancing (NLB) cluster."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14241-exam-70-412-topic-3-question-94-discussion/",
    "body": "A user named User1 is a member of the local Administrators group on Node1 and Node2.<br>User1 creates a new clustered File Server role named File1 by using the File Server for general use option.<br>A report is generated during the creation of File1 as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0038100001.jpg\" class=\"in-exam-image\"><br>File1 fails to start.<br>You need to ensure that you can start File1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLog on to the domain by using the built-in Administrator for the domain, and then recreate the clustered File Server role by using the File Server for general use option.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign the user account permissions of User1 to the Servers OU.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign the computer account permissions of Cluster2 to the Servers OU.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIncrease the value of the ms-DS-MachineAccountQuota attribute of the domain.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecreate the clustered File Server role by using the File Server for scale-out application data option."
    ],
    "answer": "B",
    "answerDescription": "Scenario: You have created a Windows Server 2012 Scale-Out File Server. The cluster, including the network and storage, pass the cluster validation test.<br>Everything looks and is good. You create a File Server role for application data (SOFS) but it fails to start.<br>Problem: Basically, the cluster needs permissions to create a computer object (for the SOFS) in the same Active Directory OU that the cluster object (Demo-<br>FSC1) is stored in.<br>Resolution: Reconfigure the permissions on the Servers OU.<br>In this case we assign the user account permissions of User1 to the Servers OU.<br>Reference: Scale-Out File Server Role Fails To Start With Event IDs 1205, 1069, and 1194 http://www.aidanfinn.com/?p=14142",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-25T08:52:00.000Z",
        "voteCount": 1,
        "content": "Other discussions also vote C, and one of them had this great response:\n\"\"\nCorrect answer is\nC. Assign the computer account permissions of Cluster2 to the Servers OU.\n\nPlease read *carefully* https://technet.microsoft.com/en-us/library/dn466519.aspx\n\nThe issue here is that computer object “File1” cannot be created in Servers OU, hence service cannot start.\nThe CNO (the Cluster object, in our case Cluster2) needs full access permissions on the Servers OU to be able to create VCOs (the cluster role, in our case File1). This has got nothing to do with user1.\n-User1 needs full permissions on CNO (Cluster2)\n-CNO needs full permissions on Servers OU\nTried it in lab: giving permissions to User1 will not allow the service to start. Giving permissions to Cluster2 on Servers OU (actually, only “create computer objects” permission is needed) will start File1 successfully."
      },
      {
        "date": "2020-11-04T21:32:00.000Z",
        "voteCount": 1,
        "content": "E it is"
      },
      {
        "date": "2020-08-08T20:08:00.000Z",
        "voteCount": 1,
        "content": "Even worse, the question states that the account is LOCAL on two different machines, which makes no sense at all."
      },
      {
        "date": "2020-07-19T05:47:00.000Z",
        "voteCount": 2,
        "content": "From Technet Answer id E. See last 2 comments\nhttps://social.technet.microsoft.com/Forums/office/en-US/54dbed95-bce1-4315-90f4-b79e1354bfcd/test-question-on-the-clustered-file-server-role-in-server-2012?forum=winserver8gen"
      },
      {
        "date": "2020-07-01T15:07:00.000Z",
        "voteCount": 1,
        "content": "Not to mention the answers are all talking about scale-out file server while the question said file server for general use..."
      },
      {
        "date": "2020-06-26T19:44:00.000Z",
        "voteCount": 1,
        "content": "Do review here: https://social.technet.microsoft.com/Forums/office/en-US/54dbed95-bce1-4315-90f4-b79e1354bfcd/test-question-on-the-clustered-file-server-role-in-server-2012?forum=winserver8gen"
      },
      {
        "date": "2020-02-15T22:46:00.000Z",
        "voteCount": 3,
        "content": "I am sure that answer is wrong..\nI vote for C. Assign the computer account permissions of Cluster2 to the Servers OU."
      },
      {
        "date": "2020-04-03T23:03:00.000Z",
        "voteCount": 2,
        "content": "I agree antonskd"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2064-exam-70-412-topic-3-question-96-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two member servers named Server1 and Server2. All servers run<br>Windows Server 2012 R2.<br>Server1 and Server2 have the Failover Clustering feature installed. The servers are configured as nodes in a failover cluster named Guster1. Cluster1 contains a file server role named FS1 and a generic service role named SVC1. Server1 is the preferred node for FS1. Server 2 is the preferred node for SVC1.<br>You plan to run a disk maintenance tool on the physical disk used by FS1.<br>You need to ensure that running the disk maintenance tool does not cause a failover to occur.<br>What should you do before you run the tool?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun Suspend-ClusterResource.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun Suspend-GusterNode.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun cluster.exe and specify the pause parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun cluster.exe and specify the offline parameter."
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-26T06:19:00.000Z",
        "voteCount": 2,
        "content": "The Suspend-ClusterResource cmdlet turns on maintenance for a disk resource or Cluster Shared Volume (CSV) so that a disk maintenance tool can be run without triggering failover."
      },
      {
        "date": "2020-02-29T17:35:00.000Z",
        "voteCount": 3,
        "content": "Correct Answer is A: https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/ee460986(v=technet.10)?redirectedfrom=MSDN"
      },
      {
        "date": "2020-01-20T20:02:00.000Z",
        "voteCount": 2,
        "content": "Answer \"A \" is correct as searched for \"Suspend-ClusterResource\" command in Google."
      },
      {
        "date": "2019-08-18T07:46:00.000Z",
        "voteCount": 2,
        "content": "I agree.......cluster.exe is deprecated in 2012"
      },
      {
        "date": "2019-06-29T02:22:00.000Z",
        "voteCount": 4,
        "content": "correct answer is A."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15047-exam-70-412-topic-3-question-97-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. All servers run Windows Server 2012 R2. The domain contains a domain controller named DC1 that is configured as an enterprise root certification authority (CA).<br>All users in the domain are issued a smart card and are required to log on to their domain-joined client computer by using their smart card.<br>A user named User1 resigned and started to work for a competing company.<br>You need to prevent User1 immediately from logging on to any computer in the domain.<br>The solution must not prevent other users from logging on to the domain.<br>Which tool should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServer Manager",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Certification Authority console",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Administrative Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Sites and Services"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-29T17:38:00.000Z",
        "voteCount": 5,
        "content": "C in order to disable the user account in Active Directory. Fastest way to shut it down."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14411-exam-70-412-topic-3-question-99-discussion/",
    "body": "You have a DNS server named Server1 that runs Windows Server 2012 R2.<br>Server1 has the zones shown in the following output.<br><img src=\"/assets/media/exam-media/02140/0038700001.png\" class=\"in-exam-image\"><br>You need to delegate permissions to modify the records in the adatum.com zone to a group named Group1.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the distribution of the trust anchors for adatum.com.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUnsign adatum.com.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStore adatum.com in Active Directory.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdate the server data file for adatum.com."
    ],
    "answer": "A",
    "answerDescription": "From the exhibit we see that the adatum.com zone is signed. A trust anchor (or trust \"point\") is a public cryptographic key for a signed zone. Trust anchors must be configured on every non-authoritative DNS server that will attempt to validate DNS data. You cannot distribute trust anchors until after a zone is signed.<br><br>Reference: Trust Anchors -<br>https://technet.microsoft.com/en-us/library/dn593672.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-01T15:22:00.000Z",
        "voteCount": 1,
        "content": "* unsign so that it can be AD-Integrated to allow permissions to be set"
      },
      {
        "date": "2020-07-01T15:21:00.000Z",
        "voteCount": 2,
        "content": "The question &amp; answer appear to be pulled from 2 different questions. The question asked is about assigning permissions to modify to a group, while the answer is talking about other DNS servers validating responses with DNSSEC. Not at all related.  - My answer to the question would be to unsign the zone so that permissions can be set &amp; then re-sign it. The answer &amp; explanation don't actually apply here."
      },
      {
        "date": "2020-02-18T12:20:00.000Z",
        "voteCount": 4,
        "content": "Consensus seems to be that the zone must be unsigned first."
      },
      {
        "date": "2020-04-04T21:48:00.000Z",
        "voteCount": 3,
        "content": "Agreed it should be \"B\" Unsign.\nTo enable the delegation of rights you have to change the zone to integrated but you can’t make changes to the zone until it’s unsigned."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11147-exam-70-412-topic-3-question-102-discussion/",
    "body": "HOTSPOT -<br>You run Get-ISCSIServerTarget and you receive the following output.<br><img src=\"/assets/media/exam-media/02140/0039000001.png\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0039100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "The Get-IscsiServerTarget command obtains iSCSI targets and their associated properties.<br>* Usually, an iSCSI participant can be defined by three or four fields:<br>✑ Hostname or IP Address (e.g., \"iscsi.example.com\")<br>✑ Port Number (e.g., 3260)<br>✑ iSCSI Name (e.g., the IQN \"iqn.2003-01.com.ibm:00.fcd0ab21.shark128\")<br>✑ An optional CHAP Secret (e.g., \"secretsarefun\")<br>-iSCSI Qualified Name (IQN)<br>the fields are:<br>literal iqn (iSCSI Qualified Name)<br>date (yyyy-mm) that the naming authority took ownership of the domain reversed domain name of the authority (e.g. org.alpinelinux, com.example, to.yp.cr)<br>Optional \":\" prefixing a storage target name specified by the naming authority.<br>* -InitiatorId&lt;InitiatorId&gt;<br>Specifies the iSCSI initiator identifiers (IDs) to which the iSCSI target is assigned.<br>Use this parameter to filter out the iSCSI Server Target object which can be accessed by the given iSCSI initiator.<br>The format of this parameter is IdType:Value.<br>The acceptable values for this parameter are: DNSName, IPAddress, IPv6Address, IQN, or MACAddress.<br>Reference: https://en.wikipedia.org/wiki/ISCSI",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-21T01:20:00.000Z",
        "voteCount": 1,
        "content": "find the answer here\nhttps://www.briefmenow.org/microsoft/use-the-drop-down-menus-to-select-the-answer-choice-that-completes-each-statement-16/"
      },
      {
        "date": "2020-02-29T19:20:00.000Z",
        "voteCount": 4,
        "content": "I THINK the answers would be Server3.Adatum.com for the top box &amp; InitiatorIds for the lower box...\n\nhttps://techcommunity.microsoft.com/t5/storage-at-microsoft/introduction-of-iscsi-target-in-windows-server-2012/ba-p/424357"
      },
      {
        "date": "2020-04-04T22:06:00.000Z",
        "voteCount": 4,
        "content": "I agree with Dan - \n\nOn the iSCSI Initiator Properties, select the Targets tab, on Quick Connect on the Target’s field, introduce the FQDN of the Target server, which in this case the answer is server3.adatum.com. If the question mentioned “Discovered targets” then the answer qould be the “IQN”.\n\nThe second part of the question, when configuring the targets properties you’ll be asked to configure Initiators ID’s, which makes that the correct answer."
      },
      {
        "date": "2020-02-29T19:04:00.000Z",
        "voteCount": 1,
        "content": "This question is a total blowout. 1: There's no graphic in the question itself. 2: The \"answer\" shows the graphic that should've been in the question, with no answer!  I'm still confused on what the answer should be here."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1093-exam-70-412-topic-3-question-103-discussion/",
    "body": "You have a server named LON-DC1 that runs Windows Server 2012 R2. An iSCSI virtual disk named VirtualiSCSI1.vhd exists on LON-DC1 as shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0039300001.jpg\" class=\"in-exam-image\"><br>You create a new iSCSI virtual disk named VirtualiSCSI2.vhd by using the existing itgt iSCSI target.<br>VirtualiSCSIl.vhd is removed from LON-DC1.<br>You need to assign VirtualiSCSI2.vhd a logical unit value of 0.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-VirtualDisk cmdlet and specify the -Uniqueld parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Add-IscsiVirtualDiskTargetMapping cmdlet and specify the Lun parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the iscsicli command and specify the reportluns parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-IscsiVirtualDisk cmdlet and specify the DevicePath parameter."
    ],
    "answer": "C",
    "answerDescription": "The Add-IscsiVirtualDiskTargetMapping cmdlet assigns a virtual disk to an iSCSI target. Once a virtual disk has been assigned to a target, and after the iSCSi initiator connects to that target, the iSCSI initiator can access the virtual disk. All of the virtual disks assigned to the same iSCSI target will be accessible by the connected iSCSI initiator.<br>Parameter include: -Lun&lt;Int32&gt;<br>Specifies the logical unit number (LUN) associated with the virtual disk. By default, the lowest available LUN number will be assigned.<br>Reference: Add-IscsiVirtualDiskTargetMapping<br>https://technet.microsoft.com/en-us/library/jj612800(v=wps.630).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-04-30T02:18:00.000Z",
        "voteCount": 6,
        "content": "B. Run the Add-IscsiVirtualDiskTargetMapping cmdlet and specify the Lun parameter."
      },
      {
        "date": "2020-11-12T19:06:00.000Z",
        "voteCount": 1,
        "content": "B i think it is"
      },
      {
        "date": "2020-02-29T19:23:00.000Z",
        "voteCount": 2,
        "content": "Agreed, \"B\" is the answer and explanation is correct."
      },
      {
        "date": "2019-04-30T02:18:00.000Z",
        "voteCount": 2,
        "content": "Answer shows wrong and explanation is corret."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15049-exam-70-412-topic-3-question-104-discussion/",
    "body": "HOTSPOT -<br>Your network contains one Active Directory forest named adatum.com. The forest contains a single domain.<br>The forest contains the domain controllers configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0039400001.png\" class=\"in-exam-image\"><br>Recently, a domain controller named DC4 was deployed to adatum.com. DC4 is in the Default-First-Site-Name site.<br>The adatum.com site links are configured as follows.<br><img src=\"/assets/media/exam-media/02140/0039500001.png\" class=\"in-exam-image\"><br>The schedule for SiteLink1 is shown in the SiteLink1 exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0039600001.jpg\" class=\"in-exam-image\"><br>The schedule for SiteLink2 is shown in the SiteLink2 exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0039700001.jpg\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0039800001.png\" class=\"in-exam-image\">",
    "answerDescription": "* SiteLink1 replication is not available at 10:00.<br>* SiteLink1 and SiteLink2 replication is available at Friday at 23:00. Replication intervals are 15 minutes and 30 minutes respectively.<br>* DefaultIPSitelink will be used to replicate an object from DC1 to DC4. The replication interval of DefaultIPSitelink is 180 minutes.",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-04T22:06:00.000Z",
        "voteCount": 1,
        "content": "Its N Y Y"
      },
      {
        "date": "2020-08-03T11:53:00.000Z",
        "voteCount": 3,
        "content": "I would say No - Yes - No.\nDC4 is isolated.\nThanks @DanStafford you're right."
      },
      {
        "date": "2020-07-19T19:08:00.000Z",
        "voteCount": 3,
        "content": "@Wazmac: i would say no, yes,NO. DC4 is the only DC in the default first site and on the default first IP site link - none of the other DC's or link are on that IP site link, so I suspect DC4 is actually isolated and wouldn't get any replication at all..."
      },
      {
        "date": "2020-07-01T16:25:00.000Z",
        "voteCount": 1,
        "content": "@Wazmac: i would say no, yes, yes. \nSitelink1 is not allowed to replicate at the specified time.\nSitelink1 &amp; Sitelink2 are allowed to replicate at the specified time and at intervals of 15 minutes &amp; 30 minutes respectively; replication traffic would have to go from DC1 &gt; DC3 across both links, so you're looking at within 45 minutes.\nThe Default-IP-Site-Link has a replication interval of 180 minutes (180/60 = 3) with no day/time restrictions, so DC4 would receive replication at 3 hours max."
      },
      {
        "date": "2020-04-04T22:35:00.000Z",
        "voteCount": 3,
        "content": "This link shows it better and the answer should be N Y N, in my opinion, what do you think Dan?\nhttp://www.briefmenow.org/microsoft/for-each-of-the-following-statements-select-yes-if-the-statement-is-true-34/"
      },
      {
        "date": "2020-02-29T20:29:00.000Z",
        "voteCount": 1,
        "content": "1. Again, the question graphic is missing from the question, and given in the answer without the answers clearly marked. 2. The \"answer\" references a DC4 which doesn't exist in the site configuration graphics or the site links referenced. As-presented, this is not a valid question nor answer."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15050-exam-70-412-topic-3-question-106-discussion/",
    "body": "HOTSPOT -<br>Your network contains one Active Directory forest. The forest has three sites configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0040000001.png\" class=\"in-exam-image\"><br>The forest contains the site links configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0040000002.png\" class=\"in-exam-image\"><br>A domain controller named DC2 has an IP address of 192.168.2.2. DC2 and is in Site2.<br>You run the following cmdlets.<br><br>New-ADReplicationSite Site3 -<br>New-ADReplacationSubnet –Name \"192.168.3.0/24\" –Site Site3<br>Use the drop-down menus to select the answer choice that completes each statement.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0040100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0040200001.png\" class=\"in-exam-image\">",
    "answerDescription": "* By default all sites are replicating trough the DEFAULTIPSITELINK using the default schedule, at every 180 minutes.<br>* You need to move DC2 logically as well.<br>Reference: Configuring Active Directory Sites and Services<br>http://www.vkernel.ro/blog/configuring-active-directory-sites-and-services",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-17T14:29:00.000Z",
        "voteCount": 1,
        "content": "Not any and remain in site 2 is the answer."
      },
      {
        "date": "2020-07-04T11:20:00.000Z",
        "voteCount": 1,
        "content": "@Dan Default-site-link couldn't exist"
      },
      {
        "date": "2020-07-01T16:48:00.000Z",
        "voteCount": 1,
        "content": "I can't find a definitive answer, however when a new site is created via GUI, I believe it's defaulted to the default IP site link, so I suspect that would also be the case if a new site is created by Poweshell."
      },
      {
        "date": "2020-07-04T11:23:00.000Z",
        "voteCount": 1,
        "content": "Default site-link couldn't exist. I agree wazmac"
      },
      {
        "date": "2020-04-04T23:00:00.000Z",
        "voteCount": 4,
        "content": "Top is wrong should be \"Not in any\"  - \nWhen you create a site through the GUI in AD Sites and Services, you are forced to add the new site to a site link but If you use the Powershell cmdlet, New-ADReplicationSite, you are not prompted to add your new site to a site link."
      },
      {
        "date": "2020-02-29T20:38:00.000Z",
        "voteCount": 2,
        "content": "192.168.1.0 is the subnet for Site1, not Site2, so putting DC3 on that subnet would I believe put it in Site1. I don't see anything to indicated that it was promoted to a DC2 while in Site2, so why would it remain in Site2 if we can't prove it was created there? It looks to me like it was created in Site1, then physically moved from 1 to 3 but not logically moved. The lower half of the question is unanswerable with the information provided.\n\nThe Upper half of the answer looks correct."
      },
      {
        "date": "2020-03-01T13:53:00.000Z",
        "voteCount": 3,
        "content": "Actually I think it's all correct. New DCs are assigned via subnet, but existing DCs must be manually moved between AD sites - even if they change IP addresses."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 36,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2067-exam-70-412-topic-3-question-107-discussion/",
    "body": "HOTSPOT -<br>You build a test environment. The test environment contains one Active Directory forest. The forest contains a single domain named contoso.com. The domain contains the servers configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0040300001.png\" class=\"in-exam-image\"><br>You run the following commands.<br><br>New-ADReplicationSite Site1 -<br><br>New-ADReplicationSite Site2 -<br>New-ADReplicationSubnet -Name \"192.168.1.0/24\" -Site Site1<br>New-ADReplicationSubnet -Name \"192.168.2.0/24\" -Site Site2<br>New-ADReplicationSiteLink -Name \"SiteLink1\" –SitesIncluded Site1,Site2 -Cost 100 - ReplicationFrequencyInMinutes 15<br>You promote Server3 and Server4 to domain controllers by using the default options.<br>Use the drop-down menus to select the answer choice that completes each statement.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0040400001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0040500001.png\" class=\"in-exam-image\">",
    "answerDescription": "*Replication will only occur between Server3 and Server4.<br>* Values that can be transferred in one replication cycle (replication of the current set of updates between a source and destination domain controller): no limit.<br>Reference: How the Active Directory Replication Model Works<br>https://technet.microsoft.com/en-us/library/cc772726(v=ws.10).aspx#w2k3tr_repup_how_otmw",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-29T20:52:00.000Z",
        "voteCount": 4,
        "content": "I have to agree with Demetris. 1: There's no indication what site(s) or site links apply to DC1 &amp; DC2. 2: We don't know if the subnet(s) DC1 &amp; DC2 are on are /16 CIDR or /24 like Servers 3 &amp; 4. That piece of information is critical to determining whether DC1 &amp; DC2 are on the same subnet or two different subnets. 3: The site creation &amp; sitelink creation Powershell cmdlets shown only tell us the AD Sites &amp; Services configuration of Server 3 &amp; Server 4. We have no information on the site &amp; link configurations of DC1 &amp; DC2. The only option we have is to assume that both of the original DC's are in the Default First Site Name and on the Default First Site Link, but without verifying a /16 CIDR on their respective subnets, we're only guessing. Also, wouldn't Servers 3 &amp; 4 be placed in the default first site &amp; default first site link upon promotion? I can see that the cmdlets run place them in another link, but does it remove them from the default link? The question is very poorly stated and with insufficient information to really determine a definitive answer."
      },
      {
        "date": "2019-06-29T03:59:00.000Z",
        "voteCount": 3,
        "content": "correct answer is: 1) DC1 will replicate only to DC2 and 2) never replicates"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 37,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34150-exam-70-412-topic-3-question-112-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>A previous administrator implemented a Proof of Concept installation of Active Directory Rights Management Services (AD RMS) on a server named Server1.<br>After the proof of concept was complete, the Active Directory Rights Management Services server role was removed.<br>You attempt to deploy AD RMS.<br>During the configuration of AD RMS, you receive an error message indicating that an existing AD RMS Service Connection Point (SCP) was found.<br>You need to ensure that clients will only attempt to establish connections to the new AD RMS deployment.<br>Which should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS, remove the records for Server1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS, increase the priority of the DNS records for the new deployment of AD RMS.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Active Directory, remove the computer object for Server1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Active Directory, remove the SCP."
    ],
    "answer": "D",
    "answerDescription": "The Active Directory Rights Management Services (AD RMS) Service Connection Point (SCP) is an object in Active Directory that holds the web address of the<br>AD RMS certification cluster. AD RMS- enabled applications use the SCP to discover the AD RMS service; it is the first connection point for users to discover the<br>AD RMS web services.<br>Only one SCP can exist in your Active Directory forest. If you try to install AD RMS and an SCP already exists in your forest from a previous AD RMS installation that was not properly deprovisioned, the new SCP will not install properly. It must be removed before you can establish the new SCP.<br>Reference: The AD RMS Service Connection Point<br>http://social.technet.microsoft.com/wiki/contents/articles/710.the-ad-rms-service-connection- point.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-02T11:18:00.000Z",
        "voteCount": 1,
        "content": "You are right@Ben14 but it leaves us with last option."
      },
      {
        "date": "2020-10-09T19:57:00.000Z",
        "voteCount": 2,
        "content": "AD Sites and services or ADSI edit"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 38,
    "url": "https://www.examtopics.com/discussions/microsoft/view/9719-exam-70-412-topic-3-question-115-discussion/",
    "body": "Your network contains one Active Directory forest named contoso.com. The forest contains two child domains and six domain controllers. The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0041400001.png\" class=\"in-exam-image\"><br>You need to ensure that all Active Directory changes are replicated to all of the domain controllers in the forest within 30 minutes.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADSite",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADReplicationSite",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADDomain",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADReplicationSiteLink",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADGroup",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADForest",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetdom"
    ],
    "answer": "B",
    "answerDescription": "The Set-ADReplicationSite cmdlet is used to set the properties for an Active Directory site that is being used for replication. Sites are used in Active Directory to either enable clients to discover network resources (published shares, domain controllers) close to the physical location of a client computer or to reduce network traffic over wide area network (WAN) links. Sites can also be used to optimize replication between domain controllers.<br>The parameter -ReplicationSchedule&lt;ActiveDirectorySchedule&gt; specifies the default replication schedule for connections within this site (intra-site replication).<br>Incorrect answers:<br>Not A: Set-ADSite is a Microsoft Exchange 2013 command. Use the Set-AdSite cmdlet to configure the Exchange settings of Active Directory sites.<br>Not D: The Set-ADReplicationSiteLink cmdlet sets properties on an Active Directory site link. A site link connects two or more sites. Replication site links reflect the administrative policy for how sites interconnect and the methods used to transfer replication traffic. You must connect sites with site links so that domain controllers at each site can replicate Active Directory changes.<br>Not F: The Set-ADForest cmdlet modifies the properties of an Active Directory forest. Replication cannot be configured with this command.<br>Reference: Technet, Set-ADReplicationSite<br>https://technet.microsoft.com/en-us/library/hh852305(v=wps.630).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-06T19:40:00.000Z",
        "voteCount": 2,
        "content": "I think answer is Set-ADReplicationSiteLink - \n\nSet-ADReplicationsite -ReplicationSchedule specifies the default replication schedule for connections within the site but in the forest there are 3 sites (Main Office, Europe Office and Asia Office).\nSo to be sure that also the DC’s within the different sites are replicating with each other within 30 minutes you must check the SiteLink replication: Set-ADReplicationSiteLink -ReplicationFrequencyInMinutes"
      },
      {
        "date": "2020-03-14T12:22:00.000Z",
        "voteCount": 1,
        "content": "Clarification, if your INTRA-site replication exceeds the specified 30 minutes, the INTER-site replication won't be uniform forest-wide."
      },
      {
        "date": "2020-03-14T12:17:00.000Z",
        "voteCount": 1,
        "content": "Set-ADReplicationSite actually has a parameter \" -ReplicationSchedule \" which configures the DEFAULT schedule for AD replication for all links in the site. Since the question is asking for a uniform 30 minutes max on replication forest-wide, I would think that using the answer marked as correct and leaving all the site links at the default schedule would be a faster way of setting a schedule that doesn't vary throughout the forest. However, if you needed to vary the schedule on a specific site-site link, then \"Set-ADReplicationSiteLink\" would be more appropriate. It's tricky, but the context is calling for the same schedule throughout the forest. \n\nhttps://docs.microsoft.com/en-us/powershell/module/activedirectory/set-adreplicationsite?view=winserver2012-ps"
      },
      {
        "date": "2019-12-04T06:53:00.000Z",
        "voteCount": 4,
        "content": "Correct answer is Set-ADReplicationSiteLink\nhttps://docs.microsoft.com/en-us/powershell/module/activedirectory/set-adreplicationsitelink?view=winserver2012-ps"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 39,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14248-exam-70-412-topic-3-question-118-discussion/",
    "body": "HOTSPOT -<br>Your network contains one Active Directory forest named contoso.com and one Active Directory forest named adatum.com. Each forest contains a single domain.<br>You have the domain controllers configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0042100001.png\" class=\"in-exam-image\"><br>You perform the following three actions:<br>✑ Create a user named User1 on DC3.<br>✑ Create a file named File1.txt in the SYSVOL folder on DC1.<br>✑ Create a Group Policy object (GPO) named GPO1 on DC1 and link GPO1 to Site2.<br>You need to identify on which domain controller or controllers each object is stored.<br>What should you identify? To answer, select the appropriate options in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0042100005.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0042200001.png\" class=\"in-exam-image\">",
    "answerDescription": "* SYSVOL is simply a folder which resides on each and every domain controller within the domain. It contains the domains public files that need to be accessed by clients and kept synchronised between domain controllers.<br>Here File1.text will be stored on both domain controllers in contoso.com (DC1 and DC2).<br>* User1 will be stored on both domain controllers in adatum.com (DC3 and DC4), and on the global catalog server in contoso.com (DC1).<br>* The global catalog is the set of all objects in an Active Directory Domain Services (AD DS) forest. A global catalog server is a domain controller that stores a full copy of all objects in the directory for its host domain and a partial, read-only copy of all objects for all other domains in the forest. Global catalog servers respond to global catalog queries.<br>GPO1 will be stored on the global catalog servers in the forest (Dc1 and DC3)<br>Reference: Understanding the Global Catalog<br>https://technet.microsoft.com/en-us/library/cc730749.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-16T09:35:00.000Z",
        "voteCount": 1,
        "content": "according to other discussions,  answer should be :\nUser : dc3 + dc4\nFile : dc1 + dc2\nGPO : dc1 + dc2"
      },
      {
        "date": "2020-08-10T12:14:00.000Z",
        "voteCount": 1,
        "content": "\"GPO1 will be stored on the global catalog servers in *the* forest (Dc1 and DC3)\" - even though the question clearly states there are two separate forests, they are answering the question as if it were a single forest. Clearly the answer here is from another question of a similar nature or flat out wrong."
      },
      {
        "date": "2020-07-01T17:55:00.000Z",
        "voteCount": 1,
        "content": "The answer is being presented as if both domains are in the same forest, yet the question specifically states there are two separate *forests*, not just two separate domains."
      },
      {
        "date": "2020-03-14T13:26:00.000Z",
        "voteCount": 1,
        "content": "Hmmm... \"And *link GPO-1 to Site 2*.\" The **SITE** is crossing forest boundaries. For that GPO link to even work, there would have to be a two-way forest root trust."
      },
      {
        "date": "2020-03-14T13:24:00.000Z",
        "voteCount": 1,
        "content": "Each site is hosting a domain controller from each domain. What's not clear is if theres a 2-way forest root trust in place, but even then I don't think the Global Catalog Server would cross the forest boundaries. It would seem to me that GPO-1 should only be present on the domain controllers in the same domain, GCS or not."
      },
      {
        "date": "2020-02-16T02:05:00.000Z",
        "voteCount": 2,
        "content": "Answer is wrong. Two different forests will not share the GC. \nAlso, the GPO are also stored in the sysvol. So it will be replicated ot all DCs in the domain, including RODC."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 40,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27964-exam-70-412-topic-3-question-119-discussion/",
    "body": "HOTSPOT -<br>Your network contains one Active Directory forest named contoso.com. The forest contains the domain controllers configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0042300001.png\" class=\"in-exam-image\"><br>You perform the following actions:<br>✑ Create a file named File1.txt in the SYSVOL folder on DC1.<br>✑ Create a user named User1 on DC4.<br>You need to identify on which domain controller or controllers a copy of each object is stored.<br>What should you identify? To answer, select the appropriate options in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0042300004.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0042400001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-16T09:49:00.000Z",
        "voteCount": 1,
        "content": "File1 - DC3\nUser1 - DC 4,5,6\n(User1 will replicate to DC5 and DC6 since they are in the same domain, even if it is not GC server.)"
      },
      {
        "date": "2020-08-10T12:22:00.000Z",
        "voteCount": 2,
        "content": "I don't understand why User1 would be stored on DC 4. It's not a Global Catalog Server, and it's in a different domain than the DC's where the user was created. That account shouldn't be present on any of the DC's listed unless DDC4 were made a GCS. (Which it probably should be since the stated question shows no GCS for the child domain."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 41,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2068-exam-70-412-topic-3-question-121-discussion/",
    "body": "Your network contains one Active Directory domain. The domain contains two Hyper-V hosts named Host1 and Host2 that run Windows Server 2012 R2.<br>Host1 contains a virtual machine named VM1.<br>You plan to move VM1 to Host2.<br>You need to generate a report that lists any configuration issues on Host2 that will prevent VM1 from being moved successfully.<br>Which cmdlet should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMove-VM",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTest-VHD",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDebug-VM",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCompare-VM"
    ],
    "answer": "C",
    "answerDescription": "The Compare-VM cmdlet compares a virtual machine and a virtual machine host for compatibility, returning a compatibility report. This is useful when trying to import or migrate a virtual machine that is incompatible with the target Hyper-V server.<br>Incorrect answers:<br>Not A: The Move-VM cmdlet moves a virtual machine to a new Hyper-V host.<br>The parameter -CompatibilityReport&lt;VMCompatibilityReport&gt; specifies a compatibility report which includes any adjustments required for the move. This report must first be generated by the Compare-VM command.<br>Not B: The Test-VHD cmdlet tests a virtual hard disk, not a virtual machine which is what we are handling here, for any problems that would make it unusable.<br>Not C: The Debug-VM cmdlet just debugs a virtual machine.<br><br>Reference: Technet, Compare-VM -<br>https://technet.microsoft.com/en-us/library/hh848612(v=wps.630).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-04T22:34:00.000Z",
        "voteCount": 2,
        "content": "D it is"
      },
      {
        "date": "2020-07-27T01:11:00.000Z",
        "voteCount": 2,
        "content": "Compare-VM: Compares a virtual machine and a virtual machine host for compatibility, returning a compatibility report."
      },
      {
        "date": "2020-07-01T18:02:00.000Z",
        "voteCount": 1,
        "content": "Answers have C &amp; D swapped with what their content should be, correct answer as-presented is \"D: Compare-VM\""
      },
      {
        "date": "2019-06-29T10:14:00.000Z",
        "voteCount": 4,
        "content": "although in the explanation, the answer is correct, D, the chosen one is wrong."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 42,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18011-exam-70-412-topic-3-question-122-discussion/",
    "body": "Your network contains an Active Directory domain named adatum.com. The domain contains a file server named Server1 that runs Windows Server 2012 R2.<br>All client computers run Windows 7.<br>You need to ensure that user settings are saved to \\\\Server1\\Users\\.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of each user account, configure the User profile settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a Group Policy object (GPO), configure the Folder Redirection settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of each user account, configure the Home folder settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a Group Policy object (GPO), configure the Drive Maps preferences."
    ],
    "answer": "B",
    "answerDescription": "User settings and user files are typically stored in the local user profile, under the Users folder. The files in local user profiles can be accessed only from the current computer, which makes it difficult for users who use more than one computer to work with their data and synchronize settings between multiple computers.<br>Two technologies exist to address this problem: Roaming Profiles and Folder Redirection.<br>Folder Redirection lets administrators redirect the path of a folder to a new location. The location can be a folder on the local computer or a directory on a network file share. Users can work with documents on a server as if the documents were based on a local drive. The documents in the folder are available to the user from any computer on the network. Folder Redirection is located under Windows Settings in the console tree when you edit domain-based Group Policy by using the<br>Group Policy Management Console (GPMC).<br>Reference: Folder Redirection Overview<br>https://technet.microsoft.com/en-us/library/cc732275.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-16T10:07:00.000Z",
        "voteCount": 1,
        "content": "This was a 70-411 question, and there was a lot of debate on whether this answer should be \"configure User Profiles\" because we are concerned with the location of the user settings, not their data (which folder redirection is usually used for)."
      },
      {
        "date": "2020-05-30T22:04:00.000Z",
        "voteCount": 1,
        "content": "70-411 Question."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 43,
    "url": "https://www.examtopics.com/discussions/microsoft/view/36227-exam-70-412-topic-3-question-124-discussion/",
    "body": "You have an enterprise certification authority (CA) named CA1.<br>You configure a recovery agent for CA1.<br>On CA1, you create a new certificate template named CertTemplate1, and then you configure CA1 to allow certificates to be requested based on CertTemplate1.<br>You need to ensure that new certificates issued based on CertTemplate1 can be recovered.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Certificate Templates console, modify the Issuance Requirements settings of CertTemplate1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Certification Authority console, modify the enrollment agents of CA1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Certificate Templates console, modify the Request Handling settings of CertTemplate1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Certification Authority console, modify the certificate managers of CA1."
    ],
    "answer": "C",
    "answerDescription": "The key archival process takes place when a certificate is issued. Therefore, a certificate template must be modified to archive keys before any certificates are issued based on this template.<br>See step 7 below.<br>To configure a certificate template for key archival and recovery<br>1. Open the Certificate Templates snap-in.<br>2. In the details pane, right-click the certificate template that you want to change, and then click Duplicate Template.<br>3. In the Duplicate Template dialog box, click Windows Server 2003 Enterprise unless all of your certification authorities (CAs) and client computers are running Windows Server 2008 R2, Windows Server 2008, Windows 7, or Windows Vista.<br>4. In Template, type a new template display name, and then modify any other optional properties as needed.<br>5. On the Security tab, click Add, type the name of the users or groups you want to issue the certificates to, and then click OK.<br>6. Under Group or user names, select the user or group names that you just added. Under Permissions, select the Read and Enroll check boxes, and if you want to automatically issue the certificate, also select the Autoenroll check box.<br>7. On the Request Handling tab, select the Archive subject's encryption private key check box.<br>8. If users already have EFS certificates that are not configured for key archival and recovery, click the Superseded Templates tab, click Add, and then click the name of the template that you want to replace.<br>9. Click OK.<br>Reference: Configure a Certificate Template for Key Archival https://technet.microsoft.com/en-us/library/cc753826.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-16T10:17:00.000Z",
        "voteCount": 2,
        "content": "No, C is correct.  You set up key archival/recovery in the Request Handling tab.\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/ee449464(v=ws.10)?redirectedfrom=MSDN#BKMK_ConfigTemplatesForArchival"
      },
      {
        "date": "2020-11-06T00:21:00.000Z",
        "voteCount": 1,
        "content": "A is the answer"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 44,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11148-exam-70-412-topic-3-question-125-discussion/",
    "body": "You have a server named Server1.<br>A Microsoft Azure Backup of Server1 is created automatically every day.<br>You rename Server1 to Server2.<br>You discover that backups are no longer created in Azure.<br>You need to back up the server to Azure.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Management Portal, modify the configuration of backup vault.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, run the Add-WBBackupTarget cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, run the Start-OBRegistration cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Management Portal, upload the Server2 certificate as a management certificate."
    ],
    "answer": "Answer: Any currently configured backups will be stopped. You will need to reregister the server with the backup vault and it will be considered a new server by",
    "answerDescription": "The Start-OBRegistration cmdlet registers the server with using the vault credentials downloaded during enrollment.<br>Question: What happens if I rename a Windows server that is backing up data to Azure?<br>Recovery Services, so the first backup operation that occurs after registration will be a full backup of all of the data included in the backup instead of just the changes since the last backup occurred. However, if you need to perform a recovery operation you can recover the data that has been backed up using Recover from another server recovery option. For more information, see Rename a server.<br><br>Reference: Azure Backup - FAQ -<br>https://azure.microsoft.com/sv-se/documentation/articles/backup-azure-backup-faq/<br><br>Reference: Start-OBRegistration -<br>https://technet.microsoft.com/en-us/library/hh770398(v=wps.630).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-16T10:21:00.000Z",
        "voteCount": 1,
        "content": "C.  Start-OBRegistration\nexplanation should say:   \"Start-OBRegistration cmdlet registers the server with *Azure using the vault credentials downloaded during enrollment\""
      },
      {
        "date": "2020-07-01T18:11:00.000Z",
        "voteCount": 1,
        "content": "* \"C. On Server2, run the Start-OBRegistration cmdlet\""
      },
      {
        "date": "2020-07-01T18:11:00.000Z",
        "voteCount": 1,
        "content": "Corret answer: \"C: Start-OBRegistration\""
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 45,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2070-exam-70-412-topic-3-question-130-discussion/",
    "body": "Your network contains one Active Directory domain named contoso.com. The domain contains two servers named Server1 and Server2 that run Windows Server<br>2012 R2. You perform daily backups of the data on Server1 to Microsoft Azure. You need to restore the data from the last backup of Server1 to Server2.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, install the Azure Backup Agent.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Management Portal, modify the configuration of the backup vault.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the domain, add Server2 to the Backup Operators group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, install the windows Server Backup feature."
    ],
    "answer": "B",
    "answerDescription": "We need the Vault credentials to be able to access the data in Vault1.<br>Reference: Microsoft Azure - Cloud Backup and Recovery<br>http://blogs.technet.com/b/rmurphy/archive/2014/12/02/microsoft-azure-backup.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-29T12:49:00.000Z",
        "voteCount": 6,
        "content": "imo, correct answer is A."
      },
      {
        "date": "2021-01-28T08:58:00.000Z",
        "voteCount": 1,
        "content": "Agree, you need to enter the credentials after starting recovery from the agent. So the agent is needed first"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 46,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11149-exam-70-412-topic-3-question-131-discussion/",
    "body": "DRAG DROP -<br>Your network contains one Active Directory domain. The domain contains two Hyper-V hosts named Host1 and Host2 that run Windows Server 2012 R2. Host1 contains a virtual machine named DC5. DC5 is a domain controller that runs Windows Server 2012 R2.<br>You configure Active Directory to support domain controller cloning for DC5, and then you shut down DC5.<br>You need to create a clone of DC5 on Host2.<br>What should you run on each Hyper-V host? To answer, drag the appropriate commands or cmdlets to the correct Hyper-V hosts. Each command or cmdlet may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0043300001.png\" class=\"in-exam-image\">",
    "answerDescription": "Use import and export feature, when you want to create a new virtual machine with the same configuration of an existing machine in Hyper-V.<br>The Export-VM cmdlet exports a virtual machine to disk.<br>The Import-VM cmdlet imports a virtual machine from a file.<br>References: Overview of exporting and importing a virtual machine https://technet.microsoft.com/en-us/library/hh831535.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-01T18:36:00.000Z",
        "voteCount": 1,
        "content": "Host1: New-ADDCCloneConfigFile ; Export-VM\nHost2: Import-VM\n\nhttps://docs.microsoft.com/en-us/archive/blogs/canitpro/step-by-step-domain-controller-cloning"
      },
      {
        "date": "2021-01-28T09:06:00.000Z",
        "voteCount": 1,
        "content": "New-ADDCCloneConfigFile is done from a DC before it is shut down, not from the host. So I think wazmac is right: export, then import"
      },
      {
        "date": "2020-04-09T21:54:00.000Z",
        "voteCount": 4,
        "content": "Correct Answer - Host1: Export-VM\n                              Host2: Import-VM"
      },
      {
        "date": "2020-03-14T18:22:00.000Z",
        "voteCount": 1,
        "content": "I take that back - it's really the fourth step in the process, but an export/import is REQUIRED to clone the domain controller. Reference the second link here in particular. However running New-ADDCCloneConfigFile is a required preceding step to the import/export as well.\n\nhttps://redmondmag.com/articles/2014/09/18/cloneable-domain-controller.aspx\n\nhttps://docs.microsoft.com/en-us/archive/blogs/canitpro/step-by-step-domain-controller-cloning"
      },
      {
        "date": "2020-03-14T18:14:00.000Z",
        "voteCount": 1,
        "content": "The real question mark here is the question saying you need a \"clone\" of the DC. That's complicated by the fact that it's a virtual machine. For a domain controller to be cloned, it has to be added to the Cloneable Domain Controllers group and a config file created. I think the \"Import/Export\" answer is flat wrong. \n\nhttps://medium.com/tech-jobs-academy/cloning-a-domain-controller-why-bother-dbaa6baaab98"
      },
      {
        "date": "2020-01-01T15:36:00.000Z",
        "voteCount": 1,
        "content": "What is the correct answer, please?"
      },
      {
        "date": "2020-01-02T17:16:00.000Z",
        "voteCount": 1,
        "content": "export and import\nexport i believe is for host 1 and import is for host 2"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 47,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18145-exam-70-412-topic-3-question-133-discussion/",
    "body": "You have a group Managed Service Account named Service01. Three servers named Server01, Server02, and Server03 currently use the Service01 service account.<br>You plan to decommission Server01.<br>You need to remove the cached password of the Service01 service account from Server01. The solution must ensure that Server02 and Server03 continue to use<br>Service01.<br>Which cmdlet should you run?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADServiceAccount",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReset-ADServiceAccountPassword",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove-ADServiceAccount",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUninstall-ADServiceAccount"
    ],
    "answer": "B",
    "answerDescription": "We reset the password for the service.<br>The Reset-ADServiceAccountPassword cmdlet resets the service account password for the local computer. This cmdlet needs to be run on the computer where the service account is installed.<br>Incorrect:<br>Not A: The Set-ADServiceAccount cmdlet cannot modify the password of the service.<br>Reference: Reset-ADServiceAccountPassword<br>https://technet.microsoft.com/en-us/library/ee617201.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-09T22:15:00.000Z",
        "voteCount": 6,
        "content": "Answer is D - Uninstall-ADServiceAccount\n\nThe Reset-ADServiceAccountPassword -  Is not supported for group managed service accounts as asked in the question.\nhttps://docs.microsoft.com/en-us/powershell/module/addsadministration/Reset-ADServiceAccountPassword?view=win10-ps"
      },
      {
        "date": "2021-01-16T13:15:00.000Z",
        "voteCount": 2,
        "content": "This question and 2 or 3 of the last few questions before this one were on 70-411.\nThe answer to this one was: D - Uninstall-ADServiceAccount.  \nThis way if you uninstall locally from the server,  rather than removing from AD,  the account will still exist for the other servers to continue using."
      },
      {
        "date": "2020-10-15T03:51:00.000Z",
        "voteCount": 2,
        "content": "I believe the correct answer is \"D\",\n\nThe question is: \"You need to remove the cached password of the Service01 service account from Server01\" and Service01 is a group Managed Service Account.\n\n\n- The Reset-ADServiceAccountPassword cmdlet resets the password for the standalone managed service account (MSA) on the local computer. You must run this cmdlet on the computer where the standalone MSA is installed. Reset is not supported for group managed service accounts.\nhttps://docs.microsoft.com/en-us/powershell/module/addsadministration/Reset-ADServiceAccountPassword?view=win10-ps\n\n\n- The Uninstall-ADServiceAccount cmdlet removes an Active Directory standalone managed service account (MSA) on the computer on which the cmdlet is run. For group MSAs, the cmdlet removes the group MSA from the cache. However, if a service is still using the group MSA and the host has permission to retrieve the password, then a new cache entry is created. The specified MSA must be installed on the computer.\nhttps://docs.microsoft.com/en-us/powershell/module/addsadministration/uninstall-adserviceaccount?view=win10-ps"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 48,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11150-exam-70-412-topic-3-question-137-discussion/",
    "body": "HOTSPOT -<br>Your network contains a DNS server named Server1. Server1 hosts a DNS zone for contoso.com.<br>You need to ensure that DNS clients cache records from contoso.com for a maximum for one hour.<br>Which value should you modify in the Start of Authority (SOA) record?<br>To answer, select the appropriate setting in the answer area.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0043800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Minimum TTL - The minimum time-to-live value applies to all resource records in the zone file. This value is supplied in query responses to inform other servers how long they should keep the data in cache. The default value is 3,600.<br>Reference: The Structure of a DNS SOA Record<br>https://support.microsoft.com/en-us/kb/163971",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-21T01:33:00.000Z",
        "voteCount": 4,
        "content": "Should be Minimum (default) TTL"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 49,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18150-exam-70-412-topic-3-question-143-discussion/",
    "body": "You have two Windows Server Update Services (WSUS) servers named Server01 and Server02. Server01 synchronizes from Microsoft ??? Update. Server02 synchronizes updates from Server01. Both servers are members of the same Active Directory domain. You configure Server01 to require SSL for all WSUS metadata by using a certificate issued by an enterprise root certification authority (CA).<br>You need to ensure that Server02 synchronizes updates from Server01.<br>What should you do on Server02?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a command prompt, run wsusutil.exe configuresslproxy server02 443.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a command prompt, run wsusutil.exe configuressl server01.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a command prompt, run wsusutil.exe configuresslproxy server01 443.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Update Services console, modify the Update Source and Proxy Server options."
    ],
    "answer": "C",
    "answerDescription": "We configure server02 to use server01 as an proxy for the updates through the wsusutil.exe configuresslproxy &lt;ssl_proxy_ip_or_name&gt; &lt;port&gt;<br>Server01 is the ssl_proxy and the port is 443 (the sll port).<br>Reference: A work-around when using different proxies for HTTP and SSL in WSUS 3.0 SP1 http://blogs.technet.com/b/craigf/archive/2009/05/04/a-work-around-when-using-different- proxies-for-http-and-ssl-in-wsus-3-0-sp1.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-15T04:39:00.000Z",
        "voteCount": 2,
        "content": "The correct answer should be \"D\".\n\nYou have to configure a downstream WSUS server to synchronize to an upstream server that uses SSL.\n\nYou can find a complete explanation here:\n\nhttps://docs.microsoft.com/en-us/windows-server/administration/windows-server-update-services/deploy/2-configure-wsus#bkmk_2.5.ConfigSSL\n\nTo synchronize a downstream server to an upstream server that uses SSL\n\n1) Log on to the computer by using a user account that is a member of the local Administrators group or the WSUS Administrators group.\n\n2) Click start, click All Programs, click Administrative Tools, and then click Windows Server Update Service.\n\n3) In the right pane, expand the server name.\n\n4) Click Options, and then click Update Source and Proxy Server.\n\n5) On the Update Source page, select Synchronize from another Windows Server Update Services server.\n\n6) type the name of the upstream server into the Server name text box. type the port number that the server uses for SSL connections into the Port number text box.\n\n7) select the Use SSL when synchronizing update information check box, and then click OK."
      },
      {
        "date": "2020-04-09T22:52:00.000Z",
        "voteCount": 2,
        "content": "Answer should be D."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 50,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18152-exam-70-412-topic-3-question-144-discussion/",
    "body": "HOTSPOT -<br>You need to configure Server1 to meet the following requirements:<br>✑ Ensure that old files in folder named Folder1 are archived automatically to a folder named Archive1.<br>✑ Ensure that JPG files can always be saved to a local computer, even when a file screen exists.<br>Which two nodes should you configure?<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0044600001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0044700001.png\" class=\"in-exam-image\">",
    "answerDescription": "Node 1: File expiration tasks are used to automatically move all files that match certain criteria to a specified expiration directory, where an administrator can then back those files up and delete them.<br>To create a file expiration task<br>1. Click the  File Management Tasks  node.<br>2. Right-click  File Management Tasks, and then click  Create File Management Task  (or click  Create File Management Task  in the  Actionspane). This opens the  Create File Management Task  dialog box.<br>3. In the  Exception path  text box, type or select the path that the exception will apply to. The exception will apply to the selected folder and all of its subfolders.<br><br>Etc -<br>Node 2:<br>Occasionally, you need to allow exceptions to file screening. For example, you might want to block video files from a file server, but you need to allow your training group to save the video files for their computer-based training. To allow files that other file screens are blocking, create a file screen exception.<br>You assign file groups to determine which file types will be allowed in the file screen exception.<br>To create a file screen exception<br>1. InFile Screening Management, click the  File Screens  node.<br>2. Right-click  File Screens, and click  Create File Screen Exception  (or select  Create File Screen Exception  from the  Actions  pane). This opens the<br>Create File Screen Exception  dialog box.<br><br>Etc -<br>Note: On the File Screening Management node of the File Server Resource Manager MMC snap-in, you can perform the following tasks:<br>* Create file screens to control the types of files that users can save, and generate notifications when users attempt to save unauthorized files.<br>* Define file screening templates that can be applied to new volumes or folders and that can be used across an organization.<br>* Create file screening exceptions that extend the flexibility of the file screening rules.<br>Reference: Create a File Expiration Task<br>https://technet.microsoft.com/en-us/library/dd759233.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-09T22:58:00.000Z",
        "voteCount": 6,
        "content": "Wrong again - File Management Tasks &amp; File Screens."
      },
      {
        "date": "2020-10-15T05:24:00.000Z",
        "voteCount": 2,
        "content": "You're right Wazmac:\n\n– File Management Tasks: edit a task with action “file expiration”\n– File Screens: Right clic &gt; Create File Screen Exception."
      },
      {
        "date": "2020-07-01T19:24:00.000Z",
        "voteCount": 3,
        "content": "Totally agree with Wazmac here. Fiel Screening Management is already expanded to expose File Screens, which is where you would have to right-click to create the exception for .jpg file type."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 51,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43329-exam-70-412-topic-3-question-146-discussion/",
    "body": "You have two servers named Server1 and Server2 that run Windows Server 2012 R2.<br>You have a Microsoft Azure subscription that has two backup vaults named Vault1 and Vault2.<br>Server1 is backed up to Vault1. The backup of Server1 contains a file named Data.db. Server2 is backed up to Vault2.<br>You need to recover a copy of Data.db to Server2.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Management Portal, modify the policies ofVault1. On Server2, run the Recover Data Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Server2, modify the logon settings for the Microsoft Azure Recovery Services Agent service, and then run the Recover Data Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Management Portal, allow the re-registration of Server1. On Server2, modify the Microsoft Azure Backup properties, and then run the Recover Data Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Server2, copy the Vault1 credentials and the passphrase. Run the Recover data Wizard."
    ],
    "answer": "D",
    "answerDescription": "We need the Vault1 credentials to be able to access the data in Vault1.<br>We need the passphrase of Server1 to access the backup that was made on Server1.<br>References: Microsoft Azure - Cloud Backup and Recovery<br>http://blogs.technet.com/b/rmurphy/archive/2014/12/02/microsoft-azure-backup.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-26T11:06:00.000Z",
        "voteCount": 1,
        "content": "Kind of oddly worded, right?  \"From Server 2, copy the vault1 creds\"?!\nBut it looks like that's the right answer according to other sites"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 52,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11151-exam-70-412-topic-3-question-152-discussion/",
    "body": "DRAG DROP -<br>You have a file server named Server1 that runs Windows Server 2012 R2.<br>The folders on Server1 are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0045800001.png\" class=\"in-exam-image\"><br>A new corporate policy states that backups must use Microsoft Online Backup whenever possible.<br>You need to identify which technology you must use to back up Server1.<br>The solution must use Microsoft Online Backup whenever.<br>What should you identify? To answer, drag the appropriate backup type to the correct location or locations. Each backup type may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0045900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "http://technet.microsoft.com/en-us/library/hh831761.aspx<br><img src=\"/assets/media/exam-media/02140/0046000001.png\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-16T17:33:00.000Z",
        "voteCount": 5,
        "content": "Frome everything I can find, MOB supports backup of both encrypted files and compressed files since Server 2008. System State backups are NOT supported, so everything but the System State could be backed up online. \n\nhttps://aidanfinn.com/?p=12179"
      },
      {
        "date": "2021-01-16T14:02:00.000Z",
        "voteCount": 1,
        "content": "this is true.  All listed are supported except System State,"
      },
      {
        "date": "2020-10-15T19:09:00.000Z",
        "voteCount": 1,
        "content": "Microsoft online backup supports all of these\n\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-system-state\n\nhttps://docs.microsoft.com/en-us/azure/backup/backup-support-matrix-mars-agent#supported-file-types-for-backup"
      },
      {
        "date": "2020-01-22T07:27:00.000Z",
        "voteCount": 1,
        "content": "you cannot use WOB when encryption is activated nor system state"
      },
      {
        "date": "2020-01-03T03:48:00.000Z",
        "voteCount": 1,
        "content": "What is the answer of the question please?"
      },
      {
        "date": "2020-01-22T07:27:00.000Z",
        "voteCount": 1,
        "content": "you cannot use WOB when encryption is activated nor system state"
      },
      {
        "date": "2021-01-16T14:01:00.000Z",
        "voteCount": 1,
        "content": "I think you mean Bitlocker encryption.  The NTFS encryption is supported, so all of these will work except the System State - the Online Backup doesn't do system state."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 53,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18254-exam-70-412-topic-3-question-162-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a main office and a branch office. An Active Directory site exists for each office.<br>All domain controllers run Windows Server 2012 R2.<br>The domain contains two domain controllers.<br>DC1 hosts an Active Directory- integrated zone for contoso.com.<br>You add the DNS Server server role to DC2.<br>You discover that the contoso.com DNS zone fails to replicate to DC2.<br>You verify that the domain, schema, and configuration naming contexts replicate from DC1 to DC2.<br>You need to ensure that DC2 replicates the contoso.com zone by using Active Directory replication.<br>Which tool should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDnscmd",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDnslint",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRepadmin",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNtdsutil",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDNS Manager",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Sites and Services",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Domains and Trusts",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Users and Computers"
    ],
    "answer": "F",
    "answerDescription": "http://technet.microsoft.com/en-us/library/cc739941(v=ws.10).aspx<br>If you seequestion about AD Replication, First preference is AD sites and services, then Repadmin and then DNSLINT.",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-17T12:33:00.000Z",
        "voteCount": 4,
        "content": "For AD Replication first preference is AD sites and services, then Repadmin and then DNSLINT"
      },
      {
        "date": "2020-07-02T11:48:00.000Z",
        "voteCount": 1,
        "content": "I'm going with it for now, too short on time to dig."
      },
      {
        "date": "2020-04-11T21:33:00.000Z",
        "voteCount": 2,
        "content": "Do we agree with this one? Been researching this question lots of different opinions on what the answer should be."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 54,
    "url": "https://www.examtopics.com/discussions/microsoft/view/42044-exam-70-412-topic-3-question-163-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a file server named Server1 and a domain controller named DC1. All servers run Windows Server 2012 R2. A Group Policy object (GPO) named GPO1 is linked to the domain.<br>Server1 contains a folder named Folder1. Folder1 is shared as Share1.<br>You need to ensure that authenticated users can request assistance when they are denied access to the resources on Server1.<br>Which two actions should you perform? (Each correct answer presents part of the solution. (Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssignthe Read Attributes NTFS permission on Folder1 to the Authenticated Users group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the File Server Resource Manager role service on Server1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the Customize message for Access Denied errors policy setting of GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Enableaccess-denied assistance on client for all file types policy setting for GPO1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the File Server Resource Manager role service on DC1."
    ],
    "answer": "BD",
    "answerDescription": "http://technet.microsoft.com/en-us/library/hh831402.aspx#BKMK_1",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-11T04:38:00.000Z",
        "voteCount": 1,
        "content": "B and C"
      },
      {
        "date": "2021-01-11T04:49:00.000Z",
        "voteCount": 1,
        "content": "never mind, just check out the actual policy, the answer is correct."
      },
      {
        "date": "2021-01-11T04:49:00.000Z",
        "voteCount": 1,
        "content": "never approve this comment"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 55,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2075-exam-70-412-topic-3-question-165-discussion/",
    "body": "Your network contains two servers named Server1 and Server2 that run Windows Server 2012 R2. Server1 and Server2 have the Hyper-V server role installed.<br>Server1 and Server2 are configured as Hyper-V replicas of each other.<br>Server1 hosts a virtual machine named VM1. VM1 is replicated to Server2.<br>You need to verify whether the replica of VM1 on Server2 is functional.<br>The solution must ensure that VM1 remains accessible to clients.<br>What should you do from Hyper-V Manager?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, execute a Planned Failover.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server1, execute a Test Failover.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2, execute a Planned Failover.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Server2,execute a Test Failover."
    ],
    "answer": "B",
    "answerDescription": "Test Failover is an operation initiated on your replica virtual machine which allows you to test the sanity of the virtualized workload without interrupting your production workload or ongoing replication.<br>The test failover needs te be done on The replica server, which is Server1. http://blogs.technet.com/b/virtualization/archive/2012/07/26/types-of-failover-operations-in-hyper-v-replica.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-17T13:19:00.000Z",
        "voteCount": 1,
        "content": "you guys are right, it's D - \n\n\"TFO is performed on the replica vm by right-clicking on the VM and choosing the Test Failover operation (either from the Hyper-V Manager or from the Failover Clustering Manager)\""
      },
      {
        "date": "2021-01-25T10:57:00.000Z",
        "voteCount": 1,
        "content": "(TFO = Test Fail Over)"
      },
      {
        "date": "2020-07-02T12:16:00.000Z",
        "voteCount": 2,
        "content": "Wazmac correct, but you can't edit these once you hit \"submit.\" Lol - D test failover on Server 2 which question states is the replica."
      },
      {
        "date": "2020-03-20T14:37:00.000Z",
        "voteCount": 2,
        "content": "Correct answer is C - execute a test failover from Server 2, which is the replica. Even the explanation included in the \"reveal answer\" says that the test failover has to be initiated from the replica server, not the primary host server."
      },
      {
        "date": "2020-04-11T21:52:00.000Z",
        "voteCount": 3,
        "content": "You mean \"D\" don't you Dan?"
      },
      {
        "date": "2019-08-20T10:25:00.000Z",
        "voteCount": 2,
        "content": "Tested in my lab and I agree."
      },
      {
        "date": "2019-06-30T04:21:00.000Z",
        "voteCount": 2,
        "content": "there is a similar question but the wording is kind different. this question has as replica Server2 and correct answer is TFO on Server2. if VM was replicated on Server1, then the provided answer would be correct."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 56,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18257-exam-70-412-topic-3-question-169-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two servers named Server1 and Server2 that run Windows Server<br>2012 R2. Server1 has the IP Address Management (IPAM) Server feature installed. Server2 has the DHCP Server server role installed. A user named User1 is a member of the IPAM Users group on Server1.<br>You need to ensure that User1 can use IPAM to modify the DHCP scopes on Server2.<br>The solution must minimize the number of permissions assigned to User1.<br>To which group should you add User1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDHCP Administrators on Server2",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIPAM ASM Administrators on Server1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIPAMUG in Active Directory",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIPAM MSM Administrators on Server1"
    ],
    "answer": "A",
    "answerDescription": "The user need rights to change DHCP not IPAM<br>C. Members ofthe DHCP Administrators group can view and modify any data at the DHCP server. http://technet.microsoft.com/en-us/library/jj878348.aspx http://technet.microsoft.com/en-us/library/cc737716(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-11T22:16:00.000Z",
        "voteCount": 1,
        "content": "Shouldn't the answer be B ? - IPAM ASM Administrators\nIPAM ASM Administrators: IPAM address space management (ASM) administrators can manage IP address blocks, ranges, and addresses."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 57,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2077-exam-70-412-topic-3-question-172-discussion/",
    "body": "Your network contains an Active Directory forest. The forest contains two domains named contoso.com and fabrikam.com. The functional level of the forest is<br>Windows Server 2003.<br>You have a domain outside the forest named adatum.com.<br>You need to configure an access solution to meet the following requirements:<br>- Users in adatum.com must be able to access resources in contoso.com.<br>- Users in adatum.com must be prevented from accessing resources in fabrikam.com.<br>- Users in both contoso.com and fabrikam.com must be prevented from accessing resources in adatum.com.<br>What should you create?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta one-way external trust from adatum.com to fabrikam.com",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta one-way realm trust from fabrikam.com to adatum.com",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta one-way realm trust from adatum.com to fabrikam.com",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta one-way external trust from fabrikam.com to adatum.com"
    ],
    "answer": "A",
    "answerDescription": "A. Aone-way trust is a unidirectional authentication path that is created between two domains. This means that in a one-way trust between Domain A and Domain<br>B, users in Domain A can access resources in Domain B.However, users in Domain B cannot access resources in Domain A. This would allow adatum.com users access to contoso which is desired.<br>B. This would allow contoso.com users access to adatum which must be prevented and used for non windows realm to AD.<br>C. This would allow adatum.com users access to contoso which is desired but realm trust types are used for non windows realm to AD.<br>D. This would allow adatum users access to contoso which must be prevented and You need to make trust relationship where domaincontoso.com trusts adatum.com.<br>NOTE: On exam thedomain names were changed, so understand the question wellhttp://technet.microsoft.com/en-us/library/cc728024(v=ws.10).aspx<br><img src=\"/assets/media/exam-media/02140/0048900001.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-30T04:44:00.000Z",
        "voteCount": 9,
        "content": "provided answers are wrong!! correct answer is a one-way external trust from contoso.com to adatum.com which is not there."
      },
      {
        "date": "2021-01-14T13:31:00.000Z",
        "voteCount": 2,
        "content": "There's a note in explanation that in exam the domain names are changed so be careful and understand the question."
      },
      {
        "date": "2020-07-28T05:00:00.000Z",
        "voteCount": 2,
        "content": "Demetris is right and FTH is right"
      },
      {
        "date": "2020-03-20T16:24:00.000Z",
        "voteCount": 1,
        "content": "The answer listed as correct would allow users in Fabrikam.com to access resources in Adatum.com - Demetris is absolutely correct. The correct answer for the stated question is not available, or the question is written incorrectly. There is no valid answer provided."
      },
      {
        "date": "2020-01-19T13:30:00.000Z",
        "voteCount": 4,
        "content": "as stated by demetris. \"external one-way trust from contoso to adatum\" is the answer but its not listed as an option."
      },
      {
        "date": "2020-01-13T01:52:00.000Z",
        "voteCount": 1,
        "content": "The answer you are proposing is not there, demetris"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 58,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2078-exam-70-412-topic-3-question-173-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a main office and a branch office. An Active Directory site exists for each office.<br>All domain controllers run Windows Server 2012 R2. The domain contains two domain controllers. The domain controllers are configured as shown in the following table.<br>DC1 hosts an Active Directory-integrated zone for contoso.com.<br>You add the DNS Server server role to DC2.<br>You discover that the contoso.com DNS zone fails to replicate to DC2.<br>You verify that the domain, schema, and configuration naming contexts replicate from DC1 to DC2.<br>You need to ensure that DC2 replicates the contoso.com zone by using Active Directory replication.<br>Which tool should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive Directory Sites and Services",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNtdsutil",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDNS Manager",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive DirectoryDomains and Trusts"
    ],
    "answer": "A",
    "answerDescription": "A. To control replication between two sites, you can use the Active Directory Sites and Services snap- in to configure settings on the site link object to which the sites areadded. By configuring settings on a site link, you can control when replication occurs between two or more sites, and how often B. Ntdsutil.exe is a command-line tool that provides management facilities for Active Directory Domain Services (AD DS) and Active Directory Lightweight Directory Services (AD<br>LDS).<br>You can use the ntdsutil commands to perform database maintenance of AD DS, manage and control single master operations, and remove metadata left behind by domain controllers that were removed from thenetwork without being properly uninstalled.<br>C. DNS Manager is the tool you'll use to manage local and remote DNS Servers<br>D. Active Directory Domains and Trusts is the Microsoft Management Console (MMC) snap-in that you can use to administer domain trusts,domain and forest functional levels, and user principal name (UPN) suffixes. http://technet.microsoft.com/en-us/library/cc731862.aspx http://technet.microsoft.com/en-us/library/cc753343(v=ws.10).aspx http://technet.microsoft.com/en-us/library/cc722541.aspx http://technet.microsoft.com/en-us/library/cc770299.aspx<br>Note: If you see question about AD Replication, First preference is AD sites and services, then Repadmin and then DNSLINT.",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-30T04:46:00.000Z",
        "voteCount": 4,
        "content": "table is missing"
      },
      {
        "date": "2021-01-17T14:51:00.000Z",
        "voteCount": 1,
        "content": "You can see the table in #181, #185 (next couple pages) but you don't really need it"
      },
      {
        "date": "2021-01-25T12:56:00.000Z",
        "voteCount": 1,
        "content": "In a couple other questions, this was mentioned in the discussion:\nfor AD replication exam questions, the preference is usually:\n1)AD Sites &amp; Services\n2)RepAdmin\n3)DNSLint"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 59,
    "url": "https://www.examtopics.com/discussions/microsoft/view/26593-exam-70-412-topic-3-question-177-discussion/",
    "body": "You have a server named Server1 that has the Active Directory Certificate Services server role installed. Server1 uses a hardware security module (HSM) to protect the private key of Server1.<br>You need to ensure that the Active Directory Certificate Services (AD CS) database, log files, and private key are backed up.<br>You perform regular backups of the HSM module by using a backup utility provided by the HSM manufacturer.<br>What else should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the certutil.execommand and specify the -backupkey parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the certutil.exe command and specify the -backupdb parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the certutil.exe command and specify the -backup parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the certutil.exe command and specify the -dump parameter."
    ],
    "answer": "B",
    "answerDescription": "A. Backup the Active Directory Certificate Services certificate and private key<br>B. Backup the Active Directory Certificate Services database<br>C. Backup Active Directory Certificate Services<br>D. Dump configuration information or files<br>http://technet.microsoft.com/en-us/library/cc732443.aspx#BKMK_backupKey http://technet.microsoft.com/en-us/library/cc732443.aspx#BKMK_backupDB http://technet.microsoft.com/en-us/library/cc732443.aspx#BKMK_backup http://technet.microsoft.com/library/cc732443.aspx#BKMK_dump<br><img src=\"/assets/media/exam-media/02140/0049600002.png\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-06T22:11:00.000Z",
        "voteCount": 1,
        "content": "B it is"
      },
      {
        "date": "2020-07-24T19:11:00.000Z",
        "voteCount": 2,
        "content": "It may be that they're figuring the HSM backup utility is backing up the key already, so that's probably why they go with \"-BackupDB\"."
      },
      {
        "date": "2020-07-24T19:10:00.000Z",
        "voteCount": 1,
        "content": "It looks to me like the \"-BakcupDB\" option would get you the log files &amp; database, but not the key. The question stipulates all 3 items, DB, Log, &amp; Key. That's why I was thinking \"-Backup\"."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 60,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17066-exam-70-412-topic-3-question-178-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named adatum.com. All servers run Windows Server 2012 R2. All domain controllers have the DNS Server server role installed.<br>You have a domain controller named DC1. On DC1, you create an Active Directory-integrated zone named adatum.com and you sign the zone by using DNSSEC.<br>You deploy a new read-only domain controller (RODC) named R0DC1.<br>You need to ensure that the contoso.com zone replicates to R0DC1.<br>What should you configure on DC1? To answer, select the appropriate tab in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0049800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0049900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "http://technet.microsoft.com/en-us/library/cc781340(v=ws.10).aspx<br>Foradditional servers to host a zone, zone transfers are required to replicate and synchronize all copies of the zone used at each server configured to host the zone.<br><img src=\"/assets/media/exam-media/02140/0050000001.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-12T21:45:00.000Z",
        "voteCount": 5,
        "content": "I believe the answer is correct due to the Zone being signed using DNSSEC, a good explanation can be found at this link, check out the last comment, it's to big to post here.\nhttp://www.briefmenow.org/microsoft/what-should-you-configure-on-dc1-13/"
      },
      {
        "date": "2020-07-02T18:01:00.000Z",
        "voteCount": 2,
        "content": "Wazmac is correct. I have since learned that RODC's will load an AD-Integrated zone that has been signed with DNSSEC as a standard secondary zone, and zone transfers MUST be configured for replication to occur to the RODC. If the zone were NOT signed with DNSSEC, and AD-integrated zone would replicate to the RODC via AD replication. It's the combination of DNSSEC with an RODC that makes all the difference here."
      },
      {
        "date": "2020-03-20T17:17:00.000Z",
        "voteCount": 1,
        "content": "The question has no valid answer in this context because it states that the zone is Active Directory-integrated. I suspect it should have stated that the zone was a standard primary zone and not AD-integrated."
      },
      {
        "date": "2020-03-20T17:16:00.000Z",
        "voteCount": 1,
        "content": "https://social.technet.microsoft.com/wiki/contents/articles/4031.how-read-only-domain-controllers-and-dns-works.aspx"
      },
      {
        "date": "2020-03-20T17:14:00.000Z",
        "voteCount": 1,
        "content": "\"On DC1, you create an Active Directory-integrated zone...\" Active Directory-integrated zones replicate via Active Directory replication, NOT zone transfers. An RODC is still a DC, it's just that the replication is one-way.\n\nhttps://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/active-directory-integrated-dns-zones"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 61,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27289-exam-70-412-topic-3-question-182-discussion/",
    "body": "You have a file server named FS1 that runs Windows Server 8.<br>Data Deduplication is enabled on FS1.<br>You need to configure Data Deduplication to run at a normal priority from 20:00 to 06:00 daily.<br>What should you configure?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile and Storage Services in Server Manager",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Data Deduplication process in Task Manager",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisk Management in Computer Management",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe properties of drive C"
    ],
    "answer": "A",
    "answerDescription": "A. In Windows Server 2012 R2, deduplication can be enabled locally or remotely by using Windows<br>PowerShell or Server Manager.<br>http://technet.microsoft.com/en-us/library/hh831700.aspx<br><img src=\"/assets/media/exam-media/02140/0050600001.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-04T05:11:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/hh831487(v=ws.11)#Data%20Deduplication"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 62,
    "url": "https://www.examtopics.com/discussions/microsoft/view/42645-exam-70-412-topic-3-question-189-discussion/",
    "body": "You manage an environment that has many servers.<br>The servers run Windows Server 2012 R2 and use iSCSI storage.<br>Administrators report that it is difficult to locate available iSCSI resources on the network.<br>You need to ensure that the administrators can locate iSCSI resources on the network by using a central repository.<br>Which feature should you deploy?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe iSCSI Target Server role service",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe iSNS Server service feature",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Windows Standards-Based Storage Management feature",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe iSCSI Target Storage Provider feature"
    ],
    "answer": "B",
    "answerDescription": "A. iSNS facilitates automated discovery, management, and configuration of iSCSI and Fibre<br>Channel devices (using iFCP gateways) ona TCP/IP network.<br>C. Windows Server 2012 R2 enables storage managementthat is comprehensive and fully scriptable, and administrators can manage it remotely<br>D. iSCSI Target Server enables you to network boot multiple computers from a single operating systemimage that is stored in a centralized location http://technet.microsoft.com/en-us/library/cc772568.aspx http://technet.microsoft.com/en-us/library/hh831751.aspx http://technet.microsoft.com/en-us/library/dn305893.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-17T15:11:00.000Z",
        "voteCount": 1,
        "content": "Internet Storage Name Service Server (iSNS Server) -\nis a repository of currently active iSCSI nodes, as well as their associated portals, entities, etc.\nAllows for centralized management, scalability, etc\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/cc772568(v=ws.11)?redirectedfrom=MSDN"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 63,
    "url": "https://www.examtopics.com/discussions/microsoft/view/42649-exam-70-412-topic-3-question-195-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>The domain contains a server named Server1 that runs Windows Server 2012 R2.<br>Server1 has the IP Address Management (IPAM) Server feature installed.<br>IPAM is configured currently for Group Policy-based provisioning.<br>You need to change the IPAM provisioning method on Server1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the ipamgc.exe command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-IPAMConfiguration cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReinstall the IP Address Management (IPAM) Server feature.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete IPAM Group Policy objects (GPOs) from the domain."
    ],
    "answer": "C",
    "answerDescription": "You cannot change the provisioning method after completing the initial setup.<br><img src=\"/assets/media/exam-media/02140/0052600001.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-17T15:27:00.000Z",
        "voteCount": 1,
        "content": "Windows Server 2012 R2 allows you to change from manual to automatic (GPO) provisioning using Set-IPAMConfiguration,  but does NOT allow changing from automatic(GPO) to manual - you have to reinstall it."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 64,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27294-exam-70-412-topic-3-question-200-discussion/",
    "body": "You are employed as a network administrator at ABC.com. ABC.com has an active directory domain named ABC.com all servers including domain controllers on the ABC.com network have Windows Server 2012 R2 installed. ABC.com has its headquarters in London and an office in Paris.<br>The London Office has a domain controller named server1, which is configured as a writeable domain controller that servers as a Global catalog server and a DNS server.<br>Server1 is configured to host an Active Directory-integrated zone for ABC.com<br>The Paris office has a Read-Only domain controller (RODC) named server2 which servers as a Global catalog server. After installing the DNS server role on server2, you want to make sure that the ABC.com zone is replicated to server2 via active directory replication.<br>Which of the following actions should you take?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should consider making use of Active Directory Sites and Services to Configured replication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should consider making use of replmon.exe to configure replication.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should consider making use of repadmin.exe to configure replication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should consider making use of Active DirectorySchema To configure replication"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-04T06:45:00.000Z",
        "voteCount": 1,
        "content": "https://helpdeskgeek.com/how-to/active-directory-force-replication/"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 65,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14379-exam-70-412-topic-3-question-207-discussion/",
    "body": "You are employed as a network administrator at contoso.com.<br>Contoso.com has a single Active Directory domain named contoso.com.<br>All servers on the Contoso.com network have Windows Server 2012 R2 installed.<br>Contoso.com has two servers, named server1 and server2 which are configured in a two-node fail over cluster.<br>You are currently configuration the quorum settings for the cluster.<br>You want to make use of a quorum mode that allows each node to vote if it is available and in communication.<br>Which of the following is the mode you should use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNode Majority",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNode and Disk Majority",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNode and File Share Majority",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo Majority: Disk Only"
    ],
    "answer": "A",
    "answerDescription": "A. Allows each node tovote -<br>B. Allows each node and a disk witness to vote<br>C. Allows each node and a File share witness to vote<br>D. Allows one node with a specified disk to have quorum<br>http://technet.microsoft.com/en-us/library/cc770620(v=ws.10).aspx<br><img src=\"/assets/media/exam-media/02140/0053500001.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-16T22:08:00.000Z",
        "voteCount": 5,
        "content": "I agree antonskd, but the question isn’t asking what the smart thing to do is. It’s asking what mode gives nodes a vote. Since it doesn’t mention storage, quorum disks, or best practices… I’d have to say A."
      },
      {
        "date": "2020-07-03T13:44:00.000Z",
        "voteCount": 2,
        "content": "I agree with Wazmac. \"A\" because of the way it's worded."
      },
      {
        "date": "2020-02-17T22:07:00.000Z",
        "voteCount": 3,
        "content": "i suppose that we need a witness for the 2-node cluster. So i bet for B &amp; C.\n\nNode majority is not a good idea for the 2-node cluster."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 66,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2089-exam-70-412-topic-3-question-214-discussion/",
    "body": "You are employed as a senior network administrator at ABC.com.<br>ABC.com has an Active Directory domain named ABC.com.<br>All servers on the ABC.com network have Windows Server 2012 R2 installed.<br>ABC.com has two servers, named SERVER1 and SERVER2 which are configured in a two-node failover cluster. Server1 includes a folder, named ABCAppData, which is configured as a Distributed File System (DFS) name space folder target. After configuring another two nodes in the failover cluster, you are instructed to make sure that access to ABC AppData is highly available.<br>You also have to make sure that application data is replicated to ABCAppData via DFS replication.<br>Which following actions should you take?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should considerconfiguring a scale-out File Server",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should consider configuring the replication settingsfor the cluster",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should consider configuring a file server for general use",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should consider configuring the Quorum settings"
    ],
    "answer": "A",
    "answerDescription": "http://technet.microsoft.com/en-us/library/hh831349.aspx<br><img src=\"/assets/media/exam-media/02140/0054500001.jpg\" class=\"in-exam-image\"><br><br><img src=\"/assets/media/exam-media/02140/0054500002.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-01T08:44:00.000Z",
        "voteCount": 8,
        "content": "correct answer  should be C because scale out does not use DFS replication as stated in question!"
      },
      {
        "date": "2020-02-13T18:20:00.000Z",
        "voteCount": 3,
        "content": "confirmed c at other sites as well.\nhttps://blogs.technet.microsoft.com/filecab/2013/12/05/to-scale-out-or-not-to-scale-out-that-is-the-question/ or you can click here for doubts."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 67,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18627-exam-70-412-topic-3-question-215-discussion/",
    "body": "Your network contains an Active Directory forest named contoso.com.<br>The forest contains a single domain. The domain contains three domain controllers.<br>The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0054600001.png\" class=\"in-exam-image\"><br><br>You discover that when you run Group Policy Results from Group Policy Management, the settings from site-linked Group Policy objects (GPOs) fail to appear in the results.<br>You need to ensure that the settings from site-linked GPOs appear in the results.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun adprep on DC3 by using Windows Server 2012 R2 installation media.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTransfer the infrastructure master role to DC3.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpgrade DC2 to Windows Server 2012 R2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRunadprepon DC1 by using Windows Server 2003 installation media."
    ],
    "answer": "A",
    "answerDescription": "In this scenario a Windows 2012 server has been added to a Windows 2003 network.<br>Note:<br>* Before adding your new Windows 2012 Domain Controller, or attempting to performaninplace upgrade of an existing Windows 2008 or 2008 R2 DC, you must make sure that the Schema is upgraded to support your new Windows 2012 DC, and that you prepare each domain where you plan to install Windows 2012 DCs.<br>To do this we can use the ADPREP.exetool found in the support\\adprep folder on your installation media.<br>* Starting with Windows 2012 there is only one version of ADPREP available, and that is a 64-bit version.<br>* Adprep is the utility--included in the OS installation media--that performs several crucial functions to upgrade AD to support that OS. The utility has three major options: /forestprep, /domainprep, and /rodcprep. The /forestprep option runs first, extending the AD schema with new object and attribute classes that the new AD versionneeds. The /domainprep option creates new well-known objects in AD, App1ies security changes, and miscellaneous other bits. Finally, /rodcprep makes forest-wide security changes to allow read-only domain controller (RODC) functionality. The Windows Server2012 R2 version of adprep.exe can run on any server that runs a 64- bit version of Windows Server 2008 or later. http://technet.microsoft.com/en-us/library/bb726995.aspx http://www.ipuptime.net/Multicast.aspx http://technet.microsoft.com/en-us/library/gg144561(v=exchg.141).aspx http://en.wikipedia.org/wiki/Unique_local_address",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-17T21:46:00.000Z",
        "voteCount": 5,
        "content": "I think the answer is B - as adprep /domainprep /gpprep \"Must be run on the infrastructure operations master for the domain\" as stated in this Microsoft document, what do you guys think?\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/dd464018(v=ws.10)?redirectedfrom=MSDN"
      },
      {
        "date": "2021-01-25T14:34:00.000Z",
        "voteCount": 1,
        "content": "Yes - \n\"answer should be B &gt;&gt; Transfer the infrastructure master role to DC3 as a first step then Run adprep /gpprep on DC3 by using Windows Server 2012 R2 installation media.\""
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 68,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18628-exam-70-412-topic-3-question-216-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains a server named Server1 that runs Windows Server 2012 R2 and has the DNS Server server role installed. Server1 is configured to use a DNS server from an Internet Service Provider (ISP) as a forwarder. Corporate management requires that client computers only resolve names of contoso.com computers.<br>You need to configure Server1 to resolve names in the contoso.com zone only.<br>What should you do on Server1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS Manager, modify the root hints of Server1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows PowerShell, run the Remove-DnsServerForwarder cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows PowerShell, run theSet-NetDnsTransitionConfiguration cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS Manager, modify the Advanced properties of Server1."
    ],
    "answer": "A",
    "answerDescription": "If the DNS server does not know the address of the requested site, then itwill forward the request to another DNS server. Inorder to do so, the DNS server must know of the IP address of another DNS server that it can forward the request to. This is the job of root hints. Root hints provides a list of IP addresses of DNS serversthat are considered to be authoritative at the root level of the DNS hierarchy (also known as root name server). http://technet.microsoft.com/en-us/library/ee649221(v=ws.10).aspx http://technet.microsoft.com/en-us/library/jj649867.aspx http://technet.microsoft.com/en-us/library/jj613703.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-21T23:53:00.000Z",
        "voteCount": 1,
        "content": "I agree on A, by forwarding the request to the ISP DNS, the local DNS is not actually performing the resolution itself."
      },
      {
        "date": "2020-07-10T19:04:00.000Z",
        "voteCount": 1,
        "content": "I stil think its D - \nIf you were to modify the root hints, then the server would still be able to use its forwader to send requests to the ISP DNS. I think the correct answer would be to edit the advanced options and disable recursion. This also disables forwarders so that the DNS server could only resolve names it was authoritative for."
      },
      {
        "date": "2020-06-14T00:56:00.000Z",
        "voteCount": 1,
        "content": "By deleting the root hints, no other than the local DNS name resolution will function. The answer is correct."
      },
      {
        "date": "2020-04-17T22:08:00.000Z",
        "voteCount": 1,
        "content": "Answer should be D - From DNS Manager, modify the Advanced properties of Server1.\n\nYou must assume that you use default settings, complemented with the information provided in the question.\n\n-If you modify (delete) root hints, you are still able to query DNS via the Forwarder(s).\n-If you use the cmdlet Remove-DnsServerForwarder, you are still able to query DNS via the Root hints (root hints are set by default).\n-The Set-NetDnsTransitionConfiguration is an IPv4 IPv6 transition protocol.\n-The only option to stop DNS queries on/to the internet is to select “Disable recursion (also disables forwarders)”. This is the only option to block both Forwarders &amp; Root hints."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 69,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37724-exam-70-412-topic-3-question-219-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>All domain controllers run Windows Server 2012 R2. The domain contains two domain controllers.<br>The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0055300001.png\" class=\"in-exam-image\"><br><br>The Branch site contains a member server named Server1 that runs Windows Server 2012 R2.<br>You need to identify which domain controller authenticated the computer account of Server1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify the value of the %LOGONSERVER% environment variable.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun nltest/sc_query.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify the value of the %SESSIONNAME% environment variable.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun nltest /dsgetsite."
    ],
    "answer": "A",
    "answerDescription": "A. %LOGONSERVER% is the domain controller thatauthenticated the current user.<br>B. Reports on the state of the secure channel the last time that you used it. (The secure channel is the one that the NetLogon service established.)<br>This parameter lists the name of the domain controller that you queried onthe secure channel, also.<br>D. Returns the name of the site in which the domain controller resides. http://technet.microsoft.com/en-us/library/cc753915(v=ws.10).aspx http://technet.microsoft.com/en-us/library/cc731935(v=ws.10).aspx<br><img src=\"/assets/media/exam-media/02140/0055300002.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-24T20:22:00.000Z",
        "voteCount": 1,
        "content": "This cmdlet has been decomissioned"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 70,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14381-exam-70-412-topic-3-question-220-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. All domain controllers run Windows Server 2012 R2. The domain contains two domain controllers.<br>The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0055400001.png\" class=\"in-exam-image\"><br><br>The Branch site contains a perimeter network.<br>For security reasons, client computers in the perimeter network can communicate with client computers in the Branch site only.<br>You plan to deploy a new RODC to the perimeter network in the Branch site.<br>You need to ensure that the new RODC will be able to replicate from DC10.<br>What should you do first on DC10?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Add-ADDSReadOnlyDomainControllerAccount cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Active Directory site.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Active Directory Domain Services Configuration Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate anActive Directory subnet."
    ],
    "answer": "A",
    "answerDescription": "Add-ADDSReadOnlyDomainControllerAccount Creates a read-only domain controller (RODC) account that can be used to install an RODC in Active Directory.<br>Note:<br>* Notes<br>Once you have added the RODC account, youcanadd an RODC to a server computer by using the Install-ADDSDomainController cmdlet with the -<br>ReadOnlyReplica switch parameter.<br>* Example<br>Adds a new read-only domain controller (RODC) account to the corp.contoso.com domain using the North America site asthe source site for the replication source domain controller.<br>C:\\PS&gt;Add-ADDSReadOnlyDomainControllerAccount -DomainControllerAccountName RODC1 -DomainName corp.contoso.com -SiteName NorthAmerica<br>Incorrect:<br>Not B: There already is a branch site.<br>References:",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-17T22:33:00.000Z",
        "voteCount": 5,
        "content": "I believe it should be C as the question is asking what should you do first?"
      },
      {
        "date": "2020-08-04T12:34:00.000Z",
        "voteCount": 1,
        "content": "I go with C"
      },
      {
        "date": "2020-08-01T19:36:00.000Z",
        "voteCount": 1,
        "content": "From the answer explanation of question 224: \"Site link transitivity is controlled by the Bridge all site links option on the properties pages of transport folders (such as IP or SMTP) in the Active Directory Sites and Services snapin.\nSite link transitivity is enabled by default.\nIf you cannot place a writable Windows Server 2008 domain controller in the nearest site to the RODC, RODC replication depends on a site link bridge betweenthe site links that contain the site of the RODC and the site ofthe writable Windows Server 2008 domain controller.\" - so if you have an RODC in the perimeter network &amp; an RODC in the site, you could use a site link bridge to replicate from the Main site to the perimeter RODC. It still doesn't explain to me why you would create the new RODC account on the local RODC rrather than on the Writeable RODC, because the new RODC account would never get replicated back to the Main site..."
      },
      {
        "date": "2020-08-01T19:25:00.000Z",
        "voteCount": 1,
        "content": "This thing is tricky because answer A only creates an account for the new RODC, but you would still have to upgrade DDC10 to a writeable DC before actually adding the new RODC, and before the new RODC *account* would replicate back to the Main site. I suppose you could create the account before switching DC10 to a writeable DC..."
      },
      {
        "date": "2020-07-03T16:05:00.000Z",
        "voteCount": 1,
        "content": "I agree with Wazmac because DC10 is currently an RODC, so you can't replicate from it to another RODC...so DC10 needs to be made a full DC. Every article I can find says no replication from an RODC."
      },
      {
        "date": "2020-02-17T23:56:00.000Z",
        "voteCount": 1,
        "content": "I do not believe that we can or should replicate RODC from RODC. \ni go with B. Make DC10 writable first"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 71,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18629-exam-70-412-topic-3-question-221-discussion/",
    "body": "You perform a full installation of Windows Server 2012 R2 on a virtual machine named Server1.<br>You plan to use Server1 as a reference image.<br>You need to minimize the amount of storage space used by the Windows Server 2012 R2 installation.<br>Which cmdlet should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove-Module",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOptimize-VHD",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOptimize-Volume",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUninstall-WindowsFeature"
    ],
    "answer": "B",
    "answerDescription": "The Optimize-VHD cmdlet optimizes the allocation of space in or more virtualhard disk files, except for fixed virtualhard disks. The Compact operation is used to optimize the files.<br>This operation reclaims unused blocks as well as rearranges the blocks to be more efficiently packed, which reduces the size of a virtual hard disk file.<br>References:",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-17T22:58:00.000Z",
        "voteCount": 2,
        "content": "I think it should be D - There is nothing in 412 about optimizing disk. The question is to minimize the Windows Installation, not the disk size. \nThoughts?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 72,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18664-exam-70-412-topic-3-question-224-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>All domain controllers run Windows Server 2012 R2. The domain contains two domain controllers.<br>The domain controllers are configured as shown in the following table.<br>The Branchsite contains a perimeter network.<br>For security reasons, client computers in the perimeter network can communicate with client computers in the Branch site only.<br>You plan to deploy a new RODC to the perimeter network in the Branch site.<br>You need to ensurethat the new RODC will be able to replicate from DC10.<br>What should you do first on DC10?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Bridge all site links setting.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Active Directory Domain Services Configuration Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Active Directory site link bridge.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Active Directory site."
    ],
    "answer": "C",
    "answerDescription": "Site link transitivity is controlled by the Bridge all site links option on the properties pages of transport folders (such as IP or SMTP) in the Active Directory Sites and Services snapin.<br>Site link transitivity is enabled by default.<br>If you cannot place a writable Windows Server 2008 domain controller in the nearest site to the RODC, RODC replication depends on a site link bridge betweenthe site links that contain the site of the RODC and the site ofthe writable Windows Server 2008 domain controller.<br><br>AD Site not read for RODC -<br>http://technet.microsoft.com/en-us/library/dd736189(v=WS.10).aspx http://technet.microsoft.com/en-us/library/cc738789(v=ws.10).aspx http://technet.microsoft.com/en-us/library/cc732632(v=ws.10).aspx http://technet.microsoft.com/en-us/library/cc778718(v=WS.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-10T13:13:00.000Z",
        "voteCount": 1,
        "content": "From 220: If you cannot place a writable Windows Server 2008 domain controller in the nearest site to the RODC, RODC replication depends on a site link bridge betweenthe site links that contain the site of the RODC and the site ofthe writable Windows Server 2008 domain controller.\" - so if you have an RODC in the perimeter network &amp; an RODC in the site, you could use a site link bridge to replicate from the Main site to the perimeter RODC."
      },
      {
        "date": "2020-04-18T21:24:00.000Z",
        "voteCount": 2,
        "content": "Table missing but if it's the same table as Q 220 the answer will be B as you can't replicate from a RODC to a RODC, need to make it a Writable DC first."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 73,
    "url": "https://www.examtopics.com/discussions/microsoft/view/42658-exam-70-412-topic-3-question-226-discussion/",
    "body": "Your network contains an Active Directory forest named contoso.com.<br>The forest contains a single domain. The domain contains three domain controllers.<br>The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0056500001.png\" class=\"in-exam-image\"><br><br>You plan to test an application on a server named Server1.<br>Server1 is currently located in Site1. After the test, Server1 will be moved to Site2.<br>You need to ensure that Server1 attempts to authenticate to DC3 first, while you test the application.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new site and associate the site to an existing site link object.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the priority of site-specific service location (SRV) DNS records for Site2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new subnet object and associate the subnet object to an existing site.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the weight of site-specific service location (SRV) DNS records Site1."
    ],
    "answer": "B",
    "answerDescription": "Service Location (SRV) Resource Record<br>Priority A number between 0 and 65535 that indicates the priority or level of preference given for this record to the host that is specified inHost offering this service.<br>Priority indicates this host's priority with respect to the other hosts in this domain that offer the same service and are specified by different service location (SRV) resource records.<br>Incorrect:<br>Not D:<br>Weight: A number between 1 and 65535 to be used as a load-balancing mechanism. When you select among more than one target SRV host for the type of service (specified in Service) that use the same Priority number, you can use this field to weight preference toward specific hosts. Where several hosts share equal priority, SRV-specified hosts with higher weight values that are entered here should be returned first to resolver clients in SRV query results. Reference:<br>Service Location (SRV) Resource Record Dialog Box",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-17T22:13:00.000Z",
        "voteCount": 1,
        "content": "Several people are saying the answer is C, because DC's use the subnet to determine which DC/site a PC should connect to authenticate."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 74,
    "url": "https://www.examtopics.com/discussions/microsoft/view/25394-exam-70-412-topic-3-question-227-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>The domain contains a server named Server1 that runs Windows Server 2012 R2.<br>You need to ensure that a WIM file that is located on a network share is used as the installation source when installing server roles and features on Server1.<br>Which two actions should you perform? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the dism.exe command and specify the /remove-package parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun theRemove-WindowsFeature cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable and configure the Specify settings for optional component installation and component repair policy setting by using a Group Policy object (GPO).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Enforce upgrade component rules policy setting by using aGroup Policy object (GPO).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Remove-WindowsPackage cmdlet."
    ],
    "answer": "AC",
    "answerDescription": "A: To remove packages from an offline image by using DISM Example:<br>At a command prompt, specify the package identity to remove it from the image.<br>You canremove multiple packages on one command line.<br>DISM /Image:C:\\test\\offline /Remove-Package<br>/PackageName:Microsoft.Windows.Calc.Demo~6595b6144ccf1df~x86~en~1.0.0.0<br>/PackageName:Microsoft-Windows-MediaPlayerPackage~31bf3856ad364e35~x86~~6.1.6801.0<br>C:<br>* You can use Group Policy to specify a Windows image repair source to use within your network.<br>The repair source can be used to restore Windows features or to repair a corrupted Windows image.<br>* Set Group Policy<br>You can use Group Policy to specify when to use Windows Update, or a network location as a repair source for features on demand and automatic corruption repair.<br>To configure Group Policy for Feature on Demand<br>Open the group policy editor. For example, on a computer that is running Windows 8, click Search,click Settings, type Edit Group Policy, and then select the Edit<br>Group Policy setting.<br>Click Computer Configuration, click Administrative Templates, click System, and then double-click the Specify settings for optional component uninstallation and component repair setting. Select the settings that you want to use for Features on Demand.<br>Note:<br>* The Windows Imaging Format (WIM) is a file-based disk image format. It was developed by Microsoft to help deploy Windows Vista and subsequent versions of<br>Windows operating system family, as well as Windows Fundamentals for Legacy PCs.",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-07T22:31:00.000Z",
        "voteCount": 1,
        "content": "I think A &amp; C are correct"
      },
      {
        "date": "2020-07-10T19:31:00.000Z",
        "voteCount": 3,
        "content": "I think the answer should be - B &amp; C\nhttps://www.briefmenow.org/microsoft/which-two-actions-should-you-perform-809/"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 75,
    "url": "https://www.examtopics.com/discussions/microsoft/view/3928-exam-70-412-topic-3-question-229-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two domain controllers named DC1 and DC2 that run Windows<br>Server 2012 R2.<br>DC1 and DC2 fail to replicate Active Directory information.<br>You confirm that DC1 and DC2 have network connectivity.<br>The NTDS Settings of DC2 are configured as shown in the NTDS Settings exhibit. (Click tie Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0056900001.jpg\" class=\"in-exam-image\"><br><br>DNS is configured as shown in the DNS exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0057000001.jpg\" class=\"in-exam-image\"><br><br>You need to ensure that DC1 and DC2 can replicate immediately.<br>Which two actions should you perform? (Each correct answer presents part of the solution. Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DC1, restart the Netlogon service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DC2, run nltest.exe /sync.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DC1, runipconfig /flushdns.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DC1, run repadmin /syncall.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DC2, run ipconfig /registerdns.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DC2, restart the Netlogon service."
    ],
    "answer": "DE",
    "answerDescription": "The DC2 name/alias is not available in DNS.<br>First we register the DC2 name from DC with the ipconfig /registerdns.<br>(E) Then we synchronizes a specified domain controller DC1 (DC2 would also work) with all of its replication partners with repadmin /syncall. (D)",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-22T09:34:00.000Z",
        "voteCount": 5,
        "content": "Answer is wrong..........should be D and F."
      },
      {
        "date": "2020-11-07T22:36:00.000Z",
        "voteCount": 1,
        "content": "Yes D &amp; F"
      },
      {
        "date": "2020-02-14T17:44:00.000Z",
        "voteCount": 1,
        "content": "d and f confirmed on other sites"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 76,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24701-exam-70-412-topic-3-question-230-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>The domain contains two member servers named Server1 and Server2.<br>All servers run Windows Server 2012 R2.<br>Server1 and Server2 have the Failover Clustering feature installed.<br>The servers are configured as nodes in a failover cluster named Cluster1.<br>Cluster1 has access to four physical disks.<br>The disks are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0057100001.png\" class=\"in-exam-image\"><br><br>You need to identify which disk can be added to a Clustered Storage Space in Cluster1.<br>Which disk should you identify?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisk1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisk2",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisk3",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisk4"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-03T17:20:00.000Z",
        "voteCount": 1,
        "content": "See the prerequisites section:\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj822937(v=ws.11)"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 77,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18731-exam-70-412-topic-3-question-236-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>The domain contains a domain controller named DC1 that runs Windows Server 2012 R2.<br>You create an Active Directory snapshot of DC1 each day.<br>You need to view the contents of an Active Directory snapshot from two days ago.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStop the Active Directory Domain Services (AD DS) service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the ntdsutil.exe command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the dsamain.exe command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart the Volume Shadow Copy Service (VSS)."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-25T19:50:00.000Z",
        "voteCount": 1,
        "content": "FYI - you can view the snapshot with dsamain, BUT FIRST you have to MOUNT it with ntdsutil!"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 78,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18738-exam-70-412-topic-3-question-241-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>The domain contains a server named Server1. Server1 runs Windows Server 2012 R2.<br>You create a group Managed Service Account named gService1.<br>You need to configure a service named Service1 to run as the gService1 account.<br>How should you configure Service1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a command prompt, run sc.exe and specify the config parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Services console, configure the General settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows PowerShell, run Set-Service and specify the -Startup Type parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Services console, configure the Log On settings."
    ],
    "answer": "D",
    "answerDescription": "Executing the sc.exe command with the config parameter will modify service configuration.",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-08T01:03:00.000Z",
        "voteCount": 1,
        "content": "Guess A is the answer here"
      },
      {
        "date": "2020-08-04T19:30:00.000Z",
        "voteCount": 1,
        "content": "Related: https://docs.microsoft.com/en-us/windows-server/security/group-managed-service-accounts/what-s-new-for-managed-service-accounts"
      },
      {
        "date": "2020-08-04T19:23:00.000Z",
        "voteCount": 1,
        "content": "To use SC.exe, you need to be in an elevated command prompt - however to see what it can do, you use a standard command prompt and run \"sc command\" to get the full options &amp; syntax of the SC command."
      },
      {
        "date": "2020-08-04T19:19:00.000Z",
        "voteCount": 1,
        "content": "According to this, you can also do so from the Services Console by configuring the Logon tab, and I believe SC.exe is the Command-Line tool that would be used in a Server Core installation: https://sourcedaddy.com/windows-7/managing-service-accounts.html , https://docs.microsoft.com/en-us/windows/win32/services/controlling-a-service-using-sc"
      },
      {
        "date": "2020-04-19T22:31:00.000Z",
        "voteCount": 3,
        "content": "70-411 Question and answer should be A."
      },
      {
        "date": "2021-01-25T19:56:00.000Z",
        "voteCount": 1,
        "content": "the explanation shown is in agreement, A"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 79,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18740-exam-70-412-topic-3-question-242-discussion/",
    "body": "You have a server named Server1 that runs Windows Server 2012 R2.<br>Server1 has 2 dual-core processors and 16 GB of RAM.<br>You install the Hyper-V server role in Server1.<br>You plan to create two virtual machines on Server1.<br>You need to ensure that both virtual machines can use up to 8 GB of memory.<br>The solution must ensure that both virtual machines can be started simultaneously.<br>What should you configure on each virtual machine?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDynamic Memory",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNUMA topology",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMemory weight",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tResource Control"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-19T22:42:00.000Z",
        "voteCount": 1,
        "content": "70-410 Question."
      },
      {
        "date": "2021-01-18T13:22:00.000Z",
        "voteCount": 1,
        "content": "there was a similar question for 70-410 but the answer was NUMA because it was looking for the quickest way to access memory -\n\n\"\nYou have a new server named Server1 that runs Windows Server 2012 R2. Server1 has two dual-core processors and 32 GB of RAM. You install the Hyper-V server role on Server1. You create two virtual machines on Server1 that each have 8 GB of memory.\n\nYou need to minimize the amount of time it takes for both virtual machines to access memory.\nWhat should you configure on each virtual machine?\n\""
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 80,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27570-exam-70-412-topic-3-question-245-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>The domain contains client computers that run either Windows XP, Windows 7, or Windows 8.<br>Network Policy Server (NPS) is deployed to the domain.<br>You plan to create a system health validator (SHV).<br>You need to identify which policy settings can be Applied to all of the computers.<br>Which three policy settings should you identify? (Each correct answer presents part of the solution.<br>Choose three.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA firewall is enabled for all network connections.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAn antispyware application is on.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAutomatic updating is enabled.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAntivirus is up to date.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAntispyware is up to date."
    ],
    "answer": "ACD",
    "answerDescription": "* System health agent (SHA) is a NAP component.<br>* System health agent (SHA)<br>A component that checks the state of the client computer to determinewhether the settings monitored by the SHA are up-to-date and configured correctly.<br>For example, the Windows Security Health Agent (WSHA) can monitor Windows Firewall, whether antivirus software is installed, enabled, and updated, whether antispyware software is installed, enabled, and updated, and whether Microsoft Update Services is enabled and the computer has the most recent security updates from Microsoft Update Services.<br>There might also be SHAs (and corresponding system health validators) available from other companies that provide different functionality.",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-28T10:34:00.000Z",
        "voteCount": 1,
        "content": "I remember this from 70-411"
      },
      {
        "date": "2020-08-07T11:27:00.000Z",
        "voteCount": 1,
        "content": "It's not 70-412 question..."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 81,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18809-exam-70-412-topic-3-question-249-discussion/",
    "body": "Your network contains an Active Directory domain named adatum.com.<br>You have a standard primary zone named adatum.com.<br>You need to provide a user named User1 the ability to modify records in the zone. Other users must be prevented from modifying records in the zone.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Zone Signing Wizard for the zone.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of the zone, change the zone type.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the new Delegation Wizard for the zone.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of the zone, modify theStart Of Authority (SOA) record."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-18T13:54:00.000Z",
        "voteCount": 1,
        "content": "B - you need to be Active Directory integrated to get that security tab and edit permissions, right?"
      },
      {
        "date": "2020-07-11T18:34:00.000Z",
        "voteCount": 4,
        "content": "70-411 Question and answer should be - B"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 82,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18812-exam-70-412-topic-3-question-250-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>All domain controllers run Windows Server 2012. One of the domain controllers is named DC1.<br>The DNS zone for the contoso.com zone is Active Directory-integrated and has the default settings.<br>A server named Server1 is a DNS server that runs a UNIX-based operating system.<br>You plan to use Server1 as a secondary DNS server for the contoso.com zone.<br>You need to ensure that Server1 can host a secondary copy of the contoso.com zone.<br>Whatshould you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows PowerShell, run the Set-DnsServerForwarder cmdlet and specify the contoso.com zone as a target.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows PowerShell, run the Set-DnsServerSetting cmdlet and specify DC1 as a target.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows PowerShell, run theSet-DnsServerPrimaryZone cmdlet and specify the contoso.com zone as a target.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom DNS Manager, modify the Advanced settings of DC1."
    ],
    "answer": "C",
    "answerDescription": "C. The Set-DnsServerSecondaryZone cmdletchanges settings for an existing secondary zone on aDomain Name System (DNS) server. http://technet.microsoft.com/en-us/library/jj649920(v=wps.620).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-03T18:25:00.000Z",
        "voteCount": 1,
        "content": "Answer C says \"Set-DnsServerPrimaryZone\" but explanation says \"Set-DnsServerSecondaryZone\" - watch out for typo, tricky."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 83,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24703-exam-70-412-topic-3-question-253-discussion/",
    "body": "Your network contains an Active Directory forest named contoso.com. The forest contains two sites named Main and Branch. The Main site contains 400 desktop computers and the Branch site contains 150 desktop computers. All of the desktop computers run Windows 8.<br>In Main, the network contains a member server named Server1 that runs Windows Server 2012.<br>You install the Windows Server Update Services server role on Server1.<br>You need to ensure that Windows updates obtained from Windows Server Update Services (WSUS) are the same for the computers in each site.<br>You want to achieve this goal by using the minimum amount of administrative effort.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Update Services console, create computer groups.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Update Services console, configure the Computers options.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Group Policy Management console, configure the Windows Update settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Group Policy Management console, configure the Windows Anytime Upgrade settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Update Services console, configure the Synchronization Schedule options."
    ],
    "answer": "C",
    "answerDescription": "Create one computer group for Main site and another group for Branch site.<br>You can deploy Windows updates by computer group.",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-11T18:49:00.000Z",
        "voteCount": 1,
        "content": "I believe C is the correct answer, but it's a 70-411 question anyway.\nhttps://www.briefmenow.org/microsoft/you-need-to-ensure-that-windows-updates-obtained-from-windows-server-update-services-wsus-are-the-same-for-the-computers-in-each-site-2/"
      },
      {
        "date": "2020-07-03T18:32:00.000Z",
        "voteCount": 1,
        "content": "https://www.rootusers.com/create-computer-groups-for-wsus/#:~:text=To%20create%20a%20new%20computer,targeting%20or%20client%20side%20targeting."
      },
      {
        "date": "2020-07-03T18:31:00.000Z",
        "voteCount": 1,
        "content": "Looks like the explanation should be using answer A, not C. Explanation matches answer A."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 84,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34815-exam-70-412-topic-3-question-257-discussion/",
    "body": "Which of the following must you back up or have a copy of to be able to ensure that you can restore an AD RMS cluster in the event that a single server hosting all<br>AD RMS components suffers complete data loss? (Choose three answers.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCluster key password",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrusted publishing domain",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrusted user domain",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAD RMS databases"
    ],
    "answer": "ABD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-19T02:18:00.000Z",
        "voteCount": 2,
        "content": "The answer (ABD) is correct.\n\nThe three steps that you can do that will allow you to recover from any AD RMS failure are:\n\n- Know your cluster  key password and store it somewhere safe\n- Export Trusted Publishing Domain\n- Create database backups\n\nhttps://social.technet.microsoft.com/wiki/contents/articles/8059.disaster-recovery-preparation-for-ad-rms.aspx"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 85,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27566-exam-70-412-topic-3-question-268-discussion/",
    "body": "The Wingtip Toys forest hosts a web application that users in the Tailspin Toys forest need to access. You are the system administrator at Wingtip Toys. A single federation server is present in each forest and you are configuring a federated trust.<br>Which of the following statements are true about the deployment solution? (Choose all that apply.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe AD FS server in the Tailspin Toys forest will function as the claims-provider server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe AD FS server in the Tailspin Toysforest will function as the relying-party server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a relying-party trust on the Wingtip Toys AD FS server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a claims-provider trust on the Wingtip Toys AD FS server."
    ],
    "answer": "AD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-18T20:23:00.000Z",
        "voteCount": 1,
        "content": "Hahaha isn't this the same as the previous question?\n\nThe side with a webapp is the Relying Party - they rely on claims to prove users can gain access.\nThe side who wants to access the webapp is the Claims Provider.  They provide claims that they are who they say they are, in order to gain access.\nAs we know, the direction of the trust is opposite of the direction of the access. So, the relying party (side with webapp) needs a claims-provider trust, and the Claims provider (side who needs to access webapp) needs a relying-party trust. \"I trust you - you can go through my stuff.\""
      },
      {
        "date": "2021-01-20T14:26:00.000Z",
        "voteCount": 1,
        "content": "In conclusion - B and C are correct again.  Same question"
      },
      {
        "date": "2020-08-10T17:42:00.000Z",
        "voteCount": 1,
        "content": "Ok, now I get it:\nIf you have the users, you have to configure your server to trust the Relying Party's server. (Configure a relying party trust)\nIf you have the web app, you have to configure your server to trust the clams provider's server. (Configure a Claims Provider trust)"
      },
      {
        "date": "2020-08-07T11:04:00.000Z",
        "voteCount": 1,
        "content": "Now I'm really confused on the trusts. I thought the claims-provder server configured the relying party trust, and the relying party server configured the claims provider trust? Time for some technet..."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 86,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34819-exam-70-412-topic-3-question-273-discussion/",
    "body": "The root domain of the Adatum forest is Adatum.local. The contoso.com domain tree is part of the Adatum forest. Don has an account in the australia.contoso.com domain and is signing on to a computer that is a member of the computers.adatum.local domain.<br>No additional UPNs have been configured. Which UPN suffix will Don use to sign on to this computer?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t@adatum.com",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t@adatum.local",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t@computers.adatum.local",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t@australia.contoso.com"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-19T02:49:00.000Z",
        "voteCount": 1,
        "content": "The proposed answer \"B\" is correct.\n\nThere are no additional UPNs configured so the default UPN suffix for a forest is the forest root domain (Adatum.local)."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 87,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24704-exam-70-412-topic-3-question-274-discussion/",
    "body": "You have configured a forest trust relationship between the Adatum forest and the Contoso forest. You want to ensure that users from the Contoso forest can authenticate only when needing to access resources in the Adatum forest using the username@secure.contoso.com UPN rather than any other UPN that is available for them.<br>Which of the following should you use to accomplish this goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSID filtering",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tName suffix routing",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tShortcut trust",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExternal trust"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-03T19:53:00.000Z",
        "voteCount": 2,
        "content": "Gold Mine on trusts, including Name Suffix Routing: \nhttps://www.microsoftpressstore.com/articles/article.aspx?p=2217267&amp;seqNum=3"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 88,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27574-exam-70-412-topic-3-question-285-discussion/",
    "body": "Your network contains one Active Directory forest named contoso.com.<br>The forest contains a single domain.<br>The domain contains the domain controllers is configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0060400001.png\" class=\"in-exam-image\"><br><br>The replication topology is configured as shown in the following output.<br><img src=\"/assets/media/exam-media/02140/0060500001.png\" class=\"in-exam-image\"><br>You discover that replication between Dc1 and DC3 takes a few hours.<br>You need to reduce the amount of time it takes to replicate Active Directory changes between DC1 and DC3.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a site link that connects Site1 and Site3, has a cost of 350, and replicates every 15 minutes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify SiteLink4to replicate every 15minute.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable Site Link bridging.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the cost of SiteLink4 to 100.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the cost of SiteLink1 to 50"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-25T20:29:00.000Z",
        "voteCount": 1,
        "content": "\"If should be 1-2, 2-3, 3-4, 1-4, the correct answer could be D. because reducing the cost of synchronization between DC3 and DC4, DC3 can replicate faster with DC2 which in turn can replicate faster with DC1.\"\nhttps://www.briefmenow.org/microsoft/you-need-to-reduce-the-amount-of-time-it-takes-to-replicate-active-directory-changes-between-dc1-and-dc3"
      },
      {
        "date": "2020-08-07T12:41:00.000Z",
        "voteCount": 1,
        "content": "Link list I was trying to post should read:\nLink 1:  Site 2 / Site 4 - 60-min - Cost 100\nLink 2:  Site 2 / Site 4 - 60-min - Cost 100\nLink 3:  Site 3 / Site 4 - 60-min - Cost 100\nLink 4:  Site 2 / Site 4 - 45-min - Cost 400"
      },
      {
        "date": "2020-08-07T12:40:00.000Z",
        "voteCount": 1,
        "content": "Question is really confusing since Site 1 is not on ANY of these site links.\nLink 1:  Site 2 / Site 4 - 60-min - Cost 100\nLink 2:  Site 2 / Site 4 - 60-min - Cost 100\nLink 2:  Site 3 / Site 4 - 60-min - Cost 100\nLink 2:  Site 2 / Site 4 - 45-min - Cost 400\nPer the shown output. Site 1 is nowhere in the output, so how does it replacate?? Is the DEFAULT-FIRST-IP-SITE-LINK still present with default values and all sites in it? That makes no sense as DC1 &gt; DC3 replication would be 30 minutes if that were the case. (If I recall the default cost = 100 &amp; default replication schedule = 30 min)\nThe question as-shown doesn't have enough / correct information to solve the problem."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 89,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19034-exam-70-412-topic-3-question-289-discussion/",
    "body": "HOTSPOT -<br>You run Get-FSRMClassificationule and you receive the following output<br><img src=\"/assets/media/exam-media/02140/0061200001.png\" class=\"in-exam-image\"><br>You have a file named file1 that is stored on drive D and has the following content \"111000000000111111\"<br>You run the classification with all of the rules<br>Use the drop-down menus to select the answer choice that completes each statement.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0061300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0061400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-04T19:10:00.000Z",
        "voteCount": 1,
        "content": "If I'm reading these rules correctly based on the 30-minute google-search crash course in .NET Regular Expression language, the file classification RE value is met by the file content, and the folder classification is met because all it requires is the folder being on the D: drive/volume, so both properties are set on the file. Best guess."
      },
      {
        "date": "2020-07-04T18:57:00.000Z",
        "voteCount": 1,
        "content": "So I'm guessing based on the link immediately above that the Regular Expression value of {\\d{2,}} translates as \"find any two decimal digits followed by *anything* [the comma in effect being a wide-open wildcard]\" ? Am I correct on this?"
      },
      {
        "date": "2020-07-04T18:51:00.000Z",
        "voteCount": 1,
        "content": "Regular Expression Language Quick Reference: https://docs.microsoft.com/en-us/dotnet/standard/base-types/regular-expression-language-quick-reference"
      },
      {
        "date": "2020-07-04T18:47:00.000Z",
        "voteCount": 1,
        "content": "Regular Expressions In .Net:\nhttps://docs.microsoft.com/en-us/dotnet/standard/base-types/regular-expressions?redirectedfrom=MSDN"
      },
      {
        "date": "2020-07-04T18:34:00.000Z",
        "voteCount": 1,
        "content": "A bit on \"Regular Expression\" values in classification rules, still clear as mud...\n\nhttps://docs.microsoft.com/en-us/windows-server/identity/solution-guides/deploy-automatic-file-classification--demonstration-steps-#:~:text=A%20regular%20expression%20classification%20rule,resource%20property%20can%20be%20configured."
      },
      {
        "date": "2020-07-04T18:30:00.000Z",
        "voteCount": 1,
        "content": "Ok, this link gives some clues, see section 9 in particular: https://www.interfacett.com/blogs/using-file-server-resource-manager-fsrm-locate-classify-sensitive-data-credit-card-numbers-stored-inside-documents"
      },
      {
        "date": "2020-07-04T18:14:00.000Z",
        "voteCount": 1,
        "content": "Completely lost on this one. I'm not able to find anything in search that tells me how to read the output of this CMDLET."
      },
      {
        "date": "2020-04-24T22:21:00.000Z",
        "voteCount": 3,
        "content": "Answer is wrong - \nProperty1 set to value1 and property2 set to value2\n&amp;\nThe value of Property1 and Property2 are"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 90,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27981-exam-70-412-topic-3-question-291-discussion/",
    "body": "Note: This question is part of series of questions that use the same or similar answer choices.<br>An answer choice may be correct for more than one question in the series.<br>Each question is independent of the other questions in this series.<br>Information and details provided in a question apply only to that question.<br>Your network contains one Active Directory forest named contoso.com.<br>The forest contains two child domains and six domain controllers.<br>The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0061500001.png\" class=\"in-exam-image\"><br><br>You need to add an additional UPN Suffix.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADSite",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADReplicationSite",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADDomain",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADReplicationSiteLink",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADGroup",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADForest",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetdom"
    ],
    "answer": "F",
    "answerDescription": "https://technet.microsoft.com/en-us/library/dd391925(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-10T17:05:00.000Z",
        "voteCount": 2,
        "content": "From the provided technet link: \"The following example demonstrates how to create a new UPN suffix for the users in the Fabrikam.com forest:\n\nSet-ADForest -UPNSuffixes @{Add=\"headquarters.fabrikam.com\"}\""
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 91,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27984-exam-70-412-topic-3-question-292-discussion/",
    "body": "Note: This question is part of series of questions that use the same or similar answer choices.<br>An answer choice may be correct for more than one question in the series.<br>Each question is independent of the other questions in this series.<br>Information and details provided in a question apply only to that question.<br>Your network contains one Active Directory forest named contoso.com.<br>The forest contains two child domains and six domain controllers.<br>The domain controllers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02140/0061600001.png\" class=\"in-exam-image\"><br><br>You need to replicate users who haven't authenticated against any domain controllers for the last 7 days.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADSite",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADReplicationSite",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADDomain",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADReplicationSiteLink",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADGroup",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-ADForest",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetdom"
    ],
    "answer": "C",
    "answerDescription": "https://technet.microsoft.com/en-us/library/ee617212.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-10T17:51:00.000Z",
        "voteCount": 1,
        "content": "-LastLogonReplicationInterval \"XX\" ( https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/ee617212(v=technet.10)?redirectedfrom=MSDN )"
      },
      {
        "date": "2021-01-20T15:43:00.000Z",
        "voteCount": 1,
        "content": "nice!\nLastLogonReplicationInterval -\nSpecifies the time, in days, within which the last logon time of an account must be replicated across all domain controllers in the domain"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 92,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37727-exam-70-412-topic-3-question-293-discussion/",
    "body": "HOTSPOT -<br>You have the following Microsoft azure backup policy<br>backup schedule : 9:00am, 12:00 pm,11:00 pm<br>every day<br>every 1 week(s)<br>dslist : {datasource<br>datasourceid:1576400609127590137<br>name:c:\\<br>filespec:filespec<br>filespec:c:\\<br>isexclude:false<br>isrecursive:true<br>}<br>policyname : f77828d2-69b6-4c4b-b98a-e5e20d9ab7e9<br>retentionpolicy : retention days : 30<br>week1yltrsschedule :<br>days: monday<br>times: 12:00:00,<br>retentention weeks: 60<br>month1yltrschedule :<br>days of month : [last,monday]<br>times: 23:00:00<br>retentention weeks: 90<br>yearly ltrschedule :<br>yearly schedule is not set<br>state : existing<br>policystate : valid<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0061800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0061900001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-24T22:25:00.000Z",
        "voteCount": 1,
        "content": "Nver mind I did not see the hours"
      },
      {
        "date": "2020-11-24T22:24:00.000Z",
        "voteCount": 1,
        "content": "Last monday is set to 90, did I read wrong"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 93,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19038-exam-70-412-topic-3-question-296-discussion/",
    "body": "HOTSPOT -<br>Your network contains one active directory domain.<br>The domain contains the servers configured as shown in the following table: server1 domain controllers<br><br>DNS server -<br>server2 domain controllers<br><br>DNS server -<br>server3 DNS server<br>Server1 has the zones shown in the following table:<br><img src=\"/assets/media/exam-media/02140/0062100001.png\" class=\"in-exam-image\"><br><br>Server3 has the following output:<br><img src=\"/assets/media/exam-media/02140/0062200001.png\" class=\"in-exam-image\"><br><br>Use the drop-down list to select the answer choice that completes each assignment.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02140/0062200002.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0062300001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-04T19:42:00.000Z",
        "voteCount": 3,
        "content": "\"Is Disintegrated\" I am guessing means NOT AD-integrated, so according to the table only Adatum.com is AD-integrated, I thought a zone had to be AD-integrated to be secured with DNSSEC, and i would have said servers 1 &amp; 3 only because according to the table, Contoso.com is \"disintegrated\" ie: NOT AD-Integrated, so why would it's permissions settings be redident on the Domain Controller (Server 2)?"
      },
      {
        "date": "2020-04-24T23:11:00.000Z",
        "voteCount": 3,
        "content": "Table in the question is broken ?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 94,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11409-exam-70-412-topic-3-question-299-discussion/",
    "body": "HOTSPOT -<br>Your network contains one Active Directory forest named adatum.com. The forest contains a single domain.<br>The site topology for the forest is shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0062500001.jpg\" class=\"in-exam-image\"><br>Each site contains one domain controller.<br>You need to ensure that replication between Site2 and Site4 occurs in 15 minutes or less.<br>What command should you run? To answer, select the appropriate options in the answer area.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02140/0062600001.png\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://technet.microsoft.com/en-us/library/hh852320(v=wps.630).aspx https://technet.microsoft.com/en-us/library/cc753764(v=ws.10).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-04T19:57:00.000Z",
        "voteCount": 2,
        "content": "New-ADReplicationSiteLink -Name SiteLink6 -SitesIncluded Site2,Site4 -ReplicationFrequencyInMinutes 15 -Cost 70"
      },
      {
        "date": "2020-04-24T23:25:00.000Z",
        "voteCount": 3,
        "content": "No answer provided ?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 95,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19039-exam-70-412-topic-3-question-300-discussion/",
    "body": "Your network contains one Active Directory forest named adatum.com. The forest contains a single domain.<br>The site topology for the forest is shown in the exhibit. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02140/0062700001.jpg\" class=\"in-exam-image\"><br>Each site contains one domain controller. Site link bridging is disabled.<br>You need to ensure that changes made to Site1 replicate to Site5 within one replication cycle.<br>What should you create?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta site link",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta site link bridge",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta site",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta subnet"
    ],
    "answer": "B",
    "answerDescription": "References:<br>https://technet.microsoft.com/en-us/library/hh852295(v=wps.630).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-04T20:00:00.000Z",
        "voteCount": 3,
        "content": "Agree with Wazmac, but also the question specifically states that Site Link Bridges are *disabled* so for both reasons a Site Link would be apropriate."
      },
      {
        "date": "2020-04-24T23:40:00.000Z",
        "voteCount": 3,
        "content": "Shouldn't the answer be A - A Site Link\nThe site link bridge will enable the replication through multiple site links, but you need to do it in 1 cycle, so you need a Site Link. please correct me if I'm wrong."
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 96,
    "url": "https://www.examtopics.com/discussions/microsoft/view/109-exam-70-412-topic-3-question-301-discussion/",
    "body": "You have two servers named Server1 and Server2 that run Windows Server 2012 R2.<br>You have a Microsoft Azure subscription that has two backup vaults named Vault1 and Vault2.<br>Server1 is backed up to Vault1. The backup of Server1 contains a file named Data.db. Server2 is backed up to Vault2.<br>You download vault credential files for Vault1 and Vault2.<br>Server1 experiences a severe hardware failure and will not start.<br>You need to recover a copy of Data.db to Server2.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Management Portal, modify the configuration of Vault1. On Server2, run the Recover Data Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Server2, modify the logon settings for the Microsoft Azure Recovery Services Agent service, and then run the Recover Data Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Server1, run the Recover Data Wizard, and then click This server. When the wizard completes, copy the files.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Management Portal, add the certificate of Server2 as a management certificate. On Server2, run the Recover Data Wizard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Server1, run the Recover Data Wizard, and then click Another server. When the wizard completes, copy the files."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-19T12:24:00.000Z",
        "voteCount": 2,
        "content": "The answer shold be: \n\nFrom Server2, copy the Vault1 credentials and the passphrase. Run the Recover data Wizard.\n\nThe most similar is \"A\"\n\nSee Question #2: https://www.examtopics.com/exams/microsoft/70-412/view/43/\n\nWe need the Vault1 credentials to be able to access the data in Vault1.\nWe need the passphrase of Server1 to access the backup that was made on Server1.\nReferences: Microsoft Azure - Cloud Backup and Recovery\nhttp://blogs.technet.com/b/rmurphy/archive/2014/12/02/microsoft-azure-backup.aspx"
      },
      {
        "date": "2021-01-20T19:58:00.000Z",
        "voteCount": 1,
        "content": "I agree - the given answer is wrong because that server is dead, and in the MS tutorial you linked, they don't mention the Microsoft Azure Recovery Services Agent service at all, but they do mention reccommend using Instant Restore with Recovery Services vaults in the Azure portal."
      },
      {
        "date": "2019-01-26T10:05:00.000Z",
        "voteCount": 4,
        "content": "Answer should be B  https://docs.microsoft.com/en-us/azure/backup/backup-azure-restore-windows-server#use-instant-restore-to-restore-data-to-an-alternate-machine"
      },
      {
        "date": "2019-01-26T09:50:00.000Z",
        "voteCount": 4,
        "content": "How are you going to restore the backup on Server1, if it experienced a severe hardware failure and won't start?"
      }
    ],
    "examNameCode": "70-412",
    "topicNumber": "3"
  }
]