[
  {
    "topic": 5,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/52199-exam-az-140-topic-5-question-1-discussion/",
    "body": "You have an Azure Virtual Desktop host pool that runs Windows 10 Enterprise multi-session.<br>You need to configure automatic scaling of the host pool to meet the following requirements:<br>✑ Distribute new user sessions across all running session hosts.<br>✑ Automatically start a new session host when concurrent user sessions exceed 30 users per host.<br>What should you include in the solution?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure Automation account and the depth-first load balancing algorithm",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure Automation account and the breadth-first load balancing algorithm\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure load balancer and the breadth-first load balancing algorithm",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure load balancer and the depth-first load balancing algorithm"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-05-09T14:25:00.000Z",
        "voteCount": 41,
        "content": "B, this would be breadth first if you are distributing user sessions across all available hosts."
      },
      {
        "date": "2021-05-09T07:01:00.000Z",
        "voteCount": 14,
        "content": "Distribute new user sessions across all running session hosts = Correct Answer is B."
      },
      {
        "date": "2024-10-02T08:11:00.000Z",
        "voteCount": 1,
        "content": "It's B because Azure Automation Account: This allows you to create and manage runbooks that can automate the scaling of your host pool. You can set up scripts to monitor the number of active sessions and start new session hosts as needed.\nBreadth-First Load Balancing Algorithm: This algorithm distributes new user sessions across all running session hosts evenly. It ensures that no single host is overloaded by spreading the user sessions as evenly as possible. Option C and  D: Azure Load Balancer is typically used for distributing network traffic and does not directly manage user sessions in Azure Virtual Desktop."
      },
      {
        "date": "2023-08-25T10:03:00.000Z",
        "voteCount": 1,
        "content": "Breadth First ensures all Hosts are used before stacking sessions on single hosts. This is a Host Pool configuration. \n\nAzure Automation achieves the auto-scaling requirements. \nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/scaling-automation-logic-apps\n\nUsing A Scale plan would be a better solution for AVD going forward.\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/autoscale-scaling-plan?tabs=pooled-autoscale"
      },
      {
        "date": "2023-07-17T03:59:00.000Z",
        "voteCount": 1,
        "content": "B is correct"
      },
      {
        "date": "2022-12-11T02:28:00.000Z",
        "voteCount": 1,
        "content": "You can't use autoscale and scale session hosts using Azure Automation and Azure Logic Apps on the same host pool. You must use one or the other.\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/autoscale-scaling-plan"
      },
      {
        "date": "2022-09-16T13:23:00.000Z",
        "voteCount": 1,
        "content": "C since the Automation Account is not required anymore: https://docs.microsoft.com/en-us/azure/virtual-desktop/autoscale-scaling-plan"
      },
      {
        "date": "2022-09-16T13:25:00.000Z",
        "voteCount": 3,
        "content": "Nvm, it's not an Azure Load Balancer that does that, it's an Autoscale Plan, so B is correct."
      },
      {
        "date": "2022-05-10T03:16:00.000Z",
        "voteCount": 2,
        "content": "B is correct answer. https://docs.microsoft.com/en-us/azure/virtual-desktop/configure-host-pool-load-balancing#configure-breadth-first-load-balancing.   https://docs.microsoft.com/en-us/azure/virtual-desktop/set-up-scaling-script#how-the-scaling-tool-works"
      },
      {
        "date": "2022-04-07T02:40:00.000Z",
        "voteCount": 1,
        "content": "B is correct answer.\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/autoscale-scaling-plan#configure-a-schedule"
      },
      {
        "date": "2022-03-31T11:12:00.000Z",
        "voteCount": 1,
        "content": "Distributing sessions across all running hosts is of course breath-first."
      },
      {
        "date": "2021-11-04T21:35:00.000Z",
        "voteCount": 3,
        "content": "All, please read the question. \n~Automatically \"start a new session host\"  - \"NOT connect\" - when concurrent user sessions exceed 30 users per host. \n`VM is off to save money!! Automation \"will start\" new session, you see :)\n\n~We all agreed on B right?"
      },
      {
        "date": "2021-11-03T18:11:00.000Z",
        "voteCount": 2,
        "content": "Depth-first = loads up a host with all users to is session host max limit before going to the next host\nBreath-first = adds users across all hosts evenly\n\nWith that being stated, going with B."
      },
      {
        "date": "2022-01-08T16:34:00.000Z",
        "voteCount": 1,
        "content": "B is correct...."
      },
      {
        "date": "2021-08-10T02:02:00.000Z",
        "voteCount": 5,
        "content": "Option A is correct...\n1. Lets say you have 5 Session Hosts, only one is active and rest are turned off. (this is the only way you can meet requirement 2).\n2. Now to automatically power on the VM you need Azure Automation account, so last two options are gone, now you have option A and Option B.\n3. When you start with only one session host, then obviously when it reaches to the maximum session limit of 30, automation account will automatically power on the next VM.\n4. Now all the new sessions will use this new powered on VM because first VM is having 30 sessions already.\nWell this kind of load balancing itself is Depth-first load balancing, hence the correct answer is A."
      },
      {
        "date": "2022-08-03T10:47:00.000Z",
        "voteCount": 1,
        "content": "I had this question in a WhizzLabs test exam too and their answer was A"
      },
      {
        "date": "2022-08-03T10:52:00.000Z",
        "voteCount": 2,
        "content": "also, not sure if this is allowed here, but I include a link to a screenshot from the Whizlabs content:\nhttps://dirtdonthurt-my.sharepoint.com/:i:/g/personal/james_dirtdonthurt_co_uk/EZC7M_dAzgxHlRqDiLSbp34B6NToq29vav8dbpKDX6Ddng?e=d3N9Ow"
      },
      {
        "date": "2022-01-08T16:35:00.000Z",
        "voteCount": 1,
        "content": "Depth-first = carga un host con todos los usuarios hasta el límite máximo de host de sesión antes de pasar al siguiente host Breath-first = agrega usuarios en todos los hosts de manera uniforme."
      },
      {
        "date": "2021-10-18T15:31:00.000Z",
        "voteCount": 1,
        "content": "I disagree, I get your logic... but if you were using auto-scaling why would you have 4 VM's powered off and not in use? You would just have one provisioned until you hit 30 users - but in that scenario as you say it's depth first.\n\nWhat would make more sense to me is that you would have sufficient hosts powered on to satisfy your expected/normal user load so logins are not delayed by provisioning or powering on - so lets say 3 hosts for 90 sessions - you then want the session load balanced across all hosts, so breadth-first is the way to go.\n\nWhat you are saying is possible, but in my experience it would result in unhappy users if you get 85 people logging on in the morning; anyone beyond user 30 will have session host unavailable whilst their host(s) boot.\n\nWhen you get abnormal user load thats where the auto-scaling kicks in and stands up a new host.\n\nSo the given answer is correct imho."
      },
      {
        "date": "2023-11-06T10:12:00.000Z",
        "voteCount": 1,
        "content": "You start with one session host . Its on breadth first but because there is only one host on . It fills that host to 30 and starts a new host. Now it fills them both upto 30 using whichever is most empty (people can log off as well as on ) . \nIts dumb though because there is no automation to turn the system off again.  So once it triggers once the new device will come on and stay on. \nIt should have a depth first requirement but that's not what the question asks for it says they must distribute across the available hosts .\n\nNote also it doesn't say by default 1 runs . They might run 3 as a minimum at all times . Or only turn a host off if it has no connections etc. Which would mean the running system would need a consistent downtime to reset itself."
      },
      {
        "date": "2021-08-05T00:08:00.000Z",
        "voteCount": 4,
        "content": "It's B. I think the main reason it is B and A is: \nDistribute new user sessions &gt;&gt;&gt; across all &lt;&lt;&lt; running session hosts.\nBoth do the same, accept Depth will load a host session to the max and then will use another host. Breadth is spread equally. (across all)"
      },
      {
        "date": "2021-07-20T05:23:00.000Z",
        "voteCount": 1,
        "content": "D. Surely it is Depth first as you are filling up the \"running\" hosts first not all hosts to the max limit of 30 user before the next host is \"started\""
      },
      {
        "date": "2021-06-23T01:23:00.000Z",
        "voteCount": 1,
        "content": "My guess correct answer should be D. there is no related automation account. this is a load balancer mechanism. right?"
      },
      {
        "date": "2021-07-11T14:34:00.000Z",
        "voteCount": 2,
        "content": "No. Load balancing is handled by Azure by selecting Breadth/Depth options."
      },
      {
        "date": "2021-06-11T02:47:00.000Z",
        "voteCount": 2,
        "content": "full link https://docs.microsoft.com/en-us/azure/virtual-desktop/configure-host-pool-load-balancing#configure-breadth-first-load-balancing"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/76257-exam-az-140-topic-5-question-2-discussion/",
    "body": "HOTSPOT -<br>You have an Azure Virtual Desktop deployment that contains a host pool named Pool1. Pool1 contains two session hosts.<br>Pool1 is configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04272/0016600001.png\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04272/0016700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04272/0016800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-desktop/configure-host-pool-load-balancing",
    "votes": [],
    "comments": [
      {
        "date": "2022-05-24T13:13:00.000Z",
        "voteCount": 13,
        "content": "Service updates happen monthly. If there are major issues, critical updates will be provided at a more frequent pace."
      },
      {
        "date": "2023-06-03T06:13:00.000Z",
        "voteCount": 1,
        "content": "Service updates happen monthly. \nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/configure-validation-environment?tabs=azure-portal"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/52230-exam-az-140-topic-5-question-3-discussion/",
    "body": "You have an Azure Virtual Desktop host pool named Pool1 and an Azure Automation account named Account1. Pool1 is integrated with an Azure Active Directory<br>Domain Services (Azure AD DS) managed domain named contoso.com.<br>You plan to configure scaling for Pool1 by using Azure Automation runbooks.<br>You need to authorize the runbooks to manage the scaling of Pool1. The solution must minimize administrative effort.<br>What should you configure?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta managed identity in Azure Active Directory (Azure AD)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta group Managed Service Account (gMSA) in Azure AD DS",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Connections shared resource in Azure Automation",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Run As account in Azure Automation"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 14,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 5,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-05-09T14:27:00.000Z",
        "voteCount": 13,
        "content": "Correct"
      },
      {
        "date": "2023-07-12T05:47:00.000Z",
        "voteCount": 6,
        "content": "This is the statement from Microsoft regarding this question. The answer is A because D will be deprecated on September 30, 2023.\n\n Important\n\nAzure Automation Run As Account will retire on September 30, 2023 and will be replaced with Managed Identities. Before that date, you'll need to start migrating your runbooks to use managed identities. For more information, see migrating from an existing Run As accounts to managed identity to start migrating the runbooks from Run As account to managed identities before 30 September 2023."
      },
      {
        "date": "2024-05-02T05:53:00.000Z",
        "voteCount": 1,
        "content": "A. a managed identity"
      },
      {
        "date": "2024-02-18T05:14:00.000Z",
        "voteCount": 2,
        "content": "\"A managed identity from Microsoft Entra ID allows your runbook to easily access other Microsoft Entra protected resources. The identity is managed by the Azure platform and doesn't require you to provision or rotate any secrets. For more information about managed identities in Microsoft Entra ID, see Managed identities for Azure resources.\n\nManaged identities are the recommended way to authenticate in your runbooks, and is the default authentication method for your Automation account.\"\n\nhttps://learn.microsoft.com/en-us/azure/automation/automation-security-overview"
      },
      {
        "date": "2024-01-31T07:36:00.000Z",
        "voteCount": 1,
        "content": "A. a managed identity in Azure Active Directory (Azure AD)"
      },
      {
        "date": "2023-12-25T08:15:00.000Z",
        "voteCount": 1,
        "content": "A should be the correct answer.\n\nAs of April 1, 2023, Run As accounts no longer work. recommended to use managed identities instead"
      },
      {
        "date": "2023-11-07T06:07:00.000Z",
        "voteCount": 2,
        "content": "A\nAzure Automation Run as accounts, including Classic Run as accounts have retired on 30 September 2023 and replaced with Managed Identities. You would no longer be able to create or renew Run as accounts through the Azure portal.\nhttps://learn.microsoft.com/en-us/azure/automation/migrate-run-as-accounts-managed-identity?tabs=sa-managed-identity"
      },
      {
        "date": "2023-06-03T06:19:00.000Z",
        "voteCount": 2,
        "content": "I take answer A because the Microsoft exam should adapt to the changes.\nNow that you have an Azure Automation account, you'll also need to set up a managed identity if you haven't already. Managed identities will help your runbook access other Azure AD-related resources as well as authenticate important automation processes.\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/set-up-scaling-script#create-a-managed-identity"
      },
      {
        "date": "2023-05-31T16:30:00.000Z",
        "voteCount": 1,
        "content": "The answer is A"
      },
      {
        "date": "2023-04-27T04:20:00.000Z",
        "voteCount": 2,
        "content": "A should be correct now but D was before\n\nAs of April 1, 2023, Run As accounts no longer work. We recommend you use managed identities instead. \n\nAnother great MS question. I wander if they accept both on the exam\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/set-up-scaling-script#create-a-managed-identity"
      },
      {
        "date": "2023-02-21T12:55:00.000Z",
        "voteCount": 1,
        "content": "A is correct (preferred), D is technically possible\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/set-up-scaling-script\nThis scaling tool uses a Run As account with Azure Automation. Azure Automation Run As accounts will retire on September 30, 2023. Microsoft won't provide support beyond that date. From now through September 30, 2023, you can continue to use Azure Automation Run As accounts. This scaling tool won't be updated to create the resources using managed identities, however, you can transition to use managed identities and will need to before then. For more information, see Migrate from an existing Run As account to a managed identity."
      },
      {
        "date": "2022-12-20T06:57:00.000Z",
        "voteCount": 2,
        "content": "managed identity\nA managed identity from Azure Active Directory (Azure AD) allows your runbook to easily access other Azure AD-protected resources. The identity is managed by the Azure platform and doesn't require you to provision or rotate any secrets."
      },
      {
        "date": "2022-11-18T11:38:00.000Z",
        "voteCount": 2,
        "content": "A is correct since Run as account will be removed\n\n\"Azure Automation Run As Account will retire on September 30, 2023 and will be replaced with Managed Identities.\"\n\nhttps://learn.microsoft.com/en-us/azure/automation/automation-security-overview"
      },
      {
        "date": "2022-10-30T08:05:00.000Z",
        "voteCount": 1,
        "content": "You can use both but manage identity minimize administrative effort. Strongly recommended to use by MS. I am using it a lot."
      },
      {
        "date": "2022-09-28T00:07:00.000Z",
        "voteCount": 1,
        "content": "The solution must minimize administrative effort."
      },
      {
        "date": "2022-09-08T01:46:00.000Z",
        "voteCount": 3,
        "content": "The answer is A.\nEven back in 2021 MS was recommending Managed Identities for this task:\n\n\"Managed identities would be the recommended method for runbook authentication going forward. Read the the guidance to migrate existing Run As accounts to Managed identities\"\n\nhttps://azure.microsoft.com/en-us/updates/azure-automation-managed-identities-ga/"
      },
      {
        "date": "2022-08-23T07:19:00.000Z",
        "voteCount": 3,
        "content": "I'd go with \"A\" - Managed Identity as it respects minizing administrative effort.\n\n\"The identity is managed by the Azure platform and users could eliminate the management overhead associated with managing Run As Account in the runbook code.\"\n\nhttps://azure.microsoft.com/en-us/updates/azure-automation-managed-identities-ga/"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/52231-exam-az-140-topic-5-question-4-discussion/",
    "body": "You have an Azure Virtual Desktop host pool named Pool1 that runs Windows 10 Enterprise multi-session hosts.<br>You need to use Performance Monitor to troubleshoot a low frame quality issue that is affecting a current use session to Pool1.<br>What should you run to retrieve the user session ID?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-ComputerInfo",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tqwinsta\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\twhoami",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet-LocalUser"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 7,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-05-11T23:11:00.000Z",
        "voteCount": 13,
        "content": "B. qwinsta\n\nhttps://docs.microsoft.com/en-us/windows-server/administration/windows-commands/qwinsta"
      },
      {
        "date": "2021-05-09T14:33:00.000Z",
        "voteCount": 5,
        "content": "Correct"
      },
      {
        "date": "2024-01-31T07:39:00.000Z",
        "voteCount": 1,
        "content": "B. qwinsta"
      },
      {
        "date": "2022-11-04T10:30:00.000Z",
        "voteCount": 1,
        "content": "No doubt! It's qwinsta command :)"
      },
      {
        "date": "2022-09-08T01:51:00.000Z",
        "voteCount": 4,
        "content": "correct. and fun to say."
      },
      {
        "date": "2022-04-05T03:04:00.000Z",
        "voteCount": 2,
        "content": "B is correct answer. \n\nhttps://docs.microsoft.com/en-gb/learn/modules/monitor-manage-performance-health/6-diagnose-graphics-performance-issues"
      },
      {
        "date": "2021-05-27T07:08:00.000Z",
        "voteCount": 4,
        "content": "Correct"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/53655-exam-az-140-topic-5-question-5-discussion/",
    "body": "You have an Azure subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/04272/0017000001.png\" class=\"in-exam-image\"><br>Which resources can you back up by using Azure Backup?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWVDVM-0 and share1 only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWVDVM-0 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWVDVM-0, Image1, and Image2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWVDVM-0, share1, and Image1 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWVDVM-0, share1, Image1, and Image2"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 8,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-05-27T07:08:00.000Z",
        "voteCount": 13,
        "content": "A is correct"
      },
      {
        "date": "2024-01-31T07:41:00.000Z",
        "voteCount": 1,
        "content": "A. WVDVM-0 and share1 only"
      },
      {
        "date": "2023-10-06T13:30:00.000Z",
        "voteCount": 1,
        "content": "A is correct.\n\nhttps://learn.microsoft.com/en-us/azure/backup/backup-overview#what-can-i-back-up"
      },
      {
        "date": "2023-06-30T08:44:00.000Z",
        "voteCount": 1,
        "content": "The answer is C. See below the list of what Azure Backup can back up:\nOn-premises - Back up files, folders, system state using the Microsoft Azure Recovery Services (MARS) agent. Or use the DPM or Azure Backup Server (MABS) agent to protect on-premises VMs (Hyper-V and VMware) and other on-premises workloads\nAzure VMs - Back up entire Windows/Linux VMs (using backup extensions) or back up files, folders, and system state using the MARS agent.\nAzure Managed Disks - Back up Azure Managed Disks\nAzure Files shares - Back up Azure File shares to a storage account\nSQL Server in Azure VMs - Back up SQL Server databases running on Azure VMs\nSAP HANA databases in Azure VMs - Backup SAP HANA databases running on Azure VMs\nAzure Database for PostgreSQL servers - Back up Azure PostgreSQL databases and retain the backups for up to 10 years\nAzure Blobs - Overview of operational backup for Azure Blobs"
      },
      {
        "date": "2023-06-30T08:51:00.000Z",
        "voteCount": 2,
        "content": "NM, I retract this post. I realized that C has listed \"Image1\" that cannot be backed up using Azure backups."
      },
      {
        "date": "2023-06-03T06:24:00.000Z",
        "voteCount": 1,
        "content": "Agree that A is the correct answer"
      },
      {
        "date": "2022-11-18T11:43:00.000Z",
        "voteCount": 1,
        "content": "Should be A"
      },
      {
        "date": "2022-07-14T03:14:00.000Z",
        "voteCount": 2,
        "content": "A is correct. For recommendation, Pooled VM should not be backup but just delete and provision again even backup can apply. \n\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/faq#how-does-azure-virtual-desktop-handle-backups-"
      },
      {
        "date": "2022-05-10T04:10:00.000Z",
        "voteCount": 2,
        "content": "A is correct.  https://docs.microsoft.com/en-us/azure/backup/backup-overview#what-can-i-back-up"
      },
      {
        "date": "2022-04-07T02:52:00.000Z",
        "voteCount": 2,
        "content": "A is correct answer."
      },
      {
        "date": "2021-08-10T02:18:00.000Z",
        "voteCount": 4,
        "content": "Correct options is A\nOnly VM and Azure files can be backed up in Azure Backup.\nAzure Storage Blob backup in background is not Azure backup solution though in background it uses backup services vault solution but it is more like a local backup solution."
      },
      {
        "date": "2021-07-25T15:01:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/backup/blob-backup-overview      https://docs.microsoft.com/en-us/azure/backup/blob-backup-configure-manage"
      },
      {
        "date": "2021-07-13T04:40:00.000Z",
        "voteCount": 2,
        "content": "Hi guys, I think it is C. Azure blobs can be backed up as well: https://docs.microsoft.com/en-us/azure/backup/blob-backup-overview\n\nso, we can backup image stored on blob storage. Please elaborate if I have understand it wrong."
      },
      {
        "date": "2022-01-09T08:24:00.000Z",
        "voteCount": 1,
        "content": "A is correct.  \nCheck https://stackoverflow.com/questions/66236403/how-to-backup-azure-custom-managed-image"
      },
      {
        "date": "2021-07-15T23:58:00.000Z",
        "voteCount": 5,
        "content": "Blob Storage cannot be backed up, only SQL on Azure VM's, On-prem Servers, Azure VM's and Azure Files (there is also a SAP related product, but I've never used it/ had experience with it from a Backup perspective)\n\nThe answer is A"
      },
      {
        "date": "2022-03-23T18:23:00.000Z",
        "voteCount": 1,
        "content": "If Share1 can be backed up because it is a storage account."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/53656-exam-az-140-topic-5-question-6-discussion/",
    "body": "DRAG DROP -<br>You have an Azure Virtual Desktop host pool named Pool1. Pool1 contains session hosts that use FSLogix profile containers hosted in Azure NetApp Files volumes.<br>You need to back up profile files by using snapshots.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04272/0017100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04272/0017100002.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/azure-netapp-files/azure-netapp-files-manage-snapshots",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-27T07:10:00.000Z",
        "voteCount": 15,
        "content": "Correct"
      },
      {
        "date": "2022-05-13T01:13:00.000Z",
        "voteCount": 1,
        "content": "Is this question old?\n\nFrom https://docs.microsoft.com/en-us/azure/azure-netapp-files/snapshots-manage-policy I can see that step 2 should be \"Create a snapshot policy\" and step 3 should be \"Apply a snapshot policy to a volume\". But what is step 1?\n\nI cannot find any reference in the docs that say you need to register either the NetApp Resource Provider (should already be registered since the question says we're already using ANF) or the snapshot policy feature (unless this WAS required before and no longer the case)?\n\nAnd obviously we don't need to create an Azure NetApp account since we're already using ANF."
      },
      {
        "date": "2022-04-07T02:56:00.000Z",
        "voteCount": 1,
        "content": "Register snapshot policy\nCreate snapshot policy\nApply snapshot policy"
      },
      {
        "date": "2021-12-09T14:49:00.000Z",
        "voteCount": 3,
        "content": "Got this on exam today."
      },
      {
        "date": "2021-11-26T17:28:00.000Z",
        "voteCount": 3,
        "content": "Correct Register, Create Policy, Apply Policy to Volume.\n\nRegister-AzProviderFeature -ProviderNamespace Microsoft.NetApp -FeatureName ANFSnapshotPolicy"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66058-exam-az-140-topic-5-question-7-discussion/",
    "body": "You have an Azure Virtual Desktop deployment.<br>You deploy and configure Azure Virtual Desktop in a secondary location.<br>You plan to perform a test failover to the secondary location, but discover existing user sessions to the primary location.<br>You need to sign out users from the session hosts in the primary location.<br>Which PowerShell cmdlet should you run?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInvoke-RdsUserSessionLogoff",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove-AzWvdUserSession\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInvoke-RestMethod",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove-Alias"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 7,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-22T16:29:00.000Z",
        "voteCount": 1,
        "content": "B. Remove-AzWvdUserSession"
      },
      {
        "date": "2022-05-21T03:51:00.000Z",
        "voteCount": 3,
        "content": "If there are existing user connections during the outage, before the admin can start failover to the secondary region, you need to end the user connections in the current region.\n\nTo disconnect users in Azure Virtual Desktop (classic), run this cmdlet: Invoke-RdsUserSessionLogoff\n\nTo disconnect users in the Azure-integrated version of Azure Virtual Desktop, run this cmdlet: Remove-AzWvdUserSession\n\nOnce you’ve signed out all users in the primary region, you can fail over the VMs in the primary region and let users connect to the VMs in the secondary region"
      },
      {
        "date": "2022-04-07T02:59:00.000Z",
        "voteCount": 3,
        "content": "B is correct - providing AVD deployment is not classic mode.\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery"
      },
      {
        "date": "2021-11-15T00:59:00.000Z",
        "voteCount": 4,
        "content": "Yes it's correct.\nhttps://docs.microsoft.com/en-us/powershell/module/az.desktopvirtualization/remove-azwvdusersession?view=azps-6.6.0"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/65501-exam-az-140-topic-5-question-8-discussion/",
    "body": "You have an Azure Virtual Desktop deployment.<br>You use the Start/Stop VMs during off-hours feature in Azure.<br>You need to configure which virtual machines must never be stopped by the solution.<br>What should you configure?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe Diagnostic settings of the host pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe Start-Stop-VM task",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure Automation account variable\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan action group"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-22T16:30:00.000Z",
        "voteCount": 1,
        "content": "C. an Azure Automation account variable"
      },
      {
        "date": "2022-07-14T03:48:00.000Z",
        "voteCount": 1,
        "content": "seems autoscaling feature use Exclusion Tag rather than variable. C is still correct if using Automation account"
      },
      {
        "date": "2022-04-05T02:43:00.000Z",
        "voteCount": 1,
        "content": "C is correct answer."
      },
      {
        "date": "2021-12-15T01:56:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/automation/automation-solution-vm-management-enable"
      },
      {
        "date": "2021-11-05T09:02:00.000Z",
        "voteCount": 3,
        "content": "Azure automation account"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66070-exam-az-140-topic-5-question-9-discussion/",
    "body": "You have an Azure Virtual Desktop host pool in the US East Azure region.<br>You need to ensure that the host pool can fail over to the US West Azure region.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Recovery Services vault.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a virtual machine snapshot of each session host.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure Storage account that uses geo-redundant storage (GRS).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new host pool."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 9,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-22T16:30:00.000Z",
        "voteCount": 2,
        "content": "A. Create a Recovery Services vault."
      },
      {
        "date": "2023-01-29T19:42:00.000Z",
        "voteCount": 1,
        "content": "You can configure replication for all your VMs in both pooled and personal host pools with Azure Site Recovery. For more information about how this process works, see Replicate Azure VMs to another Azure region\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery#vm-replication"
      },
      {
        "date": "2022-04-09T14:09:00.000Z",
        "voteCount": 2,
        "content": "A is correct. The replication is from VM for that reason we use a Recovery Services vault"
      },
      {
        "date": "2022-04-07T03:00:00.000Z",
        "voteCount": 2,
        "content": "A is correct answer."
      },
      {
        "date": "2021-11-30T13:36:00.000Z",
        "voteCount": 4,
        "content": "You will need an Recovery Services vault for this:\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-recovery-services-vault-overview"
      },
      {
        "date": "2021-11-15T09:05:00.000Z",
        "voteCount": 2,
        "content": "I think it's the answer C. Because \nData is synchronously applied three times in the primary region using Redundant Local Storage (LRS), and then applied asynchronously in the secondary region. For read access to data in the secondary region, enable geo-redundant storage with read access (RA-GRS)."
      },
      {
        "date": "2021-11-30T13:35:00.000Z",
        "voteCount": 2,
        "content": "C is not possible. With choosing an Azure Storage account that is GRS redundant you have a highly available storage account which indeed is available in another region. This will not failover the hostpool itself.\n\nYou will need an Recovery Services vault for this:\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-recovery-services-vault-overview"
      },
      {
        "date": "2021-11-15T05:27:00.000Z",
        "voteCount": 3,
        "content": "correct"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/65480-exam-az-140-topic-5-question-10-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure Virtual Desktop host pool that runs Windows 10 Enterprise multi-session.<br>User sessions are load-balanced between the session hosts. Idle session timeout is 30 minutes.<br>You plan to shut down a session host named Host1 to perform routine maintenance.<br>You need to prevent new user sessions to Host1 without disconnecting active user sessions.<br>Solution: From the host pool, you change the Drain mode of Host1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-04-07T03:01:00.000Z",
        "voteCount": 4,
        "content": "A is correct answer. \nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/drain-mode#set-drain-mode-using-the-azure-portal"
      },
      {
        "date": "2021-11-04T22:32:00.000Z",
        "voteCount": 1,
        "content": "Correcto~"
      },
      {
        "date": "2021-11-04T18:00:00.000Z",
        "voteCount": 4,
        "content": "A is correct, you enable the Drain mode. This prevents new connections and once users log off they won't be able to log into this specific host."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/67319-exam-az-140-topic-5-question-11-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure Virtual Desktop host pool that runs Windows 10 Enterprise multi-session.<br>User sessions are load-balanced between the session hosts. Idle session timeout is 30 minutes.<br>You plan to shut down a session host named Host1 to perform routine maintenance.<br>You need to prevent new user sessions to Host1 without disconnecting active user sessions.<br>Solution: From the properties of the virtual machine of Host1, you enable just-in-time (JIT) VM access.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-05-25T03:16:00.000Z",
        "voteCount": 1,
        "content": "The Just-in-Time access locks down and limits the ports of Azure virtual machines in order to overcome malicious attacks on the virtual machine, therefore only providing access to a port for a limited amount of time. Basically, you block all inbound traffic at the network level."
      },
      {
        "date": "2022-04-07T03:01:00.000Z",
        "voteCount": 2,
        "content": "B is correct answer. \nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/drain-mode#set-drain-mode-using-the-azure-portal"
      },
      {
        "date": "2021-12-07T07:20:00.000Z",
        "voteCount": 3,
        "content": "Correct."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/67320-exam-az-140-topic-5-question-12-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure Virtual Desktop host pool that runs Windows 10 Enterprise multi-session.<br>User sessions are load-balanced between the session hosts. Idle session timeout is 30 minutes.<br>You plan to shut down a session host named Host1 to perform routine maintenance.<br>You need to prevent new user sessions to Host1 without disconnecting active user sessions.<br>Solution: From the host pool, you remove Host1 from the session host list.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-desktop/drain-mode",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-06-23T15:25:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct: (B)\nUsing this option, in addition to disconnecting active sessions, the Host will be permanently removed from the Pool. The VM will not be deleted, but it cannot be added to the Pool again.\n\nLaboratory tested.\nThis is the message that is displayed when using this option:\n\"This action will remove the session host 'Host1'. \nAll user sessions will be logged off. \nAssociated resources (disks, virtual machines, etc.) will not be removed and can be removed manually. \nThis operation cannot be undone and the deleted session host will not be recoverable. \nDo you want to continue?\""
      },
      {
        "date": "2023-05-02T16:25:00.000Z",
        "voteCount": 2,
        "content": "Definitely B - No\nWhen removing a session host from the pool an alert is displayed.\n\nThis action will remove the session host 'sh01'. All users will be logged off."
      },
      {
        "date": "2022-07-14T03:58:00.000Z",
        "voteCount": 1,
        "content": "I choose B.\n\nCondition is \"without disconnecting avtive user sessions\". If removeing host from pool can fulfill this condition, A is acceptable."
      },
      {
        "date": "2022-04-07T03:02:00.000Z",
        "voteCount": 1,
        "content": "Correct answer is B.\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/drain-mode#set-drain-mode-using-the-azure-portal"
      },
      {
        "date": "2022-01-27T05:23:00.000Z",
        "voteCount": 2,
        "content": "answer is B, please don't anyhow say is it A.\n\nrequirement - without disconnecting active user sessions.. This means users are still using. Remove HOST1 from session host list means terminate the whole HOST."
      },
      {
        "date": "2021-12-19T00:40:00.000Z",
        "voteCount": 1,
        "content": "Although a silly approach, removing the session host from the host pool definitely will prevent new user sessions. So it meets the goal. It does not mention that we should choose the least effort. :)) I would go for Yes."
      },
      {
        "date": "2021-12-07T07:21:00.000Z",
        "voteCount": 2,
        "content": "Correct , best way to proceed is to set SH to Drain Mode."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75953-exam-az-140-topic-5-question-13-discussion/",
    "body": "You have an Azure Virtual Desktop deployment.<br>You plan to implement the Start/Stop VMs during off-hours feature.<br>You need to ensure that you can stop the session hosts automatically based on the CPU utilization.<br>What should you do on the session hosts?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the Azure Virtual Desktop Agent",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable change tracking",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the Power Management settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the Diagnostic settings\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-02-05T05:37:00.000Z",
        "voteCount": 1,
        "content": "D. Configure the Diagnostic settings"
      },
      {
        "date": "2023-06-03T06:34:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/virtual-desktop/autoscale-diagnostics"
      },
      {
        "date": "2023-05-02T16:35:00.000Z",
        "voteCount": 1,
        "content": "Correct D\nhttps://learn.microsoft.com/en-us/azure/automation/automation-solution-vm-management-config#cpuutil"
      },
      {
        "date": "2022-12-11T08:28:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2022-08-03T05:28:00.000Z",
        "voteCount": 1,
        "content": "Since it is a metric the Answer is correct"
      },
      {
        "date": "2022-07-14T04:03:00.000Z",
        "voteCount": 2,
        "content": "I don't get the question feature is Off hours (scaling feature) but the answers are bunch of unrelated to off hours requirement."
      },
      {
        "date": "2022-05-21T03:35:00.000Z",
        "voteCount": 3,
        "content": "This question has no validity \n\nhttps://www.linkedin.com/pulse/auto-stop-your-vm-based-cpu-utilization-azure-automation-bassel-damra/"
      },
      {
        "date": "2022-05-20T07:32:00.000Z",
        "voteCount": 2,
        "content": "I consider the answers don't match the question, we're talking about Start/Stop VMs during off-hours, https://docs.microsoft.com/en-us/azure/automation/automation-solution-vm-management-config#cpuutil"
      },
      {
        "date": "2023-01-04T22:14:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/virtual-desktop/autoscale-diagnostics"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74861-exam-az-140-topic-5-question-14-discussion/",
    "body": "You have an Azure Virtual Desktop host pool in the East US region.<br>You need to implement a disaster recovery solution that meets the following requirements:<br>✑ If users cannot connect to the Azure Virtual Desktop resources in the East US region, the users must be able to connect to the equivalent resources in the<br>West US region.<br>✑ Users must connect to the Azure Virtual Desktop resources in either the East US or the West US region by selecting a single icon in the Remote Desktop clientׁ<br>✑ In the event of a disaster, failover between the Azure regions must be initiated manually by an administrator.<br>✑ Failover times must be minimized.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a shared image gallery that has replicas in the East US and West US regions",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate new session hosts in the West US region and add the session hosts to an existing host pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an additional host pool in the West US region",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Azure Site Recovery replication of the virtual machines to the West US region\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Azure Backup to a Recovery Services vault in the West US region"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": false
      },
      {
        "answer": "C",
        "count": 3,
        "isMostVoted": false
      },
      {
        "answer": "CD",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-04-29T00:25:00.000Z",
        "voteCount": 5,
        "content": "Only D?"
      },
      {
        "date": "2022-04-30T19:17:00.000Z",
        "voteCount": 2,
        "content": "Yes looks like...\nas per the url given there,\nYou can configure all your VMs for both pooled and personal host pools with Azure Site Recovery. With this method, you'll only need to set up one host pool and its related app groups and workspaces."
      },
      {
        "date": "2024-10-10T16:24:00.000Z",
        "voteCount": 1,
        "content": "The solution D is correct. This scenario is pointing towards Active-Passive setup for disaster recovery. As this is manual recovery, you can only do it from ASR."
      },
      {
        "date": "2024-02-16T09:46:00.000Z",
        "voteCount": 2,
        "content": "ChatGPT chose D, assuming one answer: \"To implement a disaster recovery solution for your Azure Virtual Desktop (AVD) host pool that meets the specified requirements, you can utilize Azure Traffic Manager for traffic routing and Azure Site Recovery (ASR) for disaster recovery failover.\""
      },
      {
        "date": "2024-01-23T17:13:00.000Z",
        "voteCount": 1,
        "content": "D. Enable Azure Site Recovery replication of the virtual machines to the West US region"
      },
      {
        "date": "2023-12-06T23:38:00.000Z",
        "voteCount": 1,
        "content": "Needs to be the same icon, a 2nd hostpool will give you a 2nd workspace and appgroup."
      },
      {
        "date": "2023-08-25T10:46:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer is D\n\nActive-passive plans are when you have a region with one set of resources that's active and one that's turned off until it's needed (passive). If the active region is taken offline by an outage or disaster, the organization can switch to the passive region by turning it on and directing all the users there.\n\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery"
      },
      {
        "date": "2023-08-07T04:22:00.000Z",
        "voteCount": 3,
        "content": "Answer is B - Having an additional session host in the same pool meets the single icon criteria. The additional host can be put into drain mode (and off) until required and immediately available in the event a host is required in West US. \"Must be intiated manually\" is also met, as all an admin needs to do is turn on the VM. There is nothing suggesting that the East US region DC is unavailable, so the hostpool resource will still be usable. There is also no mention of minimizing administrative effort so, albeit this is an admin overhead, it meets all the requirements. This is known as an Active-Passive BCDR plan.\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery-concepts#disaster-recovery-for-shared-host-pools"
      },
      {
        "date": "2023-08-07T04:23:00.000Z",
        "voteCount": 1,
        "content": "C - Additional icon\n\nD - ASR takes longer than B as you have to wait for failover to complete and then the VM to start.\n\nNote the benefits section under the diagram of the link:\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery-concepts#disaster-recovery-for-shared-host-pools\n\nLess time spent recovering from disasters. For example, you'll spend less time on provisioning, configuring, integrating, and validating newly deployed resources.\nThere's no need to use complicated procedures.\nIt's easy to test failover outside of disasters."
      },
      {
        "date": "2023-06-03T06:42:00.000Z",
        "voteCount": 3,
        "content": "Only D.\nC is incorrect because a single icon in the Remote Desktop client is required.\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery"
      },
      {
        "date": "2022-08-31T03:16:00.000Z",
        "voteCount": 1,
        "content": "It's C. A Second Host Pool = another icon. \n\nFrom https://docs.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery\n\nyou have the option to build the VMs ahead of time and keep them powered off. You can also choose to only provision new VMs in the secondary region while a disaster is happening. If you choose these methods, you'll only need to set up one host pool and its related app groups and workspaces"
      },
      {
        "date": "2022-08-24T11:42:00.000Z",
        "voteCount": 1,
        "content": "This one is D&amp;E.  RSV for ASR needs to be deployed in failover region .  Post deployment then need to enable VM's for replication."
      },
      {
        "date": "2022-08-15T09:47:00.000Z",
        "voteCount": 3,
        "content": "There is no need for C, the users need a single icon..."
      },
      {
        "date": "2022-05-25T04:07:00.000Z",
        "voteCount": 1,
        "content": "see here: https://docs.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery"
      },
      {
        "date": "2022-05-20T07:48:00.000Z",
        "voteCount": 4,
        "content": "Yeah, the answers are right... but the question was kind of confusing due to it didn't specify you could choose more than one option.  C and D."
      },
      {
        "date": "2022-05-10T10:23:00.000Z",
        "voteCount": 2,
        "content": "C and D is right.\nC is needed as the statement says users need an icon with both East and West US, for that you need 2 hp's"
      },
      {
        "date": "2022-07-31T03:50:00.000Z",
        "voteCount": 5,
        "content": "\"Users must connect to the Azure Virtual Desktop resources in either the East US or the West US region by selecting a single icon in the Remote Desktop clientׁ\"\nIt says only 1 icon that works for both."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/76000-exam-az-140-topic-5-question-15-discussion/",
    "body": "You have an Azure Virtual Desktop deployment.<br>You need to monitor the deployment by using the Azure Virtual Desktop Insights solution in Azure Monitor.<br>What should you use as the Diagnostic settings destination for the host pool?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEvent hub",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLog Analytics workspace\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStorage account"
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-desktop/azure-monitor",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-23T17:14:00.000Z",
        "voteCount": 1,
        "content": "B. Log Analytics workspace"
      },
      {
        "date": "2022-05-21T04:04:00.000Z",
        "voteCount": 1,
        "content": "Correct \n\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/azure-monitor"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74862-exam-az-140-topic-5-question-16-discussion/",
    "body": "You have an Azure Virtual Desktop deployment.<br>In Azure Advisor, you discover the following recommendation related to Azure Virtual Desktop:<br>✑ Impact: Medium<br>✑ Description: No validation environment enabled<br>✑ Potential Benefit: Ensure business continuity through AVD service deployments<br>✑ Impacted Resource: 1 Host Pool<br>What can you validate by implementing the recommendations?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSecurity settings of Azure Virtual Desktop",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCapacity requirements of session hosts",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Site Recovery failover of the session hosts",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPreview features for Azure Virtual Desktop\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 10,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-07-07T12:03:00.000Z",
        "voteCount": 1,
        "content": "Option D is the correct answer as it directly aligns with the potential benefit of ensuring business continuity through AVD service deployments by safely testing preview features in a validation environment."
      },
      {
        "date": "2023-06-03T06:45:00.000Z",
        "voteCount": 1,
        "content": "C is completely wrong."
      },
      {
        "date": "2023-05-01T15:39:00.000Z",
        "voteCount": 1,
        "content": "D\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/configure-validation-environment?WT.mc_id=Portal-Microsoft_Azure_WVD&amp;tabs=azure-portal"
      },
      {
        "date": "2023-03-10T18:25:00.000Z",
        "voteCount": 1,
        "content": "Validation environment affects the deployment of the AVD Agent software, and causes preview versions to get deployed rather than the typical monthly general releases.  It's definitely D (Azure Site Recovery has nothing to do with this, it's for DR)"
      },
      {
        "date": "2023-01-25T16:05:00.000Z",
        "voteCount": 3,
        "content": "Answer is D - 100%: https://learn.microsoft.com/en-us/azure/virtual-desktop/create-validation-host-pool?tabs=azure-portal"
      },
      {
        "date": "2022-10-02T02:20:00.000Z",
        "voteCount": 2,
        "content": "I ran into some conitunity problems in a production enviroment, while the hostpool was set to validation mode [yes].\n\nThe issue was related to [Start on VM at connect]  We figuered out that the issues was caused by the agent version. When we manally rolled back the agent version the function became available again.\n\n I've contacted Microsoft for the issues and the stated the following:\n\n\nCause:\nKnow issue When Validation environment on Host pool is set to true (this only should be set for testing environments).\n\nResolution:\nSet Validation Environment to false (this is the recommended option in production environments)\n\nTherefor I'm with answer [D]"
      },
      {
        "date": "2022-08-24T11:44:00.000Z",
        "voteCount": 2,
        "content": "D all day long"
      },
      {
        "date": "2022-08-02T03:14:00.000Z",
        "voteCount": 1,
        "content": "Answer is C not D"
      },
      {
        "date": "2022-07-31T03:54:00.000Z",
        "voteCount": 1,
        "content": "It's for feature updates to the AVD agent."
      },
      {
        "date": "2022-06-24T13:31:00.000Z",
        "voteCount": 1,
        "content": "D. Preview features for Azure Virtual Desktop"
      },
      {
        "date": "2022-05-28T04:54:00.000Z",
        "voteCount": 1,
        "content": "validation environment"
      },
      {
        "date": "2022-05-25T04:35:00.000Z",
        "voteCount": 1,
        "content": "the question doesnt mention site recovery, so its more likely its referring to testing patching in the validation environment than full disaster recovery."
      },
      {
        "date": "2022-05-21T04:12:00.000Z",
        "voteCount": 1,
        "content": "\"You don't have a validation environment enabled in this subscription. When you made your host pools, you selected No for \"Validation environment\" in the Properties tab. To ensure business continuity through Azure Virtual Desktop service deployments, make sure you have at least one host pool with a validation environment where you can test for potential issues.”"
      },
      {
        "date": "2022-05-21T04:29:00.000Z",
        "voteCount": 1,
        "content": "Having said the above, rereading the question, it asks what you can validate by implemening the validation environment - What can you validate by implementing the recommendations?\n\nYou should only do full disaster recovery tests during a maintenance window to not disrupt your users. You can also use a host pool in the validation environment for the test.\n\nSo C is probably correct.\n\nAny testing can be done in the validation....."
      },
      {
        "date": "2022-05-20T08:38:00.000Z",
        "voteCount": 1,
        "content": "Yeah... D matches better... The validation Environment is for testing purposes..."
      },
      {
        "date": "2022-05-10T10:26:00.000Z",
        "voteCount": 1,
        "content": "c is wrong,\nD is right\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/create-validation-host-pool?tabs=azure-portal\nValidation host pools let you monitor service updates before the service applies them to your standard or non-validation environment."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74865-exam-az-140-topic-5-question-17-discussion/",
    "body": "You have an Azure Virtual Desktop host pool.<br>You add a French language pack to each session host in the host pool.<br>Several days later, users report that English displays when they connect to Azure Virtual Desktop.<br>After an investigation, you discover that the French language pack was removed, and the session hosts reverted to English.<br>You need to ensure that the French language pack is always available on the session hosts.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the international settings on each host",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign a default time zone on each host",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApply a Group Policy setting to disable the Time &amp; language settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApply a Group Policy setting that blocks the cleanup of unused language packs\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 16,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-02T06:31:00.000Z",
        "voteCount": 1,
        "content": "D. Apply a Group Policy setting that blocks the cleanup of unused language packs"
      },
      {
        "date": "2024-01-23T17:22:00.000Z",
        "voteCount": 1,
        "content": "D. Apply a Group Policy setting that blocks the cleanup of unused language packs"
      },
      {
        "date": "2023-06-03T06:49:00.000Z",
        "voteCount": 1,
        "content": "I take D."
      },
      {
        "date": "2023-01-25T06:42:00.000Z",
        "voteCount": 2,
        "content": "D on this. Tested myself"
      },
      {
        "date": "2022-12-21T12:56:00.000Z",
        "voteCount": 2,
        "content": "Should be D. Yet another question with an incorrectly assigned answer. This practice test has a LOT of these."
      },
      {
        "date": "2022-07-25T14:22:00.000Z",
        "voteCount": 1,
        "content": "I will go with D"
      },
      {
        "date": "2022-06-22T06:49:00.000Z",
        "voteCount": 3,
        "content": "D for me also"
      },
      {
        "date": "2022-06-19T23:52:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/languages-overview?view=windows-11#block-cleanup-of-unused-language-packs"
      },
      {
        "date": "2022-05-28T04:57:00.000Z",
        "voteCount": 1,
        "content": "Should be D..."
      },
      {
        "date": "2022-05-30T12:21:00.000Z",
        "voteCount": 1,
        "content": "interesting option. https://admx.help/?Category=Windows_10_2016&amp;Policy=Microsoft.Policies.Globalization::BlockCleanupOfUnusedPreinstalledLangPacks"
      },
      {
        "date": "2022-05-20T08:53:00.000Z",
        "voteCount": 3,
        "content": "I agree D."
      },
      {
        "date": "2022-05-12T09:10:00.000Z",
        "voteCount": 2,
        "content": "Should be D"
      },
      {
        "date": "2022-05-05T20:16:00.000Z",
        "voteCount": 3,
        "content": "im voting D"
      },
      {
        "date": "2022-05-05T15:07:00.000Z",
        "voteCount": 3,
        "content": "D\n\nhttps://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/languages-overview?view=windows-11#block-cleanup-of-unused-language-packs"
      },
      {
        "date": "2022-04-29T00:48:00.000Z",
        "voteCount": 3,
        "content": "Not D?"
      },
      {
        "date": "2022-05-05T20:16:00.000Z",
        "voteCount": 2,
        "content": "i think it should be D as well"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75706-exam-az-140-topic-5-question-18-discussion/",
    "body": "HOTSPOT -<br>You have an Azure Virtual Desktop deployment.<br>You are configuring the outbound firewall settings for the host pool.<br>Which outbound URL and outbound port should you configure to ensure that the host machines maintain Windows activation? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04272/0017900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04272/0018000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-desktop/safe-url-list",
    "votes": [],
    "comments": [
      {
        "date": "2023-08-25T11:00:00.000Z",
        "voteCount": 1,
        "content": "Answers are correct: \nkms.core.windows.net\t1688\tWindows activation\tInternet\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/safe-url-list?tabs=azure#session-host-virtual-machines"
      },
      {
        "date": "2022-10-19T08:44:00.000Z",
        "voteCount": 4,
        "content": "Correct. https://learn.microsoft.com/en-us/azure/virtual-desktop/safe-url-list?tabs=azure#session-host-virtual-machines"
      },
      {
        "date": "2022-06-22T13:01:00.000Z",
        "voteCount": 1,
        "content": "KMS on 1688"
      },
      {
        "date": "2022-05-16T22:43:00.000Z",
        "voteCount": 2,
        "content": "correct answer.\nhttps://azurecloudai.blog/2019/01/13/understanding-volume-activation-services-part-1-kms-and-mak/#:~:text=KMS%20TCP%20listening%20port%20%E2%80%93%20By,if%20needed%20using%20this%20setting."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75007-exam-az-140-topic-5-question-19-discussion/",
    "body": "Your network contains an on-premises Active Directory domain named contoso.com that syncs to an Azure Active Directory (Azure AD) tenant.<br>You have an Azure Virtual Desktop host pool named Pool1 that has the following settings:<br>✑ Host pool name: Pool1<br>✑ Host pool type: Personal<br>✑ Load balancing algorithm: Breadth-first<br><br>Number of VMs: 3 -<br><img src=\"/assets/media/exam-media/04272/0018000005.png\" class=\"in-exam-image\"><br>The session hosts have the following configurations:<br>✑ Image used to create the virtual machines: Windows 10 Enterprise<br>✑ Virtual machines domain-joined to: On-premises contoso.com domain<br>You need to ensure that you can use Microsoft EndPoint Manager to manage security update on the session hosts.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate Windows 10 Enterprise multi-session images",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the session hosts as hybrid Azure AD-joined\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange Host pool type to Pooled",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange Load balancing algorithm to Depth-first"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 10,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-04-30T19:46:00.000Z",
        "voteCount": 14,
        "content": "Single session is also supported..  The URL https://docs.microsoft.com/en-us/mem/intune/fundamentals/azure-virtual-desktop\nAnswer should be B .. Hybrid AD is needed."
      },
      {
        "date": "2024-05-02T06:34:00.000Z",
        "voteCount": 1,
        "content": "B. Configure the session hosts as hybrid Azure AD-joined"
      },
      {
        "date": "2024-01-24T17:53:00.000Z",
        "voteCount": 1,
        "content": "B. Configure the session hosts as hybrid Azure AD-joined"
      },
      {
        "date": "2023-06-03T06:51:00.000Z",
        "voteCount": 1,
        "content": "Answer A doesn't make sense."
      },
      {
        "date": "2023-05-31T17:41:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/mem/intune/fundamentals/azure-virtual-desktop"
      },
      {
        "date": "2023-02-21T22:49:00.000Z",
        "voteCount": 1,
        "content": "this is a repeated question, question 31 topic 4 is the same and answer is B there"
      },
      {
        "date": "2022-08-28T11:55:00.000Z",
        "voteCount": 1,
        "content": "Does load balancing even apply to personal HPs ??\nConfused. But went with 'B'"
      },
      {
        "date": "2022-08-05T14:32:00.000Z",
        "voteCount": 2,
        "content": "As the pool type is personal, you don't need multi-session vm's. So Hybrid AD is the right answer."
      },
      {
        "date": "2022-06-14T04:54:00.000Z",
        "voteCount": 3,
        "content": "Agree with B"
      },
      {
        "date": "2022-06-09T17:58:00.000Z",
        "voteCount": 1,
        "content": "A is the right answer\n\nYou can now use Microsoft Intune to manage Windows 10 or Windows 11 Enterprise multi-session remote desktops in the Microsoft Endpoint Manager admin center just as you can manage a shared Windows 10 or Windows 11 client device.\n\n\nhttps://docs.microsoft.com/en-us/mem/intune/fundamentals/azure-virtual-desktop-multi-session"
      },
      {
        "date": "2022-05-28T05:00:00.000Z",
        "voteCount": 1,
        "content": "Should be B"
      },
      {
        "date": "2022-05-20T09:40:00.000Z",
        "voteCount": 1,
        "content": "In this example Hybrid AD joined is necessary first."
      },
      {
        "date": "2022-05-14T10:48:00.000Z",
        "voteCount": 1,
        "content": "B is the right answer"
      },
      {
        "date": "2022-05-13T17:57:00.000Z",
        "voteCount": 1,
        "content": "Yes answer hold be B"
      },
      {
        "date": "2022-05-10T10:30:00.000Z",
        "voteCount": 1,
        "content": "as stated by imrans, hybrid ad joine devices is a requirement"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75256-exam-az-140-topic-5-question-20-discussion/",
    "body": "You have an Azure subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/04272/0018100003.png\" class=\"in-exam-image\"><br>You create a recovery services vault named Vault1.<br>Which resources can you back up using Azure Backup to Vault1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAVDVM-0 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAVDVM-0 and share1 only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAVDVM-0, Image1, and Image2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAVDVM-0, share1, and Image1 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAVDVM-0, share1, Image1, and Image2"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 12,
        "isMostVoted": true
      },
      {
        "answer": "E",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-05-07T06:04:00.000Z",
        "voteCount": 17,
        "content": "I believe this question overlaps with the following question.\nhttps://www.examtopics.com/discussions/microsoft/view/53655-exam-az-140-topic-5-question-5-discussion/\nI think the answer is B, for VM and file share."
      },
      {
        "date": "2022-05-25T00:54:00.000Z",
        "voteCount": 5,
        "content": "https://docs.microsoft.com/en-us/azure/backup/backup-overview#what-can-i-back-up\nOperational backup of blobs is a local backup solution. So the backup data isn't transferred to the Backup vault"
      },
      {
        "date": "2024-05-02T06:35:00.000Z",
        "voteCount": 1,
        "content": "B. AVDVM-0 and share1 only"
      },
      {
        "date": "2024-03-03T02:19:00.000Z",
        "voteCount": 1,
        "content": "For these options B but Little bit outdated answer options. Blobs backups are also possible\nhttps://learn.microsoft.com/en-us/azure/backup/blob-backup-overview"
      },
      {
        "date": "2024-01-24T17:55:00.000Z",
        "voteCount": 1,
        "content": "B. AVDVM-0 and share1 only"
      },
      {
        "date": "2023-10-10T14:01:00.000Z",
        "voteCount": 2,
        "content": "why did we pay for this practice test i all the answers are wrong. Exam Topics Moderator, can you please fix this test.  This is stupid that you are providing the wrong answers."
      },
      {
        "date": "2023-06-03T06:53:00.000Z",
        "voteCount": 2,
        "content": "Repeated question."
      },
      {
        "date": "2023-05-31T17:43:00.000Z",
        "voteCount": 1,
        "content": "B is the correct answer."
      },
      {
        "date": "2023-04-18T04:02:00.000Z",
        "voteCount": 1,
        "content": "B\nhttps://learn.microsoft.com/en-us/azure/backup/backup-overview#what-can-i-back-up"
      },
      {
        "date": "2023-02-21T22:52:00.000Z",
        "voteCount": 1,
        "content": "repeated question, question 5 topic 5"
      },
      {
        "date": "2022-12-21T13:00:00.000Z",
        "voteCount": 1,
        "content": "B is correct. This is a copy of an existing question and this copy is answered incorrectly."
      },
      {
        "date": "2022-09-10T03:49:00.000Z",
        "voteCount": 1,
        "content": "B is the correct answer."
      },
      {
        "date": "2022-05-15T02:33:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/azure/backup/backup-overview#what-can-i-back-up\nIncludes VM, FileShare and Blob"
      },
      {
        "date": "2022-05-25T00:53:00.000Z",
        "voteCount": 4,
        "content": "Read your own link: Operational backup of blobs is a local backup solution. So the backup data isn't transferred to the Backup vault.\nThe question asks what can be backed up to a vault.\nAnswer is B"
      },
      {
        "date": "2022-05-14T10:50:00.000Z",
        "voteCount": 2,
        "content": "Yes answer should be b"
      },
      {
        "date": "2022-05-07T00:21:00.000Z",
        "voteCount": 2,
        "content": "B\n\nhttps://docs.microsoft.com/en-us/azure/backup/backup-overview#what-can-i-back-up"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/76294-exam-az-140-topic-5-question-21-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure Virtual Desktop host pool that runs Windows 10 Enterprise multi-session.<br>User sessions are load-balanced between the session hosts. Idle session timeout is 30 minutes.<br>You plan to shut down a session host named Host1 to perform routine maintenance.<br>You need to prevent new user sessions to Host1 without disconnecting active user sessions.<br>Solution: From the properties of the virtual machine of Host1, you configure the Auto-shutdown settings.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-desktop/drain-mode",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-06-24T13:33:00.000Z",
        "voteCount": 2,
        "content": "B - NO"
      },
      {
        "date": "2022-05-25T21:04:00.000Z",
        "voteCount": 2,
        "content": "Drain mode isolates a session host when you want to apply patches and do maintenance without disrupting user sessions.\n\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/drain-mode"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81366-exam-az-140-topic-5-question-22-discussion/",
    "body": "HOTSPOT -<br>You have an Azure subscription.<br>You plan to deploy an Azure Virtual Desktop solution to the East US Azure region. The solution will contain the resources shown in the following table.<br><img src=\"/assets/media/exam-media/04272/0018300001.png\" class=\"in-exam-image\"><br>You need to recommend a business continuity solution that meets the following requirements:<br>* Users must be able to connect to HostPool1 if a datacenter in the East US region fails.<br>* Costs must be minimized.<br>What should you include in the recommendation for each resource? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04272/0018400001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04272/0018500001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Azure Site Recovery -<br>For personal host pools with dedicated VMs, replicate VMs using Azure Site Recovery to another region.<br>Box 2: Geo-redundant Storage (GRS)<br>You can configure and deploy Azure resources across multiple regions in either active-active or active-passive configurations. These configurations are typically found in shared host pools.<br><br>Geo-redundant storage -<br>Geo-redundant storage (GRS) copies your data synchronously three times within a single physical location in the primary region using LRS. It then copies your data asynchronously to a single physical location in a secondary region that is hundreds of miles away from the primary region. GRS offers durability for storage resources of at least 99.99999999999999% (16 9's) over a given year.<br>Incorrect:<br>* Geo-zone-redundant storage is more expensive compared to GRS<br>Geo-zone-redundant storage (GZRS) combines the high availability provided by redundancy across availability zones with protection from regional outages provided by geo-replication. Data in a GZRS storage account is copied across three Azure availability zones in the primary region and is also replicated to a secondary geographic region for protection from regional disasters. Microsoft recommends using GZRS for applications requiring maximum consistency, durability, and availability, excellent performance, and resilience for disaster recovery.<br>Azure Storage offers two options for how your data is replicated in the primary region:<br>* Locally redundant storage (LRS) copies your data synchronously three times within a single physical location in the primary region. LRS is the least expensive replication option, but isn't recommended for applications requiring high availability or durability.<br>* Zone-redundant storage (ZRS) copies your data synchronously across three Azure availability zones in the primary region. For applications requiring high availability, Microsoft recommends using ZRS in the primary region, and also replicating to a secondary region.*<br>Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery-concepts https://docs.microsoft.com/en-us/azure/storage/common/storage-redundancy#geo-redundant-storage",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-09T06:16:00.000Z",
        "voteCount": 32,
        "content": "The regions is the same, \"if a datacenter fails\" and and cost  must be minimized . So I choose hostPool1: Availability zones and Storage1: ZRS"
      },
      {
        "date": "2022-10-15T07:23:00.000Z",
        "voteCount": 2,
        "content": "Absolutely correct. While GRS would also work, it will increase costs. To allow resilience within a single AZ region, ZRS will provide sufficient failover while keeping costs down.\nand \nAvailabilityZones for the host pool as the answer to the first question."
      },
      {
        "date": "2022-10-30T10:26:00.000Z",
        "voteCount": 1,
        "content": "Absolutely. Provided answer is incorrect.\n\nDC failure = Availability Zone failure and we have 2 or 3 AZs in each region. \n\nCorrect - Availability Zones &amp; ZRS storage."
      },
      {
        "date": "2023-09-28T17:25:00.000Z",
        "voteCount": 1,
        "content": "alfonsodisalvo is 100% correct. Each region in azure has multiple datacenters broken into availability zones. ZRL, zone redundant storage is replicated across zones in a single region. \nDeploying the pool using availability zones and Zone redundant storage will allow the pool to survive a datacenter failure."
      },
      {
        "date": "2023-05-31T17:48:00.000Z",
        "voteCount": 1,
        "content": "Azure Site Recovery\nGeo-redundant storage (GRS)\n100% sure!"
      },
      {
        "date": "2023-05-31T17:50:00.000Z",
        "voteCount": 1,
        "content": "I'm sorry, I didn't read the word \"datacenter\".\nCorrect answers are: Azure Site Recovery and Zone-redundant storage (ZRS)"
      },
      {
        "date": "2023-05-31T17:54:00.000Z",
        "voteCount": 6,
        "content": "Oh my God, today is hard! haha\nCorrect: Availability Zones and ZRS storage."
      },
      {
        "date": "2022-10-27T10:18:00.000Z",
        "voteCount": 2,
        "content": "Agree - Region and Datacenter is not the same thing. I will go with ZRS and Availability Zones"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82254-exam-az-140-topic-5-question-23-discussion/",
    "body": "You have an Azure subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/04272/0018600001.png\" class=\"in-exam-image\"><br>You need to ensure that users can restore files saved to their FSLogix profile.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the CPool1 blade in the Azure portal, create a new volume.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure portal, create an Azure Backup vault and a backup policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Volume1 blade in the Azure portal, create a snapshot policy.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure portal, create a Recovery Services vault and a backup policy."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 23,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 4,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-25T14:48:00.000Z",
        "voteCount": 17,
        "content": "it says they are using netapp for fslogix, so you should use snapshot policies\nhttps://learn.microsoft.com/en-us/azure/azure-netapp-files/backup-configure-policy-based"
      },
      {
        "date": "2024-05-02T06:40:00.000Z",
        "voteCount": 1,
        "content": "C. From the Volume1 blade in the Azure portal, create a snapshot policy."
      },
      {
        "date": "2024-01-25T16:34:00.000Z",
        "voteCount": 2,
        "content": "D. From the Azure portal, create a Recovery Services vault and a backup policy."
      },
      {
        "date": "2023-09-13T07:00:00.000Z",
        "voteCount": 2,
        "content": "By creating a snapshot policy for the Azure NetApp Files volume, you can regularly capture snapshots of the data, allowing users to restore files from specific points in time if needed. This is a more appropriate solution than Azure Backup or Recovery Services vault for capturing point-in-time copies of the data stored in Azure NetApp Files."
      },
      {
        "date": "2023-06-03T07:00:00.000Z",
        "voteCount": 1,
        "content": "A snapshot is the right choice for Azure NetApp Files."
      },
      {
        "date": "2022-11-17T11:04:00.000Z",
        "voteCount": 2,
        "content": "From the docs: Azure Files Premium tier integrates with Azure Backup and is supported in conjunction with FSLogix. Azure NetApp Files offers a similar snapshot mechanism to make copies of your FSLogix profile containers.\n\nhttps://learn.microsoft.com/en-us/azure/architecture/example-scenario/wvd/windows-virtual-desktop-fslogix#backup-and-restore"
      },
      {
        "date": "2022-09-15T02:26:00.000Z",
        "voteCount": 2,
        "content": "Apparently this is correct. \n\n\"Let’s start off by discussing how we can backup the Azure File share that we utilize for our FSLogix user profiles.  The first step is that we need to create a recovery services vault.  This is a management entity that stores recovery points that have been created over time.\"\n\n- https://cloudacademy.com/course/implementing-business-continuity-azure-virtual-desktop-2526/configure-backup-and-restore-for-fslogix-user-profiles-personal-virtual-desktop-infrastructure-vdi-and-golden-images/"
      },
      {
        "date": "2023-02-07T18:16:00.000Z",
        "voteCount": 5,
        "content": "the share in question is a netapp share not azure file share"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96872-exam-az-140-topic-5-question-24-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Azure Virtual Desktop deployment that contains the session hosts shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image189.png\"><br><br>You have the users shows in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image190.png\"><br><br>Users connect to Azure from the locations shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image191.png\"><br><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-140/image192.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-140/image193.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-10T08:33:00.000Z",
        "voteCount": 24,
        "content": "no - User 2 won't work as RDP Shortpath requires Remote Desktop Client for Windows\nno - Host 2 isn't configured for RDP Shortpath\nno - RDP Shortpath for managed networks requires a site to site vpn"
      },
      {
        "date": "2023-04-18T04:24:00.000Z",
        "voteCount": 19,
        "content": "no - user 2 is not using remote desktop client for windows\nno - host 2 is not configured for RDP Shortpath\nyes - RDP Shortpath for public networks with STUN or TURN will work automatically without any additional configuration\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/configure-rdp-shortpath?tabs=public-networks"
      },
      {
        "date": "2023-07-13T17:04:00.000Z",
        "voteCount": 1,
        "content": "RDP Shortpath only works over managed networks S2S VPN or ExpressRoute."
      },
      {
        "date": "2023-09-09T14:52:00.000Z",
        "voteCount": 1,
        "content": "it works over public networks as well\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rdp-shortpath?tabs=public-networks#how-rdp-shortpath-works"
      },
      {
        "date": "2023-09-09T14:50:00.000Z",
        "voteCount": 1,
        "content": "i believe this is correct because if \"Enable RDP Shortpath for managed networks\" is not configured or disabled, the clients wont use this policy to connect therefore it will connect via the public network"
      },
      {
        "date": "2023-09-10T15:54:00.000Z",
        "voteCount": 1,
        "content": "i think it may be \nno - user 2 is not using remote desktop client for windows\nyes - RDP shortpath is enabled, but not configured for managed networks for Host 2 so should still connect\nno - RDP shortpath for managed networks is enabled, but won't work for public network at Location 2\n\nHost 1 has a stricter connection rule while Host 2 is free for all."
      },
      {
        "date": "2024-10-02T06:17:00.000Z",
        "voteCount": 2,
        "content": "The answer is correct because:\nIn the first case and third case RDP Shortpath uses VPN Site-To-Site in which connectivity is established between the client and the session host, precisely via a VPN, indidpendently whether Windows desktop or web.\nThe second case, on the other hand, is much simpler to understand because the user has to connect via the Web or via the remote desktop client app to an Internet-exposed resource, so if RDP Shortpath for managed networks is not configured, it will never log in. You have to configure RDP Shortpath for public networks. \nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rdp-shortpath?tabs=managed-networks#how-rdp-shortpath-works"
      },
      {
        "date": "2024-06-12T11:27:00.000Z",
        "voteCount": 1,
        "content": "RDP Shortpath can be used in two ways:\n\nManaged networks, where direct connectivity is established between the client and the session host when using a private connection, such as a virtual private network (VPN).\n\nPublic networks, where direct connectivity is established between the client and the session host when using a public connection. There are two connection types when using a public connection, which are listed here in order of preference:\n\nA direct UDP connection using the Simple Traversal Underneath NAT (STUN) protocol between a client and session host.\n\nAn indirect UDP connection using the Traversal Using Relay NAT (TURN) protocol with a relay between a client and session host. This is in preview."
      },
      {
        "date": "2023-12-21T12:11:00.000Z",
        "voteCount": 4,
        "content": "This is a trick question. RDP Shortpath does not need to be configured for managed networks to work. So the image showing the RDP Shortpath config for managed networks is a decoy. If a managed network isn't an option it will use the public internet. The key is the client in Windows must be used and web client does not work."
      },
      {
        "date": "2023-02-21T23:04:00.000Z",
        "voteCount": 1,
        "content": "I think it is correct \nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rdp-shortpath?tabs=managed-networks"
      },
      {
        "date": "2023-11-11T10:03:00.000Z",
        "voteCount": 1,
        "content": "Looks like RDP shortpath doesn't support Web browsers at all"
      },
      {
        "date": "2023-01-25T16:44:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct: https://learn.microsoft.com/en-us/azure/virtual-desktop/rdp-shortpath?tabs=managed-networks"
      },
      {
        "date": "2023-01-29T10:23:00.000Z",
        "voteCount": 5,
        "content": "disagree. the question specifically mentions shortpath for managed networks which does not apply over public internet - location 2 is public internet so that would be 'no'"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96782-exam-az-140-topic-5-question-25-discussion/",
    "body": "You have an Azure subscription. The subscription contains a virtual machine named Server1 that runs Windows Server and is deployed to the West US Azure region.<br><br>You deploy a new Azure Virtual Desktop host pool named HostPool1 to the East US Azure region.<br><br>You need to ensure that all the traffic between HostPool1 and Server1 is routed via the Microsoft backbone network.<br><br>What should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tservice endpoints",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tvirtual network peering\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\trouting tables",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Traffic Manager"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 8,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 3,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-08-13T20:42:00.000Z",
        "voteCount": 1,
        "content": "Azure supports the following types of peering:\n-Virtual network peering: Connecting virtual networks within the same Azure region.\n-Global virtual network peering: Connecting virtual networks across Azure regions.\nhttps://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-peering-overview\n\nQuestion should include \"Global\" for B to be the choice, but it does not, so it can not be B."
      },
      {
        "date": "2024-07-07T12:25:00.000Z",
        "voteCount": 1,
        "content": "By using virtual network peering, you achieve the goal of routing all traffic between HostPool1 and Server1 via the Microsoft backbone network, ensuring optimal connectivity and performance across Azure regions."
      },
      {
        "date": "2024-06-18T10:32:00.000Z",
        "voteCount": 1,
        "content": "I will stick with A\n\nAzure supports the following types of peering:\n\nVirtual network peering: Connecting virtual networks within the same Azure region.\n\nGlobal virtual network peering: Connecting virtual networks across Azure regions."
      },
      {
        "date": "2024-01-25T16:39:00.000Z",
        "voteCount": 1,
        "content": "B. virtual network peering."
      },
      {
        "date": "2023-11-11T10:25:00.000Z",
        "voteCount": 2,
        "content": "Virtual network peering: Connecting virtual networks within the same Azure region.\nhttps://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-peering-overview\n\nSo, A"
      },
      {
        "date": "2023-06-03T07:03:00.000Z",
        "voteCount": 1,
        "content": "Peering is the right answer."
      },
      {
        "date": "2023-04-18T04:28:00.000Z",
        "voteCount": 1,
        "content": "B\nThe traffic between virtual machines in peered virtual networks uses the Microsoft backbone infrastructure. \n\nGlobal virtual network peering: Connecting virtual networks across Azure regions.\n\nhttps://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-peering-overview#connectivity"
      },
      {
        "date": "2023-03-29T11:42:00.000Z",
        "voteCount": 1,
        "content": "B is correct"
      },
      {
        "date": "2023-03-24T09:50:00.000Z",
        "voteCount": 1,
        "content": "service endpoints provide a private and secure connection between Azure resources and specific Azure services, while virtual network peering provides a private network connection between two virtual networks"
      },
      {
        "date": "2023-02-14T08:58:00.000Z",
        "voteCount": 2,
        "content": "Answer is B https://maheshhika.com/2021/01/28/microsoft-backbone-network-based-azure-vnet-peering/"
      },
      {
        "date": "2023-02-14T07:05:00.000Z",
        "voteCount": 3,
        "content": "It doesn't specify a service. It just generally says connectivity to the server. So for that reason i go with answer B."
      },
      {
        "date": "2023-01-26T06:12:00.000Z",
        "voteCount": 1,
        "content": "I think it's A\nhttps://docs.microsoft.com/en-us/azure/virtual-network/virtual-network-service-endpoints-overview"
      },
      {
        "date": "2023-01-26T02:30:00.000Z",
        "voteCount": 1,
        "content": "Why not B?"
      },
      {
        "date": "2023-01-25T11:09:00.000Z",
        "voteCount": 1,
        "content": "Pretty sure the answer is A. \n\n\"Virtual Network (VNet) service endpoint provides secure and direct connectivity to Azure services over an optimized route over the Azure backbone network.\"\n\nhttps://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-service-endpoints-overview"
      },
      {
        "date": "2023-02-14T07:04:00.000Z",
        "voteCount": 1,
        "content": "Yes but it doesn't specify a service. It just generally says connectivity to the server. So for that reason i go with answer B."
      },
      {
        "date": "2023-01-24T15:40:00.000Z",
        "voteCount": 3,
        "content": "I think it's B."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96462-exam-az-140-topic-5-question-26-discussion/",
    "body": "You have an Azure Virtual Desktop deployment that contains the host pools shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image194.png\"><br><br>You need to create a disaster recovery environment in the West US region. The solution must minimize costs and administrative effort.<br><br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegenerate the token and reregister the virtual machines in the host pools.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate two new host pools in the West US region.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Invoke-RdsUserSessionLogoff cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure Site Recovery plan.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 9,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-04-24T07:27:00.000Z",
        "voteCount": 1,
        "content": "what about data of personal VDIs - Correct is D"
      },
      {
        "date": "2024-01-26T16:39:00.000Z",
        "voteCount": 1,
        "content": "D. Create an Azure Site Recovery plan."
      },
      {
        "date": "2023-06-03T07:55:00.000Z",
        "voteCount": 1,
        "content": "minimize costs"
      },
      {
        "date": "2023-04-18T04:34:00.000Z",
        "voteCount": 2,
        "content": "D\n\nWe recommend you use Azure Site Recovery to manage replicating VMs to other Azure locations\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery"
      },
      {
        "date": "2023-03-05T11:43:00.000Z",
        "voteCount": 1,
        "content": "I would suggest option D"
      },
      {
        "date": "2023-02-23T02:40:00.000Z",
        "voteCount": 2,
        "content": "minimize costs"
      },
      {
        "date": "2023-01-30T10:44:00.000Z",
        "voteCount": 1,
        "content": "I would choose D too."
      },
      {
        "date": "2023-01-26T02:31:00.000Z",
        "voteCount": 1,
        "content": "Should be D"
      },
      {
        "date": "2023-01-24T15:42:00.000Z",
        "voteCount": 1,
        "content": "I think D is ccorrecct."
      },
      {
        "date": "2023-01-22T02:12:00.000Z",
        "voteCount": 3,
        "content": "Should be D to minimize costs and administrative effort."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96463-exam-az-140-topic-5-question-27-discussion/",
    "body": "You have an Azure Virtual Desktop deployment.<br><br>You plan to deploy Update Management to manage automated updates for server-based session hosts.<br><br>You need to configure the prerequisites for Update Management.<br><br>Which two actions should you perform? Each correct answer presents part of the solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Log Analytics workspace.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure Automation account.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure Service Health alert rule.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Application Insights Agent.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure Azure Network Watcher."
    ],
    "answer": "AB",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AB",
        "count": 8,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-08-13T20:45:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/automation/update-management/overview#about-update-management"
      },
      {
        "date": "2024-05-02T09:33:00.000Z",
        "voteCount": 1,
        "content": "A. Create a Log Analytics workspace.\nB. Create an Azure Automation account."
      },
      {
        "date": "2024-02-29T11:45:00.000Z",
        "voteCount": 2,
        "content": "Passed with a 919 on 02/29/2024. This question was on the test."
      },
      {
        "date": "2024-01-26T16:41:00.000Z",
        "voteCount": 1,
        "content": "A. Create a Log Analytics workspace.\nB. Create an Azure Automation account."
      },
      {
        "date": "2023-06-03T07:57:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/architecture/hybrid/azure-update-mgmt"
      },
      {
        "date": "2023-03-29T11:44:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2023-01-25T17:07:00.000Z",
        "voteCount": 2,
        "content": "Correct: https://learn.microsoft.com/en-us/azure/architecture/hybrid/azure-update-mgmt"
      },
      {
        "date": "2023-01-22T02:15:00.000Z",
        "voteCount": 2,
        "content": "Correct. https://learn.microsoft.com/en-us/azure/automation/update-management/enable-from-vm"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/95821-exam-az-140-topic-5-question-28-discussion/",
    "body": "You have an Azure subscription named Subscription that contains an Azure Virtual Desktop host pool named HostPool1.<br>HostPool1 is managed by using Microsoft Intune. Subscription1 contains 50 users that connect to HostPool1 by using computers that run Windows 10.<br><br>You need to prevent the users from copying files between an Azure Virtual Desktop session and the computers. The solution must minimize administrative effort.<br><br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the RDP properties of HostPool1.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Conditional Access policy in Azure Active Directory (Azure AD).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a compliance policy in Intune.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a configuration profile in Intune."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 10,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-09-11T06:40:00.000Z",
        "voteCount": 1,
        "content": "From Gemini: Modifying the RDP properties of HostPool1 would require manual changes for each user and wouldn't be scalable for 50 users."
      },
      {
        "date": "2024-09-09T12:34:00.000Z",
        "voteCount": 1,
        "content": "This is from CoPilot: You have an Azure subscription named Subscription that contains an Azure Virtual Desktop host pool named HostPool1.\nHostPool1 is managed by using Microsoft Intune. Subscription1 contains 50 users that connect to HostPool1 by using computers that run Windows 10.\n\nYou need to prevent the users from copying files between an Azure Virtual Desktop session and the computers. The solution must minimize administrative effort.\n\nWhat should you do?\n\nA. Modify the RDP properties of HostPool1. \nB. Create a Conditional Access policy in Azure Active Directory (Azure AD).\nC. Create a compliance policy in Intune.\nD. Create a configuration profile in Intune.\nCopilot\nSent by Copilot:\nTo prevent users from copying files between an Azure Virtual Desktop session and their computers while minimizing administrative effort, you should create a configuration profile in Intune (Option D). This allows you to configure settings such as clipboard redirection and device redirection, ensuring that file transfers are blocked1."
      },
      {
        "date": "2024-05-02T09:34:00.000Z",
        "voteCount": 1,
        "content": "A. Modify the RDP properties of HostPool1."
      },
      {
        "date": "2024-01-26T16:51:00.000Z",
        "voteCount": 1,
        "content": "A. Modify the RDP properties of HostPool1."
      },
      {
        "date": "2023-11-08T04:35:00.000Z",
        "voteCount": 1,
        "content": "A\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/rdp-properties\nClipboard Redirection"
      },
      {
        "date": "2023-06-03T07:58:00.000Z",
        "voteCount": 1,
        "content": "A is correct."
      },
      {
        "date": "2023-03-29T11:45:00.000Z",
        "voteCount": 1,
        "content": "A is correct"
      },
      {
        "date": "2023-03-10T22:28:00.000Z",
        "voteCount": 1,
        "content": "It's A"
      },
      {
        "date": "2023-02-06T12:33:00.000Z",
        "voteCount": 2,
        "content": "A is correct"
      },
      {
        "date": "2023-01-22T02:16:00.000Z",
        "voteCount": 2,
        "content": "A is the correct answer."
      },
      {
        "date": "2023-01-18T04:01:00.000Z",
        "voteCount": 1,
        "content": "should be A"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96464-exam-az-140-topic-5-question-29-discussion/",
    "body": "DRAG DROP<br> -<br><br>You have an Azure Virtual Desktop personal host pool. Each session host in the pool that has an operating system disk and a data disk.<br><br>You need to back up the session host data disks.<br><br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/az-140/image195.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-140/image196.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-18T04:52:00.000Z",
        "voteCount": 11,
        "content": "Tested in lab\n\nCreate backup vault\nCreate policy &amp; configure backup\nGrant permissions for the vault\n\nWhen I enabled the backup on the storage account and selected the vault an alert was shown\n\"The vault selected here needs to have storage account backup contributor as the role on this storage account in order to configure backup. Manage Identity. \n\nClicked Manage Identity hyperlink\n\nSystem assigned (preview)\nA system assigned managed identity is restricted to one per resource and is tied to the lifecycle of this resource. You can grant permissions to the managed identity by using Azure role-based access control (Azure RBAC). The managed identity is authenticated with Azure AD, so you don’t have to store any credentials in code. Learn more about Managed identities."
      },
      {
        "date": "2024-06-19T04:28:00.000Z",
        "voteCount": 1,
        "content": "it was shown because you need to grant permission first"
      },
      {
        "date": "2023-06-03T08:21:00.000Z",
        "voteCount": 5,
        "content": "I also tested in the lab.\n1. Create backup vault\n2. Create a policy &amp; configure backup\n3. Grant permissions for the vault (managed identity was created automatically with the Backup vault.)"
      },
      {
        "date": "2024-02-29T11:47:00.000Z",
        "voteCount": 3,
        "content": "Passed with a 919 on 02/29/2024. This question was on the test. I answered the following way, not claiming it's the correct order.\n1. Create backup vault\n2. Grant Permissions for the vault\n3. Create policy and configure backup"
      },
      {
        "date": "2024-01-26T16:53:00.000Z",
        "voteCount": 1,
        "content": "1-3 Create backup vault\n2-3 Create policy &amp; configure backup\n3-3 Grant permissions for the vault"
      },
      {
        "date": "2023-03-29T11:49:00.000Z",
        "voteCount": 1,
        "content": "Correct. The documentation sais that the service uses managed identity but you don't have to set it up. Just grant it the permissions required: \"Backup vault uses managed identity to access other Azure resources. To configure a backup of managed disks, Backup Vault’s managed identity requires a set of permissions on the source disks and resource groups where snapshots are created and managed.\""
      },
      {
        "date": "2023-01-25T17:29:00.000Z",
        "voteCount": 2,
        "content": "According to this document: https://learn.microsoft.com/en-us/azure/backup/backup-managed-disks\nI think this is the correct order: \n1. Create a backup vault\n2. Create a backup policy and configure a backup\n3. Configure a managed identity"
      },
      {
        "date": "2023-01-30T13:55:00.000Z",
        "voteCount": 9,
        "content": "Thanks for the ref link, but I believe the order is\n1. Create a backup vault\n2. Configure a managed identity - this is a prerequisites\n3. Create a backup policy and configure a backup\nQ require to backup the Data disk only, so it will not be the recovery vault which is used to back the whole VM\nanother ref:\nhttps://learn.microsoft.com/en-us/answers/questions/405915/what-is-difference-between-recovery-services-vault"
      },
      {
        "date": "2023-01-22T02:18:00.000Z",
        "voteCount": 2,
        "content": "Correct."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96466-exam-az-140-topic-5-question-31-discussion/",
    "body": "You have an Azure Virtual Desktop deployment.<br><br>You plan to create a new host pool named Pool1 that will contain five Windows 11 session hosts.<br><br>You need to enable secure boot and vTPM on the session hosts.<br><br>How should you configure the Virtual Machines settings?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable encryption at rest and a platform-managed key.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet Security type to Trusted launch virtual machines.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable a system-assigned managed identity.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet Network security group to Advanced."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-27T19:10:00.000Z",
        "voteCount": 1,
        "content": "B. Set Security type to Trusted launch virtual machines."
      },
      {
        "date": "2023-01-25T17:35:00.000Z",
        "voteCount": 2,
        "content": "Correct. https://learn.microsoft.com/en-us/azure/virtual-machines/trusted-launch-portal?tabs=portal%2Cportal2#deploy-a-trusted-launch-vm"
      },
      {
        "date": "2023-01-22T02:23:00.000Z",
        "voteCount": 1,
        "content": "Correct. https://learn.microsoft.com/en-us/azure/virtual-machines/trusted-launch"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96470-exam-az-140-topic-5-question-32-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Azure Virtual Desktop host pool named HostPool1 that must support 60 sessions.<br><br>The session hosts for HostPool1 are configured as shown in the following exhibit.<br><br><img src=\"https://img.examtopics.com/az-140/image199.png\"><br><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-140/image200.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-140/image201.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-25T02:39:00.000Z",
        "voteCount": 24,
        "content": "depht-first\n20"
      },
      {
        "date": "2023-06-01T03:07:00.000Z",
        "voteCount": 6,
        "content": "Current setup is Depth as we can see 59 active sessions on one host\n20 - It's asking for stability if a host fails. We have four host meaning one could fail and all 60 user would still have access"
      },
      {
        "date": "2023-11-08T04:41:00.000Z",
        "voteCount": 2,
        "content": "- Pooled host pool that uses depth-first (why else 59 sessions on 1 host?)\n- 20 sessions (= 60 sessions / 3 remaning hosts)"
      },
      {
        "date": "2023-11-08T04:44:00.000Z",
        "voteCount": 1,
        "content": "(don't forget 'maximum performance', so 20 sessions"
      },
      {
        "date": "2023-09-13T07:28:00.000Z",
        "voteCount": 1,
        "content": "The Max session limit setting of Host must be set to 60 to maximize performance and provide user access if a single session host fails, because is a pooled host pool that uses breadth-first load balancing."
      },
      {
        "date": "2023-10-05T00:15:00.000Z",
        "voteCount": 9,
        "content": "Everything in your answer is so wrong it hurts. Please do not share answers like this. It just confuses people."
      },
      {
        "date": "2023-05-24T03:22:00.000Z",
        "voteCount": 1,
        "content": "If the question asks about how the hostpool should be used to achieve max performance, that should be breadth first.(since one session host had less users if not all the 60 users are in the same shift. Lets say, there are 21 users/shift--&gt; with breadth first: 7 users/session host) If the question asks about the current configuration, it is depth first.The question itself is not clear. The number of hosts should be set to 20/hosts since if there is one session goes offline, there should be enough session hosts to support 60 users --&gt;3X20=60.\nSo 20 users is definitely a good answer, however, about load balancing...the question is not clear. (for me)"
      },
      {
        "date": "2023-04-17T09:20:00.000Z",
        "voteCount": 4,
        "content": "depth\n60"
      },
      {
        "date": "2023-02-23T02:47:00.000Z",
        "voteCount": 3,
        "content": "depth\n15"
      },
      {
        "date": "2023-02-14T07:25:00.000Z",
        "voteCount": 1,
        "content": "Why 20 when there is 4 hosts? 15x4=60\nthe current config is depth but it should be changed to breadth."
      },
      {
        "date": "2023-02-23T14:24:00.000Z",
        "voteCount": 11,
        "content": "It's asking about if a single Host fails. Which leaves 3 Hosts, not 4.  3x20=60"
      },
      {
        "date": "2023-02-02T06:15:00.000Z",
        "voteCount": 2,
        "content": "incorrect answer - Depth first"
      },
      {
        "date": "2023-01-24T07:41:00.000Z",
        "voteCount": 3,
        "content": "Should be 60 and depth-first"
      },
      {
        "date": "2023-01-24T07:40:00.000Z",
        "voteCount": 1,
        "content": "Incorrect, should be depth-first"
      },
      {
        "date": "2023-01-24T07:06:00.000Z",
        "voteCount": 3,
        "content": "I think the first answer is incorrect it should be depth-first if you look at the image, all the sessions I logged on one host.."
      },
      {
        "date": "2023-01-22T02:27:00.000Z",
        "voteCount": 1,
        "content": "Correct."
      },
      {
        "date": "2023-01-26T02:41:00.000Z",
        "voteCount": 4,
        "content": "I'm wrong. Should be Depth- first and 20."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96879-exam-az-140-topic-5-question-33-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Azure Virtual Desktop deployment that contains the resources shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image202.png\"><br><br>You create the resources shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image203.png\"><br><br>You need to meet following requirements:<br><br>•\tBack up the FSLogix profile containers used by HostPool1.<br>•\tBackup the data disks in HostPool2.<br><br>To which resources can you back up the profile containers and the data disks? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-140/image204.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-140/image205.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-25T18:04:00.000Z",
        "voteCount": 10,
        "content": "Correct. You can backup items from the same region only. Difference between RSV and  Backup vaults are: https://harvestingclouds.com/post/azure-recovery-services-vaults-vs-backup-vaults/"
      },
      {
        "date": "2024-06-14T23:05:00.000Z",
        "voteCount": 1,
        "content": "Azure Recovery Services vaults can protect the following types of datasources:\n\nAzure Virtual machines\nSQL in Azure VM\nAzure Files (Azure Storage)\nSAP HANA in Azure VM\nAzure Backup Server\nAzure Backup Agent\nDPM\nAzure Backup vaults can protect the following types of datasources:\n\nAzure Database for PostgreSQL servers\nAzure Blobs (Azure Storage)\nAzure Disks\nKubernetes Service\nAVS Virtual machines"
      },
      {
        "date": "2024-04-11T02:09:00.000Z",
        "voteCount": 2,
        "content": "According to ChatGPT-4, correct answers are:\nFor FSLogix profile containers: Backup1 and Recovery1 only\nFor Data disks: Backup1 and Recovery1 only"
      },
      {
        "date": "2023-12-21T11:23:00.000Z",
        "voteCount": 2,
        "content": "1st Answer: Backup 1 Only\n2nd Answer: Backup 1 and Recovery 1 Only\nAzure Disks can be backed up by Backup Vaults. Those vaults are in the same region as the host pools data disks."
      },
      {
        "date": "2024-03-03T03:51:00.000Z",
        "voteCount": 2,
        "content": "Using recovery services vault, the entire VM can be backed up but not just a data disk. \nso\nProfiles: Recovery1 only (in same region, fileshare)\nDataDisks: Backup1 only (in same region and only data disk, not the entire vm). Backup2 is not option, cross-region restore is possible but no cross-region backup)"
      },
      {
        "date": "2023-09-13T07:33:00.000Z",
        "voteCount": 1,
        "content": "FSLogix profile containers: Backup1 only\nData disks: Backup1 and Backup2"
      },
      {
        "date": "2023-10-05T00:19:00.000Z",
        "voteCount": 3,
        "content": "Wrong. Backup2 is at a different region.\nThe provided answer is correct."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96469-exam-az-140-topic-5-question-34-discussion/",
    "body": "You have an Azure Virtual Desktop pooled host pool named HostPool1.<br><br>You need to dynamically allocate resources to HostPool1 based on the number of sessions for each host.<br><br>What should you create?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta load balancer rule",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta scaling plan\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta virtual machine scale set",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan availability set"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-02-09T06:53:00.000Z",
        "voteCount": 1,
        "content": "B. a scaling plan"
      },
      {
        "date": "2023-01-25T18:10:00.000Z",
        "voteCount": 1,
        "content": "Correct: https://learn.microsoft.com/en-us/azure/virtual-desktop/autoscale-scenarios"
      },
      {
        "date": "2023-01-22T02:27:00.000Z",
        "voteCount": 1,
        "content": "Correct."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96474-exam-az-140-topic-5-question-36-discussion/",
    "body": "You have an Azure Virtual Desktop personal host pool named Pool1 that contains 20 Azure AD-joined session hosts.<br><br>You need to ensure that only approved virtual machine extensions are installed on the Pool 1 session hosts. The solution must minimize administrative effort.<br><br>What should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Resource Manager (ARM) templates",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Policy\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWindows Admin Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGroup Policy"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 8,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 3,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-01-25T18:36:00.000Z",
        "voteCount": 6,
        "content": "Correct answer is B: Azure Policy. This is Built-in policy: \"Only approved VM extensions should be installed\" (find in: Azure portal &gt; Policy &gt; Definitions)"
      },
      {
        "date": "2024-04-01T08:36:00.000Z",
        "voteCount": 1,
        "content": "where did question 35 go :D"
      },
      {
        "date": "2024-04-07T13:47:00.000Z",
        "voteCount": 1,
        "content": "It's same as question 10 in topic 1"
      },
      {
        "date": "2023-09-13T07:38:00.000Z",
        "voteCount": 1,
        "content": "Azure Policy allows you to create and apply policies that enforce specific rules and conditions on your Azure resources, including virtual machines and extensions. You can define custom policies or use built-in policies to control what extensions can be installed on virtual machines. This minimizes administrative effort as you can centrally manage and enforce these policies across your environment without relying on manual configurations or individual host-based solutions like Group Policy."
      },
      {
        "date": "2023-06-03T08:35:00.000Z",
        "voteCount": 1,
        "content": "B: Azure Policy"
      },
      {
        "date": "2023-04-18T13:41:00.000Z",
        "voteCount": 1,
        "content": "Agree with ZokiZokic2023\nB\nwhile ARM templates can be used, the question asks that only approved extensions are installed. Azure policy would allow/prohibit this behavior"
      },
      {
        "date": "2023-01-30T14:20:00.000Z",
        "voteCount": 1,
        "content": "I would choose A"
      },
      {
        "date": "2023-01-30T14:21:00.000Z",
        "voteCount": 2,
        "content": "Sorry, I mean I would choose B, Azure policy"
      },
      {
        "date": "2023-01-22T02:36:00.000Z",
        "voteCount": 2,
        "content": "Should be A. https://learn.microsoft.com/en-us/azure/virtual-machines/extensions/custom-script-windows#template-deployment"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/119070-exam-az-140-topic-5-question-37-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Overview -<br><br>Contoso, Ltd. is a law firm that has a main office in Montreal and branch offices in Paris and Seattle. The Seattle branch office opened recently.<br><br>Contoso has an Azure subscription and uses Microsoft 365.<br><br>Existing Infrastructure. Active Directory<br><br>The network contains an on-premises Active Directory domain named contoso.com and an Azure Active Directory (Azure AD) tenant. One of the domain controllers runs as an Azure virtual machine and connects to a virtual network named VNET1. All internal name resolution is provided by DNS server that run on the domain controllers.<br><br>The on-premises Active Directory domain contains the organizational units (OUs) shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image236.png\"><br><br>The on-premises Active Directory domain contains the users shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image237.png\"><br><br>The Azure AD tenant contains the cloud-only users shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image238.png\"><br><br>Existing Infrastructure. Network Infrastructure<br><br>All the Azure virtual networks are peered. The on-premises network connects to the virtual networks.<br><br>A virtual network named VNET4 was recently created are peered to the other virtual networks. VNET4 does NOT contain any AVD virtual machines.<br><br>All servers run Windows Server 2019. All laptops and desktop computers run Windows 10 Enterprise.<br><br>Since users often work on confidential documents, all the users use their computer as a client for connecting to Remote Desktop Services (RDS).<br><br>In the West US Azure region, you have the storage accounts shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image239.png\"><br><br>Existing Infrastructure. Remote Desktop Infrastructure<br><br>Contoso has a Remote Desktop infrastructure shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image240.png\"><br><br><br>Requirements. Planned Changes -<br><br>Contoso plans to implement the following changes:<br><br>•\tImplement FSLogix profile containers for the Paris offices.<br>•\tDeploy an Azure Virtual Desktop host pool named Pool4.<br>•\tMigrate the RDS deployment in the Seattle office to Azure Virtual Desktop in the West US Azure region.<br><br>Requirements. Pool4 Configuration<br><br>Pool4 will have the following settings:<br><br>•\tHost pool type: Pooled<br>•\tMax session limit: 7<br>•\tLoad balancing algorithm: Depth-first<br>•\tImages: Windows 10 Enterprise multi-session<br>•\tVirtual machine size: Standard D2s v3<br>•\tName prefix: Pool4<br>•\tNumber of VMs: 5<br>•\tVirtual network: VNET4<br><br>Requirements. Technical Requirements<br><br>Contoso identifies the following technical requirements:<br><br>•\tBefore migrating the RDS deployment in the Seattle office, obtain the recommended deployment configuration based on the current RDS utilization.<br>•\tFor the Azure Virtual Desktop deployment in the Montreal office, disable audio output in the device redirection settings.<br>•\tFor the Azure Virtual Desktop deployment in the Seattle office, store the FSLogix profile containers in Azure Storage.<br>•\tEnable Operator2 to modify the RDP Properties of the Azure Virtual Desktop deployment in the Montreal office.<br>•\tFrom a server named Server1, convert the user profile disks to the FSLogix profile containers.<br>•\tEnsure that the Pool1 virtual machines only run during business hours.<br>•\tUse the principle of least privilege.<br><br><br>You need to configure the virtual machines that have the Pool1 prefix. The solution must meet the technical requirements.<br><br>What should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure Virtual Desktop automation task",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAccess control (IAM)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tService Health in Azure Monitor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Automation\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 10,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-08-25T13:17:00.000Z",
        "voteCount": 7,
        "content": "Correct Answer is D: \nAzure Automation allows you to configure run times for the VMs\n\nNot A - \"Azure Virtual Desktop automation tasks\" are not a thing. The only reference to that text string on google are test dumps. \n\nNot B - Could be used to allow Operator 2 to modify RDP Properties of the Host Pool, but the question asks about configuring the VMs not the Host pool\n\nNot C - The request is not to Monitor it is to make changes to the start/stop state of the VMs"
      },
      {
        "date": "2024-02-29T11:49:00.000Z",
        "voteCount": 1,
        "content": "Passed with a 919 on 02/29/2024. This question was on the test."
      },
      {
        "date": "2023-09-10T16:20:00.000Z",
        "voteCount": 2,
        "content": "D is the answer"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 36,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121762-exam-az-140-topic-5-question-38-discussion/",
    "body": "You have an Azure Virtual Desktop deployment that contains two Azure regions.<br><br>You plan to implement a disaster recovery solution for user profiles. The solution must meet the following requirements:<br><br>•\tUsers must retain their user profiles if a single region fails.<br>•\tAdministrative effort must be minimized.<br><br>What should you include in the recommendation?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Storage accounts that use zone-redundant storage (ZRS)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Site Recovery",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFSLogix Cloud Cache\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Backup",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFSLogix with VHDLocations"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 8,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-07-07T13:05:00.000Z",
        "voteCount": 1,
        "content": "By implementing FSLogix Cloud Cache, you achieve an effective disaster recovery solution for user profiles in your Azure Virtual Desktop deployment across multiple Azure regions, while significantly reducing administrative overhead and ensuring business continuity for your users."
      },
      {
        "date": "2024-06-18T03:32:00.000Z",
        "voteCount": 2,
        "content": "As the question never mentions FSLogix as the profile solution, then CCD would be more administrative effort to set up from scratch.  Answer is therefore B Az Site Recovery."
      },
      {
        "date": "2024-06-14T23:15:00.000Z",
        "voteCount": 1,
        "content": "FSLogix Profiles\nFSLogix user profiles are another consideration for BCDR planning with AVD. Azure Site Recovery protects servers, not storage accounts. Currently, there is no native Azure feature to replicate Azure Files Premium or Standard storage account with large file support enabled to a failover region.  Consider using Cloud Cache to maintain multiple copies of the profile data at the primary and recovery region or Azure NetApp Files to replicate a copy of the profiles to a secondary region.\n\nI would go for C"
      },
      {
        "date": "2024-05-26T09:10:00.000Z",
        "voteCount": 1,
        "content": "B - Azure Site Recovery\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/disaster-recovery"
      },
      {
        "date": "2024-05-02T10:07:00.000Z",
        "voteCount": 1,
        "content": "C: FSLogix Cloud Cache should be used for Business Continuity plans\n\nhttps://learn.microsoft.com/en-us/fslogix/concepts-container-recovery-business-continuity"
      },
      {
        "date": "2024-01-29T18:31:00.000Z",
        "voteCount": 2,
        "content": "B. Azure Site Recovery"
      },
      {
        "date": "2024-01-28T09:45:00.000Z",
        "voteCount": 1,
        "content": "Looking at both of the links below, I'd say the answer is correct.  It seems both options will maintain user profiles, but Site Recovery does it with the least administrative effort."
      },
      {
        "date": "2023-12-23T13:56:00.000Z",
        "voteCount": 2,
        "content": "I think it's C. FSLogic Cloud Cache\nBased on this: \nhttps://learn.microsoft.com/en-us/fslogix/concepts-container-recovery-business-continuity"
      },
      {
        "date": "2023-12-06T06:20:00.000Z",
        "voteCount": 2,
        "content": "I think based on this:\nhttps://azure.microsoft.com/en-us/products/site-recovery/\nAnswer is correct."
      },
      {
        "date": "2023-09-28T17:57:00.000Z",
        "voteCount": 4,
        "content": "Cloud cache! It can store the cache in up to 4 locations."
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 37,
    "url": "https://www.examtopics.com/discussions/microsoft/view/120371-exam-az-140-topic-5-question-39-discussion/",
    "body": "DRAG DROP<br> -<br><br>You have an Azure Virtual Desktop deployment and the Azure Storage accounts shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image253.png\"><br><br>You plan to create FSLogix profile containers and store the containers in the storage accounts.<br><br>You need to identify which storage accounts support the FSLogix profile containers, and then order the accounts from highest to lowest redundancy.<br><br>Which three storage accounts should you identify in sequence? To answer, move the appropriate accounts from the list of accounts to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/az-140/image254.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-140/image255.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-09-09T15:50:00.000Z",
        "voteCount": 7,
        "content": "1. storage 1 - GRS\n2. storage 5 - ZRS\n3. storage 2 - LRS"
      },
      {
        "date": "2024-05-26T09:15:00.000Z",
        "voteCount": 1,
        "content": "Are you able to explain why?"
      },
      {
        "date": "2024-07-30T10:01:00.000Z",
        "voteCount": 3,
        "content": "Storage 3 &amp; 4 are blob type and therefore cannot be used to store FSLogix profiles. We can only use General Purpose v2 &amp; Azure Files Premium to host FSLogix profiles.\n\nThen, the most redundant storage is storage 1 because it use GRS (replication between two distinct Azure paired Regions).\n\nIn a second place we have storage 5 that use ZRS (replication between the 2 or 3 availability zones inside the same Azure Regions).\n\nIn the third place, storage 2 use LRS (Local Redundant Storage =&gt; 3 copies inside the same availability zone).\n\nIn other words storage 1 can survive to an entire region outage; storage 5 can survive to a local datacenter outage inside the same region &amp; storage 2 can survive to a server failure inside the same availability zone / region."
      },
      {
        "date": "2024-05-06T16:26:00.000Z",
        "voteCount": 1,
        "content": "1. storage 1 - GRS\n2. storage 5 - ZRS\n3. storage 2 - LRS"
      },
      {
        "date": "2024-05-02T10:08:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct:\n1. storage 1 - GRS\n2. storage 5 - ZRS\n3. storage 2 - LRS"
      },
      {
        "date": "2024-01-29T18:32:00.000Z",
        "voteCount": 1,
        "content": "1. storage 01 - GRS\n2. storage 05 - ZRS\n3. storage 02 - LRS"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  },
  {
    "topic": 5,
    "index": 38,
    "url": "https://www.examtopics.com/discussions/microsoft/view/120372-exam-az-140-topic-5-question-40-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Azure subscription that contains the storage accounts shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image256.png\"><br><br>The subscription contains the vaults shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image257.png\"><br><br>The subscription contains the Azure Virtual Desktop host pools shown in the following table.<br><br><img src=\"https://img.examtopics.com/az-140/image258.png\"><br><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/az-140/image259.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/az-140/image260.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-05T00:31:00.000Z",
        "voteCount": 8,
        "content": "NYN... You can't backup a VM to a Backup Vault. Only to a recovery services vault.\n\nhttps://harvestingclouds.com/images/1648101762623c098286f87.png"
      },
      {
        "date": "2024-05-02T10:10:00.000Z",
        "voteCount": 2,
        "content": "N\nY\nN \n\nBackup a VM to a Backup Vault is not supported."
      },
      {
        "date": "2024-01-31T18:52:00.000Z",
        "voteCount": 2,
        "content": "No\nYes\nNo\nYou can't backup a VM to a Backup Vault. Only to a recovery services vault."
      },
      {
        "date": "2023-09-28T18:02:00.000Z",
        "voteCount": 2,
        "content": "NYN is correct. You can't backup a file share to a backup fault, only a service recovery vault."
      },
      {
        "date": "2023-09-16T06:25:00.000Z",
        "voteCount": 4,
        "content": "Should be NYN because a VM can only be backed up in a RSV. https://harvestingclouds.com/post/azure-recovery-services-vaults-vs-backup-vaults/"
      },
      {
        "date": "2023-09-09T15:58:00.000Z",
        "voteCount": 3,
        "content": "i think it's NYN... session hosts are backed up with Recovery Services vault. (i cant find a resource that says otherwise)"
      }
    ],
    "examNameCode": "az-140",
    "topicNumber": "5"
  }
]