[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/44248-exam-70-341-topic-1-question-11-discussion/",
    "body": "You have an Exchange Server 2013 organization named for Contoso.<br>A user named Admin1 is a member of the Domain Admins group.<br>Admin1 fails to synchronize a new Windows Phone device by using Exchange ActiveSync and receives an HTTP 500 error message. Admin1 successfully logs on to Outlook Web App and Outlook Anywhere.<br>You need to ensure that Admin1 can synchronize the new Windows Phone device by using Exchange ActiveSync.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall a trusted root certificate on the Windows Phone device.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new mobile device mailbox policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable permission inheritance on the Admin1 user account.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable permission inheritance on the Admin1 user account."
    ],
    "answer": "C",
    "answerDescription": "Mobile device mailbox policy -<br>In Microsoft Exchange Server 2013, you can create mobile device mailbox policies to apply a common set of policies or security settings to a collection of users.<br>After you deploy Exchange ActiveSync in your Exchange 2013 organization, you can create new mobile device mailbox policies or modify existing policies. When you install Exchange 2013, a default mobile device mailbox policy is created. All users are automatically assigned this default mobile device mailbox policy.",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-07T21:48:00.000Z",
        "voteCount": 1,
        "content": "the explanation says: In Microsoft Exchange Server 2013, you can create mobile device mailbox policies to apply a common set of policies or security settings to a collection of users.\n\nBut the correct answer is marked as C. Enable permission inheritance on the Admin1 user account.\n\nWhat is the correct answer then?"
      }
    ],
    "examNameCode": "70-341",
    "topicNumber": "1"
  }
]