[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/3439-exam-70-334-topic-1-question-3-discussion/",
    "body": "DRAG DROP -<br><br>Case Study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br><br>General Overview -<br>Litware, Inc., is an international manufacturing company that has 4,000 employees. The company has a sales department, a marketing department, a research department, and a human resources department.<br>Litware has a partner company named Fabrikam, Inc. Fabrikam has an office in Paris. Fabrikam uses a XMPP-based instant messaging (IM) solution.<br><br>Physical Locations -<br>Litware has seven offices located throughout North America and Europe.<br>Litware has two data centers. The data centers are located in New York and London. All communications for the North American offices are routed through the<br>New York data center. All communications for the European offices are routed through the London data center.<br>The number of users in each office is shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0001000001.png\" class=\"in-exam-image\"><br><br>Active Directory Environment -<br>Litware has an Active Directory Domain Services (AD DS) forest named litwareinc.com. The forest contains a single domain. All domain controllers run Windows<br>Server 2008 R2.<br>Each office contains five domain controllers. Each office is configured as an Active Directory site.<br><br>Lync Server Environment -<br>Litware has a Lync Server 2013 infrastructure that contains two servers in the New York office. The servers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0001000002.png\" class=\"in-exam-image\"><br>The SIP domain is litwareinc.com.<br>Litware has a Microsoft Exchange Server 2013 organization.<br><br>Problem Statements -<br>Users in the London office report poor video quality during conferences.<br><br>Requirements -<br><br>Business Goals -<br>Litware wants to minimize the costs associated with purchasing hardware and software.<br><br>Planned Changes -<br>Litware plans to migrate the Lync Server 2013 infrastructure to Skype for Business Server 2015. The migration will have a coexistence period of six months.<br>Litware plans to implement the following components as part of the planned migration:<br>✑ Persistent Chat<br>✑ Unified contact store<br>✑ Enterprise Voice for all users<br>✑ A central site in each data center<br>✑ A branch site in each branch office<br>✑ A Front End pool in each central site<br>✑ Skype for Business Phone Edition devices<br>✑ Pool pairing<br>Litware plans to create a federation relationship with Fabrikam.<br><br>Technical Requirements -<br>Litware identifies the following technical requirements for the planned migration:<br>✑ Users must be able to use all Skype for Business Server features if a single server fails.<br>✑ Users must be able to connect to the Skype for Business Server infrastructure if a single central site fails.<br>✑ Members of a group named Temp_Contractors must be prevented from using Skype for Business when they connect remotely.<br>✑ Only users in the human resources department must be able to access and discover a persistent chat room named HRConfidential.<br><br>Security Requirements -<br>Litware plans to deploy remote access. Some users work remotely from their customers offices, which have firewall restrictions. All of the remote users must be able to connect to the Skype for Business Server 2015 infrastructure by using TCP port 443.<br>You need to move the Central Management store during the planned migration.<br>Which five actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02119/0001200001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0001300001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-17T12:36:00.000Z",
        "voteCount": 2,
        "content": "1-Export\n2-Install\n3-Enable\n4-Move\n5-Setup in each Front End server"
      },
      {
        "date": "2019-08-10T18:51:00.000Z",
        "voteCount": 2,
        "content": "the setup.exe must be last step\nreference https://blogs.technet.microsoft.com/uctalks/2016/05/09/moving-the-cms-make-it-part-of-your-upgrade-action-plan-part-1/"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/254-exam-70-334-topic-1-question-9-discussion/",
    "body": "DRAG DROP -<br>You support Skype for Business clients and servers in your customers company network. All computers are members of a single Active Directory Domain<br>Services (AD DS) domain named contoso.local. The single front-end Skype for Business Server 2015 server is configured to support a Session Initiation Protocol<br>(SIP) domain named contoso.com.<br>You configure Skype for Business to support users from a new SIP domain named proseware.net.<br>The users of the new SIP domain report that the Skype for Business client is able to connect to the Skype for Business server only after manual configuration.<br>Users of the Contoso.com SIP domain are able to connect to Skype for Business server automatically, both internally and externally.<br>You need to restore the internal and external automatic discovery features for the users of the proseware.net SIP domain.<br>Which fully qualified domain name (FQDN) should you add to the subject alternative name (SAN) for each certificate? To answer, drag the appropriate FQDN to the correct certificate request. Each FQDN may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02119/0002500001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0002600001.png\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://technet.microsoft.com/en-gb/library/dn951397.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-11-06T12:01:00.000Z",
        "voteCount": 1,
        "content": "This should be: SAN Internal = LyncDiscoverInternal.contoso.local and SAN External = LyncDiscover.Proseware.net"
      },
      {
        "date": "2019-11-06T12:06:00.000Z",
        "voteCount": 2,
        "content": "My apologies. it should be \nSAN Internal = LyncDiscoverInternal.proseware.net\nSAN External = LyncDiscover.Proseware.net\n\nThis because the contoso users do not expirience any problems. Also, there isn't any awareness that any proseware.net sip addresses were already added to the certificate."
      },
      {
        "date": "2019-02-04T00:26:00.000Z",
        "voteCount": 2,
        "content": "SAN for external Autodiscover URL should not be lyncdiscover.proceware.net?"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7868-exam-70-334-topic-1-question-12-discussion/",
    "body": "HOTSPOT -<br>A company deploys Office Web Apps Server 2013 to support Microsoft Exchange and SharePoint. You have a physical instance of SQL Server in an AlwaysOn<br>Availability group configuration. The company plans to deploy a Skype for Business Server 2015 solution that supports 3,000 users.<br>You have the following requirements:<br>✑ Existing meeting rooms must be able to join Skype meetings that use video.<br>✑ All new servers must be deployed in the existing virtual environment when possible.<br>✑ Video interoperability must use a Skype for Business solution.<br>✑ Hardware and software costs must be minimized.<br>You need to deploy the Skype for Business Server 2015 roles.<br>In the table below, identify the server role to be deployed.<br>NOTE: Make only one selection in each column. Each correct answer is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02119/0003100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0003200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-11-16T19:12:00.000Z",
        "voteCount": 1,
        "content": "Venwaik, you think \"Make only one selection in each column.\" is a typo?"
      },
      {
        "date": "2020-07-28T02:26:00.000Z",
        "voteCount": 1,
        "content": "Not is a typo"
      },
      {
        "date": "2019-11-16T14:17:00.000Z",
        "voteCount": 2,
        "content": "Venwaik, you think \"Make only one selection in each column.\" is a typo?"
      },
      {
        "date": "2019-11-17T10:23:00.000Z",
        "voteCount": 1,
        "content": "My apologies, misread!"
      },
      {
        "date": "2019-11-09T04:55:00.000Z",
        "voteCount": 1,
        "content": "Virtual\nPhysical\nPhysical\nVirtual\nPhysical"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/256-exam-70-334-topic-1-question-19-discussion/",
    "body": "Contoso is evaluating the implementation of push notifications for Windows Phone devices.<br>You need to identify which tasks must be performed to enable the push notifications.<br>Which three Skype for Business Management Shell cmdlets should you identify? Each correct answer presents part of the solution. (Choose three.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-CsPushNotificationConfiguration",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-CsHostingProvider",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet-CsPublicProvider",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable-CsPublicProvider",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-CsAllowedDomain"
    ],
    "answer": "ABE",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-02-04T00:57:00.000Z",
        "voteCount": 1,
        "content": "References: https://docs.microsoft.com/de-de/skypeforbusiness/deploy/deploy-and-configure-mobility#ConfigPush"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/3440-exam-70-334-topic-1-question-31-discussion/",
    "body": "DRAG DROP -<br>You have a Skype for Business Server 2015 infrastructure.<br>You must troubleshoot issues related to the following:<br>✑ Routing calls between internal users.<br>✑ Routing outbound calls handled by Skype for Business Server 2015.<br>Which tools should you recommend? To answer, drag the appropriate tool to the correct location in the answer area. Each tool may be used once, more than once, or not at all. Additionally, you may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0005700001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-10T20:06:00.000Z",
        "voteCount": 1,
        "content": "both clslogger"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15-exam-70-334-topic-1-question-34-discussion/",
    "body": "DRAG DROP -<br>You have a Skype for Business Server 2015 infrastructure that contains two servers. The servers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0006000002.png\" class=\"in-exam-image\"><br>You deploy a new server named Server3.contoso.com.<br>You need to install the Edge Server role on Server3.contoso.com.<br>In which order should you perform the actions? To answer, move all actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02119/0006100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0006200001.png\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>http://www.sherweb.com/blog/installing-lync-2013-edge-server/",
    "votes": [],
    "comments": [
      {
        "date": "2019-01-15T21:40:00.000Z",
        "voteCount": 3,
        "content": "I am not sure if the answer is correct. Isn't step should be. 1. Modify topology Server1 2. Publish topology from server1 3. Export Cs-config 4. Install SFB on Server 3 and finally import config on server3.\n\nI have checked the referece website and they say export first and then import. \nhttps://www.sherweb.com/blog/installing-lync-2013-edge-server/"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/258-exam-70-334-topic-1-question-37-discussion/",
    "body": "You have a Lync Server 2013 and Skype for Business Server 2015 infrastructure. You migrate all users to the Skype for Business Server 2015 Front End pool.<br>After the migration, users are unable to access the whiteboards, attachments, poll data, and the Microsoft PowerPoint presentations that were uploaded to meetings before the migration.<br>You need to ensure that users can access the PowerPoint presentations, whiteboards, attachments, and the poll data.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Move-CsConferenceDirectorySkype for Business Management cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Move-CsUserSkype for Business Management cmdlet and specify a value for the-ProxyPoolparameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Move-CsUserSkype for Business Management cmdlet and specify a value for the-MoveConferenceDataparameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun theMove-CsLegacyUserSkype for Business Managementshell cmdlet."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-11T09:08:00.000Z",
        "voteCount": 1,
        "content": "NO, It's have  this parameter\nI think is C"
      },
      {
        "date": "2019-02-04T02:42:00.000Z",
        "voteCount": 2,
        "content": "Right Answer must be A. There are no such Parameter -MoveConferenceData in Move-CsUser cmdlet (https://docs.microsoft.com/en-us/powershell/module/skype/move-csuser?view=skype-ps)"
      },
      {
        "date": "2019-07-12T08:08:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/lyncserver/migrate-existing-meetings-and-meeting-content"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/8415-exam-70-334-topic-1-question-38-discussion/",
    "body": "You have a Skype for Business Server 2015 infrastructure that consists of two sites. The sites are located in New York and Rome. Each site has Enterprise Voice deployed and contains separate dial plans and voice policies.<br>You plan to deploy dial-in conferencing to both sites. In each site, you create a dedicated conferencing policy. You assign the conferencing policies to the respective users in each site. You create a dial-in conferencing access number.<br>When you attempt to assign a region to the number, you discover that the regions are unavailable.<br>You need to ensure that you can add a region to the dial-in conferencing access number.<br>What should you modify?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe meeting configuration settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe dial plans",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe conferencing policies",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe voice policies"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-11-17T07:50:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/powershell/module/skype/get-csdialinconferencingaccessnumber?view=skype-ps"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/8489-exam-70-334-topic-1-question-43-discussion/",
    "body": "DRAG DROP -<br>You have a Skype for Business Server 2015 infrastructure that contains four Front End pools. The pools are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0006800001.png\" class=\"in-exam-image\"><br>You configure three archiving policies as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0006800002.png\" class=\"in-exam-image\"><br>You need to identify which archiving setting will apply each group of users.<br>Which archiving settings will be applied?<br>To answer, drag the appropriate archiving settings to the correct user group in the answer area. Each archiving setting may be used once, more than once, or not at all. Additionally, you may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0006900001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-04T10:48:00.000Z",
        "voteCount": 1,
        "content": "User policies override any global policy or site policies.\nhttps://docs.microsoft.com/ru-ru/skypeforbusiness/deploy/deploy-archiving/configure-archiving-policies"
      },
      {
        "date": "2019-11-22T03:59:00.000Z",
        "voteCount": 1,
        "content": "venwaik, what is the reasoning?"
      },
      {
        "date": "2019-11-18T12:52:00.000Z",
        "voteCount": 1,
        "content": "Both\nBoth\nBoth\nExternal"
      },
      {
        "date": "2019-11-28T05:18:00.000Z",
        "voteCount": 1,
        "content": "what is the reasoning?"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/5240-exam-70-334-topic-1-question-44-discussion/",
    "body": "Case Study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br>Contoso, Ltd. is an international manufacturing company that has 30,000 users.<br>Contoso has the following departments: sales, research, marketing, human resources, executive, manufacturing, and legal. The sales department has 2,000 users. All of the users in the sales department are located in the United States. The research department has 3,000 users. All of the users in the research department are located in Europe.<br><br>Physical Locations -<br>Contoso has two main offices. The offices are located in Houston and Frankfurt. Each office has 15,000 users.<br>The offices connect to each other by using an MPLS network. Each office connects directly to the Internet.<br><br>Existing Environment -<br><br>Lync Server Infrastructure -<br>Contoso has a Lync Server 2013 infrastructure that only uses internal instant messaging (IM) and presence. The infrastructure contains a single Enterprise Edition<br>Front End pool that services all of the users.<br>Contoso uses a SIP domain of contoso.com for all of the users.<br>Client computers have either Microsoft Lync 2010 or Microsoft Lync 2013 installed.<br>Before deploying Skype for Business Server 2015 and migrating the users, you implement a small pilot project to test the functionality of Skype for Business<br>Server 2015.<br><br>Problem Statements -<br>The users in the pilot report that occasionally they cannot sign in to Skype for Business 2015.<br><br>Requirements -<br><br>Business Goal -<br>Contoso plans to upgrade to Skype for Business Server 2015 during the next six months. Contoso must deploy all of the conferencing and edge services. Contoso must also configure federation with its parent company, which is named Proseware, Inc. Proseware is located in Europe and has a Lync Server 2010 infrastructure.<br>Contoso must minimize hardware and software purchasing costs, while guaranteeing performance levels for all Skype for Business Server 2015 workloads.<br><br>Planned Changes -<br>Contoso plans to implement the following workloads in the Skype for Business Server 2015 deployment:<br>✑ Federation<br>✑ Dial-in conferencing<br>✑ External user access<br>✑ Audio, video, and web conferencing<br>✑ The ability to host Lync meetings that have external participants<br>The FQDNs of the edge services will be configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0007100006.png\" class=\"in-exam-image\"><br><br>Technical Requirements -<br>Contoso identifies the following technical requirements for the planned deployment:<br>✑ Only federation to Proseware must be allowed.<br>✑ All of the edge services must use default ports.<br>✑ Wide area network (WAN) traffic and Internet traffic must be minimized.<br>✑ All of the user contacts stored in Skype for Business Server 2015 must be backed up.<br>✑ The sales department must have a dedicated dial-in conferencing number. All other users in both the United States and Europe must use a pool of regional dial-in conferencing numbers.<br>✑ If a single component fails, all Skype for Business services must remain available without the need for manual intervention. Performance degradation is acceptable during a component failure state.<br>✑ The conversations of all the sales department users must be archived for 30 days. The conversations of all the research department users must be archived for 90 days. No other conversations must be archived.<br>✑ After the migration to Skype for Business Server 2015, all client computers will have three months to upgrade to Skype for Business. After three months, legacy clients must be blocked from accessing the Skype for Business Server 2015 infrastructure.<br><br>Security Requirements -<br>Contoso identifies the following security requirements for the planned deployment:<br>✑ All Skype for Business Server conferences must use a unique URL.<br>✑ Each Internet-facing service must have one or more dedicated public IP addresses.<br>✑ Only the users in the human resources department must be prevented from connecting to Skype for Business Server 2015 remotely.<br>You need to identify the dial-in conferencing configurations for sales department users.<br>Which two configurations should you use? Each correct answer presents part of the solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a user-level dial plan. Assign the dial plan to the sales department users.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new dial-in-access number. Assign the dial-in access number to a dial-in conferencing region.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a user-level conferencing policy. Assign the conferencing policy to the sales department users.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a user-level voice policy. Assign the voice policy to the sales department users.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new meeting configuration. Assign the meeting to a site."
    ],
    "answer": "BC",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-16T09:23:00.000Z",
        "voteCount": 1,
        "content": "And you cant assign a dedicated number without B."
      },
      {
        "date": "2019-09-16T09:22:00.000Z",
        "voteCount": 1,
        "content": "Its A,B. In order to assign the dedicated number to the Sales team you need to assign the dial plan to the sales department. B created the dialin conference number which is then assigned to the dialin conferencing region which is part of the dialin plan.\n\nC just makes a conferencing policy for access. You could argue A,B,C. But you cant assign a dedicated number without A."
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/23929-exam-70-334-topic-1-question-55-discussion/",
    "body": "HOTSPOT -<br><br>Overview -<br>Litware, Inc. is an international manufacturing company that has 10,000 users. The company has two offices. The offices are located in New York and Denver.<br>The offices connect to each other by using a WAN link. Each office connects directly to the Internet.<br><br>Existing Environment -<br><br>Active Directory Infrastructure -<br>The network contains an Active Directory Domain Services (AD DS) forest named litware.com. The forest contains a single domain. All domain controllers run<br>Windows Server 2008 R2.<br><br>Lync Server 2013 Infrastructure -<br>Litware has a Lync Server 2013 infrastructure in the New York office. The infrastructure contains servers and appliances. The call routing and distribution solution for the IT Help Desk and Front Desk are dependent upon Response Groups. The servers and appliances are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0011600001.png\" class=\"in-exam-image\"><br>All of the servers that have Lync Server 2013 deployed are monitored by using Microsoft System Center Operations Manager. All client computers have either<br>Microsoft Lync 2010 or Microsoft Lync 2013 installed. Administrators configure the following Lync Server 2013 features:<br>✑ IM and Presence for all sites<br>✑ External user access for IM and conferencing<br>✑ Conferencing for all sites<br>✑ Response groups<br>✑ Group Chat<br><br>Problem Statements -<br>Litware identifies the following issues:<br>✑ Users report that other users who are not listed on their contact list can see their presence information. This also occurs when the users set their privacy mode to allow only the users on their contact list to use their presence information.<br>✑ Users report that when they connect to meetings remotely, they cannot use presenter controls.<br><br>Requirements -<br><br>Planned Changes -<br>Litware plans to upgrade to Skype for Business Server 2015 during the next six months.<br>You must implement the following changes during the upgrade:<br>✑ Migrate the current Front End pool to an Enterprise Edition Front End pool named fepool1 that will contain two servers named Server13_01 and Server13_02.<br>✑ Migrate Group Chat to Persistent Chat.<br>You must minimize the costs associated with the purchase of hardware and software.<br><br>Technical Requirements -<br>You have the following technical requirements for the planned changes:<br>✑ Users running previous client versions must be able to use chat features after the server is migrated to Persistent Chat.<br>✑ Users who have mobile devices must be able to receive notifications if the Skype for Business mobile app on Windows Phone is inactive.<br>✑ A client computer named Monitor01 must be used to monitor client connectivity by using synthetic transactions.<br>✑ All response groups must be migrated to Skype for Business Server 2015.<br>✑ External users must be able to expand distribution groups.<br>✑ External users must be able to download meeting content.<br>✑ The Lync Windows Store app must be supported.<br>✑ Non-federated external partners must be able to join and present during meetings that Litware hosts.<br><br>High Availability Requirements -<br>The new Skype for Business Server 2015 infrastructure in the New Your office must be available if a single server fails. You must minimize the amount of administrative intervention that is required to recover from a single server failure. You must deploy an AlwaysOn Availability Group instance and a Distributed File<br>System (DFS) file share in the environment.<br>You need to move all users to the new Skype for Business Server 2015 infrastructure.<br>How should you configure the relevant Skype for Business Management Shell cmdlet? To answer, configure the appropriate command in the answer area.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0011700009.png\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://technet.microsoft.com/en-us/library/gg398528.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-24T07:05:00.000Z",
        "voteCount": 1,
        "content": "First\nFirst\nFirst\nFirst"
      },
      {
        "date": "2021-01-23T09:11:00.000Z",
        "voteCount": 1,
        "content": "In the first part it cannot be the \"-Identity all\" as this will search for people with \"all\" keyword.\nIt also cannot be the -OnlyLyncServer modifier as the real modifier is -OnLyncServer. Even if it is misspelling then it would list all users on the Lync server but not homed in the older versions so in this situation it is not usable.\nBy elimination it should be -UnAssignedUser and according to the documentation it would list all users enabled for SfB2015 but not in the SfB2015 registrar pool so it should list all users homed on Lync server. So I would go with that one.\nSo the answer should be Third, First, First, First"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/5165-exam-70-334-topic-1-question-56-discussion/",
    "body": "Overview -<br>Litware. Inc. is an international manufacturing company that has 10,000 users. The company has two offices. The offices are located in New York and Denver.<br>The offices connect to each other by using a WAN link. Each office connects directly to the Internet.<br><br>Existing Environment -<br><br>Active Directory Infrastructure -<br>The network contains an Active Directory Domain Services (AD DS) forest named litware.com. The forest contains a single domain. All domain controllers run<br>Windows Server 2008 R2.<br><br>Lync Server 2013 Infrastructure -<br>Litware has a Lync Server 2013 infrastructure in the New York office. The infrastructure contains servers and appliances. The call routing and distribution solution for the IT Help Desk and Front Desk are dependent upon Response Groups. The servers and appliances are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0011800001.png\" class=\"in-exam-image\"><br>All of the servers that have Lync Server 2013 deployed are monitored by using Microsoft System Center Operations Manager. All client computers have either<br>Microsoft Lync 2010 or Microsoft Lync 2013 installed. Administrators configure the following Lync Server 2013 features:<br>✑ IM and Presence for all sites<br>✑ External user access for IM and conferencing<br>✑ Conferencing for all sites<br>✑ Response groups<br>✑ Group Chat<br><br>Problem Statements -<br>Litware identifies the following issues:<br>✑ Users report that other users who are not listed on their contact list can see their presence information. This also occurs when the users set their privacy mode to allow only the users on their contact list to use their presence information.<br>✑ Users report that when they connect to meetings remotely, they cannot use presenter controls.<br><br>Requirements -<br><br>Planned Changes -<br>Litware plans to upgrade to Skype for Business Server 2015 during the next six months.<br>You must implement the following changes during the upgrade:<br>✑ Migrate the current Front End pool to an Enterprise Edition Front End pool named fepool1 that will contain two servers named Server13_01 and Server13_02.<br>✑ Migrate Group Chat to Persistent Chat.<br>You must minimize the costs associated with the purchase of hardware and software.<br><br>Technical Requirements -<br>You have the following technical requirements for the planned changes:<br>✑ Users running previous client versions must be able to use chat features after the server is migrated to Persistent Chat.<br>✑ Users who have mobile devices must be able to receive notifications if the Skype for Business mobile app on Windows Phone is inactive.<br>✑ Aclient computer named Monitor01 must be used to monitor client connectivity by using synthetic transactions.<br>✑ All response groups must be migrated to Skype for Business Server 2015.<br>✑ External users must be able to expand distribution groups.<br>✑ External users must be able to download meeting content.<br>✑ The Lync Windows Store app must be supported.<br>✑ Non-federated external partners must be able to join and present during meetings that Litware hosts.<br><br>High Availability Requirements -<br>The new Skype for Business Server 2015 infrastructure in the New Your office must be available if a single server fails. You must minimize the amount of administrative intervention that is required to recover from a single server failure. You must deploy an AlwaysOn Availability Group instance and a Distributed File<br>System (DFS) file share in the environment.<br>You need to recommend a solution to resolve the privacy issue that users report. What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta conferencing policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta client version policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta client policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta presence policy"
    ],
    "answer": "C",
    "answerDescription": "References:<br>https://technet.microsoft.com/en-us/library/gg398300.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-14T08:40:00.000Z",
        "voteCount": 1,
        "content": "Privacy Configuration is how presense visibility is set.. which is none of these answer... https://docs.microsoft.com/en-us/powershell/module/skype/set-csprivacyconfiguration?view=skype-ps"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2356-exam-70-334-topic-1-question-71-discussion/",
    "body": "Case Study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br><br>General Overview -<br>Litware, Inc., is an international manufacturing company that has 4,000 employees. The company has a sales department, a marketing department, a research department, and a human resources department.<br>Litware has a partner company named Fabrikam, Inc. Fabrikam has an office in Paris. Fabrikam uses a XMPP-based instant messaging (IM) solution.<br><br>Physical Locations -<br>Litware has seven offices located throughout North America and Europe.<br>Litware has two data centers. The data centers are located in New York and London. All communications for the North American offices are routed through the<br>New York data center. All communications for the European offices are routed through the London data center.<br>The number of users in each office is shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0018200001.png\" class=\"in-exam-image\"><br><br>Active Directory Environment -<br>Litware has an Active Directory Domain Services (AD DS) forest named litwareinc.com. The forest contains a single domain. All domain controllers run Windows<br>Server 2008 R2.<br>Each office contains five domain controllers. Each office is configured as an Active Directory site.<br><br>Lync Server Environment -<br>Litware has a Lync Server 2013 infrastructure that contains two servers in the New York office. The servers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0018200002.png\" class=\"in-exam-image\"><br>The SIP domain is litwareinc.com.<br>Litware has a Microsoft Exchange Server 2013 organization.<br><br>Problem Statements -<br>Users in the London office report poor video quality during conferences.<br><br>Requirements -<br><br>Business Goals -<br>Litware wants to minimize the costs associated with purchasing hardware and software.<br><br>Planned Changes -<br>Litware plans to migrate the Lync Server 2013 infrastructure to Skype for Business Server 2015. The migration will have a coexistence period of six months.<br>Litware plans to implement the following components as part of the planned migration:<br><br>Persistent Chat -<br><img src=\"/assets/media/exam-media/02119/0018200003.png\" class=\"in-exam-image\"><br>✑ Unified contact store<br>✑ Enterprise Voice for all users<br>✑ A central site in each data center<br>✑ A branch site in each branch office<br>✑ A Front End pool in each central site<br>✑ Skype for Business Phone Edition devices<br>✑ Pool pairing<br>Litware plans to create a federation relationship with Fabrikam.<br><br>Technical Requirements -<br>Litware identifies the following technical requirements for the planned migration:<br>✑ Users must be able to use all Skype for Business Server features if a single server fails.<br>✑ Users mustbe able to connect to the Skype for Business Server infrastructure if a single central site fails.<br>✑ Members of a group named Temp_Contractors must be prevented from using Skype for Business when they connect remotely.<br>✑ Only users in the human resources department must be able to access and discover a persistent chat room named HRConfidential.<br><br>Security Requirements -<br>Litware plans to deploy remote access. Some users work remotely from their customers offices, which have firewall restrictions. All of the remote users must be able to connect to the Skype for Business Server 2015 infrastructure by using TCP port 443.<br>You need to implement the planned unified contact store.<br>Which three actions should you perform? Each correct answer presents part of the solution. (Choose three.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a server that has Skype for Business Server 2015 deployed, run the New-CsPartnerApplicationSkype for Business Management Shell cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a server that has Exchange Server 2013 deployed, run theExchUCUtil.pslscript.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a server that has Skype for Business Server 2015 deployed, run theSet-CsUserServicesPolicySkype for Business Management Shell cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a server that has Exchange Server 2013 deployed, run the Configure-EnterprisePartnerApplication.pslscript.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom a server that has Skype for Business Server 2015 deployed, run the Set-CsClientPolicySkype for Business Management Shell cmdlet."
    ],
    "answer": "ABC",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-10T23:33:00.000Z",
        "voteCount": 2,
        "content": "I agree the correct answer is ADC"
      },
      {
        "date": "2019-07-10T06:45:00.000Z",
        "voteCount": 3,
        "content": "The ExchUCUtil tool is used to integrate the UM (AA and AS) and Skype for Business. \n\nWhy not is the correct answer ADC? you can check the following URLs: \n\nhttps://docs.microsoft.com/en-us/skypeforbusiness/deploy/integrate-with-exchange-server/configure-partner-applications\n\nhttps://docs.microsoft.com/en-us/skypeforbusiness/deploy/deploy-unified-contact-store?toc=/SkypeForBusiness/toc.json&amp;bc=/SkypeForBusiness/breadcrumb/toc.json"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/5172-exam-70-334-topic-1-question-73-discussion/",
    "body": "HOTSPOT -<br>Wide World Importers has a headquarters office in New York and a sales office in Los Angeles. The company implements Skype for Business Server 2015.<br>✑ All executive staff are based out of the New York office.<br>All sales staff are based out of the Los Angeles office.<br><img src=\"/assets/media/exam-media/02119/0018600003.png\" class=\"in-exam-image\"><br>✑ All users use Exchange Online for email.<br>The sales staff reports that their presence state does not reflect the changes they make to their calendars. You must not store Instant Messages for executives in<br>Outlook.<br>You need to configure a separate client policy for each location that will enforce the functionality required by the local users.<br>In the table below, identify the client policy parameter that will be used to configure the client policy in each location.<br>NOTE: Make only one selection in each column. Each correct answer is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02119/0018700002.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0018800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-14T10:20:00.000Z",
        "voteCount": 1,
        "content": "Parameter for NY is EnableIMAutoArchiving... not EnableMAutoArchiving"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/259-exam-70-334-topic-1-question-75-discussion/",
    "body": "You support a customer whose network environment includes Microsoft Lync Server 2010 Group Chat. You plan to deploy Skype for Business Server 2015<br>Persistent Chat.<br>You need to ensure that users who access Group Chat will have access to their chat history in Persistent Chat.<br>Which two actions should you perform? Each correct answer presents part of the solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the following Skype for Business Management Shell cmdlet: Set-CsPersistentChatActiveServer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBack up the mgc from the Group Chat server and restore it to the Persistent Chat server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnsure that legacy clients can connect to the new Persistent Chat pool. Shut down Persistent Chat services, and then run the following Skype for Business Management Shell cmdlet: Import-CsPersistentChatData",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy Skype for Business Server 2015 and then deploy a Persistent Chat pool. Shut down Lync Server 2010 Group Chat services, and then run the following"
    ],
    "answer": "CD",
    "answerDescription": "References:https://technet.microsoft.com/en-us/library/jj204709.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-18T09:36:00.000Z",
        "voteCount": 1,
        "content": "and then run the following Skype for Business Management\nShell cmdlet: Export-CsPersistentChatData"
      },
      {
        "date": "2019-02-04T06:33:00.000Z",
        "voteCount": 1,
        "content": "Question D. \"...and then run the following\" what? Admins, please complete!"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/3441-exam-70-334-topic-1-question-80-discussion/",
    "body": "HOTSPOT -<br>Wingtip Toys is currently migrating from an existing IP-PBX solution to Skype for Business Server 2015. They have their headquarters located in New York and 10 sales offices spread throughout North America.<br>Users who have been moved to Skype for Business complain that they cannot find users who are still on the existing IP-PBX. Wingtip Toys is using a 5-digit dial plan for all their IP-PBX users.<br>The following image shows the properties for a user that is still on the IP-PBX.<br><img src=\"/assets/media/exam-media/02119/0019900001.jpg\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that answers each question. Each correct answer is worth one point.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0020000001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-11T00:17:00.000Z",
        "voteCount": 1,
        "content": "both choice no.1 \nnew and update"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/8592-exam-70-334-topic-1-question-84-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory Domain Services domain named contoso.com.<br>The domain contains a Skype for Business Server 2015 infrastructure that has the<br>Persistent Chat feature configured.<br>Persistent Chat is hosted by a Front End pool named pcpool.<br>You need to configure a chat room named Announcements to meet the following requirements:<br>✑ Allow only the user nameduser1@contoso.comto post messages to Announcements.<br>✑ Users from a group named group1 must be able to view the messages in Announcements.<br>How should you configure the relevant Skype for Business Management Shell command? To answer, configure the appropriate parameters for the command in the answer area.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0020300003.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-11-19T11:11:00.000Z",
        "voteCount": 1,
        "content": "This comment says it all:\n\"Type. Lets you specify whether a chat room is a Normal room, which accepts messages posted by any member, or an Auditorium room, which accepts messages posted only by a Presenter.\"\n\nThis line is found at:\nhttps://docs.microsoft.com/en-us/skypeforbusiness/manage/persistent-chat/chat-rooms"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/260-exam-70-334-topic-1-question-89-discussion/",
    "body": "DRAG DROP -<br>You support a Skype for Business Server 2015 environment that includes the following:<br>✑ an Enterprise Edition pool with two front end servers<br>✑ one back end server<br>✑ one Edge Server that is installed into a perimeter network<br>Current traffic between LAN networks and the perimeter network is blocked. You run the Get-CsManagementStoreReplicationStatus Skype for Business<br>Management Shell cmdlet. You discover that on the Edge Server, UpToDate is shown as false.<br>You need to replicate the latest configuration changes to the Edge Server and bring it up to date.<br>Which three actions should you perform in sequence? To answer, move the appropriate three actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02119/0020700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0020900001.png\" class=\"in-exam-image\">",
    "answerDescription": "✑ From the Topology Builder, find the port that is configured on the Edge server for internal replication.<br>✑ Reissue the internal certificate on the Edge server to include the fully qualified domain name (FQDN) of the back end server.<br>✑ On the front end servers, run the Invoke-CsManagementStoreReplication Skype for Business management Shell cmdlet.<br>References: http://www.uc-guru.com/author/thomeee/",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-14T12:20:00.000Z",
        "voteCount": 2,
        "content": "The referenced link shows a scenario where the port was open and it was a cert which was the problem. The question doesnt throw that scenario.. so yes opening and checking the port should be step2."
      },
      {
        "date": "2019-02-04T07:45:00.000Z",
        "voteCount": 3,
        "content": "The second action must be „Create a firewall rule to open internal replication port…“\nOtherwise, there are no sense in first action – you don’t need to know port to issue the certificate."
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43142-exam-70-334-topic-1-question-90-discussion/",
    "body": "You deploy Skype for Business 2015 Enterprise Edition pool named pool1.contoso.local. You configure the administrative access URL to be admin.contoso.local.<br>The Front End and Back roles are installed on servers named FE1 and BE1, respectively.<br>You create the following DNS records:<br><img src=\"/assets/media/exam-media/02119/0021000004.png\" class=\"in-exam-image\"><br>You attempt to open the Skype for Business Server 2015 Control Panel and you receive an error message.<br>You need to be able to open the control panel.<br>Which two actions should you perform? Each correct answer presents part of the solution. (Choose two.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate the following DNS A record:Meet.contoso.local A 192.168.10.10",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate the following DNS SRV record:_sipinternal._tcp.contoso.local SRV priority 0, weight 0, port 5061 pool1.contoso.local",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate the following DNS A record:admin.contoso.local A 192.168.10.10",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate the following DNS A record:pool1.contoso.local A 192.168.10.10",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate the following DNS A record:lyncdiscoverinteral.contoso.local A 192.168.10.10"
    ],
    "answer": "BD",
    "answerDescription": "https://technet.microsoft.com/en-us/library/dn951397.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-23T12:03:00.000Z",
        "voteCount": 1,
        "content": "I would rather say that A record for admin.contoso.local should be added than SRV record. Am I wrong?"
      },
      {
        "date": "2021-01-23T12:03:00.000Z",
        "voteCount": 1,
        "content": "So the answer would be CD"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/261-exam-70-334-topic-1-question-91-discussion/",
    "body": "You support a Skype for Business Server 2015 environment that includes:<br>✑ a single Standard Edition server<br>✑ a single Edge Server<br>✑ a single reverse proxy that is acting as an HTTP(s) reverse proxy<br>Remote users report that the company logo is not being displayed alongside the text in their Online Meeting invites.<br>You need to find out why the logo is not being retrieved.<br>Which two actions should you perform? Each correct answer presents part of the solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the following Skype for Business Server 2015 Management Shell command: Get-CsWebServiceConfiguration | FL Identity,LogoURL",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUsing the Skype for Business Server 2015 Logging Tool, debug traffic on the Skype for Business Server 2015 Edge Server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUsing a test client inside the corporate network, run an HTTP tracing tool to debug the traffic.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the following Skype for Business Server 2015 Management Shell command:Get-CsMeetingConfiguration | FL Identity,LogoURL",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUsing a test client outside the corporate network, run an HTTP tracing tool to debug the traffic."
    ],
    "answer": "AC",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-11T00:58:00.000Z",
        "voteCount": 1,
        "content": "A is right   the LogoURL is not parameter is follow by | . the mean is display the config info and filter only display the LOGO message.\nbut the answer C, I am not sure. the question is remote user and the answer C is corporate network."
      },
      {
        "date": "2019-02-04T08:08:00.000Z",
        "voteCount": 2,
        "content": "The answers are false!\nA.: there are no such parameter “LogoURL” in Get-CsWebServiceConfiguration.\nC.: Logo cannot display remote users, why to trace a client inside the network?\nRight answers must be D. and E."
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/262-exam-70-334-topic-1-question-95-discussion/",
    "body": "HOTSPOT -<br>You are migrating from Lync Server 2013 to Skype for Business Server 2015. During the migration, users may be registered on either Lync or Skype for Business.<br>Clients that do not use WebSearch must be able to search for new address book entries.<br>You need to create the required incremental normalization rules.<br>In the table below, identify the actions that you must perform for each server version.<br>NOTE: Make only one selection in each column. Each correct answer is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02119/0021400001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0021500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://blogs.msdn.microsoft.com/mvpawardprogram/2015/12/22/upgrading-from-lync-2013-to-skype-for-business-server-2015-what-you-need-to-know/ https://uccorey.com/2015/05/05/skype-for-business-server-2015-in-place-upgrade/",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-17T12:58:00.000Z",
        "voteCount": 2,
        "content": "The reference link is not working anymore and it clearly says \"NOTE: Make only one selection in each column\" there are several selected, this is not the correct answer."
      },
      {
        "date": "2019-09-15T03:37:00.000Z",
        "voteCount": 3,
        "content": "The question itself says you need to \"CREATE\"... not SET... so Skype for Business will be the \"New-CsAddressBookNormalizationRule\" cmdlet id argue... and Lync... txt file and import id assume."
      },
      {
        "date": "2019-02-04T08:29:00.000Z",
        "voteCount": 2,
        "content": "Admins, it must be one who check the question und answer for elementary logic! \nIn question stay: \"NOTE: Make only one selection in each column\". Now see the answer…"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43157-exam-70-334-topic-1-question-105-discussion/",
    "body": "HOTSPOT -<br><br>Case Study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br><br>General Overview -<br>Litware, Inc., is an international manufacturing company that has 4,000 employees. The company has a sales department, a marketing department, a research department, and a human resources department.<br>Litware has a partner company named Fabrikam, Inc. Fabrikam has an office in Paris. Fabrikam uses a XMPP-based instant messaging (IM) solution.<br><br>Physical Locations -<br>Litware has seven offices located throughout North America and Europe.<br>Litware has two data centers. The data centers are located in New York and London. All communications for the North American offices are routed through the<br>New York data center. All communications for the European offices are routed through the London data center.<br>The number of users in each office is shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0024000001.png\" class=\"in-exam-image\"><br><br>Active Directory Environment -<br>Litware has an Active Directory Domain Services (AD DS) forest named litwareinc.com. The forest contains a single domain. All domain controllers run Windows<br>Server 2008 R2.<br>Each office contains five domain controllers. Each office is configured as an Active Directory site.<br><br>Lync Server Environment -<br>Litware has a Lync Server 2013 infrastructure that contains two servers in the New York office. The servers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0024100001.png\" class=\"in-exam-image\"><br>The SIP domain is litwareinc.com.<br>Litware has a Microsoft Exchange Server 2013 organization.<br><br>Problem Statements -<br>Users in the London office report poor video quality during conferences.<br><br>Requirements -<br><br>Business Goals -<br>Litware wants to minimize the costs associated with purchasing hardware and software.<br><br>Planned Changes -<br>Litware plans to migrate the Lync Server 2013 infrastructure to Skype for Business Server 2015. The migration will have a coexistence period of six months.<br>Litware plans to implement the following components as part of the planned migration:<br>✑ Persistent Chat<br>✑ Unified contact store<br>✑ Enterprise Voice for all users<br>✑ A central site in each data center<br>✑ A branch site in each branch office<br>✑ A Front End pool in each central site<br>✑ Skype for Business Phone Edition devices<br>✑ Pool pairing<br>Litware plans to create a federation relationship with Fabrikam.<br><br>Technical Requirements -<br>Litware identifies the following technical requirements for the planned migration:<br>✑ Users must be able to use all Skype for Business Server features if a single server fails.<br>✑ Users must be able to connect to the Skype for Business Server infrastructure if a single central site fails.<br>✑ Members of a group named Temp_Contractors must be prevented from using Skype for Business when they connect remotely.<br>✑ Only users in the human resources department must be able to access and discover a persistent chat room named HRConfidential.<br><br>Security Requirements -<br>Litware plans to deploy remote access. Some users work remotely from their customers offices, which have firewall restrictions. All of the remote users must be able to connect to the Skype for Business Server 2015 infrastructure by using TCP port 443.<br>You are deploying an Edge Server.<br>You need to configure the firewall to support the planned federation relationship.<br>Which port should you open between the Internet and the Edge Server? To answer, configure the appropriate protocol and port in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02119/0024200001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0024300001.png\" class=\"in-exam-image\">",
    "answerDescription": "References: https://technet.microsoft.com/en-us/library/jj618369(v=ocs.15).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-24T00:57:00.000Z",
        "voteCount": 1,
        "content": "TCP/5061 is for standard federation, TCP/5269 is for the XMPP federation. As the only federation will be with Fabrikam who uses XMPP solution the answer is TCP/5269."
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/263-exam-70-334-topic-1-question-106-discussion/",
    "body": "Case Study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br>Contoso, Ltd. is an international manufacturing company that has 30,000 users.<br>Contoso has the following departments: sales, research, marketing, human resources, executive, manufacturing, and legal. The sales department has 2,000 users. All of the users in the sales department are located in the United States. The research department has 3,000 users. All of the users in the research department are located in Europe.<br><br>Physical Locations -<br>Contoso has two main offices. The offices are located in Houston and Frankfurt. Each office has 15,000 users.<br>The offices connect to each other by using an MPLS network. Each office connects directly to the Internet.<br><br>Existing Environment -<br><br>Lync Server Infrastructure -<br>Contoso has a Lync Server 2013 infrastructure that only uses internal instant messaging (IM) and presence. The infrastructure contains a single Enterprise Edition<br>Front End pool that services all of the users.<br>Contoso uses a SIP domain of contoso.com for all of the users.<br>Client computers have either Microsoft Lync 2010 or Microsoft Lync 2013 installed.<br>Before deploying Skype for Business Server 2015 and migrating the users, you implement a small pilot project to test the functionality of Skype for Business<br>Server 2015.<br><br>Problem Statements -<br>The users in the pilot report that occasionally they cannot sign in to Skype for Business 2015.<br><br>Requirements -<br><br>Business Goal -<br>Contoso plans to upgrade to Skype for Business Server 2015 during the next six months. Contoso must deploy all of the conferencing and edge services. Contoso must also configure federation with its parent company, which is named Proseware, Inc. Proseware is located in Europe and has a Lync Server 2010 infrastructure.<br>Contoso must minimize hardware and software purchasing costs, while guaranteeing performance levels for all Skype for Business Server 2015 workloads.<br><br>Planned Changes -<br>Contoso plans to implement the following workloads in the Skype for Business Server 2015 deployment:<br>✑ Federation<br>✑ Dial-in conferencing<br>✑ External user access<br>✑ Audio, video, and web conferencing<br>✑ The ability to host Lync meetings that have external participants<br>The FQDNs of the edge services will be configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0024500001.png\" class=\"in-exam-image\"><br><br>Technical Requirements -<br>Contoso identifies the following technical requirements for the planned deployment:<br>✑ Only federation to Proseware must be allowed.<br>✑ All of the edge services must use default ports.<br>✑ Wide area network (WAN) traffic and Internet traffic must be minimized.<br>✑ All of the user contacts stored in Skype for Business Server 2015 must be backed up.<br>✑ The sales department must have a dedicated dial-in conferencing number. All other users in both the United States and Europe must use a pool of regional dial-in conferencing numbers.<br>✑ If a single component fails, all Skype for Business services must remain available without the need for manual intervention. Performance degradation is acceptable during a component failure state.<br>✑ The conversations of all the sales department users must be archived for 30 days. The conversations of all the research department users must be archived for 90 days. No other conversations must be archived.<br>✑ After the migration to Skype for Business Server 2015, all client computers will have three months to upgrade to Skype for Business. After three months, legacy clients must be blocked from accessing the Skype for Business Server 2015 infrastructure.<br><br>Security Requirements -<br>Contoso identifies the following security requirements for the planned deployment:<br>✑ All Skype for Business Server conferences must use a unique URL.<br>✑ Each Internet-facing service must have one or more dedicated public IP addresses.<br>✑ Only the users in the human resources department must be prevented from connecting to Skype for Business Server 2015 remotely.<br>You need to configure the Skype for Business Server 2015 infrastructure to meet the security requirements for the human resources department. The solution must minimize administrative effort.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the global external access policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new user-level external access policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new user-level client policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Access Edge Configuration settings."
    ],
    "answer": "C",
    "answerDescription": "https://technet.microsoft.com/en-us/library/gg398300.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-11T10:25:00.000Z",
        "voteCount": 1,
        "content": "I agree too"
      },
      {
        "date": "2019-02-04T10:35:00.000Z",
        "voteCount": 2,
        "content": "Correct answer must be B. For preventing some users from connecting to Skype for Business remotely, you need first off all create a new user-level external access policy with New-CsExternalAccessPolicy"
      },
      {
        "date": "2019-07-16T08:23:00.000Z",
        "voteCount": 1,
        "content": "I agree. The correct answer must be B. Check the following reference:\nhttps://docs.microsoft.com/en-us/powershell/module/skype/new-csexternalaccesspolicy?view=skype-ps"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/264-exam-70-334-topic-1-question-107-discussion/",
    "body": "HOTSPOT -<br><br>Case Study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br>Contoso, Ltd. is an international manufacturing company that has 30,000 users.<br>Contoso has the following departments: sales, research, marketing, human resources, executive, manufacturing, and legal. The sales department has 2,000 users. All of the users in the sales department are located in the United States. The research department has 3,000 users. All of the users in the research department are located in Europe.<br><br>Physical Locations -<br>Contoso has two main offices. The offices are located in Houston and Frankfurt. Each office has 15,000 users.<br>The offices connect to each other by using an MPLS network. Each office connects directly to the Internet.<br><br>Existing Environment -<br><br>Lync Server Infrastructure -<br>Contoso has a Lync Server 2013 infrastructure that only uses internal instant messaging (IM) and presence. The infrastructure contains a single Enterprise Edition<br>Front End pool that services all of the users.<br>Contoso uses a SIP domain of contoso.com for all of the users.<br>Client computers have either Microsoft Lync 2010 or Microsoft Lync 2013 installed.<br>Before deploying Skype for Business Server 2015 and migrating the users, you implement a small pilot project to test the functionality of Skype for Business<br>Server 2015.<br><br>Problem Statements -<br>The users in the pilot report that occasionally they cannot sign in to Skype for Business 2015.<br><br>Requirements -<br><br>Business Goal -<br>Contoso plans to upgrade to Skype for Business Server 2015 during the next six months. Contoso must deploy all of the conferencing and edge services. Contoso must also configure federation with its parent company, which is named Proseware, Inc. Proseware is located in Europe and has a Lync Server 2010 infrastructure.<br>Contoso must minimize hardware and software purchasing costs, while guaranteeing performance levels for all Skype for Business Server 2015 workloads.<br><br>Planned Changes -<br>Contoso plans to implement the following workloads in the Skype for Business Server 2015 deployment:<br>✑ Federation<br>✑ Dial-in conferencing<br>✑ External user access<br>✑ Audio, video, and web conferencing<br>✑ The ability to host Lync meetings that have external participants<br>The FQDNs of the edge services will be configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02119/0024700006.png\" class=\"in-exam-image\"><br><br>Technical Requirements -<br>Contoso identifies the following technical requirements for the planned deployment:<br>✑ Only federation to Proseware must be allowed.<br>✑ All of the edge services must use default ports.<br>✑ Wide area network (WAN) traffic and Internet traffic must be minimized.<br>✑ All of the user contacts stored in Skype for Business Server 2015 must be backed up.<br>✑ The sales department must have a dedicated dial-in conferencing number. All other users in both the United States and Europe must use a pool of regional dial-in conferencing numbers.<br>✑ If a single component fails, all Skype for Business services must remain available without the need for manual intervention. Performance degradation is acceptable during a component failure state.<br>✑ The conversations of all the sales department users must be archived for 30 days. The conversations of all the research department users must be archived for 90 days. No other conversations must be archived.<br>✑ After the migration to Skype for Business Server 2015, all client computers will have three months to upgrade to Skype for Business. After three months, legacy clients must be blocked from accessing the Skype for Business Server 2015 infrastructure.<br><br>Security Requirements -<br>Contoso identifies the following security requirements for the planned deployment:<br>✑ All Skype for Business Server conferences must use a unique URL.<br>✑ Each Internet-facing service must have one or more dedicated public IP addresses.<br>✑ Only the users in the human resources department must be prevented from connecting to Skype for Business Server 2015 remotely.<br>You need to identify the minimum number of Skype for Business Server 2015 servers and supporting server roles required in each Skype for Business site.<br>What is the minimum number of servers required? To answer, select the appropriate number of each server type in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02119/0024900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02119/0025000001.png\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://technet.microsoft.com/en-us/library/gg615015.aspx<br>https://blogs.technet.microsoft.com/canitpro/2015/05/05/step-by-step-installation-of-skype-for-business-server-2015/",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-11T10:27:00.000Z",
        "voteCount": 1,
        "content": "I agree 2,4,2,2"
      },
      {
        "date": "2019-02-04T10:52:00.000Z",
        "voteCount": 1,
        "content": "I don’t agree with answers. Technical Requirements says: “If a single component fails, all Skype for Business services must remain available without the need for manual intervention. Performance degradation is acceptable during a component failure state.”\nAccording to this per site: Edge Servers – 2, Front End Servers – 4 (if one fail the 3 can still serve 15.000 user), OWA Servers – 2, SQL Servers – 2."
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/5201-exam-70-334-topic-1-question-111-discussion/",
    "body": "Overview -<br>General Overview -<br>ADatum is an international logistics company that has 12,000 employees. The company has a sales department, a marketing department, a human resources department, a finance department, and an operations department.<br><br>Physical Locations -<br>ADatum has four offices located throughout the world.<br>ADatum has two data centers. The data centers are located in New York and Toronto. All communications are routed through the New York and Toronto data centers.<br>The number of users in each office is shown in the following table:<br><img src=\"/assets/media/exam-media/02119/0027100001.png\" class=\"in-exam-image\"><br><br>Existing Environment -<br><br>Active Directory environment -<br>ADatum has an Active Directory Domain Services (AD DS) forest named adatum.com.<br>The forest contains a single domain. All domain controllers run Windows Server 2012 R2.<br>Each office contains redundant domain controllers. Each office is configured as an AD DS site.<br><br>Lync Server environment -<br>ADatum has a Lync Server 2013 infrastructure that contains Two pools. There is one pool in the New York data center and one pool in the Toronto data center.<br>These pools are in a pairing relationship for site resiliency.<br>In preparation for the Skype for Business Server update, you install the required prerequisite components on all Lync Server 2013 servers.<br>There is a dedicated management computer named NYCMGMT1 in the New York office that has Lync Server 2013 administrative tools installed.<br>All company users are evenly distributed across the New York and Toronto pools.<br>The servers are configured as shown in the following tables:<br><img src=\"/assets/media/exam-media/02119/0027200001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02119/0027300001.png\" class=\"in-exam-image\"><br>Both data centers have a complete set of redundant load balancers and reverse proxies.<br>Internal and external URLS.<br>The Lync Server 2013 Web Services and Office Web Apps Server 2013 farm for both New York and Toronto pools use the following internal and external URLs:<br><img src=\"/assets/media/exam-media/02119/0027300002.png\" class=\"in-exam-image\"><br><br>Reverse Proxy Rules -<br>You use the following reverse proxy rules to publish external access for the New York pool:<br><img src=\"/assets/media/exam-media/02119/0027400001.png\" class=\"in-exam-image\"><br><br>Unused servers -<br>The Sydney and Stockholm offices each have a server room. The following is the list of unused servers in the server rooms:<br><img src=\"/assets/media/exam-media/02119/0027400002.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02119/0027500001.png\" class=\"in-exam-image\"><br><br>SIP Domain and firewall -<br>The SIP domain is adatum.com.<br>ADatum has a Microsoft Office 365 subscription. The company recently completed an upgrade to Exchange Server 2013. In-Place hold is not in use.<br>ADatum is federated with Fabrikam. Inc. The configuration information is shown below:<br><img src=\"/assets/media/exam-media/02119/0027500002.png\" class=\"in-exam-image\"><br>Firewall configuration on the edge firewall facing to the Internet from both perimeter networks in New York and Toronto allows connection to Any IP addresses in the Internet on port TCP/5061.<br><br>Problem statements -<br>All external users that are homed in the New York pool reported that they have issues with uploading PowerPoint presentations during conferences.<br>The PowerPoint upload issue is affecting all internal users that are homed in the Toronto pool.<br>Users in the Sydney office report poor audio and video quality during conferences. Desktop sharing during conferences also exhibits poor performance.<br><br>Business requirements -<br>The company has identified the following business requirements:<br>The Sales and marketing departments must have the ability to interact with various suppliers and customers that use Skype Consumer. To enhance the<br><img src=\"/assets/media/exam-media/02119/0027500003.png\" class=\"in-exam-image\"> capability, users from sales and marketing departments would like to be able to look up additional Skype Consumer contact details.<br>✑ The company wants to improve the conferencing experience for users in the Sydney office.<br>✑ ADatum recently acquired a local logistic company in Australia and is planning to rebrand the business in the Asia pacific market. The rebranded business with operate under the name Wide World Importer.<br>✑ The acquired company has an existing video teleconferencing (VTC) solution from Cisco/Tandberg.<br>✑ ADatum wants to minimize the cost of any changes to the infrastructure.<br>✑ A consultant that works from the Stockholm office will oversee the deployment of any new services.<br><br>Technical requirements -<br>The company has identified the following technical requirements:<br>✑ Any new infrastructure must be deployed to support high availability.<br>✑ All users in Sydney will use the new email and SIP domain.<br>✑ All federation traffic for the SIP domain wideworldimporters.com must route through the infrastructure in the Sydney office.<br>✑ All conferencing capabilities must be available in the event of wide area network (WAN) link failure.<br>✑ Only users in the sales and marketing departments must be able to federate with Skype consumer.<br>✑ ADatum uses third party identity providers to federate with Azure Active Directory.<br>✑ You must integrate Microsoft Exchange with Skype for Business to archive Skype for Business data in user mailboxes.<br>✑ You must use wideworldimporters.com as the email and SIP domain for rebranded business.<br>✑ You must implement archiving for all skype for business users. You must not make changes to existing Microsoft exchange functionality.<br>You need to identify the computers that you can use to upgrade the topology to support Skype for Business Server 2015.<br>What are two possible ways to achieve the goal? Each correct answer presents a complete solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn NYCMGMT1, uninstall the Lync Server administrative tools, and install Skype for Business Server 2015 administrative tools.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn SYDSERVER01, install the Lync Server 2013 administrative tools and upgrade to the latest cumulative update.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn SHSERVER01, install the Skype for Business Server 2015 administrative tools.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn NYCMGMT1, upgrade the Administrative tools to the latest Lync Server 2013 cumulative update."
    ],
    "answer": "BD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-15T05:35:00.000Z",
        "voteCount": 1,
        "content": "Explain... and reference on why you wouldnt install S4B 2015 admin tools in both?"
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/5202-exam-70-334-topic-1-question-115-discussion/",
    "body": "You have a Skype for Business Server 2015 infrastructure that has Enterprise Voice enabled.<br>You need to ensure that users can place a call on hold, and can then retrieve the call later by dialing a number from any phone. The solution must ensure that if a call is on hold for four minutes, the call is automatically forwarded to the receptionist.<br>Which two actions should you perform? Each correct answer presents part of the solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the global dial plan.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Call Park settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the global voice policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Call Park orbit.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a static route."
    ],
    "answer": "CD",
    "answerDescription": "References: https://technet.microsoft.com/en-us/library/gg182611(v=ocs.15).aspx https://technet.microsoft.com/en-us/library/gg398753.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-15T06:01:00.000Z",
        "voteCount": 1,
        "content": "Somone could say the answer is B,C and D... because B changing the call park setting to pass the call to the receptionist after 4 minutes... but you also need to change global voice policy and enable call park orbit."
      }
    ],
    "examNameCode": "70-334",
    "topicNumber": "1"
  }
]