[
  {
    "topic": 12,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33845-exam-da-100-topic-12-question-1-discussion/",
    "body": "HOTSPOT -<br>How should you distribute the reports to the board? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04207/0015200001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04207/0015200002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Using a workspace membership<br>Scenario:<br>The company wants to provide a single package of reports to the board that contains custom navigation and links to supplementary information.<br>Note: Workspace is a shared environment for a group of people. You can have multiple Power BI content in a workspace. One workspace can have hundreds of dashboards, reports, and datasets in it.<br>Box 2:  A mail-enabled security group<br><br>Scenario: Security Requirements -<br>The reports must be made available to the board from powerbi.com. A mail-enabled security group will be used to share information with the board.",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-06T14:25:00.000Z",
        "voteCount": 71,
        "content": "Answer:C,b"
      },
      {
        "date": "2020-10-07T22:53:00.000Z",
        "voteCount": 2,
        "content": "no you can add security groups to row level security on workspace"
      },
      {
        "date": "2020-12-20T14:49:00.000Z",
        "voteCount": 5,
        "content": "This is the correct answer. Scenario requirements: the company wants to provide a single package of reports to the board that includes custom navigation and links to supplementary information. see https://docs.microsoft.com/en-us/power-bi/collaborate-share/service-create-distribute-apps#design-the-navigation-experience"
      },
      {
        "date": "2021-04-18T14:53:00.000Z",
        "voteCount": 3,
        "content": "I agree, because \"any reports that the analysts build must not be included in the quarterly reports for the board\""
      },
      {
        "date": "2020-12-20T09:17:00.000Z",
        "voteCount": 12,
        "content": "The second is clear that it is B.\nThe first I think is C.\n\n\"The company wants to provide a single package of reports to the board that contains custom navigation and links to supplementary information.\"\n\nThe New navigation builder option allows you to build a custom navigation for your app.\n\nhttps://docs.microsoft.com/en-us/power-bi/collaborate-share/service-create-distribute-apps"
      },
      {
        "date": "2022-05-22T10:11:00.000Z",
        "voteCount": 1,
        "content": "C and  B. An app allows you for navigation customization and selection of what reports and dashboard they want to be shared."
      },
      {
        "date": "2021-06-21T13:43:00.000Z",
        "voteCount": 2,
        "content": "Only App can provide navigation, so the answer of first question should be A."
      },
      {
        "date": "2021-06-17T17:19:00.000Z",
        "voteCount": 1,
        "content": "whats wrong with Using an App"
      },
      {
        "date": "2021-04-23T05:40:00.000Z",
        "voteCount": 5,
        "content": "answer is B B 100%"
      },
      {
        "date": "2021-04-13T20:04:00.000Z",
        "voteCount": 2,
        "content": "\"The reports must be made available to the board from powerbi.com.\" Is that meaning we should deliver the report via workspace to the board? And I don't think we can assume the board members only care about the result rather than the underlying dataset. I had a boss who liked study every number in the report and where these numbers came from."
      },
      {
        "date": "2021-03-30T11:02:00.000Z",
        "voteCount": 2,
        "content": "Can someone please confirm the correct answer?"
      },
      {
        "date": "2021-03-16T12:18:00.000Z",
        "voteCount": 1,
        "content": "Today I'd make a Team which automatically associates a workspace in Power BI and associate the membership there to simplify distribution of non-reporting assets and a rich set of communication features that automatically associate when communicating about the topic."
      },
      {
        "date": "2021-02-02T18:14:00.000Z",
        "voteCount": 1,
        "content": "Is it BB or CB? it's confusing."
      },
      {
        "date": "2021-02-06T01:00:00.000Z",
        "voteCount": 4,
        "content": "C+B is correct"
      },
      {
        "date": "2021-02-02T17:19:00.000Z",
        "voteCount": 3,
        "content": "I think App is appropriate here. Because if you give them workspace access, they canview all the reports, including crap reports or the reports which is of their no interest. Its better create an app, and make available only few reports and dashboards in it and they can view it... They dont care about data set and only wants to view the result.. So based on my own opinion App is better than workspace"
      },
      {
        "date": "2021-01-17T11:25:00.000Z",
        "voteCount": 3,
        "content": "It should be C and B. The question is about the board Distribution, and we got information that the board cannot see additional reports, which might be created by analysts. You can do this only in the app (in workspace you see everything). Here is the original requirement: “ The analysts must be able to build new reports from the dataset that contains the profit and loss data, but any reports that the analysts build must not be included in the quarterly reports for the board”"
      },
      {
        "date": "2021-01-07T03:55:00.000Z",
        "voteCount": 2,
        "content": "I think BB is correct :\n\"The analysts must be able to build new reports from the dataset that contains the profit and loss data\", \n\" The analysts must not be able to share the quarterly reports with anyone.\""
      },
      {
        "date": "2021-02-24T12:28:00.000Z",
        "voteCount": 1,
        "content": "this is about the rôle you want to give to user, Contributor can't share report.\nbut here we want to demystify   C or B in the first Box ==&gt; For me it's  C* , B\nbecause  with C \"share with app\" you can choose the content you want to share.\nbut with B \"share by workspace\" the workspace rls only work on Viewer Rôle ==&gt; so  \"not on analysts\". and in this case the requirement :  \"The company wants to provide a single package of reports to the board that contains custom navigation and links to supplementary information.\"\n===&gt; so it's C (for me)\nhttps://docs.microsoft.com/en-us/power-bi/admin/service-admin-rls#using-rls-with-workspaces-in-power-bi"
      },
      {
        "date": "2020-11-27T19:28:00.000Z",
        "voteCount": 5,
        "content": "both BB or CB would do the work but I'm leaning towards C and B, because RSL is not available to workspace.\n\nRLS not working in workspace, use App instead\nhttps://community.powerbi.com/t5/Service/Row-level-Security-for-workspace-owners/td-p/1359184"
      },
      {
        "date": "2020-12-10T17:55:00.000Z",
        "voteCount": 5,
        "content": "Agree.\n\nhttps://docs.microsoft.com/en-us/power-bi/admin/service-admin-rls#using-rls-with-workspaces-in-power-bi\n\nC+B."
      },
      {
        "date": "2021-01-19T09:53:00.000Z",
        "voteCount": 3,
        "content": "don't agree: RLS works on datasets. So on workspaces.  BB it is"
      },
      {
        "date": "2021-07-26T07:08:00.000Z",
        "voteCount": 1,
        "content": "it might be a misunderstanding. In your link you posted, they commented  \" RLS is not applied for workspace owner \""
      },
      {
        "date": "2020-11-21T12:31:00.000Z",
        "voteCount": 3,
        "content": "Agree with C&amp;B\nAn App is better way to distribute the contents. Analysts will have the ability to inculde or not contents of a workspace in the App."
      },
      {
        "date": "2020-11-10T17:15:00.000Z",
        "voteCount": 1,
        "content": "App generally good option when distributing to large audience or giving to everyone."
      },
      {
        "date": "2020-11-14T14:59:00.000Z",
        "voteCount": 6,
        "content": "Problem is if there's only one workspace used for development it doesn't comply to this: The analysts must be able to build new reports from the dataset that contains the profit and loss data, but any reports that the analysts build must not be included in the quarterly reports for the board.\n\nInstead, App does and makes workspace like a staging area.. we can edit or make incremental changes without committing those changes to the published version of the app. So the board won’t see the changes until the analyst decide."
      },
      {
        "date": "2020-11-07T17:41:00.000Z",
        "voteCount": 1,
        "content": "Correct, Workspace will have Viewer with analysts having Build on datasets...while Sharing Individual Reports works too, that is unnecessary work (you would have to share each report)...by assigning Viewer on the Workspace with Build on the Datasets they need to build from it would be easier to manage"
      }
    ],
    "examNameCode": "da-100",
    "topicNumber": "12"
  },
  {
    "topic": 12,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46814-exam-da-100-topic-12-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to grant access to the business unit analysts.<br>What should you configure? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04207/0015400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04207/0015400002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: The Viewer role to the workspace<br>The Viewer role gives a read-only experience to its users. They can view dashboards, reports, or workbooks in the workspace, but can't browse the datasets or dataflows. Use the Viewer role wherever you would previously use a classic workspace set to ג€Members can only view Power BI contentג€.<br><img src=\"/assets/media/exam-media/04207/0015500001.jpg\" class=\"in-exam-image\"><br><br>Box 2: Build -<br>The analysts must be able to build new reports from the dataset that contains the profit and loss data.<br>Scenario: The reports must be made available to the board from powerbi.com.<br>The analysts responsible for each business unit must see all the data the board sees, except the profit and loss data, which must be restricted to only their business unit's data. The analysts must be able to build new reports from the dataset that contains the profit and loss data, but any reports that the analysts build must not be included in the quarterly reports for the board. The analysts must not be able to share the quarterly reports with anyone.<br>Reference:<br>https://www.nickyvv.com/2019/08/the-new-power-bi-workspace-viewer-role-explained.html<br>Deploy and Maintain Deliverables",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-14T12:51:00.000Z",
        "voteCount": 70,
        "content": "\"The analysts must be able to build new reports from the dataset that contains the profit and loss data, but any reports that the analysts build must not be included in the quarterly reports for the board\" : \nThe Viewer role with Build Permission in the PowerBI, allows to export the data and build reports around it. The analyst report should not be included in the quarterly report, so its better to create the report in its own workspace\nCheck second last point here:\nhttps://docs.microsoft.com/en-us/power-bi/collaborate-share/service-new-workspaces#features-that-work-differently\n\nThe analysts must not be able to share the quarterly reports with anyone: \n If the role is Members,  the analyst can share the quarterly reports with anyone. This point makes it clear that analyst should not be given Members role\n\nHence, the answer should be Viewer Role and Build permission"
      },
      {
        "date": "2021-04-02T00:03:00.000Z",
        "voteCount": 41,
        "content": "Based on the latest updated permissions here: https://docs.microsoft.com/en-us/power-bi/collaborate-share/service-new-workspaces\n\nViewer can no longer create report based on current dataset in the workspace.  Only Contributor or Member would be able to do so. Therefore, watch out for the update in this question."
      },
      {
        "date": "2021-06-21T12:21:00.000Z",
        "voteCount": 11,
        "content": "Our goal : the group can create but cannot share\n1- If the role is Member =&gt; Users can share reports so that should be avoided\n2- With Build permission =&gt; Users can create reports (https://docs.microsoft.com/en-us/power-bi/connect-data/service-datasets-build-permissions)\n\nSo the answer for sure is : Viewer + Build"
      },
      {
        "date": "2021-05-16T12:59:00.000Z",
        "voteCount": 6,
        "content": "To copy a report, and to create a report in another workspace based on a dataset in this workspace, you need Build permission for the dataset. For datasets in this workspace, the people with Admin, Member, and Contributor roles automatically have Build permission through their workspace role.\n\nso the answer is \"Viewer role\""
      },
      {
        "date": "2021-12-20T12:37:00.000Z",
        "voteCount": 2,
        "content": "At first I thought the answer was correct but you seem to be right... Viewer rol can:\n* View and interact with an item;\n* Read data stored in workspace dataflows.\nSo, I it should be Member to my opion."
      },
      {
        "date": "2021-12-20T12:38:00.000Z",
        "voteCount": 1,
        "content": "Correction, I mean Contributor"
      },
      {
        "date": "2021-05-20T07:28:00.000Z",
        "voteCount": 2,
        "content": "So, after the update, Member and builder? but what about the re-share aspect..."
      },
      {
        "date": "2022-06-16T20:44:00.000Z",
        "voteCount": 1,
        "content": "Based on latest roles updates in (https://docs.microsoft.com/en-us/power-bi/collaborate-share/service-roles-new-workspaces), its member and build."
      },
      {
        "date": "2022-03-17T08:40:00.000Z",
        "voteCount": 1,
        "content": "I got it on my exam 03/17/2022. 90-95% questions were from here. 61 questions in 100 min. All 3 case studies that appeared in exam, where from here."
      },
      {
        "date": "2022-03-17T08:40:00.000Z",
        "voteCount": 1,
        "content": "Answered: Viewer and Build"
      },
      {
        "date": "2022-08-01T15:08:00.000Z",
        "voteCount": 5,
        "content": "dude. stfu man. you got all the 100 questions in exam? you have been commenting this literally in every question. stop creating a mess for people"
      },
      {
        "date": "2022-03-11T02:53:00.000Z",
        "voteCount": 5,
        "content": "This is the kind of question where you choose through elimination.\nViewer - not possible since the analysts should be able to build reports\nMember - not possible since the analysts should NOT be able to share reports (items)\nSo this leaves as with the first option - Access permissions to an app.\n\nThe second part is obvious - Build."
      },
      {
        "date": "2022-03-03T05:24:00.000Z",
        "voteCount": 3,
        "content": "The correct answer should be:         Access permission to app + Build\n\nYou can choose the following as you are creating and assigning apps From the \"Permissions\" section:\n1-) You can provide access to the app to the entire organization, group, or individual (in our case, the app can be assigned with either individual analyst or group of analysts).\n2-) Also down in the options, you can choose to: \n     A-) Allow users to connect to the app's underlying datasets using the build permission  \n     B-) Allow users to make a copy of the reports in the app"
      },
      {
        "date": "2022-03-01T11:42:00.000Z",
        "voteCount": 1,
        "content": "on exam 3/1/2022"
      },
      {
        "date": "2022-02-19T23:47:00.000Z",
        "voteCount": 2,
        "content": "Viewer + build,  cuz RLS only applied to viewer role."
      },
      {
        "date": "2022-02-08T01:46:00.000Z",
        "voteCount": 2,
        "content": "Even in the new Power BI roles, the dataset owner can assign build permissions to specific users, so I think that there is no problem to assign it to VIEWER roles. \nhttps://docs.microsoft.com/en-us/power-bi/connect-data/service-datasets-build-permissions\n\nBut I don't like the viewer role option because the description says:\n\"The analysts responsible for each business unit must see all the data the board sees, except the profit and loss data, which must be restricted to only their business unit's data\"\n\nIf we assigned a viewer role with build permissions, they would see all the data, including the profit and loss, and they should be restricted to see that information. For this reason I think that it is better to share an app with build permissions."
      },
      {
        "date": "2022-01-03T06:34:00.000Z",
        "voteCount": 2,
        "content": "based on this source (workspace roles), viewer role can't create a report, thereby \"Member\" and \"Built\" are correct."
      },
      {
        "date": "2022-01-03T06:34:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/power-bi/collaborate-share/service-roles-new-workspaces#workspace-roles"
      },
      {
        "date": "2021-12-10T08:09:00.000Z",
        "voteCount": 1,
        "content": "on exam 12/10/2021"
      },
      {
        "date": "2021-11-12T01:38:00.000Z",
        "voteCount": 2,
        "content": "Viewer role, Build permission.\n\"Allow users to export data: Even users with the Viewer role in the new workspace can export data if they have Build permission on the datasets in that workspace.\"\nhttps://docs.microsoft.com/en-us/power-bi/collaborate-share/service-new-workspaces"
      },
      {
        "date": "2021-11-11T13:32:00.000Z",
        "voteCount": 4,
        "content": "on exam - Nov 11, 2021. \nmy answers:\nThe Viewer role\nBuild"
      },
      {
        "date": "2021-10-16T00:59:00.000Z",
        "voteCount": 5,
        "content": "This came in my Exam today 16/10 and i said Viewer +build permission and is correct"
      },
      {
        "date": "2021-10-15T01:24:00.000Z",
        "voteCount": 2,
        "content": "I doubt if the right answer would be Viewer! recently the permission of Viewers has been limited more, they cannot create a report any longer. in addition look at this link:\n\nPower BI provides the Build permission as a complement to the existing permissions, Read and Reshare. All users who already had Read permission for datasets via app permissions, sharing, or workspace access at that time also got Build permission for those same datasets\n\nhttps://docs.microsoft.com/en-us/power-bi/connect-data/service-datasets-build-permissions#:~:text=Power%20BI%20provides%20the%20Build,permission%20for%20those%20same%20datasets."
      },
      {
        "date": "2021-10-14T07:21:00.000Z",
        "voteCount": 2,
        "content": "On exam 10/14/21"
      },
      {
        "date": "2021-09-23T02:43:00.000Z",
        "voteCount": 1,
        "content": "question in exam on 18th September"
      }
    ],
    "examNameCode": "da-100",
    "topicNumber": "12"
  }
]