[
  {
    "topic": 11,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34659-exam-da-100-topic-11-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to create a DAX measure in the data model that only allows users to see projections at the appropriate level of granularity.<br>How should you complete the measure? To answer, drag the appropriate values to the correct targets. Each value may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04207/0009100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04207/0009100002.png\" class=\"in-exam-image\">",
    "answerDescription": "Scenario: Revenue projections are set at the monthly level and summed to show projections for the quarter.<br><br>Box 1: IF -<br><br>Box 2: ISFILTERED -<br>ISFILTERED returns TRUE when columnName is being filtered directly. If there is no filter on the column or if the filtering happens because a different column in the same table or in a related table is being filtered then the function returns FALSE.<br><br>Box 3: SUM -<br>Reference:<br>https://docs.microsoft.com/en-us/dax/isfiltered-function-dax",
    "votes": [],
    "comments": [
      {
        "date": "2021-04-22T04:53:00.000Z",
        "voteCount": 33,
        "content": "answer is correct"
      },
      {
        "date": "2021-10-17T01:29:00.000Z",
        "voteCount": 17,
        "content": "I really didn't understand the wuestion well!"
      },
      {
        "date": "2022-03-01T11:49:00.000Z",
        "voteCount": 2,
        "content": "on exam 3/1/2022"
      },
      {
        "date": "2021-09-23T02:41:00.000Z",
        "voteCount": 4,
        "content": "question in exam on 18th September"
      },
      {
        "date": "2021-10-16T01:03:00.000Z",
        "voteCount": 1,
        "content": "Same 16/10"
      },
      {
        "date": "2021-05-02T04:35:00.000Z",
        "voteCount": 5,
        "content": "we only use keepfilters with calculate functions so yep just saying"
      },
      {
        "date": "2021-05-22T08:58:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/pt-pt/dax/keepfilters-function-dax"
      },
      {
        "date": "2021-02-08T03:19:00.000Z",
        "voteCount": 3,
        "content": "Shouldn't this formula use SUMX as there is no CALCULATE to iterate?"
      },
      {
        "date": "2021-02-11T01:37:00.000Z",
        "voteCount": 6,
        "content": "SUMX uses table name as an argument not just column name as shown in the question"
      },
      {
        "date": "2020-12-10T15:49:00.000Z",
        "voteCount": 3,
        "content": "correct Ans.\nbecoz:\n1, if (ABC, abc) -&gt; if ABC is true, then return abc.\n2, ISFILTERED --&gt; Returns TRUE when columnName is \"being filtered \" directly.\n\nTable 'Date' is a dimension table, usually proactively acting as a filter to others (eg: group by [Date]) to aggregate \"fact\" table 's column."
      },
      {
        "date": "2020-12-10T15:57:00.000Z",
        "voteCount": 5,
        "content": "Let me break it down a little bit.\nWe need “not(isfilter(xx)” TRUE, and then ISFILTER must be a FALSE.\nWhich means whatsoever inside the ISFILTER must be a “dimension table”, cannot act as a “fact” table to be filter by others to get some aggregated data (eg: “sum, count, min, max, etc….)."
      },
      {
        "date": "2020-11-21T11:43:00.000Z",
        "voteCount": 2,
        "content": "Agree with solution as a calculation at date (day) level doesn't make sense in this context."
      },
      {
        "date": "2020-10-16T17:35:00.000Z",
        "voteCount": 1,
        "content": "DAX has to make use of some conditionality so as to restrict user view of projections. \nso the DAX will be \nIF-------KEEPFILTERS----SUM"
      },
      {
        "date": "2020-10-18T02:25:00.000Z",
        "voteCount": 36,
        "content": "it's ISFILTERED because it will returns boolean (if it's not isfiltered give me the total), KEEP FILTERS returns a table"
      },
      {
        "date": "2020-11-26T06:45:00.000Z",
        "voteCount": 1,
        "content": "Isn't it just the very opposite?\nhttps://docs.microsoft.com/en-us/power-bi/guidance/dax-avoid-avoid-filter-as-filter-argument"
      },
      {
        "date": "2021-01-13T02:31:00.000Z",
        "voteCount": 4,
        "content": "KEEPFILTERS works only with CALCULATE or CALCULATETABLE. So, it has no sense in this DAX.\nISFILTERED is correct due to if we are not filtering by Date we suppose the filters are Year, Quarter or Month so, we have to accumulate Revenue Projection"
      },
      {
        "date": "2021-04-22T04:55:00.000Z",
        "voteCount": 1,
        "content": "agreed with tamin"
      }
    ],
    "examNameCode": "da-100",
    "topicNumber": "11"
  },
  {
    "topic": 11,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33751-exam-da-100-topic-11-question-2-discussion/",
    "body": "Which two types of visualizations can be used in the balance sheet reports to meet the reporting goals? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta line chart that shows balances by quarter filtered to account categories that are long-term liabilities.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta clustered column chart that shows balances by date (x-axis) and account category (legend) without filters.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta clustered column chart that shows balances by quarter filtered to account categories that are long-term liabilities.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta pie chart that shows balances by account category without filters.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta ribbon chart that shows balances by quarter and accounts in the legend.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AC",
    "answerDescription": "Visualize the Data",
    "votes": [
      {
        "answer": "AE",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-12-10T17:15:00.000Z",
        "voteCount": 48,
        "content": "BS is required to report by quarter. B is incorrect.\nBS all accounts are showing ending balance, and assets = liabilities + equity, D is incorrect.\nA or C? the only difference is line chart vs. cluster column chart? The Board wanna see the change of long-term liabilities. Here I will go with A, line chart is perfect to observe a trend over a period of time (short or long), column chart is good for various categories (product).\nE is correct. \n\nRef:\nhttps://docs.microsoft.com/en-us/power-bi/visuals/power-bi-visualization-types-for-reports-and-q-and-a\n\n\nHence, A + E."
      },
      {
        "date": "2021-01-12T04:22:00.000Z",
        "voteCount": 8,
        "content": "I think A &amp; C.  Look at the description for E:  \"You can create ribbon charts to visualize data, and quickly discover which data category has the highest rank (largest value). Ribbon charts are effective at showing rank change, with the highest range (value) always displayed on top for each time period.\"  Ref: https://docs.microsoft.com/en-us/power-bi/visuals/desktop-ribbon-charts"
      },
      {
        "date": "2021-03-01T05:48:00.000Z",
        "voteCount": 7,
        "content": "BS is not per se required to report per quarter. It states: \"At least one of the balance sheet reports in the quarterly reporting package must show the ending balances for the quarter\". Hence A + B.  C is incorrect because a clustered column chart filtered by only one category makes no sense. A ribbon chart is meant for rank changes, not relevant here."
      },
      {
        "date": "2020-11-21T12:09:00.000Z",
        "voteCount": 28,
        "content": "For me A &amp; E:\nA: line chart to show changes by quarter on long-term liabilities filtered already in the visual\nE: ribbon chart to show balances by quarters and Accounts in legends (we can highlight long-term liabilities and see the changes also here)\n\nFor those who said C, there is no need to clustered column chart as we have only one Value to present which is Balance."
      },
      {
        "date": "2021-01-20T23:56:00.000Z",
        "voteCount": 8,
        "content": "I think it should C because it is mention in the requirements that users should be able to compare quarterly data. And the comparison is better with a column chart."
      },
      {
        "date": "2022-09-08T20:11:00.000Z",
        "voteCount": 1,
        "content": "A for change of liability; E for balance of all accounts with trends"
      },
      {
        "date": "2022-01-25T14:01:00.000Z",
        "voteCount": 4,
        "content": "I choose A &amp; C"
      },
      {
        "date": "2021-09-10T05:37:00.000Z",
        "voteCount": 1,
        "content": "E, it is the only option with the account column in a visual.\nC, because the requirement is comparison, not trend (trend is wanted with revenue)."
      },
      {
        "date": "2021-11-14T04:18:00.000Z",
        "voteCount": 1,
        "content": "One of the requirements is literally 'trend over time'."
      },
      {
        "date": "2021-07-11T09:01:00.000Z",
        "voteCount": 2,
        "content": "C , E. E is the only option that meets the req for ending balances for each account. A would have the info on liabilities change between latest and last quarter, but wouldn’t be as easy to see the changes as a column chart if each cluster were for each account category. (2 columns in each cluster)"
      },
      {
        "date": "2021-06-21T23:59:00.000Z",
        "voteCount": 1,
        "content": "both A and C say \"... to account categories that are long-term liabilities\". We want to see all accounts, not only which that are long-term liabilities. So for me the answers are D (ending balances accounts comparison) and E (comparison over time)"
      },
      {
        "date": "2021-06-20T11:14:00.000Z",
        "voteCount": 1,
        "content": "Balance report requirement: \n1.You plan to relate the balance sheet to a standard date table in Power BI in a many-to-one relationship based on the last day of the month. \n2.At least one of the balance sheet reports in the quarterly reporting package must show the ending balances for the quarter, as well as for the previous quarter.\n\nOnly C can realize the second requirements, list the ending balances for the quarter, as well as for the previous quarter. So C has to be selected."
      },
      {
        "date": "2021-06-05T22:32:00.000Z",
        "voteCount": 2,
        "content": "Shouldn't it be A + E because the board wants to see both:\nEnding balances for each account\nChanges in long-term liabilities from the previous quarter\n\nA+C gives the same information (only for long-term liabilities) but there are also other accounts.\n\nPlease, correct me if I'm wrong."
      },
      {
        "date": "2021-05-07T13:31:00.000Z",
        "voteCount": 2,
        "content": "I guess we can strike down A and C right away because of its focus on long term liabilities  and we don't have any such requirement. Management would be first interested to see latest balance sheet and for that we have two options in answers Clustered column chart or Pie chart; I will go for pie chart. For comparison to previous quarters we can use ribbon chart which is the only choice left. So my answer is DE."
      },
      {
        "date": "2021-05-07T14:21:00.000Z",
        "voteCount": 3,
        "content": "sorry for reading the requirements properly, here I go again.  For showing balances of each account no option but pie chart suits. So I will stick to D.    With the filtered line chart  we can't show revenue trends so A is not possible.  With clustered column chart with account category we can't show expense projections, so B wouldn't work. option C has the same problem as option A. so my answer is still DE."
      },
      {
        "date": "2021-04-23T05:31:00.000Z",
        "voteCount": 6,
        "content": "its A and E , A for trend and E for comparison example : highest vs lowest"
      },
      {
        "date": "2021-02-20T04:20:00.000Z",
        "voteCount": 1,
        "content": "A &amp; B, as clustered columns are not useful with only one category (C), and E is not ordered in time sequence to compare same periods. B is montly as this is the balancesheet granularity, but still allows to see the quarter data easily. Well, if you don't want montly data, then go for A &amp; E."
      },
      {
        "date": "2021-02-22T09:25:00.000Z",
        "voteCount": 4,
        "content": "I'll finally go for A &amp; E, altough I still think E is not a good visualization for this case, but in fact the time sequence is preserved."
      },
      {
        "date": "2021-02-03T05:11:00.000Z",
        "voteCount": 3,
        "content": "C &amp; E to me.. A is not possible because line graph shows contineous trend.. In ballance sheet we are comparing quarterly ballances and liabilities"
      },
      {
        "date": "2021-05-04T02:16:00.000Z",
        "voteCount": 1,
        "content": "It cannot be C.. Its A because we are showing trends over a period of time."
      },
      {
        "date": "2021-02-02T20:05:00.000Z",
        "voteCount": 5,
        "content": "A&amp;C sounds correct. Not E because ribbon chart shows ranks and the team isn't interested in ranks. Pie chart would make somewhat sense but no one displays balances in terms of pie chart."
      },
      {
        "date": "2020-12-17T04:13:00.000Z",
        "voteCount": 13,
        "content": "Should be A &amp; E:\nA : Changes in long-term liabilities from the previous quarter\nE: Ending balances for each account"
      },
      {
        "date": "2020-11-18T14:53:00.000Z",
        "voteCount": 4,
        "content": "C &amp; D should do the job.\nFor change in LT liabilities from prev quarter, a Clustered Col chart is right. A Line chart may not be good to display just 2 data points (quarters)\nTo display the Ending balances of all accounts, a simple Pie chart is only the valid option available. The requirement is to display the balances at the end of that quarter, not the comparison with other quarters. The other 4 options display either by quarter or by date which is not required for this."
      },
      {
        "date": "2021-01-18T05:48:00.000Z",
        "voteCount": 1,
        "content": "ribbon chart aims to present in terms of ranking, so i think it cant really present well for the change of account over time (imagine if an account has swapped rankings across quarters, you may not be easily to visualize the change/difference)\n\nanswer to pie chart sounds reasonable but it seems strange to present account balance in terms of pie chart, so I have doubt in that"
      },
      {
        "date": "2020-11-13T04:28:00.000Z",
        "voteCount": 7,
        "content": "C &amp; E?"
      }
    ],
    "examNameCode": "da-100",
    "topicNumber": "11"
  }
]