[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37247-exam-70-467-topic-1-question-18-discussion/",
    "body": "DRAG DROP -<br>You are administering a SQL Server Analysts Services (SSAS) database on a server. The database hosts a financial cube based on a SQL Azure database.<br>You need to grant write access to the financial cube for all users in the group USA\\PowerUsers.<br>Which three actions should you perform in sequence? (To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.)<br>Select and Place:<br><img src=\"/assets/media/exam-media/02157/0012500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02157/0012600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note:<br>* A member of the server role for Microsoft SQL Server Analysis Services, or a member of a database role that has Full Control (Administrator) permissions in a particular database, can create a database role that only has permission to process specified objects within the database. Giving a database role permission to process a database object lets an administrator delegate the task of processing certain objects, without also granting extraneous permissions to the user who is performing the processing.<br>* To give a database role permission to process a cube<br>1. In SQL Server Management Studio, connect to the instance of Analysis Services, expand Roles for the appropriate database in Object Explorer, and then double-click a database role (or right-click Roles and select New Role to create a new database role). If this is a new role, make sure that you enter a name for the role in the Role name box.<br>2. Click Cubes in the Select a Page pane, locate the cube in the Cube list, and then select the Process check box for the cube.<br>3. Click the OK button.<br>* There is no write permissions on a cube.<br>Reference: Grant Process Permissions on an Analysis Services Multidimensional Database",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-18T13:44:00.000Z",
        "voteCount": 2,
        "content": "Correct answer for box 3 is Read/Write, there are no \"Process\" permissions for a cube."
      }
    ],
    "examNameCode": "70-467",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37249-exam-70-467-topic-1-question-20-discussion/",
    "body": "You are creating a Multidimensional Expressions (MDX) calculation for Projected Revenue in a cube.<br>For Customer A, Projected Revenue is defined as 150 percent of the Total Sales for the customer. For all other customers, Projected Revenue is defined as 110 percent of the Total Sales for the customer.<br>You need to calculate the Projected Revenue as efficiently as possible.<br>Which calculation should you use? (More than one answer choice may achieve the goal. Select the BEST answer.)<br><img src=\"/assets/media/exam-media/02157/0012900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption A",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption B",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption C",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOption D"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-18T14:00:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "70-467",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37251-exam-70-467-topic-1-question-22-discussion/",
    "body": "DRAG DROP -<br>You are designing a self-service business intelligence and reporting environment.<br>Business analysts will create and publish PowerPivot for Microsoft Excel workbooks and create reports by using SQL Server Reporting Services (SSRS) and<br>Power View. When the data models become more complex and the data volume increases, the data models will be replaced by IT-hosted server-based models.<br>You have the following requirements:<br>✑ Maintain the self-service nature of the reporting environment.<br>✑ Reuse existing reports.<br>✑ Add calculated columns to the data models.<br>You need to create a strategy for implementing this process.<br>What should you do?<br>To answer, drag the appropriate term or terms to the correct location or locations in the answer area. (Answer choices may be used once, more than once, or not all.)<br>Select and Place:<br><img src=\"/assets/media/exam-media/02157/0013100004.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02157/0013200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Import -<br><br>Box 2: tabular -<br><br>Box 3: Deploy -<br><br>Box 4: Modify -<br>You can see that the audiences for these two approaches are different: Tabular models are for IT professionals, while PowerPivot models are for business users.<br>And keep in mind you can import a PowerPivot workbook to create a new tabular product.  For example, a business user might create a solution using<br>PowerPivot.  By restoring the workbook, IT can add features that are not supported in PowerPivot, such as roles to grant read permission to different groups of users.  Additionally, recognition by IT that the model is important to the organization may prompt them to import the workbook into a tabular project and take ongoing responsibility for developing the model.",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-18T14:11:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "70-467",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18633-exam-70-467-topic-1-question-41-discussion/",
    "body": "You are designing a SQL Server Integration Services (SSIS) solution that will load multiple Online Transactional Processing (OLTP) data sources into a SQL<br>Server data mart.<br>You have the following requirements:<br>✑ Ensure that the process supports the creation of an exception report that details possible duplicate key values, null ratios within columns, and column-length distributions of values.<br>✑ Ensure that users can generate the exception report in an XML format.<br>✑ Use the minimum development effort.<br>You need to design the SSIS solution to meet the requirements.<br>What should you do? (More than one answer choice may achieve the goal. Select the BEST answer.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse a Data Profiling task. Use a Data Flow task to extract the XML output of the Data Profiling task into a SQL Server table. Query the table to view the exceptions.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse Data Flow tasks to process the clean data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse a Data Profiling task. Read the exceptions in Data Profile Viewer.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDesign a stored procedure that examines data for common dirty data patterns. Use an Execute SQL task."
    ],
    "answer": "C",
    "answerDescription": "Ref: http://technet.microsoft.com/en-us/library/bb895263.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-18T02:39:00.000Z",
        "voteCount": 1,
        "content": "Shouldn't this be A because the requirement is for the user to be able to extract the results to an XML?"
      }
    ],
    "examNameCode": "70-467",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18786-exam-70-467-topic-1-question-102-discussion/",
    "body": "You are designing a partitioning strategy for a SQL Server Analysis Services (SSAS) cube. New data is loaded in real-time into the data warehouse that feeds the cube. Between 10 million and 15 million rows of data are loaded into the main fact table each day from a Microsoft Azure SQL Database.<br>You have the following requirements:<br>✑ Maximize cube query performance during business hours.<br>✑ Ensure that data is available in the cube as soon as possible after it is loaded into the data warehouse.<br>You need to design a partitioning strategy that meets the requirements.<br>What should you do? (More than one answer choice may achieve the goal. Select the BEST answer.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPartition the cube by day for history, using hybrid OLAP (HOLAP) storage mode. Create a daily partition that uses multidimensional OLAP (MOLAP) storage mode during the day. Reprocess the partition incrementally during the day.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPartition the cube by week for history. Create a daily partition that uses multidimensional OLAP (MOLAP) storage mode. Process the partition periodically to add new data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPartition the cube by day for history, using multidimensional OLAP (MOLAP) storage mode. Create a daily partition that uses proactive caching during the day. Reprocess the partition in full MOLAP storage mode at night",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPartition the cube by day for history, using multidimensional OLAP (MOLAP) storage mode. Create a daily partition that uses relational OLAP (ROLAP) storage"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-20T11:30:00.000Z",
        "voteCount": 1,
        "content": "This can't be A because \"incremental\" add to the database doesn't satisfy the requirement of getting the data as soon as possible."
      }
    ],
    "examNameCode": "70-467",
    "topicNumber": "1"
  }
]