[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27418-exam-70-357-topic-2-question-1-discussion/",
    "body": "Case Study -<br>This is a case study. Case studies are not limited separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Background -<br>You are developing an application named Timeline that presents information on a timeline. The app allows users to create items and enter details about the item.<br>The app displays item names on a timeline. When users select an item name on the timeline, the app displays additional content about the item.<br><br>Business requirements -<br><br>Timeline section -<br>The timeline element of the app has the following layout requirements:<br>✑ The timeline must adapt to the screen size and orientation of the device.<br>✑ The timeline size must dynamically change if the window containing the content is resized by the user.<br>✑ The user must be able to scroll through the timeline horizontally when the device is in landscape mode.<br>✑ The user must be able to scroll through the timeline vertically when the device is in portrait mode.<br>✑ The timeline must begin scrolling as soon as a scroll is detected. Scrolling must continue for a short distance after the scroll input has stopped.<br>✑ Scroll bars or panning controls must always be visible.<br>The following image depicts the layout for the timeline section of the app when the device is using landscape orientation:<br><img src=\"/assets/media/exam-media/01210/n41522700005.jpg\" class=\"in-exam-image\"><br>The following image depicts the layout for the timeline section of the app when the device is using portrait orientation:<br><img src=\"/assets/media/exam-media/01210/n41522700001.jpg\" class=\"in-exam-image\"><br><br>Content section -<br>The content element of the app has the following layout requirements:<br>✑ When a user selects an item on the timeline, the details for that item must display beneath or to the right of the timeline.<br>✑ The content section must display one page of information. The element must be a child of the selected item in the timeline.<br>✑ Users must be able to return to a previously selected event by pressing the Back button.<br><br>User interface -<br>The user must be able to navigate the application using the interface below:<br><img src=\"/assets/media/exam-media/01210/n41522700000.jpg\" class=\"in-exam-image\"><br>✑ The Favorite button marks the current content to be displayed in a Favorites panel.<br>✑ The Back and Forward buttons navigate through the app selection history. Both buttons must be available on all devices.<br>✑ The Notes button allows the user to manage notes about the current content.<br>✑ The app must support touch, mouse, and stylus input.<br>✑ The app layout must automatically adapt to the screen size and orientation.<br><br>Technical requirements -<br><br>Layout -<br>You identify the following layout requirements:<br><br>General -<br>✑ All user interface (UI) elements must continuously scale when a user resizes the window.<br>✑ UI controls must be smaller and spaced closer together if there is a mouse or stylus available.<br>✑ UI controls must be larger and spaced farther apart if the device supports touch and there is no mouse or pointer available.<br><br>Timeline -<br>✑ The timeline must be displayed in a horizontal layout when the device is in a landscape orientation or when the horizontal width is greater than the vertical height.<br>✑ The timeline must be displayed in a vertical layout when the device is in a portrait orientation or when the vertical height is greater than the horizontal width.<br>✑ Each item in the past must be linked to the next item in the future.<br>✑ Users must be able to scroll from past events to future events or from future events to past events.<br>✑ The app must only allow one level of detail to be linked to each item in the timeline.<br><br>Optimization -<br>You must optimize the app using the following guidelines:<br>✑ You must minimize the time it takes to display content when an item on the timeline is selected.<br>✑ The app must respect memory and resource constraints for all devices.<br><br>XAML coding style -<br>All code and markup must conform to the following style guidelines:<br>✑ Use resource dictionaries for styles that are used more than once.<br>✑ Limit the use of nested panels.<br>✑ Use built-in properties of existing panels instead of using separate style objects.<br>✑ Use the navigation structure that best models the data without exceeding the requirements of the app.<br><br>Application structure -<br><br>MainPage.xaml -<br>Relevant portions of the app files are shown below. (Line numbers in the code segments are included for reference only and include a two-character prefix that denotes the specific file to which they belong.)<br><img src=\"/assets/media/exam-media/01210/n41522700004.png\" class=\"in-exam-image\"><br><br>Settings.xaml -<br>Relevant portions of the app files are shown below. (Line numbers in the code segments are included for reference only and include a two-character prefix that denotes the specific file to which they belong.)<br><img src=\"/assets/media/exam-media/01210/n41522700003.png\" class=\"in-exam-image\"><br><br>ResourceDictionery.xaml -<br>Relevant portions of the app files are shown below. (Line numbers in the code segments are included for reference only.)<br><img src=\"/assets/media/exam-media/01210/n41522700002.jpg\" class=\"in-exam-image\"><br><br>MainPage.xaml.cs -<br>Relevant portions of the app files are shown below. (Line numbers in the code segments are included for reference only and include a two-character prefix that denotes the specific file to which they belong.)<br><img src=\"/assets/media/exam-media/01210/n41522700007.png\" class=\"in-exam-image\"><br>Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution. Determine whether the solution meets the stated goals.<br>You need to implement the appropriate XAML layout for the Timeline app.<br>Solution: You create an instance of a StackPanel class.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "StackPanel is a simple layout panel that arranges its child elements into a single line that can be oriented horizontally or vertically. StackPanel controls are typically used in scenarios where you want to arrange a small subsection of the UI on your page.<br>The following XAML shows how to create a vertical StackPanel of items.<br><br>XAML -<br>&lt;StackPanel&gt;<br>&lt;Rectangle Fill=\"Red\" Height=\"44\"/&gt;<br>&lt;Rectangle Fill=\"Blue\" Height=\"44\"/&gt;<br>&lt;Rectangle Fill=\"Green\" Height=\"44\"/&gt;<br>&lt;Rectangle Fill=\"Orange\" Height=\"44\"/&gt;<br>&lt;/StackPanel&gt;<br>The result looks like this.<br><img src=\"/assets/media/exam-media/01210/n41522700006.png\" class=\"in-exam-image\"><br>Reference: https://docs.microsoft.com/en-us/windows/uwp/layout/layout-panels",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-05T07:45:00.000Z",
        "voteCount": 1,
        "content": "Answer: B"
      }
    ],
    "examNameCode": "70-357",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11854-exam-70-357-topic-2-question-7-discussion/",
    "body": "You must create a control that meets the following requirements:<br>✑ allows you to extend the behavior of a combo box<br>✑ allows the arrow image that is located at the right edge of a standard control to be replaced with a new image<br>✑ has a property that sets and returns the image<br>✑ maintains all of the properties of a standard combo box control<br>✑ has a visual interface of the control that is defined by using XAML<br>✑ defines the properties for the control in code<br>You need to create the control.<br>Which object should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tContentDialog",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStaticResource",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThemeResource",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUserControl A"
    ],
    "answer": "Explanation",
    "answerDescription": "ContentDialog represents a dialog box that can be customized to contain checkboxes, hyperlinks, buttons and any other XAML content.<br>Reference: https://docs.microsoft.com/en-us/uwp/api/windows.ui.xaml.controls.contentdialog",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-12T15:56:00.000Z",
        "voteCount": 5,
        "content": "Correct Answer: D"
      }
    ],
    "examNameCode": "70-357",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27622-exam-70-357-topic-2-question-10-discussion/",
    "body": "Case Study -<br>This is a case study. Case studies are not limited separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Background -<br>You are developing a Universal Windows Platform (UWP) app for LitWare, Inc. that will assist video artists. The app allows artists to create videos, share videos through other mobile apps, and upload the videos through LitWare, Inc.'s web services. What helps set LitWare Inc.'s app apart from competitors is their focus on speed and performance.<br><br>Business Requirements -<br><br>Support many devices -<br>✑ Users may have phones, tablets, or laptops. The app must support all devices with a fluid layout that grows off-screen and adapts to each device.<br><br>Record video -<br>✑ Users must be able to record videos and view them in their videos library.<br>The app must display information about the recorded video.<br><img src=\"/assets/media/exam-media/01210/n41527400001.png\" class=\"in-exam-image\"><br>✑ Users must be able to edit the upload queue in the app.<br><br>Branding -<br>✑ The app must have consistent branding throughout all views.<br><br>Upload videos -<br>✑ The app must allow deferral and scheduling of video uploads.<br>✑ Users must be able to view the status of uploaded videos.<br>✑ Any videos created with this app or shared with this app must be uploaded without user interaction.<br><br>Download video -<br>✑ The app must have the option to automatically download videos.<br>✑ Users must be able to initiate downloading of videos.<br><br>Share video -<br>✑ The app must allow be allowed to receive videos from other apps.<br><br>Technical Requirements -<br><br>Support multiple devices -<br>The app must support the following:<br>✑ Use horizontal layout for larger screens.<br>✑ User vertical layout for smaller screens.<br>✑ Use one layout control per view.<br>The app must be compatible with current and future XBOX apps that use C++.<br><br>Uploading and downloading -<br>✑ The app must use a background operations to upload and download videos.<br><br>Code reuse -<br>✑ The app must use a common pool of XAML resources and custom controls. All custom controls must use a consistent theme throughout the app.<br>✑ You must create code that can be reused in C++, C#, JavaScript, whenever possible.<br>The app must call the background service to avoid duplication of code.<br><img src=\"/assets/media/exam-media/01210/n41527400003.png\" class=\"in-exam-image\"><br><br>Security -<br>✑ End users must be authenticated using OAuth.<br>✑ Web services must be authenticated.<br>✑ Users must have the option to use single sign-on.<br><br>Recording -<br>✑ The app must use the microphone and webcam to support audio and video recording. In addition, the app must support the use of the back and camera buttons, if present.<br><br>Integration -<br>Other apps must be able to share videos with this app through a Universal Windows Platform (UWP) app service.<br><br>Architecture and coding style -<br>✑ The app must follow the Model-View-ViewModel (MVVM) pattern.<br>✑ The app's user interface (UI) must be optimized for performance.<br>✑ The app must use compile time coding techniques over runtime.<br><br>Application structure -<br><br>Package.appxmanifest -<br>Relevant portions of the app files are shown below. Line numbers in the code segments are included for reference only and include a two-character prefix that denotes the specific file to which they belong.<br><img src=\"/assets/media/exam-media/01210/n41527400002.png\" class=\"in-exam-image\"><br><br>BackgroundTask.cs -<br>Relevant portions of the app files are shown below. Line numbers in the code segments are included for reference only and include a two-character prefix that denotes the specific file to which they belong.<br><img src=\"/assets/media/exam-media/01210/n41527400000.jpg\" class=\"in-exam-image\"><br>Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution. Determine whether the solution meets the stated goals.<br>You must create a project for shared code.<br>Solution: You implement the shared code in a Class Library (Universal Windows).<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo A"
    ],
    "answer": "Explanation",
    "answerDescription": "The .NET Framework Portable Class Library project type in Visual Studio helps you build cross-platform apps and libraries for Microsoft platforms quickly and easily.<br>Portable class libraries can help you reduce the time and costs of developing and testing code. Use this project type to write and build portable .NET Framework assemblies, and then reference those assemblies from apps that target multiple platforms such as Windows and Windows Phone.<br>Even after you create a Portable Class Library project in Visual Studio and start developing it, you can change the target platforms. Visual Studio will compile your library with the new assemblies, which helps you identify the changes you need to make in your code.<br>From scenario:<br>The app must be compatible with current and future XBOX apps that use C++.<br>✑ You must create code that can be reused in C++, C#, JavaScript, whenever possible.<br>✑ The app must call the background service to avoid duplication of code.<br>Reference:<br>https://docs.microsoft.com/en-us/dotnet/standard/cross-platform/cross-platform-development-with-the-portable-class-library",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-20T06:42:00.000Z",
        "voteCount": 1,
        "content": "Ans: B. No"
      }
    ],
    "examNameCode": "70-357",
    "topicNumber": "2"
  }
]