[
  {
    "topic": 8,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/28989-exam-70-464-topic-8-question-7-discussion/",
    "body": "DRAG DROP -<br>You need to implement a new version of usp_AddMobileLocation. Develop the solution by selecting and arranging the required code blocks in the correct order.<br>You may not need all of the code blocks.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03026/0010800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03026/0010900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note:<br>* From scenario:<br>The mobile application will need to meet the following requirements:<br>Â· Update the location of the user by using a stored procedure named usp_AddMobileLocation.<br>* DELAYED_DURABILITY<br>SQL Server transaction commits can be either fully durable, the SQL Server default, or delayed durable (also known as lazy commit).<br>Fully durable transaction commits are synchronous and report a commit as successful and return control to the client only after the log records for the transaction are written to disk. Delayed durable transaction commits are asynchronous and report a commit as successful before the log records for the transaction are written to disk. Writing the transaction log entries to disk is required for a transaction to be durable. Delayed durable transactions become durable when the transaction log entries are flushed to disk.",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-18T07:10:00.000Z",
        "voteCount": 1,
        "content": "Read Uncommiited is not supported \nSee https://docs.microsoft.com/en-us/previous-versions/sql/sql-server-2016/dn133175(v=sql.130)?redirectedfrom=MSDN"
      }
    ],
    "examNameCode": "70-464",
    "topicNumber": "8"
  },
  {
    "topic": 8,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/39855-exam-70-464-topic-8-question-9-discussion/",
    "body": "DRAG DROP -<br>You need to redesign the system to meet the scalability requirements of the application.<br>Develop the solution by selecting and arranging the required code blocks in the correct order.<br>You may not need all of the code blocks.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03026/0011300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03026/0011400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note:<br>* MEMORY_OPTIMIZED_DATA<br>First create a memory-optimized data filegroup and add a container to the filegroup.<br>Then create a memory-optimized table.<br>* You must specify a value for the BUCKET_COUNT parameter when you create the memory- optimized table. In most cases the bucket count should be between<br>1 and 2 times the number of distinct values in the index key.<br>* Example:<br>-- create a durable (data will be persisted) memory-optimized table -- two of the columns are indexed<br>CREATE TABLE dbo.ShoppingCart (<br>ShoppingCartId INT IDENTITY(1,1) PRIMARY KEY NONCLUSTERED, UserId INT NOT NULL INDEX ix_UserId NONCLUSTERED HASH WITH<br>(BUCKET_COUNT=1000000),<br>CreatedDate DATETIME2 NOT NULL,<br><br>TotalPrice MONEY -<br>) WITH (MEMORY_OPTIMIZED=ON)<br>GO",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-14T07:54:00.000Z",
        "voteCount": 1,
        "content": "The primary key block is swapped with the index block, the commas don't match this way."
      }
    ],
    "examNameCode": "70-464",
    "topicNumber": "8"
  }
]