[
  {
    "topic": 21,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79135-exam-az-204-topic-21-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to implement event routing for retail store location data.<br>Which configurations should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04273/0050900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04273/0051000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Azure Blob Storage -<br>Azure event publishers and event handlers are at the core of the Event Grid routing-service. Event Grid listens to Azure event publishers, such as Blog Storage, then reacts by routing specific events to Azure event handlers, such as WebHooks. You can easily control this entire process at a granular level through event subscriptions and event filters.<br><br>Box 2: Azure Event Grid -<br>Azure Event Grid is a highly scalable event-routing service that listens for specific system events, then reacts to them according to your precise specifications. In the past, event handling has relied largely on polling ג€\" a high latency, low-efficiency approach that can prove prohibitively expensive at scale.<br><br>Box 3: Azure Logic App -<br>Event Grid's supported event handlers currently include Event Hubs, WebHooks, Logic Apps, Azure Functions, Azure Automation and Microsoft Flow.<br>Reference:<br>https://www.appliedi.net/blog/using-azure-event-grid-for-highly-scalable-event-routing",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-01T12:32:00.000Z",
        "voteCount": 37,
        "content": "Shouldn't it be Azure Function App for the handler?"
      },
      {
        "date": "2022-09-01T23:38:00.000Z",
        "voteCount": 6,
        "content": "Agree, there is no logic app in the solution."
      },
      {
        "date": "2022-09-03T00:00:00.000Z",
        "voteCount": 5,
        "content": "Yes, logic app is not mentioned"
      },
      {
        "date": "2023-07-06T01:31:00.000Z",
        "voteCount": 8,
        "content": "This was on the exam (July 2023). Went with blob/grid/function. Scored 917"
      },
      {
        "date": "2024-08-15T05:00:00.000Z",
        "voteCount": 2,
        "content": "The answer is Blob Storage, Event Grid, Function app. You maniacs want to send the entire blob through the Service Bus, don't you? Fools. What you want is for Blob Storage to emit an event saying \"a new blob is here\" to the function app, and then the Function app reads the blob and potentially saves the data to Cosmos. Please don't use Service bus to send data when it's already been stored and can just as easily be read by a function."
      },
      {
        "date": "2024-05-08T20:55:00.000Z",
        "voteCount": 1,
        "content": "For the Handler, Logic Apps are not part of the test anymore, so Function App is probably the preferred option here, regardless of what it was before."
      },
      {
        "date": "2024-03-13T01:29:00.000Z",
        "voteCount": 1,
        "content": "Event data --&gt; Configuration\nSource = Azure Blob Storage\nReceiver = Azure Event Grid \nHandler = Azure Logic App"
      },
      {
        "date": "2024-08-09T06:38:00.000Z",
        "voteCount": 1,
        "content": "logic app is not used in this case , Handler is the function"
      },
      {
        "date": "2024-02-11T04:54:00.000Z",
        "voteCount": 2,
        "content": "locations send data every hour to an Azure Blob storage account to support inventory, purchasing and delivery services.\nThis data might be more than event grid max message size of 512k, so survicebus should be here"
      },
      {
        "date": "2024-04-21T22:00:00.000Z",
        "voteCount": 1,
        "content": "Agreed. Blob storage dispatch heavy-weight payload data that fall under the category of \"messages\" - the dispatched data packets are not light-weight events. We should use Service Bus here"
      },
      {
        "date": "2023-04-07T21:59:00.000Z",
        "voteCount": 2,
        "content": "Is this microsoft question or Azure Function app"
      },
      {
        "date": "2023-04-07T20:16:00.000Z",
        "voteCount": 2,
        "content": "\"process sales financials\" needs messages not events, \"immediately\" =&gt; Box 2: Azure Service Bus\n\"Azure Functions must\" =&gt; Box 3: Azure Function App"
      },
      {
        "date": "2023-04-07T20:58:00.000Z",
        "voteCount": 2,
        "content": "ok, this is wrong. Because 21/1 has no Service Bus option and \"financial\" is probably for the audit trigger only.\nSo Box:2 must be Event Grid"
      },
      {
        "date": "2023-04-07T21:03:00.000Z",
        "voteCount": 2,
        "content": "... I mean 29/1 has no Service Bus"
      },
      {
        "date": "2023-04-14T11:54:00.000Z",
        "voteCount": 2,
        "content": "exactly. Event should not carry much information, so Azure Service Bus should be utilized"
      },
      {
        "date": "2022-11-18T07:48:00.000Z",
        "voteCount": 8,
        "content": "Retail store locations -\nAzure Functions must process data immediately when data is uploaded to Blob storage. Azure Functions must update Azure Cosmos DB by using native SQL language queries.\nAudit store sale transaction information nightly to validate data, process sales financials, and reconcile inventory.\n\nLogic app is not mentioned anywhere in the case study.\nSo #3 should be Function app?"
      }
    ],
    "examNameCode": "az-204",
    "topicNumber": "21"
  }
]