[
  {
    "topic": 23,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14849-exam-az-203-topic-23-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to meet the security requirements for external partners.<br>Which Azure Active Directory features should you use?<br>To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br>",
    "options": [],
    "answer": "Explanation",
    "answerDescription": "Box 1: B2B -<br>Scenario: External partners must use their own credentials and authenticate with their organization's identity management solution.<br>Azure Active Directory (Azure AD) business-to-business (B2B) collaboration lets you securely share your company's applications and services with guest users from any other organization, while maintaining control over your own corporate data. Work safely and securely with external partners, large or small, even if they don't have Azure AD or an IT department. A simple invitation and redemption process lets partners use their own credentials to access your company's resources.<br>Developers can use Azure AD business-to-business APIs to customize the invitation process or write applications like self-service sign-up portals.<br><br>Box 2: Access Review -<br>Scenario: External partner logins must be audited monthly for application use by a user account administrator to maintain company compliance.<br>Azure Active Directory (Azure AD) Access Reviews enable organizations to efficiently manage group memberships, access to enterprise applications, and role assignments.<br>Administrators can use Azure Active Directory (Azure AD) to create an access review for group members or users assigned to an application. Azure AD automatically sends reviewers an email that prompts them to review access.<br>References:<br>https://docs.microsoft.com/en-us/azure/active-directory/b2b/what-is-b2b",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-11T01:03:00.000Z",
        "voteCount": 26,
        "content": "Options: https://www.itexams.com/static/img/exams/Microsoft-AZ-203-1.0/xmlfile-190_1.png"
      },
      {
        "date": "2020-07-04T16:21:00.000Z",
        "voteCount": 2,
        "content": "Audting info - \nhttps://docs.microsoft.com/en-us/azure/active-directory/b2b/auditing-and-reporting"
      }
    ],
    "examNameCode": "az-203",
    "topicNumber": "23"
  },
  {
    "topic": 23,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/25040-exam-az-203-topic-23-question-2-discussion/",
    "body": "You need to meet the security requirements for the E-Commerce Web App.<br>Which two steps should you take? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdate the E-Commerce Web App with the service principal's client secret.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Managed Service Identity (MSI) on the E-Commerce Web App.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a policy to the Azure Key Vault to grant access to the E-Commerce Web App.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure AD service principal."
    ],
    "answer": "BC",
    "answerDescription": "Scenario: E-commerce application sign-ins must be secured by using Azure App Service authentication and Azure Active Directory (AAD).<br>A managed identity from Azure Active Directory allows your app to easily access other AAD-protected resources such as Azure Key Vault. T<br>References:<br>https://docs.microsoft.com/en-us/azure/app-service/overview-managed-identity",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-18T23:17:00.000Z",
        "voteCount": 1,
        "content": "The A,C is not enough alone with that the app cannot access to the key vault an RBAC or an access policy still need so the B,C is correct with that the webabb access to the kv."
      },
      {
        "date": "2021-01-09T03:24:00.000Z",
        "voteCount": 2,
        "content": "There are two requirements securing access to Key Vault (requires B,C) and securing Web App with AAD (reuquiers A,D). So all answers seems to be necessary and if one suppose that prerequisites (msi + principal) are done there can be that the correct answer is A,C"
      },
      {
        "date": "2021-02-02T16:23:00.000Z",
        "voteCount": 3,
        "content": "The answers all relate to the \"all settings must be in Key Vault\" requirement. Storing secrets in apps is bad practice and breaches requirements, which rule out A and D. It is more secure to use a Managed Identity that has access to Key Vault; ie, C &amp; C."
      },
      {
        "date": "2021-02-02T16:23:00.000Z",
        "voteCount": 1,
        "content": "OOps. That should be B &amp; C."
      },
      {
        "date": "2020-07-07T11:22:00.000Z",
        "voteCount": 4,
        "content": "should not it be A and D."
      },
      {
        "date": "2021-01-13T08:29:00.000Z",
        "voteCount": 1,
        "content": "IMO, given Answer is wrong. it should be A and D\nthe requirement is \"E-commerce application sign-ins must be secured by using Azure App Service authentication and Azure Active Directory (AAD).\"\n\nSo therefore you need to enable APP Service Authentication and add the Service Principal. Secret is optional.\nhttps://docs.microsoft.com/en-us/azure/app-service/configure-authentication-provider-aad"
      },
      {
        "date": "2020-07-21T17:47:00.000Z",
        "voteCount": 6,
        "content": "The given answer should be correct. It's mentioned in MS docs on how to configure and allow access from WebApp to Key Vault:\n- Add a system-assigned identity\n- Add a user-assigned identity\n- Obtain tokens for Azure resources \n\n\n\"An app can use its managed identity to get tokens to access other resources protected by Azure AD, such as Azure Key Vault.\"\nhttps://docs.microsoft.com/en-us/azure/app-service/overview-managed-identity?tabs=dotnet#add-a-system-assigned-identity"
      }
    ],
    "examNameCode": "az-203",
    "topicNumber": "23"
  },
  {
    "topic": 23,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20074-exam-az-203-topic-23-question-3-discussion/",
    "body": "You need to access user claims in the e-commerce web app.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUsing the Azure CLI, enable Cross-origin resource sharing (CORS) from the e-commerce checkout API to the e-commerce web app.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdate the e-commerce web app to read the HTTP request header values.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign the Contributor RBAC role to the e-commerce web app by using the Resource Manager create role assignment API.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWrite custom code to make a Microsoft Graph API call from the e-commerce web app."
    ],
    "answer": "D",
    "answerDescription": "If you want more information about the user, you'll need to use the Azure AD Graph API.<br>References:<br>https://docs.microsoft.com/en-us/azure/architecture/multitenant-identity/claims",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-09T01:12:00.000Z",
        "voteCount": 21,
        "content": "It should be B."
      },
      {
        "date": "2020-05-09T01:14:00.000Z",
        "voteCount": 5,
        "content": "https://docs.microsoft.com/en-us/azure/app-service/app-service-authentication-how-to#access-user-claims"
      },
      {
        "date": "2022-03-12T20:08:00.000Z",
        "voteCount": 1,
        "content": "Got it on 03/2022, I chose B. Update the e-commerce web app to read the HTTP request header values."
      },
      {
        "date": "2021-11-25T04:02:00.000Z",
        "voteCount": 1,
        "content": "For all language frameworks, App Service makes the claims in the incoming token (whether from an authenticated end user or a client application) available to your code by injecting them into the request headers. External requests aren't allowed to set these headers, so they are present only if set by App Service. Some example headers include:\n\nX-MS-CLIENT-PRINCIPAL-NAME\nX-MS-CLIENT-PRINCIPAL-ID\n\nhttps://docs.microsoft.com/en-us/azure/app-service/configure-authentication-user-identities"
      },
      {
        "date": "2020-12-25T17:08:00.000Z",
        "voteCount": 1,
        "content": "Claims are name-value pairs that relay facts about the token subject. It contains many facts aboutt eh security principal among other info. user claims is available through a few means. If you want MORE INFO about the user, you'll need to use the AAD Graph API.\nNow the question doesn't say how much of the user claims info is to be accessed. So it's hard to say if B is sufficient or if we need to write custom code through Graph API.\nInconclusive to me. I'll go with Graph API... rest is up to Bruce Almighty!"
      },
      {
        "date": "2020-08-06T10:39:00.000Z",
        "voteCount": 2,
        "content": "B only sends part of headers if you want all, you will need an extra call to /.auth/me that is a call to Graph, keep in mind you can create custom claims"
      },
      {
        "date": "2021-01-05T12:51:00.000Z",
        "voteCount": 1,
        "content": "This is true for the client-side code (in JS for example). The documentation linked below says, that ID and access tokens are injected through headers X-MS-TOKEN-AAD-ID-TOKEN and X-MS-TOKEN-AAD-ACCESS-TOKEN. \nhttps://docs.microsoft.com/en-us/azure/app-service/app-service-authentication-how-to#access-user-claims"
      },
      {
        "date": "2020-05-27T10:31:00.000Z",
        "voteCount": 4,
        "content": "It is B."
      },
      {
        "date": "2020-05-11T08:33:00.000Z",
        "voteCount": 5,
        "content": "I feel like this should be B not D, if your user is signed in properly the claims should be in the header of all requests which should allow you to retrieve the claims using  claims principal, i shouldnt need to write extra code to hit an api for all that information"
      }
    ],
    "examNameCode": "az-203",
    "topicNumber": "23"
  },
  {
    "topic": 23,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/23146-exam-az-203-topic-23-question-4-discussion/",
    "body": "You need to meet the LabelMaker application security requirement.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a conditional access policy and assign it to the Azure Kubernetes Service cluster.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPlace the Azure Active Directory account into an Azure AD group. Create a ClusterRoleBinding and assign it to the group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a RoleBinding and assign it to the Azure AD account.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Microsoft Azure Active Directory service principal and assign it to the Azure Kubernetes Service (AKS) cluster."
    ],
    "answer": "B",
    "answerDescription": "Scenario: The LabelMaker applications must be secured by using an AAD account that has full access to all namespaces of the Azure Kubernetes Service (AKS) cluster.<br>Permissions can be granted within a namespace with a RoleBinding, or cluster-wide with a ClusterRoleBinding.<br>References:<br>https://kubernetes.io/docs/reference/access-authn-authz/rbac/",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-07T01:56:00.000Z",
        "voteCount": 1,
        "content": "This is a tough question because multiple answers appear supported by the MSFT documentation.\n\nB: Supported by this documentation, but it says \"This article assumes that you have an existing AKS cluster enabled with Azure AD integration\" -- so I think that since this will be a new AKS cluster, D is the correct answer.\nhttps://docs.microsoft.com/en-us/azure/aks/azure-ad-rbac\n\nD: supported by this (legacy) documentation, for new AKS clusters\nhttps://docs.microsoft.com/en-us/azure/aks/azure-ad-integration-cli\n\nSince this is a question from a legacy test, not sure this question still appears on Az-204 since they removed AKS from the content."
      },
      {
        "date": "2020-12-25T17:18:00.000Z",
        "voteCount": 1,
        "content": "Agree with the given answer and explanation.\n\nA RoleBinding may reference any Role in the same namespace. Alternatively, a RoleBinding can reference a ClusterRole and bind that ClusterRole to the namespace of the RoleBinding.\nIf you want to bind a ClusterRole to all the namespaces in your cluster, you use a ClusterRoleBinding."
      },
      {
        "date": "2020-06-14T10:46:00.000Z",
        "voteCount": 1,
        "content": "AFAIK Kubernetes RBAC has nothing in common with AAD. I would say D."
      },
      {
        "date": "2020-06-15T08:50:00.000Z",
        "voteCount": 8,
        "content": "Disagree, it does, please check following url: https://docs.microsoft.com/es-es/azure/aks/azure-ad-integration-cli#create-rbac-binding"
      }
    ],
    "examNameCode": "az-203",
    "topicNumber": "23"
  }
]