[
  {
    "topic": 29,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74952-exam-az-204-topic-29-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to implement the retail store location Azure Function.<br>How should you configure the solution? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04273/0007900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04273/0008100001.png\" class=\"in-exam-image\">",
    "answerDescription": "Scenario: Retail store locations: Azure Functions must process data immediately when data is uploaded to Blob storage.<br><br>Box 1: HTTP -<br>Binding configuration example: https://&lt;storage_account_name&gt;.blob.core.windows.net<br><br>Box 2: Input -<br>Read blob storage data in a function: Input binding<br><br>Box 3:  Blob storage -<br>The Blob storage trigger starts a function when a new or updated blob is detected.<br>Azure Functions integrates with Azure Storage via triggers and bindings. Integrating with Blob storage allows you to build functions that react to changes in blob data as well as read and write values.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/azure-functions/functions-bindings-storage-blob-trigger",
    "votes": [],
    "comments": [
      {
        "date": "2022-04-29T22:49:00.000Z",
        "voteCount": 53,
        "content": "1. azure cosmos\n2. output\n3. blob storage"
      },
      {
        "date": "2022-05-02T10:52:00.000Z",
        "voteCount": 4,
        "content": "Agreed: We need write to cosmos output, so that deals box1 and 2, and func is triggered by changes on bloob"
      },
      {
        "date": "2022-09-03T00:53:00.000Z",
        "voteCount": 11,
        "content": "Seems ok, te person who writes answers in exam topics doesn't read questions..."
      },
      {
        "date": "2023-04-08T17:31:00.000Z",
        "voteCount": 1,
        "content": "100% correct!"
      },
      {
        "date": "2023-05-23T00:43:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2022-12-01T10:43:00.000Z",
        "voteCount": 32,
        "content": "1. (binding) = Azure CosmosDB\n     reason: Azure Functions must update Azure Cosmos DB\n2. (direction) = output\n     reason: all triggers are input, so we are not talking about the trigger binding. we must update Azure Cosmos DB so we need output binding.  If input and output were selectable, i'd probably go for that\n3. (trigger) = EventGrid\n    reason: the azure function is triggered by an EventGrid event so that processing happens immediately"
      },
      {
        "date": "2024-06-07T12:18:00.000Z",
        "voteCount": 1,
        "content": "You're quite right. Don't really understand those suggested answers.\nEspecially when they mention immediately and CosmosDB"
      },
      {
        "date": "2023-09-03T20:11:00.000Z",
        "voteCount": 1,
        "content": "There is no EventGrid mentioned anywhere. You can simply use Azure Function Blob Trigger to get triggered from the Blob storage."
      },
      {
        "date": "2023-07-23T02:16:00.000Z",
        "voteCount": 1,
        "content": "This is the right answer and has to be highest voted"
      },
      {
        "date": "2024-09-06T02:54:00.000Z",
        "voteCount": 1,
        "content": "I think it should be:\n\n1. Azure Cosmos DB\n2. output\n3. Blob storage\n\nMy reasoning: Looking at the options we conclude that we can use only one binding. \nWe need to process the uploaded data and update the database. (one output binding to the Cosmos DB is certain)\nWith Event Grid we will receive only information about the event and nothing else. With Blob storage trigger we will have access to the blob itself. No need for additional input binding."
      },
      {
        "date": "2024-08-07T01:09:00.000Z",
        "voteCount": 1,
        "content": "The question is very confusing IMO.\nIf we choose Binding direction: Input, then \n1. HTTP\n2. Input\n3. Blob storage\nHowever, if we choose Binding direction: Output, then\n1. Azure CosmosDB\n2. Output\n3. Blob storage"
      },
      {
        "date": "2024-07-29T18:10:00.000Z",
        "voteCount": 1,
        "content": "The trigger should be Event Grid. The blob trigger is based on the poll, Event Grid trigger can lead to a timely trigger."
      },
      {
        "date": "2024-07-07T15:06:00.000Z",
        "voteCount": 2,
        "content": "Why would we need trigger for output? I think it's:\nBinding: blob storage\ndirection: input\ntrigger: event grid (counting previous question at page 38 topic 21 question 1 established that pattern is blob -&gt; event queue -&gt; Function)?"
      },
      {
        "date": "2024-07-03T00:56:00.000Z",
        "voteCount": 1,
        "content": "nowhere is said that there is an Event Grid, but the requirements only speak about Blob Storage, so why not a much simpler Trigger Blob Storage - Binding Cosmos DB - direction Input ?"
      },
      {
        "date": "2024-02-06T00:02:00.000Z",
        "voteCount": 2,
        "content": "1. azure cosmos 2. output 3. blob storage\nFor updating Azure Cosmos DB upon processing the data, an output binding to Azure Cosmos DB is needed. This enables the function to write data directly to Cosmos DB without needing to manually implement the database connection and data insertion logic.\n\nThe trigger for this function should be Blob storage because the requirement is to start the processing immediately when data is uploaded to the Blob storage. This directly supports the scenario where store locations send data every hour to be processed."
      },
      {
        "date": "2023-09-14T02:36:00.000Z",
        "voteCount": 2,
        "content": "I would say Cosmos - Output - Blob.\n\nYou have a Blob storage trigger ( Azure Functions must process data immediately when data is uploaded to Blob storage).\nAnd a Cosmos Output Binding (Azure Functions must update Azure Cosmos DB by using native SQL language queries)"
      },
      {
        "date": "2024-02-01T16:37:00.000Z",
        "voteCount": 1,
        "content": "For me it is the correct answer"
      },
      {
        "date": "2023-07-11T18:00:00.000Z",
        "voteCount": 3,
        "content": "I wonder why the answer is not \nbinding - Blob\ndirection - in\ntrigger - event grid.\nexample scenario 2 - https://learn.microsoft.com/en-us/azure/azure-functions/functions-triggers-bindings?tabs=csharp"
      },
      {
        "date": "2023-09-03T20:17:00.000Z",
        "voteCount": 1,
        "content": "Question stated that Function must update data to Azure Cosmos DB"
      },
      {
        "date": "2023-04-28T00:59:00.000Z",
        "voteCount": 5,
        "content": "based on the Topic 21 - Testlet 22, question #1 \nevent routing: BLOB -&gt; EventGrid -&gt; Function\n\n1. CosmosDB\n2. Output\n3. trigger = EventGrid"
      },
      {
        "date": "2023-03-11T14:59:00.000Z",
        "voteCount": 3,
        "content": "1. Azure Cosmos DB\n2. Output\n3. Event Grid\n\nusing Event Grid Trigger for blob events instead of using Blob storage as input to function, provides low latency.\nReference: https://learn.microsoft.com/en-us/azure/azure-functions/functions-bindings-storage-blob-trigger?tabs=csharp-script&amp;pivots=programming-language-csharp\n\naccording to this reference, it says: \"If you require faster or more reliable blob processing, you should instead implement one of the following strategies:\nAdd the source parameter with a value of EventGrid to your binding definition and create an event subscription on the same container.\nOR \nReplace the Blob Storage trigger with an Event Grid trigger using an event subscription on the same container.\""
      },
      {
        "date": "2023-01-06T19:27:00.000Z",
        "voteCount": 2,
        "content": "1. azure cosmos\n2. output\n3. blob storage\nBecase \n1.Triggers cause a function to run. A trigger defines how a function is invoked and a function must have exactly one trigger. Triggers have associated data, which is often provided as the payload of the function.\n2.Binding to a function is a way of declaratively connecting another resource to the function; bindings may be connected as input bindings, output bindings, or both. Data from bindings is provided to the function as parameters.\nrefer : https://learn.microsoft.com/en-us/azure/azure-functions/functions-triggers-bindings?tabs=csharp"
      },
      {
        "date": "2022-12-10T05:23:00.000Z",
        "voteCount": 2,
        "content": "1. azure cosmos\n2. output\n3. blob storage"
      },
      {
        "date": "2022-10-24T06:30:00.000Z",
        "voteCount": 2,
        "content": "Can someone give a clue from which system this configuration format is? \nAzure functions : No\nCosmos DB : No\nAzure Event Grid : No\nStorage blob : No"
      },
      {
        "date": "2022-11-18T23:40:00.000Z",
        "voteCount": 1,
        "content": "this is more convincing !! Thanks"
      },
      {
        "date": "2022-10-24T06:56:00.000Z",
        "voteCount": 6,
        "content": "If it was function.json it should have been someting like:\n\n{\n    \"disabled\":false,\n    \"bindings\":[\n        // ... bindings here\n        {\n            \"type\": \"EventGridTrigger\",\n            \"direction\": \"in\",\n            \"name\": \"inBinding\",\n            // ... more depending on binding\n        },\n        {\n            \"type\": \"CosmosDBOutput\",\n            \"direction\": \"out\",\n            \"name\": \"outBinding\",\n            // ... more depending on binding\n        }\n    ]\n}"
      },
      {
        "date": "2022-11-18T23:41:00.000Z",
        "voteCount": 1,
        "content": "this is more convincing !! Thanks"
      },
      {
        "date": "2022-10-20T17:28:00.000Z",
        "voteCount": 4,
        "content": "got for me in 20/10/2022"
      },
      {
        "date": "2023-05-11T23:02:00.000Z",
        "voteCount": 1,
        "content": "Can you confirm what is the correct answer, it looks like the answer is not clear yet."
      },
      {
        "date": "2023-10-29T10:51:00.000Z",
        "voteCount": 1,
        "content": "Should be:\nAzure Cosmos DB\nOutput\nEvent Grid"
      },
      {
        "date": "2022-10-08T07:39:00.000Z",
        "voteCount": 3,
        "content": "I do not understand this question. Binding is Azure cosmos, then the binding direction should be output. If it is trigger then binding direction should be in. So, I do not understand what this means. I just hope these kind of absurd questions are not asked by Microsoft. \nBut for the trigger I will use EventGrid because it says it should respond immediately. Blob triggers use polling, while event grid triggers are \"event-driven\" (basically Microsoft wants us to better use Event Grid for storage events)"
      }
    ],
    "examNameCode": "az-204",
    "topicNumber": "29"
  },
  {
    "topic": 29,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83680-exam-az-204-topic-29-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to implement the corporate website.<br>How should you configure the solution? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04273/0008300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04273/0008400001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Standard -<br>Below is a high-level comparison of the features as per the pricing tier for the App Service Plan.<br><img src=\"/assets/media/exam-media/04273/0008500001.jpg\" class=\"in-exam-image\"><br><br>Note: Corporate website -<br>The company provides a public website located at http://www.vanarsdelltd.com. The website consists of a React JavaScript user interface, HTML, CSS, image assets, and several APIs hosted in Azure Functions.<br>Corporate website requirements:<br>✑ Secure the website by using SSL.<br>✑ Minimize costs for data storage and hosting.<br>✑ Implement native GitHub workflows for continuous integration and continuous deployment (CI/CD).<br>✑ Distribute the website content globally for local use.<br>✑ Implement monitoring by using Application Insights and availability web tests including SSL certificate validity and custom header value verification.<br>✑ The website must have 99.95 percent uptime.<br><br>Box 2: App Service Web App -<br>A Web App is a web application that is hosted in an App Service. The App Service is the managed service in Azure that enables you to deploy a web application and make it available to your customers on the Internet in a very short amount of time.<br>Incorrect:<br>A Static Web Application is any web application that can be delivered directly to an end user's browser without any server-side alteration of the HTML, CSS, or<br>JavaScript content.<br>Reference:<br>https://azure-training.com/2018/12/27/understanding-app-services-app-service-plan-and-ase/ https://docs.microsoft.com/en-us/azure/app-service/overview",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-30T05:53:00.000Z",
        "voteCount": 10,
        "content": "Got this question on 30-Sep-2022 exam.\nAnswer is correct. Passed with 870 score."
      },
      {
        "date": "2022-12-01T10:55:00.000Z",
        "voteCount": 5,
        "content": "Static web apps only support HTTP triggered functions (https://learn.microsoft.com/en-us/azure/static-web-apps/functions-bring-your-own#link-an-existing-azure-functions-app).  The top of the case study reads: \"several APIs hosted in Azure Functions.\"\n\nIf we assume that the referenced azure functions here (APIs) are NOT the Azure functions for processing blob storage, then they can be HTTP triggered and we are fine choosing Static Web App.\n\nI think this is a reasonable assumption, but I leave it to the test taker to interpret which is correct."
      },
      {
        "date": "2024-07-29T18:28:00.000Z",
        "voteCount": 1,
        "content": "I choose \"App Service Static Web App\": This service is optimized for static content and integrates well with GitHub for CI/CD workflows. It also supports global distribution via Azure CDN, which helps in distributing the website content globally for local use."
      },
      {
        "date": "2024-04-04T08:39:00.000Z",
        "voteCount": 1,
        "content": "It should be azure static web app since no where in the description it says about hosting the az functions in the same static web app resource or having the same hostname for both static web app and azure functions.\n\nAnd azure static web app does support native github workflow: https://azure.microsoft.com/en-us/products/app-service/static \n\"and native GitHub workflows for CI/CD.\""
      },
      {
        "date": "2024-02-08T07:19:00.000Z",
        "voteCount": 1,
        "content": "It is not the static (serverless) web app because you need to support native GitHub workflows for continuous integration and continuous deployment (CI/CD). This is only possible with the app service web app. See: https://learn.microsoft.com/en-us/azure/app-service/deploy-github-actions?tabs=applevel%2Caspnetcore"
      },
      {
        "date": "2024-05-09T22:32:00.000Z",
        "voteCount": 2,
        "content": "\"Deploying to Azure Static Web App\nYou can deploy your web app to Azure Static Web App as part of your continuous deployment (CD) workflows.\"\nhttps://docs.github.com/en/actions/deployment/deploying-to-your-cloud-provider/deploying-to-azure/deploying-to-azure-static-web-app"
      },
      {
        "date": "2023-05-11T23:05:00.000Z",
        "voteCount": 3,
        "content": "Standard plan with app service web app would be the appropriate option."
      },
      {
        "date": "2022-11-18T23:42:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct."
      },
      {
        "date": "2022-11-18T23:43:00.000Z",
        "voteCount": 3,
        "content": "All below requirements are met with standard plan\n\nSecure the website by using SSL.\nMinimize costs for data storage and hosting.\nImplement native GitHub workflows for continuous integration and continuous deployment (CI/CD).\nDistribute the website content globally for local use.\nImplement monitoring by using Application Insights and availability web tests including SSL certificate validity and custom header value verification.\nThe website must have 99.95 percent uptime."
      },
      {
        "date": "2022-10-24T11:27:00.000Z",
        "voteCount": 3,
        "content": "I think the tier is Standard is because of the Traffic manager support.\nrequirement : \"Distribute the website content globally for local use\", \nDistributions slots (in the answer given) are not required.\n(+ static web app )"
      },
      {
        "date": "2022-09-26T06:18:00.000Z",
        "voteCount": 3,
        "content": "1-CI/CD\n2-including SSL certificate \n3-Distribute the website content globally\n4-Minimize costs\n\nwith these criteria we can use standard Plan and for the web site we have to choose azure app service"
      },
      {
        "date": "2022-10-08T07:47:00.000Z",
        "voteCount": 4,
        "content": "I would have said host it in azure static web app (a fine option) that has static part as well as support functions. A perfect option. \nIf functions are to be created outside in another function app and then it contains only the static part then I will host it in blob-storage to get the 99.95% availability SLA of blob storage hot tier and CDN is also easy. \nIt is very difficult to choose one when I cannot look into the head of the question creator. Another vague question from the \"M$\""
      },
      {
        "date": "2022-10-08T07:49:00.000Z",
        "voteCount": 2,
        "content": "See the link for Static web app: https://azure.microsoft.com/en-us/products/app-service/static/#features\nI have used this in real life (but do not know if available for enterprise customers)"
      },
      {
        "date": "2022-10-08T07:51:00.000Z",
        "voteCount": 2,
        "content": "Yes, another evil question to sow confusion. Microsoft takes it personally when people answer correctly"
      },
      {
        "date": "2022-10-09T04:10:00.000Z",
        "voteCount": 2,
        "content": "It is DEFINITELY static web app and Standard plan. Check the availability SLA. Static web app guarantees 99.95% availability and it supports git workflow. It has Functions capability. And in practice also it is a beautiful solution unlike many solutions from MIcrosoft"
      }
    ],
    "examNameCode": "az-204",
    "topicNumber": "29"
  }
]