[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1055-exam-70-347-topic-2-question-6-discussion/",
    "body": "DRAG DROP -<br>You are a Microsoft SharePoint administrator for Contoso, Ltd. Contoso recently purchased Office 365 E3 licenses for all employees. You administer Office 365 by using the admin@contoso.com account. Contoso plans to migrate all legacy SharePoint sites to SharePoint Online.<br>The human resources department manager asks you to set up a SharePoint Online site collection that meets the requirements described in the following table.<br><img src=\"/assets/media/exam-media/02131/0006900001.png\" class=\"in-exam-image\"><br>You need to set up the site collection.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02131/0007000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02131/0007100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "To administer Office 365 services using Windows PowerShell, you first need to open Windows PowerShell (Step 1).<br>You then need to connect to the Office 365 service, in this case, SharePoint Online by running the Connect-SPOService cmdlet and providing the SharePoint site<br>URL and your administrative credentials (Step2).<br>To create a new SharePoint Online site collection using PowerShell, you run the New-SPOSite cmdlet (Step 3). The URL, Owner and StorageQuote parameters are required. The ResourceQuota and Title parameters are optional. The CompatibilityLevel parameter is also optional. This question states that the compatibility level should be SharePoint 2013. As this parameter is not specified in the answer, the compatibility level will be set at the default setting. The default is SharePoint<br>2013.<br>References: https://technet.microsoft.com/en-us/library/fp161392",
    "votes": [],
    "comments": [
      {
        "date": "2019-04-28T07:10:00.000Z",
        "voteCount": 1,
        "content": "Shouldn't it be first: \"Open SharePoint Online Management Shell\" and not just \"open sharepoint management shell\"?"
      }
    ],
    "examNameCode": "70-347",
    "topicNumber": "2"
  }
]