[
  {
    "topic": 3,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11297-exam-70-463-topic-3-question-10-discussion/",
    "body": "You are developing a SQL Server Integration Services (SSIS) project that contains a project Connection Manager and multiple packages.<br>All packages in the project must connect to the same database. The server name for the database must be set by using a parameter named ParamConnection when any package in the project is executed.<br>You need to develop this project with the least amount of development effort.<br>What should you do? (Each answer presents a part of the solution. Choose all that apply.)<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a package parameter named ConnectionName in each package.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEdit each package Connection Manager. Set the ConnectionName property to @[$Project::ParamConnection].",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEdit the project Connection Manager in Solution Explorer. Set the ConnectionName property to @ [$Project::ParamConnection].",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Sensitive property of the parameter to True.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a project parameter named ConnectionName.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Required property of the parameter to True."
    ],
    "answer": "CEF",
    "answerDescription": "C: From question: \" The server name for the database must be set by using a parameter named ParamConnection when any package in the project is executed.\"<br>E: SSIS 2012 has introduced the concept of Project level connection managers. An SSIS project is generally more than one package. To simplify lives, the SSIS team now allows for the sharing of common resources acrossprojects, connection managers being one of those resources.<br>F: When a parameter is marked as required, a server value or execution value must be specified for that parameter. Otherwise, the corresponding package does not execute. Although the parameter has a default value at design time, it will never be used once the project is deployed.<br>Note:<br>* Integration Services (SSIS) parameters allow you to assign values to properties within packages at the time of package execution. You can create project parameters at the project level and package parameters at the package level. Project parameters are used to supply any external input the project receives to one or more packages in the project. Package parameters allow you to modify package execution without having to edit and redeploy the package.",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-02T18:54:00.000Z",
        "voteCount": 1,
        "content": "The question says the parameter to use is ParamConnection, but the answer e says to create a parameter named ConnectionName.  So there is a mismatch between question and answer"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2678-exam-70-463-topic-3-question-13-discussion/",
    "body": "HOTSPOT -<br>You are the data steward at your company.<br>Duplicate customers exist in a Microsoft Excel workbook. You create a Data Quality Services (DQS) knowledge base and matching policy to identify these duplicate customers.<br>You need to identify the duplicate customers.<br>Which option should you use? (To answer, select the appropriate option in the answer area.)<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0015900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-21T01:56:00.000Z",
        "voteCount": 1,
        "content": "New data quality project"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/55149-exam-70-463-topic-3-question-14-discussion/",
    "body": "HOTSPOT -<br>You are developing a SQL Server Integration Services (SSIS) package. The data source for the data flow task is a table that has been configured as a change data capture (CDC) table. You are using a CDC Source component to obtain the CDC data.<br>The CDC Source component has the following requirements:<br>✑ The output must include metadata columns that indicate which source columns have changed.<br>✑ The output must return only one change row per source row that is modified in the current CDC processing range.<br>You need to configure the CDC Source component.<br>Which CDC processing mode should you select? (To answer, configure the appropriate option or options in the dialog box in the answer area.)<br>Hot Area:<br><img src=\"/assets/media/exam-media/02151/0016100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0016200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "References: http://msdn.microsoft.com/en-gb/library/hh231004.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-06-12T05:21:00.000Z",
        "voteCount": 1,
        "content": "what is the answer?"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43184-exam-70-463-topic-3-question-15-discussion/",
    "body": "HOTSPOT -<br>You are developing a SQL Server Integration Services (SSIS) package.<br>The package must run a parameterized query against a Windows Azure SQL Database database.<br>You need to use the least amount of development effort to meet the package requirement.<br>Which task should you use? (To answer, select the appropriate task in the answer area.)<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0016300001.png\" class=\"in-exam-image\">",
    "answerDescription": "Running Parameterized SQL Commands<br>SQL statements and stored procedures frequently use input parameters, output parameters, and return codes. The Execute SQL task supports the Input, Output, and ReturnValue parameter types. You use the Input type for input parameters, Output for output parameters, and ReturnValue for return codes.<br>In SSIS there are two tasks than can be used to execute SQL statements: Execute T-SQL Statement and Execute SQL. What is the difference between the two?<br>The Execute T-SQL Statement task tasks less memory, parse time, and CPU time than the Execute SQL task, but is not as flexible. If you needto run parameterized queries, save the query results to variables, or use property expressions, you should use the Execute SQL task instead of the Execute T-SQL<br>Statement task.<br>References: http://msdn.microsoft.com/en-us/library/ms141003.aspx http://www.sqlservercentral.com/blogs/jamesserra/2012/11/08/ssis-execute-sql-task-vs-execute-t-sql-statement-task/",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-24T06:49:00.000Z",
        "voteCount": 1,
        "content": "Execute SQL task"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2680-exam-70-463-topic-3-question-17-discussion/",
    "body": "HOTSPOT -<br>You are developing a SQL Server Integration Services (SSIS) package to implement an incremental data load strategy. The package reads rows from a source system and compares them to rows in a destination system. New rows will be inserted and changed rows will be updated.<br>You have used a Lookup transformation and a Conditional Split transformation. The Lookup transformation joins the source and destination table on the business key, and includes all columns from the destination table in the data flow output. The Conditional Split transformation inspects the destination columns and directs data flow to either insert new records or update existing records.<br>You need to configure the Lookup transformation to ensure that all records flow to the Conditional Split transformation, regardless of whether the rows match an existing row in the destination table.<br>Which setting should you select? (To answer, select the appropriate option in the answer area.)<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0016800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-21T03:59:00.000Z",
        "voteCount": 1,
        "content": "Ignore Failure"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/268-exam-70-463-topic-3-question-18-discussion/",
    "body": "HOTSPOT -<br>You are using the Master Data Services (MDS) Add-in for Excel to configure the entities in a model. The model consists of two entities: one named Customer and one named State. You open the Customer entity.<br>Currently, data stewards can enter any text value in the Customer entity's State attribute. You must restrict the entry of values in the State attribute to members defined in the State entity.<br>You need to configure the State attribute of the Customer entity.<br>Which option should you use? (To answer, select the appropriate area in the answer area.)<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0016900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-02-05T14:21:00.000Z",
        "voteCount": 2,
        "content": "Attribute properties"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2681-exam-70-463-topic-3-question-23-discussion/",
    "body": "DRAG DROP -<br>Your company is evaluating the data cleansing capabilities of SQL Server Data Quality Services (DQS).<br>A stand-alone server will be used to host DQS, as well as all related services necessary to run this service.<br>You need to install the DQS components on the server by using the minimum amount of steps possible. You also need to grant permissions to a login named<br>DataStewards to enable DataStewards to edit and execute DQS projects.<br>Which four actions should you perform in sequence? (To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.)<br>Select and Place:<br><img src=\"/assets/media/exam-media/02151/0017400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0017500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note:<br>Step 1-2:<br>* SQL Server Data Quality Services (DQS) is a new feature in SQL Server 2012 that contains the following two components: Data Quality Server and Data Quality<br>Client.<br>* You have to use the SQL Server 2012 Setup to install DQS components. When you run the SQL Server Setup, you have to go through a series of installation wizard pages to select appropriate options based on your requirements.<br>/ Feature Selection<br>Data Quality Services under Database Engine Services to install the Data Quality Server.<br>Data Quality Client to install Data Quality Client.<br>Step 3-4:<br>* The Data Quality Services (DQS) security infrastructure is based upon the SQL Server security infrastructure. A database administrator grants a user a set of permissions by associating the user with a DQS role. Doing so determines the DQS resources that the user has access to and the functional activities that the user is allowed to perform.<br>* There are four roles for DQS. One is the database administrator (DBA) who deals primarily with product installation, database maintenance, and user management. This role primarily uses the SQL Server Management Studio, rather than within the Data Quality Client application. Their server role is sysadmin.<br>The three other roles are information workers, data stewards who use the product directly by working in the Data Quality Client application. These roles include the following:<br>✑ The DQS Administrator (dqs_administrator role) can do everything in the scope of the product.<br>✑ The DQS KB Editor (dqs_kb_editor role) can perform all of the DQS activities, except for administration.<br>✑ The DQS KB Operator (dqs_kb_operator role) can edit and execute a project. They cannot perform any kind of knowledge management; they cannot create or change a knowledge base. They can see the activity monitoring data, but cannot terminate an activity or perform administrative duties.<br>References: http://msdn.microsoft.com/en-gb/library/gg492277(v=sql.110).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-21T04:09:00.000Z",
        "voteCount": 6,
        "content": "I think that box4 should be -  dqs_kb_operator"
      },
      {
        "date": "2020-07-15T16:07:00.000Z",
        "voteCount": 4,
        "content": "I agree dqs_kb_operator can edit and execute projects.Thats all the question asks for so why put them in the dqs_kb_editor.You are giving them unecessary priviliges that are not asked for."
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/273-exam-70-463-topic-3-question-32-discussion/",
    "body": "HOTSPOT -<br>You are developing a SQL Server Integration Services (SSIS) package. The package contains a user-defined variable named @Queue which has an initial value of 10.<br>The package control flow contains many tasks that must repeat execution until the @Queue variable equals 0.<br>You need to enable the tasks to be grouped together for repeat execution.<br>Which item should you add to the package? (To answer, select the appropriate item in the answer area.)<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0018900001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-05T04:26:00.000Z",
        "voteCount": 1,
        "content": "we don't need Foreach loop container here"
      },
      {
        "date": "2019-02-05T14:42:00.000Z",
        "voteCount": 2,
        "content": "For Loop Container"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17711-exam-70-463-topic-3-question-35-discussion/",
    "body": "A SQL Server Integration Services (SSIS) 2012 package currently downloads sales data from a Windows Azure SQL Database database.<br>To improve sales data accuracy, exchange rates must be downloaded daily from a public HTTP website instead of from a weekly flat file. The public website hosts a comma-separated values (CSV) file that contains one row per currency.<br>You need to download the CSV file to the environment.<br>What should you use to retrieve the document from the website?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Script component",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Web Service task",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Web Service source",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Script task"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-31T02:17:00.000Z",
        "voteCount": 1,
        "content": "why not a script component?"
      },
      {
        "date": "2020-05-13T00:10:00.000Z",
        "voteCount": 1,
        "content": "Since the requirement is only to download the file and not process i.e. to traverse it. There is one more similar question to this in which script component is used due to the requirement of traversing"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11421-exam-70-463-topic-3-question-54-discussion/",
    "body": "DRAG DROP -<br>You are building a fact table in a data warehouse.<br>The table must have a columnstore index. The table cannot be partitioned.<br>You need to design the fact table and load it with data.<br>Which three actions should you perform in sequence? (To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.)<br>Select and Place:<br><img src=\"/assets/media/exam-media/02151/0021000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0021100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Only nonclustered columnstore indexes are available in SQL Server 2012 so when the index is created, you cannot update the table (without using partition switching). Therefore you have to load the data BEFORE creating the index.<br>In SQL Server 2014, you could create a clustered columnstore index which would allow updates to the table after the index is created.",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-04T22:39:00.000Z",
        "voteCount": 2,
        "content": "Not sure if MAXDOP is actually needed, but since INCLUDE and ASC keywords would be invalid for creating the columnstore and it needs to be created, the option with MAXDOP is the only valid one"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11422-exam-70-463-topic-3-question-60-discussion/",
    "body": "You have a server named SQL1 that has SQL Server Integration Services (SSIS) installed. SQL1 has eight CPUs, 8 GB of RAM, RAID-10 storage, and a 10- gigabit Ethernet connection.<br>A package named Package1 runs on SQL1. Package1 contains 10 data tasks. Package1 queries 3 GB of data from the source system.<br>You review the performance statistics on SQL1 and discover that Package1 executes slower than expected.<br>You need to identify the problem that is causing Package1 to execute slowly.<br>Which performance monitor counter data should you review?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSQLServer:SSIS Pipeline 10.0: Buffers in use",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSQLServer: SSIS Pipeline 10.0:Private buffer memory",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMemory\\Pages/sec",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSQLServer:SSIS Pipeline 10.0: Flat butter memory"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-04T22:57:00.000Z",
        "voteCount": 1,
        "content": "I think answer d has a type, should be buffer not butter :)"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11456-exam-70-463-topic-3-question-62-discussion/",
    "body": "HOTSPOT -<br>You have a data warehouse that is hosted in a SQL Server instance. The data in the data warehouse is loaded by running bcp.exe.<br>You discover that the transaction logs regularly fill up the local hard disk on the server and that a WRITELOG wait is present.<br>You need to reduce the amount of disk space used to store the transaction logs and to remove the WRITELOG wait.<br>Which two database property settings should you modify? To answer, select the appropriate settings in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02151/0021700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0021900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-28T01:03:00.000Z",
        "voteCount": 1,
        "content": "Recovery model if changed to bulk logged would reduce the amount of information written to the logs so much less likely to fill up the disks.\nDelayed durability enabled would remove the log writing contention so reduce the waits."
      },
      {
        "date": "2020-01-05T18:35:00.000Z",
        "voteCount": 2,
        "content": "I think Delayed Durability enabled instead of Concatenate null yields null is correct."
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11460-exam-70-463-topic-3-question-70-discussion/",
    "body": "DRAG DROP -<br>You have a data warehouse that contains all of the sales data for your company.<br>You plan to create a SQL Server Integration Services (SSIS) package to extract a list of files from a database and to load the files to the data warehouse.<br>You need to design a control flow for the SSIS package. The control flow must meet the following requirements:<br>✑ Load the data in a single transaction.<br>✑ Load multiple tables in parallel after extracting the data.<br>Which types of containers should you add to the design? To answer, drag the appropriate container types to the correct locations. Each container type may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02151/0022800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0023000001.png\" class=\"in-exam-image\">",
    "answerDescription": "References: https://docs.microsoft.com/en-us/sql/integration-services/integration-services-transactions",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-05T19:37:00.000Z",
        "voteCount": 4,
        "content": "I think the Load Table container should be a sequence.  Once the files have been loaded into stage data, there is no longer a collection that needs to be iterated over."
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11462-exam-70-463-topic-3-question-73-discussion/",
    "body": "HOTSPOT -<br>You are designing a package control flow. The package moves sales order data from a Microsoft Azure SQL Database transactional database to an on-premise reporting database. The package will run several times a day, while new sales orders are being added to the transactional database.<br>The current design of the package control flow is shown in the answer area. (Click the Exhibit button.)<br><img src=\"/assets/media/exam-media/02151/0023400001.jpg\" class=\"in-exam-image\"><br>The Insert New Orders Data Flow task must meet the following requirements:<br>✑ Usage of the tempdb database should not be impacted.<br>✑ Concurrency should be maximized, while only reading committed transactions.<br>✑ If the task fails, only that task needs to be rolled back.<br>You need to configure the Insert New Orders Data Flow task to meet the requirements.<br><img src=\"/assets/media/exam-media/02151/0023500001.jpg\" class=\"in-exam-image\"><br>How should you configure the transaction properties? To answer, select the appropriate setting or settings in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02151/0023600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0023800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "IsolationLevel = ReadCommited -<br><br>TransactionOption = Required -<br>References:<br>https://docs.microsoft.com/en-us/sql/integration-services/integration-services-transactions https://docs.microsoft.com/en-us/sql/connect/jdbc/understanding-isolation-levels",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-28T08:35:00.000Z",
        "voteCount": 1,
        "content": "If the package uses the NotSupported option, the tasks can not roll back if they fail. We do want it to roll back. So without knowing the setting of the other tasks we must assume \"required\" is the correct answer. \"supported\" relies on a  transaction existing and as we don't want to roll back the others we can assume the other tasks are set to \"NotSupported\"."
      },
      {
        "date": "2020-07-16T01:35:00.000Z",
        "voteCount": 2,
        "content": "I think the task should have its own transaction since only that task should be rolled back hence why the Required option is needed here"
      },
      {
        "date": "2020-01-05T19:50:00.000Z",
        "voteCount": 2,
        "content": "I think the TransactionOption should be Not Supported, as failure should not roll back anything outside of that task.  If set to required, it will enlist to a pre-existing transaction and roll back anything that occurred in that transaction no failure."
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/25868-exam-70-463-topic-3-question-75-discussion/",
    "body": "You are developing a SQL Server Integration Services (SSIS) project by using the Project Deployment Model. A package in the project extracts data from a<br>Microsoft Azure SQL Database. The package is deployed to SQL Server.<br>The package is not producing the desired results.<br>You need to generate the .mdmp and .tmp debug files in order to troubleshoot the issues.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExecute the catalog.create_execution_dump stored procedure with the package execution_id.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExecute the catalog.add_data_tap stored procedure with the package execution_id.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the DTEXEC utility with the /Reporting V option.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the DTEXEC utility with the /Logger option."
    ],
    "answer": "D",
    "answerDescription": "References: https://docs.microsoft.com/en-us/sql/integration-services/packages/dtexec-utility",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-16T01:39:00.000Z",
        "voteCount": 2,
        "content": "Looks to be wrong choices listed here.Think it should be to use DTEXEC utility with /DebugDump option"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14611-exam-70-463-topic-3-question-80-discussion/",
    "body": "HOTSPOT -<br>You administer a Microsoft SQL Server 2012 database. The database contains a table that has the following definition:<br><img src=\"/assets/media/exam-media/02151/0024500001.png\" class=\"in-exam-image\"><br>You want to export data from the table to a flat file by using the SQL Server Import and Export Wizard.<br>You need to ensure that the following requirements are met:<br>✑ The first row of the file contains the first row of data.<br>✑ Each record is of the same length.<br>✑ The date follows the U.S. date format.<br>✑ The file supports international characters.<br>What should you do? (To answer, simply select the option or options in the answer areathat you would configure.)<br>Hot Area:<br><img src=\"/assets/media/exam-media/02151/0024600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02151/0024800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://www.sqlshack.com/export-data-sql-server-flat-file/",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-21T03:28:00.000Z",
        "voteCount": 3,
        "content": "should format not be fixed width to all be same length?"
      },
      {
        "date": "2020-05-13T01:25:00.000Z",
        "voteCount": 3,
        "content": "Yes it should be, also the unicode radio button needs to be checked as per the requirement"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11464-exam-70-463-topic-3-question-81-discussion/",
    "body": "You are developing a SQL Server Integration Services (SSIS) project to read and write data from a Windows Azure SQL Database database to a server that runs<br>SQL Server 2012.<br>The connection will be used by data flow tasks in multiple SSIS packages. The address of the target Windows Azure SQL Database database will be provided by a project parameter.<br>You need to create a solution to meet the requirements by using the least amount of administrative effort and maximizing data flow performance.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse an SSIS Script task that uses the custom assembly to parse the text data when inserting it.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse an SSIS Script transformation that uses the custom assembly to parse the text data when inserting it.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a SQL Common Language Runtime (SQLCLR) function that uses the custom assembly to parse the text data, deploy it in the Windows Azure SQL Database database, and use it when inserting data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a SQL Common Language Runtime (SQLCLR) stored procedure that uses the custom assembly to parse the text data, deploy it in the Windows Azure"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-27T15:16:00.000Z",
        "voteCount": 2,
        "content": "The options listed here seem a bit unusual for the question being asked.I think a correct answer here would something that would involve implementing Project Parameters"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17668-exam-70-463-topic-3-question-82-discussion/",
    "body": "You are developing a SQL Server Integration Services (SSIS) package. The package sources data from an HTML web page that lists product stock levels.<br>You need to implement a data flow task that reads the product stock levels from the HTML web page.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse an msi file to deploy the package on the server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen a command prompt and run the dtutil/copy command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd an OnError event handler to the SSIS project.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen a command prompt and run the gacutil command."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-30T05:36:00.000Z",
        "voteCount": 1,
        "content": "none of the answers make sense for the question"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/3457-exam-70-463-topic-3-question-88-discussion/",
    "body": "In your ETL process, there are three external processes that need to be executed in sequence, but you do not want to stop execution if any of them fails.<br>Can this be achieved by using precedence constraints? If so, which precedence constraints can be used?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo, this cannot be achieved just by using precedence constraints.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes, this can be achieved by using completion precedence constraints between the first and the second and between the second and the third Execute Process tasks, and by using a success precedence constraint between the third Execute Process task and the following task.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes, this can be achieved by using completion precedence constraints between the first and the second, between the second and the third, and between the third Execute Process task and the following task.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes, this can be achieved by using failure precedence constraints between the first and the second, and between the second and the third Execute Process"
    ],
    "answer": "B",
    "answerDescription": "References: https://msdn.microsoft.com/en-us/library/cc505848.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-13T01:26:00.000Z",
        "voteCount": 2,
        "content": "C is the correct answer, have verified the same in the training kit as well."
      },
      {
        "date": "2020-03-12T15:55:00.000Z",
        "voteCount": 2,
        "content": "C would seem more correct"
      },
      {
        "date": "2019-08-11T08:12:00.000Z",
        "voteCount": 3,
        "content": "Why not C?"
      }
    ],
    "examNameCode": "70-463",
    "topicNumber": "3"
  }
]