[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1816-exam-70-339-topic-6-question-1-discussion/",
    "body": "Case Study -<br>This is a case study. Case studies are not limited separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other question on this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next sections of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question on this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an<br>All Information tab, note that the information displayed is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Background -<br><br>General -<br>Blue Yonder Airlines manufactures, sells, and services small commercial jet aircraft. The company has offices worldwide. Blue Yonder currently uses both<br>SharePoint 2013 and SharePoint 2016. The company has a public website that is based on an ASP.NET web application.<br><br>SharePoint 2013 -<br>Service environment (SharePoint 2013)<br>✑ The legacy SharePoint farm runs SharePoint Server 2013.<br>✑ This farm has over 200 site collections that are hosted on 20 content databases. There is no clear documentation that details which site collections are located in which content databases.<br>✑ The SQL Server for the SharePoint 2013 farm is ServerRole2013.<br><br>Requirements -<br><br>General -<br>Every file stored within the system must contain the following common document properties:<br>✑ Document Status<br>✑ Department<br>✑ Author<br>✑ Enterprise Keywords<br>Values for the Document Status property must be displayed in English, Spanish, or French. The display language must be based on a users language preferences.<br>Additional fields or settings may be added in the future.<br>You must be able to manage file metadata settings from a single location. When you make changes to settings, the changes must be applied to site collections and existing documents. This location must not be a part of the existing marketing, HR, or procurement team sites.<br><br>Site collections -<br>Each departmental site must have a separate site collection. All departmental sites must be hosted in a single web application which is located at http:// sp.blueyonder.com.<br>Locations for the storage of personal documents for each employee should be created in a dedicated web application.<br><br>Governance -<br>No custom development is permitted. Custom solutions must not be installed on the farm. Only configurations based on standard functionality acceptable.<br>Employees in the marketing, HR, and procurement departments are only permitted to have Read, Contribute, or Edit permissions to their sites.<br><br>Human Resources -<br>The human resources (HR) department is responsible for sharing information with all employees related to four themes: my work, my pay, my benefits, and my career. The naming of these themes may change over time, and additional themes may be added. It must be possible for someone from the HR team to edit the themes.<br>The HR site in the intranet is divided into a top level site with three subsites. Each subsite represents a unique team.<br>The global navigation of the HR site must feature a listing of the relevant themes and link to custom pages that list content for each theme. The site must not display links to subsites or other pages on the HR site.<br><br>Team site URL -<br>The HR site must use the URL http://hr.blueyonder.com.<br><br>Marketing -<br>The marketing department will use SharePoint to publish brochures, marketing materials, and announcements. Only final versions of these documents may be added to the marketing team site for sharing with other Blue Yonder employees. Once a file is published, employees must be able to access the file by using a consistent link even if the file is renamed or moved within the site.<br><br>User file storage -<br>Files that are in draft mode must not be accessible to any user except the author until the file is ready for review. Each marketing employee must have a single location for storing draft work, work in progress materials, and other personal files. Files stored in this location must only be accessible to the employee that owns the area unless the employee chooses to share a file with other users.<br>The storage location must be created automatically for an employee and must not require assistance from IT for configuration.<br>The URL for each employees site must be http://employees.blueyonder.com/my/personal/username, where username represents the login of the employee.<br><br>Public website -<br>The public website is not part of the SharePoint environment. It is a standalone ASP.NET website. Content on the public website, including news and job postings, is updated once a month. Information posted to the public website must be accessible by using search. Information stored in the Downloads section of the website must not be crawled due to the large size and the number of files.<br><br>Team site URL -<br>The team site for the department must use the URL http://marketing.blueyonder.com.<br><br>Procurement -<br>The procurement department uses SharePoint to store contracts and related documents. You must store these documents in as few document libraries as possible. The documents may contain precedents or terms that are relevant for reuse. The procurement site stored over 20 million documents. The term store for the site contains two million terms.<br><br>File storage -<br>Currently, the site consumes approximately 100 gigabytes (GB) of storage. This is expected to double within a year. It is expected that search will be a key feature for this group.<br><br>Search -<br>When a search is conducted and a user hovers over the search result, the user must be able to easily launch the document, visit the library that it is stored in, or preview the file. The links to the document and the library must appear above the preview of the file.<br><br>Team site URL -<br>The site for the department must use the URL http://procurement.blueyonder.com.<br><br>Products -<br>The product team uses the legacy SharePoint 2013 farm. You must upgrade the farm to SharePoint Server 2016 so that the product team can take advantage of all the services that are available to the other departments.<br>The existing products site is very active. You must ensure that users cannot change the site content during the upgrade process.<br><br>SharePoint 2016 -<br><br>Logical architecture -<br>✑ The SharePoint environment has two web applications. One web application is used for Departmental Collaboration, and the other is used for Central<br>Administration.<br>✑ Each departmental site should be configured as a separate site collection.<br>✑ All departmental sited should be hosted within the same webapplication. The web application is accessible at the URLhttp://sp.bluyonder.com.<br>✑ Locations for the storage of personal documents for each employee should be created in a dedicated web application.<br><br>Server environment -<br>✑ The server farm is configured with SharePoint Server 2016 and Office Online Server. No additional add-ons or software packages are installed.<br>✑ The SQL Server for the SharePoint 2016 farm is ServerRole2016.<br>✑ The farm should leverage MinRole with a dedicated server for search.<br>You need to configure SharePoint to support the required common document properties.<br>Which two actions should you perform? Each correct answer presents part of the solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActivate the Metadata Navigation and Filtering feature.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn each site collection, define content types and site columns.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a site collection. Define content types and site columns.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActivate the Content Type Syndication Hub feature.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a library. Create columns and save the library as a template."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-06-15T15:58:00.000Z",
        "voteCount": 1,
        "content": "A. Activate metadata nav &amp; filtering\nE. Create lib, columns &amp; save as template."
      },
      {
        "date": "2019-07-27T08:57:00.000Z",
        "voteCount": 2,
        "content": "manage fild setting from single place -&gt; content type hub"
      },
      {
        "date": "2019-07-27T08:57:00.000Z",
        "voteCount": 2,
        "content": "so C and D"
      }
    ],
    "examNameCode": "70-339",
    "topicNumber": "6"
  },
  {
    "topic": 6,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1839-exam-70-339-topic-6-question-2-discussion/",
    "body": "During the upgrade from SharePoint 2013 to SharePoint 2016, you discover there is a missing feature. You review the logs and observe the following error message:<br>Message: Database [WSS_ Contoso_OR01] has reference(s) to a missing feature: Id = [4be9a980-965f-486f-9eda-074e284875d7].<br>Remedy: The feature with Id 4be9a980-965f-486f-9eda-074e284875d7 is referenced in the database [WSS_ Contoso_OR01], but is not installed on the current farm.<br>The missing feature may cause upgrade to fail. Please install any solution which contains the feature and restart upgrade if necessary.<br>You need to identify the page that is missing the feature.<br>Which of the following will identify the page?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn the SQL Server, run the following SQL syntax against WSS_Contoso_OR01: SELECT FeatureID, FullURL FROM WebsINNER JOIN FeaturesON Webs.Id = Features.WebIdWHERE FeatureID = 4be9a980-965f-486f-9eda-074e284875d7ORDER BY FeatureID",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn the SharePoint Server, review the Health Analyzer and find the missing dependencies.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn the SharePoint Server, run the following Windows PowerShell command: Test-SPContentDatabase-Name $dbName ;-WebApplication $wa | Select Category, Message | Where {$_.Category –eq \"MissingFeature\"}",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn the SharePoint Server, run the following Windows PowerShell command: Test-SPContentDatabase-Name $dbName -WebApplication $wa | Select"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-04-20T15:33:00.000Z",
        "voteCount": 1,
        "content": "answer is C"
      },
      {
        "date": "2019-06-16T15:09:00.000Z",
        "voteCount": 2,
        "content": "answer: On the SharePoint Server, run the following Windows PowerShell command: Test-SPContentDatabase- \nName $dbName -WebApplication $wa | Select Category, Message | Where {$_.Category –eq \n“MissingFeature”}"
      }
    ],
    "examNameCode": "70-339",
    "topicNumber": "6"
  }
]