[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1071-exam-70-346-topic-2-question-1-discussion/",
    "body": "DRAG DROP -<br>You implement Office 365 for an organization.<br>You must create the correct DNS entries needed to configure Exchange Online.<br>Which DNS entries should you create? To answer, drag the appropriate DNS record type to the correct purpose. Each DNS record type may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02128/0001200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02128/0001300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "TXT record is used for verification. When you have added the record at your domain registrar's site, you'll go back to Office 365 and request Office 365 to look for the record. When Office 365 finds the correct TXT record, your domain is verified.<br>MX (mail exchanger) record points to where your email should be sent. It also has a priority field so that you can send mail to different servers in a priority order.<br>CNAME (alias or canonical) record redirects one domain to another in the DNS system. When a name server looks up a domain and finds that it has a CNAME record, the server replaces the first domain name with the CNAME, and then looks up the new name.",
    "votes": [],
    "comments": [
      {
        "date": "2019-04-28T15:02:00.000Z",
        "voteCount": 1,
        "content": "I think the TXT record to be created is for the  SPF record that is what prevents outgoing mail to be seen as spam"
      }
    ],
    "examNameCode": "70-346",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24339-exam-70-346-topic-2-question-3-discussion/",
    "body": "HOTSPOT -<br>You are the SharePoint Online administrator for Contoso, Ltd. The company purchases an Office 365 Enterprise El plan.<br>The public-facing website must use SharePoint Online and the custom domain contoso.com.<br>You need to configure the DNS settings for the public-facing SharePoint site.<br>How should you configure the DNS settings? Select the appropriate options from each list in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02128/0001400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02128/0001500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "The CNAME record is used to redirect one domain to another in the DNS system. When a name server looks up a domain and finds that it has a CNAME record, the server replaces thefirst domain name with the CNAME, and then looks up the new name.",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-28T20:31:00.000Z",
        "voteCount": 1,
        "content": "Public website is no longer available (and for quite few years already)"
      }
    ],
    "examNameCode": "70-346",
    "topicNumber": "2"
  }
]