[
  {
    "topic": 16,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74730-exam-md-101-topic-7-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to recommend a solution to meet the device management requirements.<br>What should you include in the recommendation? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04293/0054700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04293/0054800001.png\" class=\"in-exam-image\">",
    "answerDescription": "From the scenario:<br>Litware identifies the following device management requirements:<br>✑ Prevent the sales department employees from forwarding email that contains bank account information.<br>✑ Ensure that Microsoft Edge Favorites are accessible from all computers to which the developers sign in.<br>✑ Prevent employees in the research department from copying patented information from trusted applications to untrusted applications.<br>Box 1:<br>Employees in the research department must be prevented from copying patented information from trusted applications to untrusted applications. This requires an<br>App protection policy.<br>App protection policies make sure that the app-layer protections are in place. For example, you can:<br>✑ Require a PIN to open an app in a work context<br>✑ Control the sharing of data between apps<br>Prevent the saving of company app data to a personal storage location<br><img src=\"/assets/media/exam-media/04293/0054800007.png\" class=\"in-exam-image\"><br>Box 2:<br>Employees in the sales department must be prevented from forwarding email that contains bank account information.<br>Azure Information Protection is a cloud-based solution that helps an organization to classify and optionally, protect its documents and emails by applying labels.<br>Labels can be applied automatically by administrators who define rules and conditions, manually by users, or a combination where users are given recommendations.<br>Reference:<br>https://docs.microsoft.com/en-us/intune/app-protection-policy https://docs.microsoft.com/en-us/azure/information-protection/what-is-information-protection",
    "votes": [],
    "comments": [
      {
        "date": "2022-04-28T00:23:00.000Z",
        "voteCount": 6,
        "content": "Answers provided are correct. Read what they're asking first. Then go back to search the specific information."
      },
      {
        "date": "2024-01-10T01:55:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2022-04-28T14:28:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      }
    ],
    "examNameCode": "md-101",
    "topicNumber": "7"
  }
]