[
  {
    "topic": 4,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16274-exam-mb-220-topic-4-question-1-discussion/",
    "body": "DRAG DROP -<br>You want to create a method that will alert sales people when a lead is ready to be sold to.<br>This method should automatically move the lead to the Sales-Acceptance stage of the lead life-cycle.<br>Which four steps must you take, in order to complete your task? (Choose four.) To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04131/0006600001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04131/0006700001.png\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://docs.microsoft.com/en-gb/dynamics365/customer-engagement/marketing/set-up-lead-scoring",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-11T10:02:00.000Z",
        "voteCount": 37,
        "content": "Answer is correct. \n\n\nPublish isnt an option to go live with lead scoring models\nSetting sales ready score is done on grades tab\nSales Ready score is defined on grades tab and not on summary tab\n\nHence correct answer : \n\n1) Create a Lead Scoring Model\n2) Add a condition and action tile\n3) Set the sales Ready score on the grades tab\n4) Click Go Live"
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21212-exam-mb-220-topic-4-question-2-discussion/",
    "body": "As a Marketing Administrator you have been tasked with automatically creating leads based on interactions your marketing contacts have with your organization.<br>What are two ways the system can create leads from the same marketing contact? (Choose two.) Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIt can automatically create one per visit to a customer journey that is configured to create leads automatically.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIt can automatically create one per visit to a landing page that is configured to create leads automatically.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIt can automatically create one per interaction that indicates a level of interest in a product or service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIt can automatically create only one; each marketing contact equates to one lead."
    ],
    "answer": "AB",
    "answerDescription": "References:<br>https://docs.microsoft.com/en-us/dynamics365/customer-engagement/marketing/lead-lifecycle",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-29T00:22:00.000Z",
        "voteCount": 14,
        "content": "If Answer B is correct, it should be rewritten like filling out a form on a landing page. Just visiting a landing page does not create any leads."
      },
      {
        "date": "2020-06-22T10:30:00.000Z",
        "voteCount": 12,
        "content": "I  disagree.\n\n1. The provided Microsoft Link say otherwise ;)\n- \"Created by a create-lead tile in a customer journey. \" \n- \"Customer opt-in from a landing page\"\n\n2. I think we can agree that answer D is wrong, as it states that you can create only one - contradicting the question itself.\n\n3. Answer C should also be wrong, as it states \"per interaction that indicates a level of interest in a product or service\". There is no feature to create a lead based on a \"level of interest\". progress a lead (scoring model) but not create. \nThe create you do with a landingpage"
      },
      {
        "date": "2023-08-23T17:23:00.000Z",
        "voteCount": 1,
        "content": "I would argue that Answer C could be correct if you build a segment using behavioural insight (i.e. clicked on link indicating interest in a Product or service), then build a Customer Journey to create a Lead if the customer clicks on link A.\n\nOne could argue that A is incorrect, because you cannot 'visit' a customer journey..."
      },
      {
        "date": "2022-11-02T17:28:00.000Z",
        "voteCount": 3,
        "content": "Lead generation 1) Created by a create-lead tile in a customer journey. These leads can be linked to either a contact or an account, depending on the tile and customer journey settings 2) Customer opt-in from a landing page (matched to an existing contact or creates a new, linked contact)- So Answer is -A, B"
      },
      {
        "date": "2022-09-30T05:51:00.000Z",
        "voteCount": 1,
        "content": "Correct, leads can be generated from Customer journey via interaction &amp; leads can be created form form submission if configured."
      },
      {
        "date": "2021-02-24T07:48:00.000Z",
        "voteCount": 1,
        "content": "I think is correct A and B - if you create a new landing page you can set purpose on Lead Generation. the same in the landing page template \nsearch filter"
      },
      {
        "date": "2021-02-24T07:47:00.000Z",
        "voteCount": 1,
        "content": "I think is correct A and B - if you create a new landing page you can set purpose on Lead Generation in summary tab the same if you filter by purpose, checking lead gen,  among landing page templates."
      },
      {
        "date": "2020-11-24T10:23:00.000Z",
        "voteCount": 1,
        "content": "I think arki is correct."
      },
      {
        "date": "2020-05-23T09:42:00.000Z",
        "voteCount": 5,
        "content": "I think B and C would be more appropriate"
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/44800-exam-mb-220-topic-4-question-3-discussion/",
    "body": "DRAG DROP -<br>Your marketing department purchases a file with a list of leads.<br>Which actions should you perform, in sequence, in order to be able to add these leads to a marketing segment? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04131/0006900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04131/0006900002.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-07-27T13:39:00.000Z",
        "voteCount": 12,
        "content": "Another question lacking clarity but to me it doesn’t make sense to import the list as leads before importing as contacts:\n1. Assure the file in proper format\n2. Import file as contacts with duplicate detection\n(Now we have a contact record for every lead we want to import)\n3. Import file as leads \n(Setting the reference to those existing contacts on import)\nNo need for any workflow. \nIf you import leads first and we’re talking classic workflows, what workflow step do you think you can use to link the relevant contact to the lead? Update record, how do you set the contact record value dynamically, use the lead name and hope it resolves to the contact? Flow makes more sense as you could query for the existing contact before setting it on the lead.  \n\nGiven answer may be correct for the exam but just wanted to highlight why it is not an obvious answer."
      },
      {
        "date": "2021-08-26T01:26:00.000Z",
        "voteCount": 2,
        "content": "I agree with this process, however we would be missing to treat unrelated leads to contacts, the flow using relate action would make sense at the end"
      },
      {
        "date": "2021-04-21T05:03:00.000Z",
        "voteCount": 6,
        "content": "Answer should be: \n1. Assure the file is in the proper format\n2. Import the file as leads\n3. import the file as contacts (2 &amp; 3 can be inverted)\n4. use workflows to link contact and leads (easy since both have same data structure)\nManually relating leads to contacts does not make any sense"
      },
      {
        "date": "2024-03-29T18:55:00.000Z",
        "voteCount": 1,
        "content": "Manually relating leads to contacts does not make any sense\n-&gt; it does not state \"manually\" just \" relate leads to contacts\" I was assuming some flow or plugin..."
      },
      {
        "date": "2024-03-30T17:58:00.000Z",
        "voteCount": 1,
        "content": "if you have the guid of the contacts you could add that one to the parent contact for lead and import the list as exel into leads: all depending on the scenario you actually have"
      },
      {
        "date": "2023-08-23T17:35:00.000Z",
        "voteCount": 2,
        "content": "I think Microsoft is trying to trick us all.. :) I think this question could have a few different solutions...\n\nDocumentation shows Knightie's answer could be correct (using a workflow to link the Contact for orphaned Lead) - https://learn.microsoft.com/en-us/dynamics365/marketing/market-to-leads#automatically-generate-contacts-for-orphaned-leads\n\nAnother option is to import Leads and Contacts separately (my preferred option)\nFirst import the Contacts, then ensure your Lead file includes the lookup to Parent Contact, populate this field. Then import Leads. (Since you've already imported all the Leads as Contacts, there will be no orphaned Leads)\n\nMy answer:\n1) A - Assure the file in proper format\n2) D - Import file as contacts with duplicate detection\n3) B - Relate each Lead to a Contact\n4) C - Import file as Leads with duplicate detection"
      },
      {
        "date": "2024-03-30T18:02:00.000Z",
        "voteCount": 1,
        "content": "3) B - Relate each Lead to a Contact -&gt; with guid in the excel!\n\nfrom my perspective the lead should create the contact upon qualification - and not the contact first and then generate the lead."
      },
      {
        "date": "2022-06-25T00:54:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/dynamics365/marketing/market-to-leads#automatically-generate-contacts-for-orphaned-leads\nThe answer is correct, my points.\n1. no need to import contacts, the it will generate in the workflow.\n2. it will auto link if the system knows what to link.\n3. those failed auto linked should let you have a chance to manual link them first.. cases like the contact is using English name but your Lead is using Chinese name... you can help by linking them up manually first.\n4. Then let the workflow to generate the contacts and link them up."
      },
      {
        "date": "2022-01-27T08:05:00.000Z",
        "voteCount": 4,
        "content": "The answer is correct because you can \"Import leads from a file and then manually map each lead to a contact or account.\" as per this link https://docs.microsoft.com/en-us/dynamics365/marketing/lead-lifecycle"
      },
      {
        "date": "2024-03-30T18:04:00.000Z",
        "voteCount": 1,
        "content": "sounds like stone age"
      },
      {
        "date": "2021-09-21T01:12:00.000Z",
        "voteCount": 2,
        "content": "Nobody realises the contact records already exist in the system?"
      },
      {
        "date": "2021-09-20T02:01:00.000Z",
        "voteCount": 4,
        "content": "'Segments, customer journeys, and other Dynamics 365 Marketing features require that each lead has a contact associated with it. However, sales-driven setups may follow a different model, where leads are created as the first touchpoint, without necessarily having contact records associated with them.\n\nTo solve this, you can use Dynamics 365 custom workflows to automatically generate and link a contact record for each new or existing unmatched lead record. To create the link, populate the parentcontactid field of each lead record with the GUID of the relevant contact record (this field is labelled as Parent contact for lead when you're designing a workflow in the UI). This field connects to the contact record through an N:1 relation called lead_parent_contact.'\n\nSo shouldn't it be: \n1. Assure the file in proper format\n2. Import file as leads\n3. Use workflow to link contact and leads"
      },
      {
        "date": "2023-08-23T17:30:00.000Z",
        "voteCount": 1,
        "content": "correct \nhttps://learn.microsoft.com/en-us/dynamics365/marketing/market-to-leads#automatically-generate-contacts-for-orphaned-leads"
      },
      {
        "date": "2021-03-08T03:40:00.000Z",
        "voteCount": 1,
        "content": "If I was undertaking this task I would complete the following steps:\n1. Assure the file is in the required format and data exists for all required fields\n2. Relate each Lead to a Contact (ensure Existing Contact is set)\n3. Import the File as Contacts (get the parent record imported first, so that the value is there to set the Lead Existing Contact field)\n4. Import the file as Leads (should now match without failure to an Existing Contact)"
      },
      {
        "date": "2021-02-15T10:52:00.000Z",
        "voteCount": 3,
        "content": "Im not 100% sure but I think the methods are:\n- assure data is in the proper format..\n- Import the file as leads\n- Import the file as contacts\n- Relate each lead to contact\n\nThis is a lot of manual work, though.\nWith workflows you cannot do \"batch jobs\" as listing filtered records and updating them. Maybe with advanced flow."
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75782-exam-mb-220-topic-4-question-4-discussion/",
    "body": "You are a marketing administrator for Contoso Ltd.<br>You have a Contact Us marketing form that has fields for a person's name, company, address, email address, and phone number.<br>When the form is submitted, you need to ensure that:<br>✑ If the contact or lead already exists, their record is updated.<br>✑ If the contact or lead does not exist, their record is created.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet ג€Update contact/leadsג€ to Contact and Lead.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet ג€Generate Leads Without Matchingג€ to Yes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet ג€Store Form Submission' to Yes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVerify that ג€Lead Matching Strategyג€ and ג€Contact Matching Strategyג€ are set correctly.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 7,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-11-01T12:06:00.000Z",
        "voteCount": 1,
        "content": "The “Update contact/leads” setting is used to specify which types of records (contacts, leads, or both) should be updated when a form submission is received. But it doesn’t dictate the logic for matching incoming data with existing records.\n\nThe “Lead Matching Strategy” and “Contact Matching Strategy” settings are used to determine how incoming leads and contacts are matched with existing ones. If a match is found, the existing record is updated; if no match is found, a new record is created."
      },
      {
        "date": "2023-05-02T02:24:00.000Z",
        "voteCount": 1,
        "content": "It should be D to me."
      },
      {
        "date": "2023-02-06T06:36:00.000Z",
        "voteCount": 1,
        "content": "Should be D"
      },
      {
        "date": "2022-09-27T03:27:00.000Z",
        "voteCount": 1,
        "content": "Is it A or D?"
      },
      {
        "date": "2022-06-06T01:20:00.000Z",
        "voteCount": 4,
        "content": "I reckon this answer is correct. Form selection on which entities to update or create takes over the matching strategy."
      },
      {
        "date": "2024-03-29T19:08:00.000Z",
        "voteCount": 1,
        "content": "Update contacts / leads does not include \"create\": Create is requested too in this question"
      },
      {
        "date": "2024-03-29T19:10:00.000Z",
        "voteCount": 1,
        "content": "First, i thought the same but the level of granularity from the question \"You have a Contact Us marketing form that has fields for a person's name, company, address, email address, and phone number.\" does not fit A (it is a too general response for the level of details provided)"
      },
      {
        "date": "2022-10-12T01:49:00.000Z",
        "voteCount": 2,
        "content": "Agree with you, A is a must to update in leads / contacts,"
      },
      {
        "date": "2022-05-18T11:50:00.000Z",
        "voteCount": 4,
        "content": "Isn't it D"
      },
      {
        "date": "2022-06-13T08:02:00.000Z",
        "voteCount": 4,
        "content": "I agree, answer is D per the following quote: \"The system applies the Contact matching strategy to see if an existing contact matches the submission.\nIf a matching contact is found, update its fields to match the submission.\nIf no contact is found, then create a new one based on the submission.\" listed in the the link provided by the answer: \n\nhttps://docs.microsoft.com/en-us/dynamics365/marketing/marketing-forms"
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/72327-exam-mb-220-topic-4-question-5-discussion/",
    "body": "You are a Dynamics 365 Marketing functional consultant.<br>You need to set up a Marketing campaign for a client to demonstrate how they can engage customers in email campaigns.<br>To set up your demo, you will need to establish a list of contacts. You need to avoid using actual contacts.<br>Which two methods can be used to load demo contacts for the campaign? Each correct answer presents part of the solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate Contacts in Demo Data of Marketing Settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate contacts manually in the Leads section of Dynamics 365 Marketing.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImport contacts from an Excel file.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate contacts manually in the Contacts section of Dynamics 365 Marketing.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "CD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "CD",
        "count": 12,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-03-04T15:18:00.000Z",
        "voteCount": 10,
        "content": "Cannot be A, there is no \"Demo Data\" section in Marketing Settings"
      },
      {
        "date": "2022-06-25T20:53:00.000Z",
        "voteCount": 5,
        "content": "Sample Data is managed at Dynamics 365 Settings or Powerapp Admin Environment management of D365 Marketing, not within Marketing 365 Settings."
      },
      {
        "date": "2023-05-02T02:26:00.000Z",
        "voteCount": 1,
        "content": "It should be C and D.\nEven if you can install Sample Data a section \"Demo Data\" where you can add contacts doesn't exist at all."
      },
      {
        "date": "2022-11-02T17:58:00.000Z",
        "voteCount": 3,
        "content": "Install Sample Date:  Settings (Settings.) &gt; Advanced Settings &gt; Settings &gt; Data Management &gt; Sample Data - So answer is: A &amp; C"
      },
      {
        "date": "2022-10-24T06:30:00.000Z",
        "voteCount": 1,
        "content": "I agree C - D"
      },
      {
        "date": "2022-10-10T07:34:00.000Z",
        "voteCount": 1,
        "content": "cd in my opinion"
      },
      {
        "date": "2022-07-23T13:48:00.000Z",
        "voteCount": 3,
        "content": "Microsoft docs says A is correct but didnot actually find it in environment https://docs.microsoft.com/en-us/dynamics365/marketing/additional-settings"
      },
      {
        "date": "2022-03-18T13:40:00.000Z",
        "voteCount": 2,
        "content": "I guess CD"
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/103682-exam-mb-220-topic-4-question-6-discussion/",
    "body": "You are setting up a Lead Scoring model.<br><br>You want to score leads based on a condition.<br><br>Which two conditions follow the Fixed Rule Category? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBased on age\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClicking on a link in an email",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAn event for which the contact registered",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBased on zip code\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AD",
        "count": 11,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-05-04T01:26:00.000Z",
        "voteCount": 5,
        "content": "A and D (demographic or firmographic data from Contact or Account record)"
      },
      {
        "date": "2024-03-30T18:18:00.000Z",
        "voteCount": 1,
        "content": "i am familiar with the \"fixed demo- or firmographic rule\": but customers change age and even zip all the time; the rule itself is as fixed or dynamic as behaviour rule. i think \"fixed\" is odd in this context."
      },
      {
        "date": "2023-09-11T23:49:00.000Z",
        "voteCount": 1,
        "content": "A and D are correct"
      },
      {
        "date": "2023-05-03T04:25:00.000Z",
        "voteCount": 1,
        "content": "Should be A and D"
      },
      {
        "date": "2023-05-02T05:52:00.000Z",
        "voteCount": 1,
        "content": "A and D (demographic or firmographic data from Contact or Account record)"
      },
      {
        "date": "2023-05-02T02:28:00.000Z",
        "voteCount": 2,
        "content": "Fixed rules are based on fixed demographic or firmographic data found in lead or contact records.\nBehavior rules are based on interactions like email clicked, event registered, or website visited.\n\nB and C are Behavior rules"
      },
      {
        "date": "2023-04-21T06:54:00.000Z",
        "voteCount": 1,
        "content": "A and D"
      },
      {
        "date": "2023-03-23T10:11:00.000Z",
        "voteCount": 2,
        "content": "Incorrect? Fixed rule definition here: https://learn.microsoft.com/en-us/dynamics365/marketing/score-manage-leads"
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/122945-exam-mb-220-topic-4-question-7-discussion/",
    "body": "You want to update the marketing settings to enable this scenario:<br>When a person submits a form, the marketing system will pair the submission with an existing lead by their email address and the product they are interested in.<br><br>Which setting should you update?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLanding pages",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLead scoring",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMatching strategy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDefault marketing settings"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-03-05T00:59:00.000Z",
        "voteCount": 1,
        "content": "If Generate leads without matching is set to Yes, the system always creates a new lead, regardless of the Lead matching strategy.\nIf Generate leads without matching is set to No, the system applies the Lead matching strategy to look for an existing lead that matches the submission.\nIf a matching lead is found, update its fields to match the submission.\nIf no lead is found, create a new one based on the submission."
      },
      {
        "date": "2023-10-09T01:19:00.000Z",
        "voteCount": 3,
        "content": "Seems correct.\n\"Contact and Lead matching strategies: These settings control which incoming form-field values are matched against existing contact and lead records. If an existing record has matching values in all the specified fields\"\n\nhttps://learn.microsoft.com/en-us/dynamics365/customer-insights/journeys/marketing-forms"
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/119169-exam-mb-220-topic-4-question-8-discussion/",
    "body": "DRAG DROP<br> -<br><br>Various departments in your company work with leads that all gather and contain different information.<br><br>You need to explain to these departments the various scenarios that can create leads automatically or manually.<br><br>Which of these scenarios will or will not create a lead? To answer, drag the appropriate scenario to the correct answer. Each answer may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct match is worth one point.<br><br><img src=\"https://img.examtopics.com/mb-220/image154.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/mb-220/image155.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-03-30T18:37:00.000Z",
        "voteCount": 1,
        "content": "for the last one: Create/update both contacts and leads\nWhen a form is submitted with Update contact/leads set to Contacts and leads (which is the standard and recommended setting):\n\nBoth leads and contacts will be created or updated as needed.\nhttps://learn.microsoft.com/en-us/dynamics365/customer-insights/journeys/marketing-forms#form-setting-effects\ni interprete this that it creates a lead in any case, even if it finds a valid / unique contact"
      },
      {
        "date": "2023-08-26T19:53:00.000Z",
        "voteCount": 2,
        "content": "Agree with the answers for these statements, except the third option.\nHow does one mark event visitors as Leads?...\nEvent registrations are against the Contact, not against Leads. So if we are importing a list of event visitors, we would need to import them as Contacts (not leads), and then as Event Registration records. \nThere is a setting on Events to autocreate a Lead for each Event Registration, but this is not enabled by default."
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "4"
  }
]