[
  {
    "topic": 4,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34157-exam-pl-100-topic-4-question-1-discussion/",
    "body": "HOTSPOT -<br>You are configuring security to enable users to analyze data by using Microsoft Excel templates.<br>You create a security role named TemplateAdministrator and configure the role as shown below and assign the role to a user named User1.<br><img src=\"/assets/media/exam-media/04323/0025800001.jpg\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that answers each question based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04323/0025900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0026000001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-10T01:34:00.000Z",
        "voteCount": 139,
        "content": "Read on Document Template\nExport to Excel"
      },
      {
        "date": "2021-12-19T06:36:00.000Z",
        "voteCount": 1,
        "content": "oh for sure"
      },
      {
        "date": "2021-02-18T06:19:00.000Z",
        "voteCount": 12,
        "content": "question 1: in my opinion \"read on personal document template\" makes no sense because \"pre-configured example templates\" are global, not personal templates. user1 already has read permissions on his own templates, so he need global \"read on document template\" permission."
      },
      {
        "date": "2022-06-24T05:25:00.000Z",
        "voteCount": 2,
        "content": "I agree that is Read on Document Templates and Export to excel, BUT there is something tricky here, I think is in Download the file to create an Excel template."
      },
      {
        "date": "2021-10-13T09:15:00.000Z",
        "voteCount": 3,
        "content": "I tried it out and for the second answer it is \"Export to Excel\""
      },
      {
        "date": "2021-08-29T23:58:00.000Z",
        "voteCount": 1,
        "content": "The user already have Read on personal document template."
      },
      {
        "date": "2021-06-25T05:55:00.000Z",
        "voteCount": 3,
        "content": "I have this question in a Braindump PDF from Microsoft direct.\n\nThe answer they say is :\n1) Read on Document Template.\n2) Read on Personal Document Template"
      },
      {
        "date": "2021-06-22T17:39:00.000Z",
        "voteCount": 3,
        "content": "The question asks to be able to -download- a template in order to create one. To download one, you need access to the ones in the system and the privilege that is missing is prvReadDocumentTemplate. Personal Document Template is already set to read, so you can already download your own. \n\nRead on Document Template for both. \nhttps://docs.microsoft.com/en-us/previous-versions/dynamicscrm-2016/developers-guide/hh547441(v=crm.8)"
      },
      {
        "date": "2021-06-22T12:36:00.000Z",
        "voteCount": 3,
        "content": "Has anyone had this question come up in their exam and what is the correct answer? \n\nIMO:\n1) Read on Document Template.\n2) Read on Personal Document Template, as Export to Excel is therefore going to use D365 to DOWNLOAD THE DATA of the file, not use the file as a layout for, what the user wants, an Excel template. They already have Share Personal Document Template allowed, but this is no use if they don't have Read to support it as Share can't be done without Read."
      },
      {
        "date": "2021-06-10T08:49:00.000Z",
        "voteCount": 6,
        "content": "Read on Document Template\nExport to Excel"
      },
      {
        "date": "2021-04-27T17:56:00.000Z",
        "voteCount": 1,
        "content": "The question is related to the graphic shown. Based on it, only the personal document template was set. So answer is both read on personal doc template."
      },
      {
        "date": "2021-03-10T08:46:00.000Z",
        "voteCount": 1,
        "content": "I can not find anything about \"Export to Excel\"."
      },
      {
        "date": "2021-05-20T10:28:00.000Z",
        "voteCount": 1,
        "content": "Export to Excel permissions make sense, below is what the documentation states about downloading a file to create the template:\n\"During the creation of an Excel template, a maximum of 50 records are exported in the template file\"\nhttps://docs.microsoft.com/en-us/power-platform/admin/analyze-your-data-with-excel-templates#select-the-data-to-include-in-the-template"
      },
      {
        "date": "2020-12-27T09:48:00.000Z",
        "voteCount": 2,
        "content": "unsure if this answer is correct? Have the feeling the answer should be Read on Document Template in both cases?"
      },
      {
        "date": "2020-12-28T09:23:00.000Z",
        "voteCount": 19,
        "content": "okay guys I tried it out and the second answer is \"export to excel\" permission for 100%"
      },
      {
        "date": "2021-01-05T17:50:00.000Z",
        "voteCount": 3,
        "content": "It's not documented. Guess I'll go with an anonymous powerMaster who seems 100% confident :)\nFor 1st answer, documentation says:\n\"3. Select Document Template to set access for templates available to the entire organization. Select Personal Document Template for templates shared to individual users.\".\nCase in point is for setting for User1 (= individual user).\nOne of the answers (mostly 1st) should be \"Read on Personal Document Template\".\nhttps://docs.microsoft.com/en-us/power-platform/admin/analyze-your-data-with-excel-templates#use-security-roles-to-control-access-to-templates"
      },
      {
        "date": "2021-02-04T13:19:00.000Z",
        "voteCount": 1,
        "content": "#Conholioz - I wondered the same thing.  The documentation clearly states Document Templates to set access for templates available to the entire organization (green bubble) and Personal Document Template shared to individual users (plural, not singular), which makes sense there's a green bubble there also (for organization).  I had to read the statement in the documentation again to make sure for myself."
      },
      {
        "date": "2021-02-04T13:20:00.000Z",
        "voteCount": 1,
        "content": "But, then again -- the question said \"user1\", indicating singular, so I can see where it can be misleading."
      },
      {
        "date": "2020-11-30T14:23:00.000Z",
        "voteCount": 2,
        "content": "Nope. It says the following:\nTemplates uploaded from a list of records are available to the user who uploaded the template. To share the template with others, following these steps:\n\nFrom the template Information page, click Share.\n\nUse the Share personal document template page to share the Excel template with others and to set permissions.\n\nhttps://docs.microsoft.com/en-us/power-platform/admin/analyze-your-data-with-excel-templates"
      },
      {
        "date": "2021-01-05T17:57:00.000Z",
        "voteCount": 2,
        "content": "Are you suggesting 'Read on Personal Document Template' for answer 1 or answer 2?\nI'm guessing answer 1.\n\nExplanation:\n\"3. Select DOCUMENT TEMPLATE to set access for templates available to the ENTIRE ORGANIZATION. Select PERSONAL DOCUMENT TEMPLATE for templates shared to INDIVIDUAL USERS.\".\nUser1 = individual user\nhttps://docs.microsoft.com/en-us/power-platform/admin/analyze-your-data-with-excel-templates#use-security-roles-to-control-access-to-templates"
      },
      {
        "date": "2020-11-17T21:53:00.000Z",
        "voteCount": 2,
        "content": "Share personal document template\nhttps://docs.microsoft.com/en-us/power-platform/admin/analyze-your-data-with-excel-templates"
      },
      {
        "date": "2021-01-05T17:58:00.000Z",
        "voteCount": 3,
        "content": "Are you suggesting 'Read on Personal Document Template' for answer 1 or answer 2?\nI'm guessing answer 1.\n\nExplanation:\n\"3. Select DOCUMENT TEMPLATE to set access for templates available to the ENTIRE ORGANIZATION. Select PERSONAL DOCUMENT TEMPLATE for templates shared to INDIVIDUAL USERS.\".\nUser1 = individual user\nhttps://docs.microsoft.com/en-us/power-platform/admin/analyze-your-data-with-excel-templates#use-security-roles-to-control-access-to-templates"
      },
      {
        "date": "2020-10-15T04:47:00.000Z",
        "voteCount": 2,
        "content": "from msft docs: Use the Share personal document template page to share the Excel template with others and to set permissions."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34100-exam-pl-100-topic-4-question-2-discussion/",
    "body": "HOTSPOT -<br>An administrator plans to create and deploy dashboards for use only by sales associates. The dashboards will display the current sales pipeline, open cases, recent major wins, and key opportunities by postal code.<br>Sales associates must be able to act on the specific data displayed in dashboards.<br>You need to create the dashboards.<br>Which type of dashboards should you create? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04323/0026100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0026100002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: User -<br>Type of dashboard: If you want your dashboards to be available across the organization and do not want to manage the access levels at a more detailed level, you might want to create an organization-owned dashboard. However, if you are concerned about the access privileges and security of your dashboard, consider creating a user-owned dashboard where you have more control on who can access it.<br><br>Box 2: Single-stream -<br>The single-stream dashboards display real-time data over one stream based on an entity view or queue. The single-stream dashboards are typically helpful to Tier<br>2 service leads or managers, who monitor fewer, but more complex or escalated cases.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/developer/model-driven-apps/create-dashboard https://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/configure-interactive-experience-dashboards",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-10T01:39:00.000Z",
        "voteCount": 56,
        "content": "System Chart\nMulti-Stream"
      },
      {
        "date": "2022-09-18T22:44:00.000Z",
        "voteCount": 1,
        "content": "system DBoards are visible to everyone. (https://learn.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/create-edit-dashboards?view=op-9-1)"
      },
      {
        "date": "2021-05-21T01:43:00.000Z",
        "voteCount": 7,
        "content": "Agreed:\n- A standard dashboard is not interactive and does not allow users to act on specific data in the dashboard.\n- System dashboards are visible to all app users by default but can be secured by enabling security roles. \n- The user dashboard might be more straightforward as it is secure by default. However, I'm not so sure if interactive dashboards are supported as a user dashboard. 3rd link says only system dashboards support single/multi stream dashboards!\n- I'd go for multi-stream as I can't assume that all the mentioned kpi's are part of the same (single) entity.\n\nhttps://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/create-edit-dashboards\nhttps://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/configure-interactive-experience-dashboards#enable-security-roles\nhttps://docs.microsoft.com/en-us/powerapps/user/interactive-dashboards"
      },
      {
        "date": "2020-12-08T13:19:00.000Z",
        "voteCount": 26,
        "content": "1. User\n2. Multi-Stream (https://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/configure-interactive-experience-dashboards#:~:text=The%20multi%2Dstream%20dashboards%20display,time%20over%20multiple%20data%20streams.&amp;text=The%20data%20flows%20from%20various,an%20entity%20view%20or%20queue.)"
      },
      {
        "date": "2024-01-14T13:27:00.000Z",
        "voteCount": 1,
        "content": "User \nMulti stream"
      },
      {
        "date": "2023-12-20T09:54:00.000Z",
        "voteCount": 1,
        "content": "I actually thought this was system dashboard but since this is being shared to specific team members, not all users, I think user dashboard is correct. \n\nAn admin would follow these steps:\n\nFrom the user dashboard that you've created, you would click the 'share dashboard' button and select the specific members in your company/team with whom you wish to \nshare the dashboard.\n\nhttps://powerusers.microsoft.com/t5/Building-Power-Apps/What-is-the-difference-between-a-system-and-a-user-dashboard/m-p/1891414#M476075"
      },
      {
        "date": "2022-12-28T00:22:00.000Z",
        "voteCount": 1,
        "content": "System\nMulti-Steam"
      },
      {
        "date": "2021-10-10T08:57:00.000Z",
        "voteCount": 5,
        "content": "1. System Chart \n\"Interactive dashboards are system dashboards that only an admin can create.\"\n2. Multi-Stream \nBecause we need to show records from different entities."
      },
      {
        "date": "2021-07-04T09:40:00.000Z",
        "voteCount": 7,
        "content": "https://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/create-edit-dashboards\n\n\"There are two types of dashboards, user dashboards and system dashboards. An app user can create a dashboard visible only to them in the app areas that they have privileges to. An admin or customizer creates or customizes system dashboards that, when published, are visible to all app users.\"\n\nhttps://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/configure-interactive-experience-dashboards\n\n\"The multi-stream dashboards display data in real time over multiple data streams. [...] The data in a stream can be based only on one table, but, each stream can be based on a different table. [...] The single-stream dashboards display real-time data over one stream based on a table view or queue.\"\n\nSo I'd say the correct answers are system and multi-stream."
      },
      {
        "date": "2021-06-10T01:48:00.000Z",
        "voteCount": 5,
        "content": "It's System because that is the only dashboard type admins can share."
      },
      {
        "date": "2021-06-07T14:29:00.000Z",
        "voteCount": 5,
        "content": "The dashboard should be available for sales associates instead of the entire organization, so I think it should be user. Then we need to show records from different entities so it should be multi-stream"
      },
      {
        "date": "2021-03-28T22:48:00.000Z",
        "voteCount": 2,
        "content": "single stream because we monitor one entity--&gt;  opportunities\nSystem--&gt;because by default they are available to all organization, unless you limit access by enabling security rules over them (you can enable security rules from the classic solution customizer, go to dashboards and select enable security rules)"
      },
      {
        "date": "2021-06-03T04:48:00.000Z",
        "voteCount": 4,
        "content": "from what i can tell, we monitor multiple entities. major wins, open cases, opportunities etc :)"
      },
      {
        "date": "2021-03-11T09:31:00.000Z",
        "voteCount": 1,
        "content": "The dashboard will give information by postal code.\nThe Single-stream  display real time data from given entity.\nSo I think Single-stream is the best answer."
      },
      {
        "date": "2021-03-10T09:23:00.000Z",
        "voteCount": 1,
        "content": "Scenario \"An administrator plans to create and deploy dashboards for use only by sales associates.\"\n\nWhen a system dashboard is published this are visible to all app users. So, according to this action cannot be a system dashboard."
      },
      {
        "date": "2021-03-11T09:17:00.000Z",
        "voteCount": 3,
        "content": "I made a review system is better."
      },
      {
        "date": "2021-02-23T20:04:00.000Z",
        "voteCount": 2,
        "content": "I am going to go against the grain here.   I would build a System Dashboard and package into an App for the Sales persona, restricting access to other users.   Benefit of a system dashboard is that it can be packaged into a solution for upstream deployment,\n\nI also think a Standard DB is adequate as it can support objects from multiple entities.   The limitation of standard dashboards is that a filter cannot be applied across objects/entities.  I saw no requirement for cross-entity filtering."
      },
      {
        "date": "2021-02-18T06:34:00.000Z",
        "voteCount": 3,
        "content": "in my opinion its a \"system dashboard\" which can see every user with appropriate permissions. a \"user\" dashboard only one dedicated user can see - no one else can see, regardless of the permissions unless the user shares his dashboard."
      },
      {
        "date": "2021-02-02T08:50:00.000Z",
        "voteCount": 1,
        "content": "Create a *System dashboard*, so that it can be shared easily. Then, in the dashboard list, click on the ellipsis, and \"enable security roles\". A user dashboard is meant for your personal use (can be shared, but that's not what the question was about)."
      },
      {
        "date": "2021-02-02T08:51:00.000Z",
        "voteCount": 7,
        "content": "Thus system + multi-stream"
      },
      {
        "date": "2021-01-31T08:49:00.000Z",
        "voteCount": 6,
        "content": "System Chart\nMulti-Stream"
      },
      {
        "date": "2021-01-16T02:06:00.000Z",
        "voteCount": 13,
        "content": "don,t know who to believe. almost every question in this dump have some conflicts with the commenting audience."
      },
      {
        "date": "2021-02-02T08:54:00.000Z",
        "voteCount": 2,
        "content": "Test it out :) I just did it, and I was able to create a multi-stream system dashboard, plug in required data, enable security roles, grant access to the sales users."
      },
      {
        "date": "2021-02-07T02:01:00.000Z",
        "voteCount": 2,
        "content": "me too. i don't know who to believe.."
      },
      {
        "date": "2022-08-09T11:58:00.000Z",
        "voteCount": 2,
        "content": "Most of the time it's because the questions are poorly written or are really ambiguous. For me this is 1.System/Multistream\nBecause if you create a User dashboard, it's only for you or some others, which is the purpose but... the questions says an ADMIN plans to create, therefore, an ADMIN CAN ONLY create a system dashboard. The second one we're assuming that \"current sales pipelines, open cases, recen major...\" represent more that one entity (table) and that's why it's multi-stream"
      },
      {
        "date": "2023-12-20T09:58:00.000Z",
        "voteCount": 1,
        "content": "An admin can create User dashboards and shared as well.\n\nFrom the user dashboard that you've created, you would click the 'share dashboard' button and select the specific members in your company/team with whom you wish to share the dashboard.\n\nhttps://powerusers.microsoft.com/t5/Building-Power-Apps/What-is-the-difference-between-a-system-and-a-user-dashboard/m-p/1891414#M476075\n\nI do think the second question is multi-stream due to multiple avenues of data."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34158-exam-pl-100-topic-4-question-3-discussion/",
    "body": "You need to set the value for a global variable named RunningTotal to 5 and navigate to the previous screen named MainScreen.<br>Which formula should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdateContext( { RunningTotal: 5 } ); Navigate( MainScreen, ScreenTransition.Cover, RunningTotal );",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIf( Value(TextBox1.Text) &gt;= 0, (Set( RunningTotal, 5); Back();), Color.Green )",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdateContext( { RunningTotal:5 } ); Back()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet( RunningTotal, 5 ); Back();\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "You set the value of the global variable with the Set function. Set( MyVar, 1 ) sets the global variable MyVar to a value of 1.<br>Use the Back and Navigate function to change which screen is displayed.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/maker/canvas-apps/working-with-variables https://docs.microsoft.com/en-us/powerapps/maker/canvas-apps/functions/function-navigate",
    "votes": [
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-10-25T06:03:00.000Z",
        "voteCount": 26,
        "content": "correct 100%"
      },
      {
        "date": "2021-01-01T06:38:00.000Z",
        "voteCount": 9,
        "content": "The correct answer is a Set-Back so it is D (for dry humour)."
      },
      {
        "date": "2023-12-20T10:01:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2022-12-28T00:23:00.000Z",
        "voteCount": 1,
        "content": "D is correct."
      },
      {
        "date": "2022-11-11T08:31:00.000Z",
        "voteCount": 1,
        "content": "Correct!"
      },
      {
        "date": "2022-01-31T08:23:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2021-10-02T14:32:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2021-08-07T00:25:00.000Z",
        "voteCount": 1,
        "content": "As in Question asks for Global go with Set function"
      },
      {
        "date": "2021-06-22T12:38:00.000Z",
        "voteCount": 2,
        "content": "Agree."
      },
      {
        "date": "2021-06-08T09:09:00.000Z",
        "voteCount": 3,
        "content": "D is correct. As other users said, C is used to set a context variabile but we are required so set a global one"
      },
      {
        "date": "2021-04-28T02:13:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      },
      {
        "date": "2021-02-23T19:24:00.000Z",
        "voteCount": 4,
        "content": "CORRECT"
      },
      {
        "date": "2021-02-18T07:32:00.000Z",
        "voteCount": 2,
        "content": "..but C also works ;)"
      },
      {
        "date": "2021-02-18T07:46:00.000Z",
        "voteCount": 2,
        "content": "sorry, correction - it only works when the var already was set before; D is the correct answer"
      },
      {
        "date": "2021-03-01T04:15:00.000Z",
        "voteCount": 3,
        "content": "It would not work in this case. We need to set a global variable, not a local one. If you use UpdateContext() in this case, it would create/update a local variable with exactly the same name (on that specific screen). The global variable would keep it's original value and would not be updated."
      },
      {
        "date": "2020-11-16T04:30:00.000Z",
        "voteCount": 4,
        "content": "So, the answer they give is correct then?"
      },
      {
        "date": "2020-11-26T01:34:00.000Z",
        "voteCount": 8,
        "content": "Yes, the ans is correct Set() &amp; Then Back()"
      },
      {
        "date": "2020-10-10T01:49:00.000Z",
        "voteCount": 7,
        "content": "Updatecontext is only for local variables"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82746-exam-pl-100-topic-4-question-4-discussion/",
    "body": "DRAG DROP -<br>You are developing a Power BI report for a company.<br>The Power BI report must display company performance metrics in Power BI service. The report must include three fields in a visualization. The data for the report exists in a dataset.<br>The company will display the report on a large television screen during team meetings.<br>You need to create the report.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04323/0026300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0026400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Select a dataset -<br>Sign in to your Power BI online account, or sign up, if you don't have an account yet.<br>Open the Power BI service.<br>Get some data and open it in report view.<br><br>Box 2: Create a report -<br>Use that data to create visualizations and save it as a report.<br>Box 3: Add a visualization to the report<br>Box 4: Add the report to a new dashboard<br>Visualizations (known as visuals for short) display insights that have been discovered in the data. A Power BI report might have a single page with one visual or it might have pages full of visuals. In the Power BI service, visuals can be pinned from reports to dashboards.<br>Reference:<br>https://docs.microsoft.com/en-us/power-bi/fundamentals/service-get-started https://docs.microsoft.com/en-us/power-bi/visuals/power-bi-report-visualizations",
    "votes": [],
    "comments": [
      {
        "date": "2022-11-11T07:16:00.000Z",
        "voteCount": 11,
        "content": "The image is different from the text of the explanation, don't know wich one is right:\n\nBox 1: Select a dataset\nBox 2: Create a report \nBox 3: Add a visualization to the report\nBox 4: Add the report to a new dashboard"
      },
      {
        "date": "2023-02-16T19:19:00.000Z",
        "voteCount": 2,
        "content": "hmmm, i think they provide the correct answer as they only ask us to create report. so anything related to dashboard is not related to us"
      },
      {
        "date": "2022-10-25T05:34:00.000Z",
        "voteCount": 6,
        "content": "I would go for:\nselect a dataset\ncreate a report\nadd a visualization to the report\nadd data fields to the report"
      },
      {
        "date": "2024-01-11T12:20:00.000Z",
        "voteCount": 1,
        "content": "Select a dataset:\nCreate a report\nAdd data fields to the report:\nAdd the report to a new dashboard:"
      },
      {
        "date": "2023-01-07T23:45:00.000Z",
        "voteCount": 5,
        "content": "-Select a dataset\n-Create a report\n-Add a visualization to the report\n-Add data fields to the report"
      },
      {
        "date": "2022-11-11T08:41:00.000Z",
        "voteCount": 2,
        "content": "I agree with ExamTopic answer!"
      },
      {
        "date": "2022-09-18T22:58:00.000Z",
        "voteCount": 2,
        "content": "i think its correct"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/57310-exam-pl-100-topic-4-question-5-discussion/",
    "body": "DRAG DROP -<br>The company is adding a multi-stream interactive dashboard to a model-driven app.<br>The company requires configuration of the dashboard to filter the table data based on modified accounts over the last month.<br>You need to configure the filters for the model-driven app dashboard.<br>Which configuration should you use? To answer, drag the appropriate configurations to the correct requirements. Each configuration may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04323/0026500001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0026600001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Filter table -<br>Filter Table: The visual filters and global filter attributes are based on this table.<br><br>Box 2: Filter By -<br>Filter By: The column that the time frame filter applies to.<br>Incorrect Answers:<br>✑ Table View: The visual filters are based on this view.<br>✑ Time Frame: The default time frame filter value for the Filter By column.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/configure-interactive-experience-dashboards",
    "votes": [],
    "comments": [
      {
        "date": "2021-07-06T11:12:00.000Z",
        "voteCount": 39,
        "content": "No idea"
      },
      {
        "date": "2021-07-11T08:15:00.000Z",
        "voteCount": 15,
        "content": "Answers are correct - \nComposing custom interactive dashboards - To compose a custom interactive dashboard, the following attributes must be set:\n1. Filter table: The visual filters and global filter attributes are based on this table.\n2. Table View: The visual filters are based on this view.\n3. Filter By: The column that the time frame filter applies to.\n4. Time Frame: The default time frame filter value for the Filter By column."
      },
      {
        "date": "2021-10-07T08:02:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2023-04-23T04:11:00.000Z",
        "voteCount": 1,
        "content": "Correct. Refer to 7th point in link https://learn.microsoft.com/en-us/power-apps/maker/model-driven-apps/configure-interactive-experience-dashboards#create-interactive-experience-dashboards"
      },
      {
        "date": "2022-09-06T07:19:00.000Z",
        "voteCount": 1,
        "content": "Filter Table: The visual filters and global filter attributes are based on this table.\nTable View: The visual filters are based on this view.\nFilter By: The column that the time frame filter applies to.\nTime Frame: The default time frame filter value for the Filter By column."
      },
      {
        "date": "2022-01-27T17:08:00.000Z",
        "voteCount": 1,
        "content": "correct .\nFilter Table: The visual filters and global filter attributes are based on this table.\nTable View: The visual filters are based on this view.\nFilter By: The column that the time frame filter applies to.\nTime Frame: The default time frame filter value for the Filter By column.\nhttps://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/configure-interactive-experience-dashboards#enable-security-roles"
      },
      {
        "date": "2021-07-09T22:28:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/learn/modules/configure-model-driven-apps-customer-engagement-apps/10-streams-tiles"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/57204-exam-pl-100-topic-4-question-6-discussion/",
    "body": "DRAG DROP -<br>You are an app and report maker. You provide visualizations for two departments in an organization.<br>Each department requires department-specific visualizations:<br><img src=\"/assets/media/exam-media/04323/0026700001.png\" class=\"in-exam-image\"><br>You need to create the visualizations.<br>Which chart type should you use? To answer, drag the appropriate chart type to the correct requirements. Each chart type may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04323/0026700002.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0026800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Tag -<br><br>Box 2: Multi-series -<br>Multi-series charts: Charts that display data with multiple series values mapped to a single category value.<br>Incorrect Answers:<br>Multi-series charts include stacked column charts, which vertically display the contribution of each series to a total across categories, and 100% stacked column charts, which compare the percentage that each series contributes to a total across categories.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/developer/model-driven-apps/understand-charts-underlying-data-chart-representation",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-18T23:26:00.000Z",
        "voteCount": 2,
        "content": "correct answer is tag and multi-series"
      },
      {
        "date": "2021-11-23T19:44:00.000Z",
        "voteCount": 1,
        "content": "- Column\n- StackedColumn\n- StackedColumn100\n- Bar\n- StackedBar\n- StackedBar100\n- Area\n- StackedArea\n- StackedArea100\n- Line\n- Pie\n- Funnel\n- Tag\n- Doughnut\n- Point\n\nNo chart type was called 'multi-series'"
      },
      {
        "date": "2021-12-19T06:44:00.000Z",
        "voteCount": 3,
        "content": "so answer is: Tag and Stacked in this case"
      },
      {
        "date": "2022-09-18T23:26:00.000Z",
        "voteCount": 2,
        "content": "no, multi series have them all. Check MS site related to this"
      },
      {
        "date": "2023-10-22T13:16:00.000Z",
        "voteCount": 1,
        "content": "Multi-series charts: Charts that display data with multiple series values mapped to a single category value. Multi-series charts include stacked column charts, which vertically display the contribution of each series to a total across categories, and 100% stacked column charts, which compare the percentage that each series contributes to a total across categories. You can combine different compatible chart types in multi-series charts, for example, column and line, bar and line, and so on.\nhttps://learn.microsoft.com/en-us/power-apps/developer/model-driven-apps/understand-charts-underlying-data-chart-representation"
      },
      {
        "date": "2021-08-20T06:23:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2021-07-12T12:37:00.000Z",
        "voteCount": 4,
        "content": "Tag and Stacked Column are part of the multi-series chart. Hence, they are chart type of Multi-series"
      },
      {
        "date": "2021-07-05T11:35:00.000Z",
        "voteCount": 2,
        "content": "Multi-series is not a chart type.\nAccording to me:\nTag\nStacked-column"
      },
      {
        "date": "2021-07-08T07:13:00.000Z",
        "voteCount": 5,
        "content": "no , multi series is a chart type , given answer seems right \nhttps://docs.microsoft.com/en-us/powerapps/developer/model-driven-apps/understand-charts-underlying-data-chart-representation"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/58161-exam-pl-100-topic-4-question-7-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You are creating a canvas app.<br>You need to automatically detect bicycles in pictures taken with the camera.<br>Proposed solution:<br>✑ Create an Object Detection custom model in AI Builder.<br>✑ Train the model with pictures of bicycles and then publish the trained model.<br>✑ Add the Object Detector control to your canvas app.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "To train an object detection model to recognize your objects, you have to gather images that contain those objects.<br>The first thing you'll do when you create an AI Builder object detection model is to define its domain.<br><br>Upload images -<br>Then Train and publish your object detection model<br>The object detector component takes a photo or loads an image file to do an object detection scan. On a mobile device, the user chooses between taking a photo or selecting one already available in the device user interface. When an image is selected, the component automatically scans it to identify objects.<br>Reference:<br>https://docs.microsoft.com/en-us/ai-builder/prediction-overview https://docs.microsoft.com/en-us/ai-builder/object-detector-component-in-powerapps",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-12-05T08:35:00.000Z",
        "voteCount": 1,
        "content": "isn't suppose to be an approval thing involved when creating a model"
      },
      {
        "date": "2022-11-11T08:55:00.000Z",
        "voteCount": 2,
        "content": "Correct!"
      },
      {
        "date": "2022-01-25T16:59:00.000Z",
        "voteCount": 1,
        "content": "correct 100%"
      },
      {
        "date": "2021-08-20T06:25:00.000Z",
        "voteCount": 4,
        "content": "correct"
      },
      {
        "date": "2021-07-19T03:38:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/ai-builder/get-started-with-object-detection"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/60050-exam-pl-100-topic-4-question-8-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You are creating a canvas app.<br>You need to automatically detect bicycles in pictures taken with the camera.<br>Proposed solution:<br>✑ Create a Prediction custom model in AI Builder.<br>✑ Train the model with pictures of bicycles and then publish the trained model.<br>✑ Add the Object Detector control to your canvas app.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Instead create an Object Detection custom model<br>Note: AI Builder prediction models analyze patterns in historical data that you provide. Prediction models learn to associate those patterns with outcomes. Then, we use the power of AI to detect learned patterns in new data, and use them to predict future outcomes.<br>Reference:<br>https://docs.microsoft.com/en-us/ai-builder/prediction-overview",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-11-11T08:57:00.000Z",
        "voteCount": 1,
        "content": "solution:\n✑ Create an Object Detection custom model in AI Builder.\n✑ Train the model with pictures of bicycles and then publish the trained model.\n✑ Add the Object Detector control to your canvas app."
      },
      {
        "date": "2022-11-11T08:56:00.000Z",
        "voteCount": 1,
        "content": "Prediction Model does not resolve the problem."
      },
      {
        "date": "2021-12-27T19:11:00.000Z",
        "voteCount": 1,
        "content": "Correct."
      },
      {
        "date": "2021-08-20T06:27:00.000Z",
        "voteCount": 2,
        "content": "B is correct. prediction models are not support image"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/60051-exam-pl-100-topic-4-question-9-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You are creating a canvas app.<br>You need to automatically detect bicycles in pictures taken with the camera.<br>Proposed solution:<br>✑ Create a Category Classification custom model in AI Builder.<br>Train the model with pictures of bicycles and then publish the trained model.<br><img src=\"/assets/media/exam-media/04323/0027000005.png\" class=\"in-exam-image\"><br>✑ Add the Object Detector control to your canvas app.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Instead create an Object Detection custom model<br>Reference:<br>https://docs.microsoft.com/en-us/ai-builder/prediction-overview https://docs.microsoft.com/en-us/ai-builder/object-detector-component-in-powerapps",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-08-20T06:28:00.000Z",
        "voteCount": 5,
        "content": "B is correct.\nCategory classification is one of the fundamental natural language processing so no working with image!"
      },
      {
        "date": "2022-11-11T08:58:00.000Z",
        "voteCount": 1,
        "content": "solution:\n✑ Create an Object Detection custom model in AI Builder.\n✑ Train the model with pictures of bicycles and then publish the trained model.\n✑ Add the Object Detector control to your canvas app."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63494-exam-pl-100-topic-4-question-10-discussion/",
    "body": "DRAG DROP -<br>A company uses data from a publicly available web service. You plan to create a tabular report by using Power BI Desktop to visualize data from the web service.<br>The data returned in one column is numeric and must be converted to a corresponding text value. The most up-to-date version of the data must always be used.<br>You need to create the report and make it available only to co-workers.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>NOTE: More than one order of answer choices is correct. You will receive credit for any of the correct orders you select.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04323/0027200001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0027300001.png\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Create a table and input the data from the web service<br>Step 2: Perform data transformation<br>Step 3: Create the visualization.<br><br>Step 4: Publish to AppSource -<br>With Power BI apps, you can create collections of dashboards and reports and publish these collections as apps to your whole organization or to specific people or groups.<br>Business users get your apps in a few different ways:<br>✑ They can find and install your app from Microsoft AppSource.<br>✑ You can send them a direct link.<br>Reference:<br>https://docs.microsoft.com/en-us/power-bi/collaborate-share/service-create-distribute-apps",
    "votes": [],
    "comments": [
      {
        "date": "2021-10-02T19:33:00.000Z",
        "voteCount": 58,
        "content": "Wrong Answer. the key is \"The most up-yo-date version of data must be always be used\" .so the steps are:\n1- Create a connection to the web service.\n2- Perform data transformation.\n3- Create a visualization\n4- Publish to the Power BI Service."
      },
      {
        "date": "2021-12-03T08:57:00.000Z",
        "voteCount": 7,
        "content": "Agreed 100%. The answer is wrong. \n1. Create a connection to web\n2. Create table and input data\n3. Perform data transformation\n4. Create visualization"
      },
      {
        "date": "2022-02-23T09:03:00.000Z",
        "voteCount": 8,
        "content": "To me the correct answers are:\n 1-Create table and input data (the question talks about 'tabular report')\n2- Perform data transformation.\n3- Create a visualization\n4- Publish to the Power BI Service."
      },
      {
        "date": "2022-12-26T03:26:00.000Z",
        "voteCount": 11,
        "content": "Maybe it's worth to roll dices instead of reading these comments, all with different answers"
      },
      {
        "date": "2024-01-11T12:33:00.000Z",
        "voteCount": 1,
        "content": "Create a connection to the web service:\nCreate a table and input the data from the web service\nCreate the visualization\nPublish to the Power BI service"
      },
      {
        "date": "2023-03-13T12:41:00.000Z",
        "voteCount": 2,
        "content": "1- Create a connection to the web service.\n2- Perform data transformation.\n3- Create a visualization\n4- Publish to the Power BI Service.\n\nhttps://learn.microsoft.com/en-us/power-bi/connect-data/desktop-tutorial-importing-and-analyzing-data-from-a-web-page"
      },
      {
        "date": "2023-10-23T08:38:00.000Z",
        "voteCount": 1,
        "content": "Thank you for sharing the link. it brings clarity"
      },
      {
        "date": "2022-12-28T01:01:00.000Z",
        "voteCount": 3,
        "content": "Most updated version could also be taken from 'Create a table and input the data from web service'.\n1-Create table and input data.\n2- Perform data transformation.\n3- Create a visualization\n4- Publish to the Power BI Service."
      },
      {
        "date": "2022-11-11T09:01:00.000Z",
        "voteCount": 1,
        "content": "1. Create a connection to web 2. Create table and input data 3. Perform data transformation 4. Create visualization"
      },
      {
        "date": "2022-11-11T07:27:00.000Z",
        "voteCount": 2,
        "content": "I'm not able to test so I choose \n1- Create a connection to the web service.\n2- Perform data transformation.\n3- Create a visualization\n4- Publish to the Power BI Service.\n\nas my fighter"
      },
      {
        "date": "2022-03-22T12:52:00.000Z",
        "voteCount": 4,
        "content": "I wonder what is the correct sequence...here."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/70353-exam-pl-100-topic-4-question-11-discussion/",
    "body": "DRAG DROP -<br>A call center manager monitors incoming phone calls. The manager analyzes the performance of phone reps by using a custom view. The view contains a custom field named Phone call Duration in Minutes.<br>The call center manager must present an Excel spreadsheet daily to upper management. The spreadsheet must contain the call center performance for further trending analysis and corrective actions.<br>You need to create the spreadsheet.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04323/0027500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0027600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Export the custom view to an Excel dynamic pivot table<br>You can export app data to an Office Excel PivotTable to see patterns and trends in data. An Excel PivotTable is a great way to summarize, analyze, explore, and present your app data.<br>Step 2: Create a pivot table, and then use the Phone Rep field as a category and the Phone call Duration in Minutes as field as series<br>Step 3: Set the formula for phone call duration in minutes to Average and add a pie chart linked to the pivot table<br>Step 4: Save the spreadsheet and upload it back to the system.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/user/export-excel-pivottable",
    "votes": [],
    "comments": [
      {
        "date": "2022-11-16T04:24:00.000Z",
        "voteCount": 28,
        "content": "May I ask how this is PL-100 related?"
      },
      {
        "date": "2022-01-27T20:02:00.000Z",
        "voteCount": 14,
        "content": "Step 1: Export the custom view to an Excel dynamic pivot table\nYou can export app data to an Office Excel PivotTable to see patterns and trends in data. An Excel PivotTable is a great way to summarize, analyze, explore, and present your app data.\nStep 2: Create a pivot table, and then use the Phone Rep field as a category and the Phone call Duration in Minutes as field as series\nStep 3: Set the formula for phone call duration in minutes to Average and add a pie chart linked to the pivot table\nStep 4: Save the spreadsheet and upload it back to the system.\nIs this right answer or the one is picture?"
      },
      {
        "date": "2023-03-21T12:23:00.000Z",
        "voteCount": 1,
        "content": "the answer option is incorrect. \"Create a pivot table, and then use the Phone Rep field as a category and the Phone call Duration in Minutes field as series\" \nSeries is legend. In order to calculate average of call time, Phone call Duration in Minutes field should be used as Values, not series."
      },
      {
        "date": "2023-03-21T12:24:00.000Z",
        "voteCount": 1,
        "content": "So \n\nStep 1: Export the custom view to an Excel dynamic pivot table\nYou can export app data to an Office Excel PivotTable to see patterns and trends in data. An Excel PivotTable is a great way to summarize, analyze, explore, and present your app data.\nStep 2: Create a pivot table, and then use the Phone Rep field as a category and the Phone call Duration in Minutes as field as VALUES\nStep 3: Set the formula for phone call duration in minutes to Average and add a pie chart linked to the pivot table\nStep 4: Save the spreadsheet and upload it back to the system."
      },
      {
        "date": "2023-01-07T23:51:00.000Z",
        "voteCount": 1,
        "content": "The explanation underneath says it correct. Picture doesn't match this unfortunately"
      },
      {
        "date": "2022-11-07T17:19:00.000Z",
        "voteCount": 3,
        "content": "You have to export the data to Excel first, otherwise you’ll be creating a Pivot Table based on a blank spreadsheet."
      },
      {
        "date": "2022-12-30T03:54:00.000Z",
        "voteCount": 3,
        "content": "That's right. So, the right answer should be:\n1. Export ... to an Excel dynamic spreadsheet\n2. Create a pivot table, … Rep field as a service\n3. Set the formula …\n4. Save the spreadsheet …"
      },
      {
        "date": "2022-01-20T13:04:00.000Z",
        "voteCount": 2,
        "content": "Based on the explanation, the steps 2 &amp; 3 should swap places:\n1. Create a pivot table, and use the Phone Rep field as...\n2. Export the custom view to Excel dynamic pivot table\n3. Set the formula for phone call duration...\n4. Save the spreadsheet and upload back to the system"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80628-exam-pl-100-topic-4-question-12-discussion/",
    "body": "HOTSPOT -<br>The managers in an organization use a model-driven app. The app should display only one dashboard named Corporate Data.<br>The managers observe that several dashboards are displayed.<br><img src=\"/assets/media/exam-media/04323/0027700001.jpg\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that answers each question based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04323/0027800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0027800002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Open the model-driven app in the app designer.<br>1. On the app designer canvas, select the Dashboards tile.<br>On the app designer canvas, the right pane shows dashboards that are available in the default solution.<br>2. Clearing the corresponding check box.<br>Box 2: Open the site map in the sitemap designer and delete the Ideas dashboard from the Results group<br>Site maps define the manner by which users move between tables in a model-driven app.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/add-edit-app-components",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-21T15:43:00.000Z",
        "voteCount": 1,
        "content": "D. Open solution in classic interface and delete the dashboards from the solutions or from the environment. Deleting dashboards from App Designer won't get rid of the list of dashboards in the current solution or environments. \nB is correct."
      },
      {
        "date": "2022-12-30T04:00:00.000Z",
        "voteCount": 2,
        "content": "Yes correct, go the old interface to remove dashboards from the app. This is still not possible in the new UI at this moment."
      },
      {
        "date": "2022-11-11T09:16:00.000Z",
        "voteCount": 2,
        "content": "Correct!!!"
      },
      {
        "date": "2022-09-06T07:38:00.000Z",
        "voteCount": 4,
        "content": "Correct answer."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/70721-exam-pl-100-topic-4-question-13-discussion/",
    "body": "Engineers in an organization plan to attend an international product show.<br>The engineers must be able to capture information about presented products based on personal assessment and interest. The engineers must capture the information by taking pictures of the booth, brochures, and other product-specific materials.<br>You need to provide a button flow to streamline the process.<br>Which two AI Builder models should you use? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLanguage detection\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSentiment analysis",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCategory classification",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBusiness card reader",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tForm processing\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AE",
        "count": 8,
        "isMostVoted": true
      },
      {
        "answer": "BE",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "AD",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-19T01:23:00.000Z",
        "voteCount": 7,
        "content": "correct"
      },
      {
        "date": "2024-02-27T07:52:00.000Z",
        "voteCount": 1,
        "content": "Am I the only one who thinks that sentiment analysis is needed for\"The engineers must be able to capture information about presented products based on personal assessment and interest.\""
      },
      {
        "date": "2024-01-24T07:41:00.000Z",
        "voteCount": 1,
        "content": "why not E? if The engineers must be able to capture information about presented products based on personal assessment and interest.???"
      },
      {
        "date": "2024-01-12T12:34:00.000Z",
        "voteCount": 1,
        "content": "I vote for D. Business card reader and \nE. Form processing Most Voted\nLanguage detection is typically used to identify the language in which a given text is written"
      },
      {
        "date": "2023-12-25T14:50:00.000Z",
        "voteCount": 1,
        "content": "For obvious reasons"
      },
      {
        "date": "2023-09-22T07:51:00.000Z",
        "voteCount": 3,
        "content": "So.....\nA) Language - I think its a stretch to say you need the language model but considering these are our only options and we need two, I can understand it being correct because it is an International Convention.\nD) Business Card Reader - by process of elimination, they are at a convention and likely meeting lots of people, the Business Card Reader would allow them to do that faster.\n\nTHE REASON IT CANT BE E is because Form Processing REQUIRES the form to be uniform and booths, brochures, etc. are anything but uniform.  Form processing is for extracting info from receipts/tax docs. Because of this, I think its more reasonable to say they would use Business Card Reader."
      },
      {
        "date": "2023-03-21T15:50:00.000Z",
        "voteCount": 1,
        "content": "A to detect language since this is international show. E for processing brochures and booth pictures. Business card readers are just for reading business cards"
      },
      {
        "date": "2023-01-26T04:30:00.000Z",
        "voteCount": 1,
        "content": "What about DE? language recognition does not make sense but form processing is better for retrieve information from a written text"
      },
      {
        "date": "2023-01-07T23:53:00.000Z",
        "voteCount": 1,
        "content": "A &amp; D look correct"
      },
      {
        "date": "2022-11-11T07:45:00.000Z",
        "voteCount": 3,
        "content": "the case scenario it's a non sense why do I care to ue the language recognition? don't you see that the brochure is in English, Italian or whatever? and brochures are not business card so what's the point? and they are not a standard form too, so what's the right answer?"
      },
      {
        "date": "2022-01-28T01:54:00.000Z",
        "voteCount": 3,
        "content": "I think A E ?\nhttps://docs.microsoft.com/en-us/ai-builder/form-processing-model-requirements"
      },
      {
        "date": "2022-02-06T06:42:00.000Z",
        "voteCount": 8,
        "content": "Finally AD, as there is probably no standard document on the show"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82435-exam-pl-100-topic-4-question-14-discussion/",
    "body": "A company uses Microsoft PowerPoint and Power BI to deliver presentations for company meetings. You have a Power BI visualization on a dashboard. The visualization displays sales summaries by product category.<br>You need to display the visualization on a PowerPoint slide. The slide must also include the last time that the visualization was refreshed, and a link back to the original visualization.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Power BI visual and then select Export data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExpand the visual to full screen and use the print screen hot key.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect Export then PowerPoint from the Power BI dashboard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Power BI visual and then select Copy visual as image.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Windows Snipping tool."
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 7,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-16T10:01:00.000Z",
        "voteCount": 6,
        "content": "C. Select Export then PowerPoint from the Power BI dashboard.\n\nhttps://docs.microsoft.com/en-us/power-bi/collaborate-share/end-user-powerpoint"
      },
      {
        "date": "2022-09-19T01:25:00.000Z",
        "voteCount": 3,
        "content": "\\yeah, C is correct"
      },
      {
        "date": "2023-03-11T12:07:00.000Z",
        "voteCount": 1,
        "content": "C is incorrect. it doesn't display time last refreshed. D is the Right answer"
      },
      {
        "date": "2023-03-11T12:08:00.000Z",
        "voteCount": 1,
        "content": "as it shows last date time and link"
      },
      {
        "date": "2022-11-11T07:49:00.000Z",
        "voteCount": 5,
        "content": "D seems right to me https://learn.microsoft.com/en-us/power-bi/visuals/power-bi-visualization-copy-paste#copy-a-visual-as-an-image-to-your-clipboard"
      },
      {
        "date": "2023-10-23T09:27:00.000Z",
        "voteCount": 1,
        "content": "For me, I selected the visual, then I exported-&gt;PowerPoint -&gt;choosing the 'Embed and Image' option. This gave me the auto-generated report in PowerPoint with the link and the information that was last refreshed. I don't know which one to choose, C, or D?"
      },
      {
        "date": "2023-07-27T03:48:00.000Z",
        "voteCount": 1,
        "content": "It is indeed D, just tried it. x"
      },
      {
        "date": "2023-03-07T00:32:00.000Z",
        "voteCount": 1,
        "content": "D is correct. Not C, because you can't export a dashboard."
      },
      {
        "date": "2023-01-27T02:10:00.000Z",
        "voteCount": 1,
        "content": "Even toguht I feel like C and D might both work I think MS is looking for answer C here because when you export to Powerpoint \"The report is static; the slides retain the state of the report at the time of export.\""
      },
      {
        "date": "2023-01-27T02:11:00.000Z",
        "voteCount": 1,
        "content": "*Even though"
      },
      {
        "date": "2023-01-17T13:26:00.000Z",
        "voteCount": 2,
        "content": "just tried it, D it is"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/86914-exam-pl-100-topic-4-question-15-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You are creating a canvas app.<br>You need to automatically detect bicycles in pictures taken with the camera.<br>Proposed solution:<br>✑ Create an Object Detection custom model in AI Builder.<br>✑ Add the Object Detector control to your canvas app.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Instead: Proposed solution:<br>ג€¢    Create an Object Detection custom model in AI Builder.<br>ג€¢    Train the model with pictures of bicycles and then publish the trained model.<br>ג€¢    Add the Object Detector control to your canvas app.<br>Note: To train an object detection model to recognize your objects, you have to gather images that contain those objects.<br>The first thing you'll do when you create an AI Builder object detection model is to define its domain.<br><br>Upload images -<br>Then Train and publish your object detection model<br>The object detector component takes a photo or loads an image file to do an object detection scan. On a mobile device, the user chooses between taking a photo or selecting one already available in the device user interface. When an image is selected, the component automatically scans it to identify objects.<br>Reference:<br>https://docs.microsoft.com/en-us/ai-builder/prediction-overview https://docs.microsoft.com/en-us/ai-builder/object-detector-component-in-powerapps",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-23T09:39:00.000Z",
        "voteCount": 2,
        "content": "Similar with one previous question \"Exam PL-100 topic 4 question 7 discussion\" but this one does not include the step \"Train the model with pictures of bicycles and then publish the trained model.\" for that matter, B is correct answer. Object detection model should be trained and published before adding control to the canvas app"
      },
      {
        "date": "2022-11-11T09:18:00.000Z",
        "voteCount": 1,
        "content": "B is the answer!"
      },
      {
        "date": "2022-11-03T01:41:00.000Z",
        "voteCount": 1,
        "content": "thats is correct 100%"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/101375-exam-pl-100-topic-4-question-16-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You are creating a canvas app.<br><br>You need to automatically detect bicycles in pictures taken with the camera.<br><br>Proposed solution:<br><br>•\tCreate an Object Detection pre-built model in AI Builder.<br>•\tAdd the Object Detector control to your canvas app.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 4,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-03-12T11:06:00.000Z",
        "voteCount": 4,
        "content": "I think B as there is no pre-build Object Detection model\nhttps://learn.microsoft.com/en-us/ai-builder/object-detection-overview"
      },
      {
        "date": "2023-04-25T02:14:00.000Z",
        "voteCount": 1,
        "content": "Yes. B is the right answer. https://learn.microsoft.com/en-us/ai-builder/prebuilt-overview has the list of pre-built AI models and object detection is not in that list. Cross checked in make.powerautomate.com -&gt; AI builder -&gt; Explore -&gt; All as well."
      },
      {
        "date": "2023-03-02T12:11:00.000Z",
        "voteCount": 1,
        "content": "It is a pre-built model, so I vote for A (custom model needs to be trained)"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/114547-exam-pl-100-topic-4-question-17-discussion/",
    "body": "You are designing an interactive report for a model-driven app. The report will use more than five million records. The query that retrieves data for the report requires more than five minutes to complete.<br><br>You need to create the report.<br><br>Which option should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower BI\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStandard dashboard",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInteractive dashboard"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-18T11:33:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2023-07-27T03:52:00.000Z",
        "voteCount": 1,
        "content": "A is correct"
      },
      {
        "date": "2023-07-08T20:46:00.000Z",
        "voteCount": 2,
        "content": "That's correct. Power BI Reports are highly interactive and is suitable for handling large datasets and queries that take more than five minutes to complete."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/103544-exam-pl-100-topic-4-question-18-discussion/",
    "body": "HOTSPOT<br> -<br><br>The customer service team of a company uses a model-driven app to log customer interactions.<br><br>The app contains two tables: one to track customer interactions and one to track products.<br><br>The team requires an interactive dashboard to display the activities. The dashboard must display the products that have the most complaints. Each chart must display the associated data.<br><br>You need to create the dashboard.<br><br>Which features should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-100/image304.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-100/image305.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-01-24T08:37:00.000Z",
        "voteCount": 1,
        "content": "Show Chart Only"
      },
      {
        "date": "2023-07-30T23:26:00.000Z",
        "voteCount": 4,
        "content": "For the second requirement I would choose 'Show Chart Only'.\nIf you uncheck that option it will display the chart and its associated data according to this link https://learn.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/set-properties-chart-list-included-dashboard?view=op-9-1."
      },
      {
        "date": "2023-12-25T15:36:00.000Z",
        "voteCount": 1,
        "content": "wrong it says, Clear this check box if you want to display the chart and its associated data.\n\nclear not tick \n\nI believe  it is correct"
      },
      {
        "date": "2023-12-25T15:39:00.000Z",
        "voteCount": 1,
        "content": "Default will display the data thus displaying the associated data"
      },
      {
        "date": "2023-03-21T18:09:00.000Z",
        "voteCount": 1,
        "content": "Answer is kind of vague, especially 2nd one, in terms of the data?"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/102348-exam-pl-100-topic-4-question-19-discussion/",
    "body": "DRAG DROP<br> -<br><br>A commercial bakery uses an inventory system to track ingredients consumed in their production line. The workers use iPads to interact with the system and reserve the ingredients for the next batch. Data from the system is extracted as a .csv file.<br><br>You need to create a Power BI report from the extracted data by using only an iPad.<br><br>Which five actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/pl-100/image306.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-100/image307.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-25T09:23:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      },
      {
        "date": "2023-03-11T12:38:00.000Z",
        "voteCount": 1,
        "content": "agreed"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104673-exam-pl-100-topic-4-question-20-discussion/",
    "body": "DRAG DROP<br> -<br><br>You create a canvas app. You run App checker to validate the app.<br><br>App checker returns error results.<br><br>You need to locate where the errors occur.<br><br>Which areas should you review? To answer, drag the appropriate areas to the correct error messages. Each area may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-100/image333.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-100/image334.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-23T10:09:00.000Z",
        "voteCount": 10,
        "content": "what the Hell are the suggested answers?"
      },
      {
        "date": "2023-04-13T01:51:00.000Z",
        "voteCount": 5,
        "content": "function\nformula\naccessibility"
      },
      {
        "date": "2023-07-30T23:35:00.000Z",
        "voteCount": 3,
        "content": "There is NO 'Function' are in the AppChecker so the first one is also 'Formula'."
      },
      {
        "date": "2023-09-19T22:34:00.000Z",
        "voteCount": 1,
        "content": "Answers are correct. Check this link https://powerapps.microsoft.com/en-us/blog/new-app-checker-helps-you-fix-errors-and-make-accessible-apps/"
      },
      {
        "date": "2023-04-29T06:16:00.000Z",
        "voteCount": 4,
        "content": "there is no function area in canvas"
      },
      {
        "date": "2023-04-29T00:44:00.000Z",
        "voteCount": 5,
        "content": "Formula\nFormula\nAccessibility"
      },
      {
        "date": "2023-03-31T18:35:00.000Z",
        "voteCount": 5,
        "content": "Formula\nFormula\nAccessibility"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121818-exam-pl-100-topic-4-question-21-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>A company uses Microsoft Power Apps.<br><br>You need to create a canvas app to display a Microsoft Power BI report. The report must use the context of a selected record in the app. Data in a Power BI control must be filtered to display the context of the selected record.<br><br>You need to propose the right solution.<br><br>Solution: Add Power Apps to Power BI using Power Apps for Power BI visualization.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-03-20T07:02:00.000Z",
        "voteCount": 1,
        "content": "I agree with ImissOOP. It should be the other way around."
      },
      {
        "date": "2024-01-02T17:24:00.000Z",
        "voteCount": 1,
        "content": "Power BI allows you to embed Power Apps directly within a Power BI report using the Power Apps visualization. This means you can create a canvas app that is tightly integrated into the Power BI report."
      },
      {
        "date": "2023-12-25T16:03:00.000Z",
        "voteCount": 2,
        "content": "it should be the other way around add power bi to power apps"
      },
      {
        "date": "2023-09-29T05:50:00.000Z",
        "voteCount": 1,
        "content": "The Power BI report and the instance of Power Apps Studio that was launched share a live data connection. While they're both open, you can filter or change the data in your report to see the updated data reflect immediately in your app in Power Apps Studio."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121548-exam-pl-100-topic-4-question-22-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>A company uses Microsoft Power Apps.<br><br>You need to create a canvas app to display a Microsoft Power BI report. The report must use the context of a selected record in the app. Data in a Power BI control must be filtered to display the context of the selected record.<br><br>You need to propose the right solution.<br><br>Solution: Append filter parameter to Power BI report URL.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-12-01T10:42:00.000Z",
        "voteCount": 1,
        "content": "This should be yes. We do this all the time\n\nhttps://learn.microsoft.com/en-us/power-bi/collaborate-share/service-url-filters"
      },
      {
        "date": "2023-12-05T18:56:00.000Z",
        "voteCount": 1,
        "content": "The key is \"The report must use the context of a selected record in the app\" which would entail clicking and using something like Power Apps visual for Power BI instead of editing a url"
      },
      {
        "date": "2023-09-27T05:20:00.000Z",
        "voteCount": 1,
        "content": "Correct. \nFiltering in the URL would make it static, and not based on selected by user I guess."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121319-exam-pl-100-topic-4-question-23-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>A company uses Microsoft Power Apps.<br><br>You need to create a canvas app to display a Microsoft Power BI report. The report must use the context of a selected record in the app. Data in a Power BI control must be filtered to display the context of the selected record.<br><br>You need to propose the right solution.<br><br>Solution: Add a slicer to a Power BI element on the screen where data is selected.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-03-20T08:36:00.000Z",
        "voteCount": 1,
        "content": "It doesn't meet the goal."
      },
      {
        "date": "2024-01-14T13:43:00.000Z",
        "voteCount": 1,
        "content": "No,\nWhile adding a slicer in Power BI can help filter data within the Power BI report itself, it does not directly provide a way to pass the context of a selected record from the canvas app to the Power BI report"
      },
      {
        "date": "2023-12-05T19:08:00.000Z",
        "voteCount": 1,
        "content": "You are adding a slicer to the PowerBi component which was added to the power app"
      },
      {
        "date": "2023-12-01T10:43:00.000Z",
        "voteCount": 1,
        "content": "This is a No.\n\nSlicers are part of power bi. Not from the power app itself"
      },
      {
        "date": "2023-09-24T09:00:00.000Z",
        "voteCount": 1,
        "content": "A. Yes is the correct answer\nSlicer Usage: Slicers in Power BI are used to filter data within a Power BI report. They can be used to filter data based on selected values, but they typically operate within the Power BI report itself. If you want to filter data in the Power BI report based on the context of a selected record in your canvas app, you would need to pass the selected record's information to the Power BI report, and the report should be configured to use that information for filtering."
      },
      {
        "date": "2023-11-27T20:36:00.000Z",
        "voteCount": 1,
        "content": "A slicer isn't a Canvas app, though, which is what the question is asking for."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/116589-exam-pl-100-topic-4-question-24-discussion/",
    "body": "You create a Microsoft Power BI report with multiple visualizations displayed together.<br><br>The report must be available to users in all security roles.<br><br>You need to display the report in a model-driven app.<br><br>What should you embed?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower BI dashboard on a model-driven form.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower BI tile on a model-driven form.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower BI dashboard on a model-driven dashboard.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower BI tile on a model-driven dashboard."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-27T04:12:00.000Z",
        "voteCount": 2,
        "content": "I think its D actually"
      },
      {
        "date": "2023-07-30T23:46:00.000Z",
        "voteCount": 4,
        "content": "It's C because the requirement is to have 'multiple'  visualizations displayed together.\nA Power BI tile as answer D suggests is A 'single' visualization on a dashboard."
      },
      {
        "date": "2023-12-20T13:38:00.000Z",
        "voteCount": 1,
        "content": "Yes I agree with C."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/116867-exam-pl-100-topic-4-question-25-discussion/",
    "body": "HOTSPOT<br> -<br><br>A state planning department stores demographic data in a local SQL Server database.<br><br>The department uses a local report server to analyze the data for land development purposes.<br><br>You need to create a visual to display the demographic data.<br><br>Which component should you use? To answer, select the appropriate option in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-100/image349.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-100/image350.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-12-25T16:45:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/power-bi/visuals/power-bi-visualizations-arcgis\n\nis an option latitude and longitude  city is mandatory in this case treated as the location"
      },
      {
        "date": "2023-12-25T16:46:00.000Z",
        "voteCount": 1,
        "content": "*latitude and longitude is an option \n\ntypo"
      },
      {
        "date": "2023-12-01T10:56:00.000Z",
        "voteCount": 1,
        "content": "This is a local report server sets. But anyways arcgis uses longitude and latitude coordinates\n\nhttps://learn.microsoft.com/en-us/sql/reporting-services/report-design/maps-report-builder-and-ssrs?view=sql-server-ver16"
      },
      {
        "date": "2023-09-20T03:06:00.000Z",
        "voteCount": 3,
        "content": "https://learn.microsoft.com/en-us/power-bi/visuals/power-bi-visualizations-arcgis saying for demographic data"
      },
      {
        "date": "2023-07-30T23:58:00.000Z",
        "voteCount": 2,
        "content": "I would go for 'Filled Maps' and 'Location' but not quite sure.\n\nhttps://learn.microsoft.com/en-us/power-bi/visuals/power-bi-visualization-filled-maps-choropleths?tabs=powerbi-desktop"
      },
      {
        "date": "2023-12-20T13:43:00.000Z",
        "voteCount": 1,
        "content": "that's incorrect. It's arcgis for demographic data.\n\nAnalyze data based on spatial qualities. Identify a location in relation to other critical variables. And add demographic and reference layers, such as income, population, or weather, included free with ArcGIS.\nhttps://powerbi.microsoft.com/en-us/power-bi-esri-arcgis/"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/116869-exam-pl-100-topic-4-question-26-discussion/",
    "body": "HOTSPOT<br> -<br><br>You use Microsoft Power BI Desktop to create a report.<br><br>Users note that column headings are confusing.<br><br>You need to modify some columns and delete other columns.<br><br>Which tool should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-100/image351.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-100/image352.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-31T00:00:00.000Z",
        "voteCount": 1,
        "content": "Seems correct, although 'Fields pane' is now called 'Data' in Power BI Desktop."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142003-exam-pl-100-topic-4-question-27-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You create a custom table as part of a solution in the development environment. You deploy major version solutions as managed solutions to production. The organization does not allow new solutions to be created in the production environment.<br><br>When a minor update is made to a column length, users cannot enter entire values.<br><br>You need to allow users to enter entire values in the column.<br><br>Solution: Update the column length in the development environment. Export the solution as a managed solution. Import the solution into production.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-06T01:44:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142004-exam-pl-100-topic-4-question-28-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You create a custom table as part of a solution in the development environment. You deploy major version solutions as managed solutions to production. The organization does not allow new solutions to be created in the production environment.<br><br>When a minor update is made to a column length, users cannot enter entire values.<br><br>You need to allow users to enter entire values in the column.<br><br>Solution: Update the column length in the production environment.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-06T01:44:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/129739-exam-pl-100-topic-4-question-29-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>A company uses Microsoft Power Apps.<br><br>You need to create a canvas app to display a Microsoft Power BI report. The report must use the context of a selected record in the app. Data in a Power BI control must be filtered to display the context of the selected record.<br><br>You need to propose the right solution.<br><br>Solution: Define a tile in Power BI element.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-12-29T12:05:00.000Z",
        "voteCount": 2,
        "content": "Answer is No!\nDefining a tile in Power BI is a step in the Power BI report creation process, but it doesn't directly address the integration with Power Apps or the requirement to use the context of a selected record for filtering. The key is to use parameters or filters in the Power BI report and set them dynamically based on the selected record in the Power App."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "4"
  }
]