[
  {
    "topic": 9,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/5192-exam-mb-200-topic-9-question-1-discussion/",
    "body": "You need to move changes to the production environment.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImport an unmanaged solution with a default publisher.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImport a managed solution with a default publisher.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImport a managed solution with a custom publisher.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImport an unmanaged solution with a custom publisher."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-14T18:47:00.000Z",
        "voteCount": 26,
        "content": "This should be unmanaged solution with a custom publisher."
      },
      {
        "date": "2019-10-02T04:17:00.000Z",
        "voteCount": 1,
        "content": "You're right!"
      },
      {
        "date": "2019-10-18T08:41:00.000Z",
        "voteCount": 22,
        "content": "Microsoft advocates for Managed Solutions to Production instances. \n\nThere are two types of Dynamics 365 Customer Engagement (on-premises) solutions: managed and unmanaged. A managed solution is a completed solution that is intended to be distributed and installed. An unmanaged solution is one that is still under development or isn’t intended to be distributed. When the unmanaged solution is complete and you want to distribute it, export it and package it as a managed solution.\n\nI would say the answer is managed with a custom publisher"
      },
      {
        "date": "2019-11-08T01:04:00.000Z",
        "voteCount": 5,
        "content": "The key for me is \"or isn’t intended to be distributed\". This is a custom solution for Lamna Healthcare and is not going to be distributed to other environments"
      },
      {
        "date": "2020-03-20T03:58:00.000Z",
        "voteCount": 7,
        "content": "Healthcare keeps all components in the default solution but maintains a unique prefix. Dynamics is a non-code environment. This detail indicates that you have to use a managed solution with a custom publisher. C is the correct answer."
      },
      {
        "date": "2020-05-30T08:03:00.000Z",
        "voteCount": 5,
        "content": "for me that indicates, that it must be unmanaged. Because it has to stay in the default solution, which you can only accomplish by importing an unmanaged solution."
      },
      {
        "date": "2020-08-21T09:11:00.000Z",
        "voteCount": 3,
        "content": "Default solution cant be exported. The components of the lamna healthcare would be kept in an unmanaged solution with custom publisher (with unique prefix)in Dev environment. But it should be exported as managed which can then imported as managed in the PROD"
      },
      {
        "date": "2021-06-19T08:37:00.000Z",
        "voteCount": 1,
        "content": "It's A - Import an UNMANAGED solution with a DEFAULT publisher\n\nThey use default solution - unmanaged (because default solution can be exported only as unmanaged)\nThey have unique prefix - DEFAULT publisher (You will ask why not custom? Because they use default solution - so default publisher as well. You can change prefix for default publisher, there is no need to have custom publisher to have unique prefix :))"
      },
      {
        "date": "2020-01-09T00:26:00.000Z",
        "voteCount": 14,
        "content": "I think it should be A. You can't change the Publisher on Default Solution, however you can change the Prefix on the Default Publisher record itself."
      },
      {
        "date": "2020-02-05T01:22:00.000Z",
        "voteCount": 3,
        "content": "You are right HABIBI\nDefault Solution --&gt; Unmanaged\nDefault Solution --&gt; Default publisher"
      },
      {
        "date": "2021-06-19T08:38:00.000Z",
        "voteCount": 1,
        "content": "Correct. People think it needs to be custom publisher to have unique prefix but it not correct. They use default solution, so default publisher as well. Prefix can be changed for default solution, check: https://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/change-solution-publisher-prefix?view=op-9-1"
      },
      {
        "date": "2020-12-21T20:43:00.000Z",
        "voteCount": 1,
        "content": "C. Import a managed solution with a custom publisher."
      },
      {
        "date": "2020-12-21T20:37:00.000Z",
        "voteCount": 1,
        "content": "The Default Solution can’t be exported. Therefore, you can’t distribute the Default Solution to another environment.\nhttps://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/use-solutions-for-your-customizations"
      },
      {
        "date": "2020-12-17T11:03:00.000Z",
        "voteCount": 2,
        "content": "Default Solution --&gt; Unmanaged\nDefault Solution --&gt; Default publisher"
      },
      {
        "date": "2020-08-21T09:14:00.000Z",
        "voteCount": 1,
        "content": "Default solution cannot be exported. For exporting to PROD , the components of the lamna healthcare would be kept in an unmanaged solution with custom publisher (with unique prefix)in Dev environment. But it should be exported as managed which can then imported as managed in the PROD. \nI would say the answer is managed with a custom publisher"
      },
      {
        "date": "2020-07-05T11:14:00.000Z",
        "voteCount": 3,
        "content": "You can't change the Publisher on Default Solution, and you can't export defaut solution as managed =­&gt; the answer is A : Import an unmanaged solution with a default publisher"
      },
      {
        "date": "2020-06-29T00:20:00.000Z",
        "voteCount": 3,
        "content": "You can change the prefix of the default solution so it is A, Unmanaged (since she is working with the default solution) and default publisher (since she uses the default solution, she has changed the default prefix)."
      },
      {
        "date": "2020-06-04T06:17:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/solutions-overview\n\nThis also says managed are only used for imports into other organisations, which isn't the case here so it would be unmanaged default solution"
      },
      {
        "date": "2020-05-27T05:57:00.000Z",
        "voteCount": 1,
        "content": "Very interesting, Ive never seen anyone using managed solutions for deployments to Production of any iterated customizations BUT on a newly updated documentation Microsoft is suggesting to use Managed. I find this odd....\n\"In the Package Type step, you must choose whether to export the solution as an Unmanaged or Managed solution. Unmanaged solutions are intended to be used to transport configuration from one development environment to another or to check into your source control system. Managed solutions are intented to be used to transport configuration to all other environments including test and production environments.\""
      },
      {
        "date": "2020-03-28T17:07:00.000Z",
        "voteCount": 3,
        "content": "You can't change the publisher for the default solution. You also can't export the default solution as a managed solution. So it has to be A."
      },
      {
        "date": "2020-04-04T22:06:00.000Z",
        "voteCount": 1,
        "content": "You need to move changes to the production environment. on production recommendation is managed solution"
      },
      {
        "date": "2020-06-06T02:51:00.000Z",
        "voteCount": 1,
        "content": "I would go for this option again I am not able to export default solution also"
      },
      {
        "date": "2020-03-12T02:33:00.000Z",
        "voteCount": 2,
        "content": "Why not A? The Default solution can be exported and it is forced as an unmanaged solution. For the publisher, you cannot change the default publisher, but you can change its prefix, that would fit the requirement. That would be an easy way to handle all of this, you will be ensured that the production = sandbox (no missing component, no unmanaged local customization in production would be kept). Am I wrong?"
      },
      {
        "date": "2020-02-14T06:46:00.000Z",
        "voteCount": 1,
        "content": "I think this is D. Keeping all components in default solution means when moving changes to production, you can only export default solution and install default solution as an unmanaged solution file. You cannot change publisher for default solution and prefix is only changed by clicked the publisher and changing that!"
      },
      {
        "date": "2020-02-09T14:36:00.000Z",
        "voteCount": 3,
        "content": "Default solution (as given in the requirement) can't be exported as managed! So the answer is unmanaged solution.\n\nNow I checked it now.. and it's possible to change prefix for the default publisher to whatever you want, though it's not possible to change the default publisher itself for the default solution.. So the question must have more clarity and is ambiguos.\nBeing forced to choose one, I would have chosen \"unmanaged solution with a custom publisher.\".. as proposed by JNSNW"
      },
      {
        "date": "2020-02-02T11:20:00.000Z",
        "voteCount": 2,
        "content": "Why not Managed solution with a default publisher ? Managed solution is completed solution for install, and the customer hold everything inside of default solution...Any suggestion ?"
      },
      {
        "date": "2020-02-02T11:23:00.000Z",
        "voteCount": 2,
        "content": "Sorry, inside of default publisher."
      },
      {
        "date": "2020-01-30T01:13:00.000Z",
        "voteCount": 3,
        "content": "“Install an unmanaged solution only if you want to add all the components to your default solution and overwrite any existing customizations.”\nhttps://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/solutions-overview\nSo I vote for C"
      },
      {
        "date": "2019-12-04T21:10:00.000Z",
        "voteCount": 7,
        "content": "I will go for D. Import an unmanaged solution with a custom publisher."
      },
      {
        "date": "2019-12-28T18:10:00.000Z",
        "voteCount": 4,
        "content": "I don't believe the custom publisher is needed (see my reply to AlexR above)."
      }
    ],
    "examNameCode": "mb-200",
    "topicNumber": "9"
  }
]