[
  {
    "topic": 8,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19366-exam-ms-200-topic-8-question-3-discussion/",
    "body": "HOTSPOT -<br>A user named User1 left the organization 10 days ago.<br>You need to purge all the email data of User1.<br>How should you complete the command? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03084/0013200001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03084/0013300001.png\" class=\"in-exam-image\">",
    "answerDescription": "References:<br>https://docs.microsoft.com/en-us/exchange/recipients/disconnected-mailboxes/permanently-delete-mailboxes?view=exchserver-2019<br>Manage Recipients and Devices",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-18T05:38:00.000Z",
        "voteCount": 1,
        "content": "The answer (SoftDeleted) is correct regarding following comment:\nUser accounts are deleted from Active Directory the day after a user's final date of employment.\n\nSo for exchange it is softdeleted :-)"
      },
      {
        "date": "2020-05-18T22:20:00.000Z",
        "voteCount": 4,
        "content": "Disabled is correct, when you delete the user account from AD, mailbox is disconnected and marked as Disabled.\nSoft-deleted mailboxes: When a mailbox is moved to a different mailbox database, Exchange doesn't fully delete the mailbox from the source mailbox database when the move is complete. Instead, the mailbox in the source mailbox database is switched to a soft-deleted state. Like disabled mailboxes, soft-deleted mailboxes are retained in the source database either until the deleted mailbox retention period expires or until the Remove-StoreMailbox cmdlet is used to purge the mailbox."
      },
      {
        "date": "2020-04-30T05:32:00.000Z",
        "voteCount": 3,
        "content": "This is wrong. State of the mailbox is disabled. Soft Deleted is for mailboxes that are moved across databases, here it left the company and the account has been deleted. Account deletions are marked as disabled in database"
      }
    ],
    "examNameCode": "ms-200",
    "topicNumber": "8"
  }
]