[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/45460-exam-az-200-topic-1-question-7-discussion/",
    "body": "HOTSPOT -<br>A company provides web app hosting services for customers.<br>You have a set of App Service Plans available to deploy resources for new projects. The available service tiers are shown in the Service Tiers exhibit. (Click the<br>Service Tiers tab.)<br><img src=\"/assets/media/exam-media/02521/0001300001.png\" class=\"in-exam-image\"><br>You must provision resources for the projects as shown in the Projects exhibit. (Click the Projects tab.)<br><img src=\"/assets/media/exam-media/02521/0001400001.png\" class=\"in-exam-image\"><br>The AdventureWorks project requires the use of deployment slots as shown in the Deployment Slots exhibit. (Click the Deployment Slots tab.)<br><img src=\"/assets/media/exam-media/02521/0001400002.jpg\" class=\"in-exam-image\"><br>You need to determine where to deploy resources for each project.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02521/0001500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02521/0001500002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: No -<br>AdventureWorks Cycles should use the dedicated service plan. The Dedicated service tier consists of S1 Standard instance, and the P1 premium instance.<br>Note: When you deploy your web app, web app on Linux, mobile back end, and API app to App Service, you can deploy to a separate deployment slot instead of the default production slot when running in the Standard, Premium, or Isolated App Service plan tier.<br><br>Box 2: Yes -<br>The prototype plan can be used for Research.<br>The Prototype Service consists F1 (free) instance, and D1 (shared instance)<br><br>Box 3: No -<br>Coho Vineyeard can be hosted on the Shared service tier.<br>The Shared service tier consists of the B1 and B2 basic instances.<br>References:<br>https://azure.microsoft.com/en-us/pricing/details/app-service/windows/",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-22T18:55:00.000Z",
        "voteCount": 1,
        "content": "hhhhhhh"
      }
    ],
    "examNameCode": "az-200",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37230-exam-az-200-topic-1-question-8-discussion/",
    "body": "Each year, a company consolidates manufacturing data for a year and stores the data in a single blob within a Blob container. Data from previous years is stored in the same storage account in the same container.<br>The company has a General Purpose v2 (GPv2) Azure Storage account with a Blob container named Compliance-data. Data from previous years is retained for compliance reasons but it is infrequently accesses.<br>The current solution is becoming costly. You observe that users accidentally modify compliance data.<br>You need to reduce costs and preserve the compliance data.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Azure Portal, go to configuration settings of each blob in the Compliance-data container and set Access tier to Archive.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet up another GPv2 storage account and copy data to the new storage account.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Azure Portal, go to configuration settings for each blob in the Compliance-data container and set the Access tier to Cool.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure another GPv2 cold storage account and copy data to the new storage account."
    ],
    "answer": "C",
    "answerDescription": "Cool storage is optimized for storing data that is infrequently accessed and stored for at least 30 days.<br>Incorrect Answers:<br>A: Archive storage is optimized for storing data that is rarely accessed and stored for at least 180 days with flexible latency requirements (on the order of hours).<br>References:<br>https://docs.microsoft.com/en-in/azure/storage/blobs/storage-blob-storage-tiers",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-24T07:47:00.000Z",
        "voteCount": 1,
        "content": "The requirements are rather vague but the keyword is infrequently accesses"
      },
      {
        "date": "2020-11-18T06:53:00.000Z",
        "voteCount": 1,
        "content": "Why C?\nData is stored just for compliance reasons and is not supposed to be accessed. Should be A no?"
      }
    ],
    "examNameCode": "az-200",
    "topicNumber": "1"
  }
]