[
  {
    "topic": 3,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17302-exam-az-103-topic-3-question-1-discussion/",
    "body": "HOTSPOT -<br>You have an Azure subscription named Subscription1. Subscription1 contains a virtual machine named VM1.<br>You install and configure a web server and a DNS server on VM1.<br>VM1 has the effective network security rules shown in the following exhibit.<br><img src=\"/assets/media/exam-media/03048/0013400001.jpg\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03048/0013500001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0013500002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1:<br>Rule2 blocks ports 50-60, which includes port 53, the DNS port. Internet users can reach the Web server, since it uses port 80.<br>Box 2:<br>If Rule2 is removed internet users can reach the DNS server as well.<br>Note: Rules are processed in priority order, with lower numbers processed before higher numbers, because lower numbers have higher priority. Once traffic matches a rule, processing stops. As a result, any rules that exist with lower priorities (higher numbers) that have the same attributes as rules with higher priorities are not processed.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-network/security-overview",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-16T19:30:00.000Z",
        "voteCount": 8,
        "content": "It's correct answer ..When some try to connect Dns as rule having priority 900 it will resolve it and block. And when we delete this rule other rule 50-500 has both dns port 53 and web server 80 so it will allow both."
      },
      {
        "date": "2020-05-09T08:11:00.000Z",
        "voteCount": 7,
        "content": "The question assumes that web servers are listening on default HTTP (TCP 80) and HTTPS (TCP 443) ports which is not necessarily the case. \nI really think they should give more clarity in the question. \nIt also worth mentioning that UDP 53 is usually used for DNS client queries and on Windows 10 it doesn't fall back to TCP 53 (just tested it).\nTCP 53 is usually used for zone transfers."
      },
      {
        "date": "2021-07-29T09:10:00.000Z",
        "voteCount": 2,
        "content": "You are correct. Only web server is accessible from internet through Rule 1 in both case. Irrespective of rule 2 is available or not, UDP 53 isn't available to query DNS from internet."
      },
      {
        "date": "2024-03-14T23:58:00.000Z",
        "voteCount": 1,
        "content": "Given answer is correct"
      },
      {
        "date": "2021-04-01T08:55:00.000Z",
        "voteCount": 1,
        "content": "came out in exam"
      },
      {
        "date": "2021-04-07T02:31:00.000Z",
        "voteCount": 2,
        "content": "Answers plz!"
      },
      {
        "date": "2021-01-24T17:20:00.000Z",
        "voteCount": 1,
        "content": "Answers are correct"
      },
      {
        "date": "2020-12-30T09:13:00.000Z",
        "voteCount": 1,
        "content": "The key point here: \"Rules with small (meaning higher priority) values are processed before rules with larger (meaning lower priority) values.\""
      },
      {
        "date": "2020-08-09T11:13:00.000Z",
        "voteCount": 4,
        "content": "Some things to think about here; 1. 'Internet' users being 'outside users' trying to access (incoming traffic) your Web (Internet Server/Site) / DNS Server.\n\n2. I saw no mention of NSG order of processing Rules. \"A number between 100 and 4096. Rules are processed in priority order, with lower numbers processed before higher numbers, because lower numbers have higher priority. Once traffic matches a rule, processing stops. As a result, any rules that exist with lower priorities (higher numbers) that have the same attributes as rules with higher priorities are not processed.\"\n\nThat said, I believe the given answers are correct."
      },
      {
        "date": "2020-10-07T22:21:00.000Z",
        "voteCount": 1,
        "content": "If the the term internet users refers to outside users, well... given answers here are correct.\n\n1. DNS port is blocked by rule2 - then only port 80 is accessible to use.\n2. Deleting rule2 which blocking DNS port - means both web port 80 which is not block and unblocking DNS port by deleting rule2 - means both web and DNS are accessible.\n\nIf the term internet users refer to outside users."
      },
      {
        "date": "2020-08-07T06:50:00.000Z",
        "voteCount": 3,
        "content": "Answers are not correct:\n- Sceario1 Rule1 blocks DNS and Outgoing rule blocks Web server port .So internet users cannot access either DNS or WEB \nScenario 2: \nOnly DNS can be accessed."
      },
      {
        "date": "2020-08-11T18:59:00.000Z",
        "voteCount": 2,
        "content": "the question is about the inbound internet traffic and not the outgoing.. The given answers are correct.."
      },
      {
        "date": "2020-09-17T06:19:00.000Z",
        "voteCount": 1,
        "content": "Agree on this explanation.\nNo internet user can get a response back if outbound is blocked."
      },
      {
        "date": "2021-04-29T21:46:00.000Z",
        "voteCount": 2,
        "content": "Do you know outbound has access to internet by default ? We need to add only inbound rules to configure access to internet. You are wrong Answers are right"
      },
      {
        "date": "2020-08-03T07:01:00.000Z",
        "voteCount": 2,
        "content": "Answer stated is correct:\nDNS uses port 53/TCP for zone transfers and 53/UDP for lookups. As port 50-60 ANY (=TCP and UDP) protocol is denied by Rule2. DNS server wil not work.\nWebserver (port 80/TCP and port 443/TCP) will work as Rule1 allows this.\nIf Rule2 is removed, DNS server will also work.\n(Rule3 is irrelevant.)"
      },
      {
        "date": "2021-07-29T09:12:00.000Z",
        "voteCount": 2,
        "content": "How will DNS work by removing deny rule. There  is no allow rule for UDP 53."
      },
      {
        "date": "2020-08-01T02:47:00.000Z",
        "voteCount": 5,
        "content": "Came in exam 1st  Aug 2020"
      },
      {
        "date": "2020-08-07T13:45:00.000Z",
        "voteCount": 2,
        "content": "did you answer the same answer? stupid question, but did you pass? \nI know you might have answered it wrong and passed thought, but just wanted to know :)"
      },
      {
        "date": "2020-07-27T01:21:00.000Z",
        "voteCount": 1,
        "content": "TCP 53 is only for zone transfers for DNS servers. UDP 53 for name resolution for \"users\". Whoever created this question, he/she was clearly not aware of that. Strictly speaking, provided answer is wrong."
      },
      {
        "date": "2020-08-05T06:04:00.000Z",
        "voteCount": 1,
        "content": "But since there is no better answer, we have to live with the provided one."
      },
      {
        "date": "2020-07-03T02:36:00.000Z",
        "voteCount": 2,
        "content": "Not the best question, technically you can access both directly through 3389 but I don't think that is what they are asking.\nI think they are talking about direct ports 80 and 53 in which case, answer is correct. \nProtocol = ANY (TCP/UDP/ICMP)"
      },
      {
        "date": "2020-06-26T13:41:00.000Z",
        "voteCount": 2,
        "content": "Inbound NSG rule will block DNS but will allow port 80 or 443 whichever port for webserver to work. \nOutbound rule will block port 80.  If a user initiates a conection (incoming) to the webserver he gets connected but however a rule exists to prevent port 80 from going out. \nMy guess is user cannot access DNS or webserver. Someone please clarify."
      },
      {
        "date": "2020-07-06T18:23:00.000Z",
        "voteCount": 3,
        "content": "Users on the internet can access only the webserver. The outgoing rule that blocks port 80 only affects the server if it initiates an internet access. For exemple, an admin user logged on the server, trying to reach the internet. The webservers doesn't send traffic on the port 80 or 443, they only listen."
      },
      {
        "date": "2020-06-09T15:04:00.000Z",
        "voteCount": 3,
        "content": "given answers are correct"
      },
      {
        "date": "2020-06-12T02:10:00.000Z",
        "voteCount": 2,
        "content": "The outbound port 80 is blocked, so how he will get the webpage from web server. Considering the available options provided answers are correct"
      },
      {
        "date": "2020-06-20T16:44:00.000Z",
        "voteCount": 1,
        "content": "does not matter if port 80 is blocked web server will respond I just tested and works"
      },
      {
        "date": "2020-06-09T10:02:00.000Z",
        "voteCount": 3,
        "content": "Given answer is correct"
      },
      {
        "date": "2020-05-22T07:43:00.000Z",
        "voteCount": 1,
        "content": "we also need to assume we are using IP addresses as opposed to hostnames as DNS wouldn't be resolving anything which also could change answer 1 to none of those services DNS nor HTTP unless like I said they are using IP addresses instead. Hard to tell."
      },
      {
        "date": "2020-05-21T10:24:00.000Z",
        "voteCount": 1,
        "content": "dns uses udp for look  ups. zone transfers are done over tcp. question is vague in that but the assumption is that they are looking for an dns lookup as thats what the general public will gravitate towards on this question,"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15909-exam-az-103-topic-3-question-2-discussion/",
    "body": "DRAG DROP -<br>You have an Azure Linux virtual machine that is protected by Azure Backup.<br>One week ago, two files were deleted from the virtual machine.<br>You need to restore the deleted files to an on-premises computer as quickly as possible.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03048/0013700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0013700002.png\" class=\"in-exam-image\">",
    "answerDescription": "To restore files or folders from the recovery point, go to the virtual machine and choose the desired recovery point.<br>Step 0. In the virtual machine's menu, click Backup to open the Backup dashboard.<br>Step 1. In the Backup dashboard menu, click File Recovery.<br>Step 2. From the Select recovery point drop-down menu, select the recovery point that holds the files you want. By default, the latest recovery point is already selected.<br>Step 3: To download the software used to copy files from the recovery point, click Download Executable (for Windows Azure VM) or Download Script (for Linux<br>Azure VM, a python script is generated).<br>Step 4: Copy the files by using AzCopy<br>AzCopy is a command-line utility designed for copying data to/from Microsoft Azure Blob, File, and Table storage, using simple commands designed for optimal performance. You can copy data between a file system and a storage account, or between storage accounts.<br>References:<br>https://docs.microsoft.com/en-us/azure/backup/backup-azure-restore-files-from-vm https://docs.microsoft.com/en-us/azure/storage/common/storage-use-azcopy",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-10T03:41:00.000Z",
        "voteCount": 26,
        "content": "In question, Its a Linux machine not Windows. So we have to use AZCopy"
      },
      {
        "date": "2020-03-29T02:47:00.000Z",
        "voteCount": 11,
        "content": "Nope. Also for Linux VM you download and run a script that mounts the paths to your localbox.\n\nA copy is for copying files that are still in the cloud. Doesn't apply in this case."
      },
      {
        "date": "2020-03-09T01:20:00.000Z",
        "voteCount": 17,
        "content": "Last step chould be file explorer not AZcopy see documentation for windows because you mount a ISCSI drive to your VM"
      },
      {
        "date": "2020-06-17T05:27:00.000Z",
        "voteCount": 10,
        "content": "but this is linux machine."
      },
      {
        "date": "2024-03-13T03:51:00.000Z",
        "voteCount": 1,
        "content": "Right is\n1 From the Azure portal, click File Recovery from the vault. \n2 Select a restore point. \n3 Download and run a script. \n4 Copy the files by using File Explorer"
      },
      {
        "date": "2021-05-11T01:40:00.000Z",
        "voteCount": 2,
        "content": "so which is the correct steps please?\n\nFor Windows VM it should be:\n1 From the Azure portal, click File Recovery from the vault.\n2 Select a restore point.\n3 Download and run a script.\n4 Copy the files by using File Explorer\n\nFor Linux VM it should be:\n1 From the Azure portal, click Restore VM from the vault.\n2. Select Restore Point,\n3. Download and run a script\n4. Mount a VHD"
      },
      {
        "date": "2021-06-26T22:15:00.000Z",
        "voteCount": 1,
        "content": "You should be mindful of when the files will be restored to? Question is a computer though source is Linux. Here in AZ-103 it doesn't say whether Windows or Linux but AZ-104 it says in Windows server. Only last step should be modified:\n\nWindows: Copy the files by using File Explorer\nLinux: Copy the files by using AZCopy"
      },
      {
        "date": "2021-05-25T22:56:00.000Z",
        "voteCount": 1,
        "content": "I think both step 4 should be [Copy the files by using File Explorer]?\nbecause azcopy is to get file still from cloud?\nand the disk already mounted during the step [Download and run a script]?\n\nfor Linux VM, I am not talking about Windows File Explorer . I mean some kind of built-in file manager. \ni am a learner please correct me if I am wrong.."
      },
      {
        "date": "2021-01-14T07:08:00.000Z",
        "voteCount": 1,
        "content": "Azcopy run in linux   https://azure.microsoft.com/es-es/blog/azcopy-on-linux-now-generally-availble/"
      },
      {
        "date": "2020-10-28T10:52:00.000Z",
        "voteCount": 1,
        "content": "With the given option the answer should be copy the file using file explorer.  Read this Microsoft article. \n\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-restore-files-from-vm\n\n\"In Linux, the volumes of the recovery point are mounted to the folder where the script is run. The attached disks, volumes, and the corresponding mount paths are shown accordingly. These mount paths are visible to users having root level access. Browse through the volumes mentioned in the script output.\""
      },
      {
        "date": "2020-09-20T16:15:00.000Z",
        "voteCount": 1,
        "content": "What would be the solution if the given VM is Windows (Instead Linux)?"
      },
      {
        "date": "2020-09-07T12:29:00.000Z",
        "voteCount": 1,
        "content": "The script should be run on a Linux machine because this is a Linux VM that you are trying to mount. The machine where the script/exe runs has to recognize the filesystem. The files to recover need to be recovered on an on-prem Linux machine as the source vm is Linux. I think we don't need AzCopy (because that's to copy from/to Azure, a mounted drive isn't actually \"Azure\") . We would need a File Explorer in Linux (or cp but that's not a given option).\n\nWhat do you think about this  logic?"
      },
      {
        "date": "2020-08-03T05:15:00.000Z",
        "voteCount": 5,
        "content": "No need for AZCopy, you can use File Explorer:  \n\n\"When you run the executable, the operating system mounts the new volumes and assigns drive letters. You can use Windows Explorer or File Explorer to browse those drives. \"\n\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-restore-files-from-vm"
      },
      {
        "date": "2020-08-02T03:28:00.000Z",
        "voteCount": 1,
        "content": "azcopy is not needed, azcopy is to move files to azure storage, we need to move to on-premises. &gt;&gt; \nhttps://docs.microsoft.com/en-us/azure/storage/common/storage-ref-azcopy-copy\n\nso a simply cp or if the linux vm is using a gui use the explorer\nso step number four \"copy files by using file explorer\"\nsee:\nhttps://azure.microsoft.com/en-us/blog/instant-file-recovery-from-azure-linux-vm-backup-using-azure-backup-preview/"
      },
      {
        "date": "2020-08-01T17:06:00.000Z",
        "voteCount": 1,
        "content": "AZcopy is for copying Data in an out of storage accounts. This question should be for a windows VM if they want to use file explorer. On a Linux machine, a simple cp will work."
      },
      {
        "date": "2020-07-31T18:22:00.000Z",
        "voteCount": 1,
        "content": "The given answer is correct. you are copying the restored files to an ON-PREM machine. AzCopy is required\n\nhttps://gcits.com/knowledge-base/how-to-migrate-files-into-microsoft-azure-virtual-machines/"
      },
      {
        "date": "2020-07-20T22:59:00.000Z",
        "voteCount": 1,
        "content": "Why would I use azcopy when the restore point is mounted locally using the script."
      },
      {
        "date": "2020-07-08T11:22:00.000Z",
        "voteCount": 1,
        "content": "In step 4.  AzCopy is the answer as the task is to copy \nFrom: Azure Linux virtual machine\nTo: to an on-premises computer \nSo for this specific question its AZcopy, if the machine were Azure Windows than it would be File Explorer"
      },
      {
        "date": "2020-07-05T03:21:00.000Z",
        "voteCount": 1,
        "content": "And because the scripts itself is mounting the vhd file so you don't need to do it by yourself, and you don't need to mention that in the answer (I guess)."
      },
      {
        "date": "2020-07-05T03:18:00.000Z",
        "voteCount": 1,
        "content": "I agree with ape421. The answer is File Explorer and other options are absolutely wrong. Virtual machine drive is saved as VHD file. Azcopy can not read the contents of VHD file but it would deal with the vhd file as-is like any video file. To read the content of the file you should mount the vhd file and then use the file explorer to read the contents."
      },
      {
        "date": "2020-06-29T03:08:00.000Z",
        "voteCount": 2,
        "content": "had in exam\n\nIts refers to a Linux machine but retrieving the file from an on prem windows p.c.. so selected windows explorer"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16164-exam-az-103-topic-3-question-3-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g, copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may have more than one lab that you must complete. You can use as much time as you would like to complete each lab. But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br>You may now click next to proceed to the lab.<br>Use the following login credentials as needed:<br><br>Azure Username: XXXXXXX -<br><br>Azure Password: XXXXXXX -<br>The following information is for technical support purposes only:<br><br>Lab Instance: 9172796 -<br><img src=\"/assets/media/exam-media/03048/0013900001.jpg\" class=\"in-exam-image\"><br>You plan to protect on-premises virtual machines and Azure virtual machines by using Azure Backup.<br>You need to prepare the backup infrastructure in Azure. The solution must minimize the cost of storing the backups in Azure.<br>What should you do from the Azure portal?<br>",
    "options": [],
    "answer": "See solution below.",
    "answerDescription": "First, create Recovery Services vault.<br>Step 1: On the left-hand menu, select All services and in the services list, type Recovery Services. As you type, the list of resources filters. When you see<br>Recovery Services vaults in the list, select it to open the Recovery Services vaults menu.<br><img src=\"/assets/media/exam-media/03048/0014000001.jpg\" class=\"in-exam-image\"><br>Step 2: In the Recovery Services vaults menu, click Add to open the Recovery Services vault menu.<br><img src=\"/assets/media/exam-media/03048/0014100001.png\" class=\"in-exam-image\"><br>Step 3: In the Recovery Services vault menu, for example,<br>Type myRecoveryServicesVault in Name.<br>The current subscription ID appears in Subscription. If you have additional subscriptions, you could choose another subscription for the new vault.<br>For Resource group select Use existing and choose myResourceGroup. If myResourceGroup doesn't exist, select Create new and type myResourceGroup.<br>From the Location drop-down menu, choose West Europe.<br>Click Create to create your Recovery Services vault.<br>References:<br>https://docs.microsoft.com/en-us/azure/backup/tutorial-backup-vm-at-scale",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-10T13:55:00.000Z",
        "voteCount": 15,
        "content": "think switching backup storage accout to Locally Redundant for cost saving is missing ?"
      },
      {
        "date": "2020-06-22T08:54:00.000Z",
        "voteCount": 5,
        "content": "you go to your RSV -&gt; properties -&gt; 'Backup configuration update' button -&gt; Storage Replication type. Need to switch to LRS. It's GRS by default. From Azure Portal info box:\n\"This option cannot be changed after protecting items.  Geo-redundant storage (GRS) provides a higher level of data durability than Locally redundant storage (LRS) and costs more\""
      },
      {
        "date": "2020-06-28T23:58:00.000Z",
        "voteCount": 3,
        "content": "this is the right answer. RSV -&gt; properties -&gt; 'Backup configuration update' button -&gt; Storage Replication type\nNote:\nBest time to identify your storage redundancy option is right after vault creation and before any machines are registered to vault. After an item has been registered to the vault the storage redundancy option is locked and cannot be modified."
      },
      {
        "date": "2020-04-07T05:27:00.000Z",
        "voteCount": 11,
        "content": "PREPARE the backup not CREATE a backup"
      },
      {
        "date": "2021-03-17T06:52:00.000Z",
        "voteCount": 1,
        "content": "these simulation type questions are coming nowadays in test?"
      },
      {
        "date": "2020-06-03T14:07:00.000Z",
        "voteCount": 4,
        "content": "Create a RSV and than set Storage replication type to Locally-redundant"
      },
      {
        "date": "2020-06-03T02:43:00.000Z",
        "voteCount": 2,
        "content": "although minimise cost of STORAGE is a bit vague - same location as VM is a given - presumably archive as opposed to hot"
      },
      {
        "date": "2020-06-03T02:38:00.000Z",
        "voteCount": 2,
        "content": "Yeah its 'prepare the backup infrastructure'...not 'create' - so it wants you to complete the Recovery Services Vault blade -"
      },
      {
        "date": "2020-05-30T11:39:00.000Z",
        "voteCount": 3,
        "content": "It is needed verifying in which region the Azure VMs are located, to create the Vault on the same region."
      },
      {
        "date": "2020-05-27T09:45:00.000Z",
        "voteCount": 4,
        "content": "To minimize the cost. Set Storage replication type to Locally-redundant\nhttps://docs.microsoft.com/en-us/azure/backup/backup-create-rs-vault#set-storage-redundancy"
      },
      {
        "date": "2020-03-27T05:16:00.000Z",
        "voteCount": 1,
        "content": "\" The solution must minimize the cost of STORING the backups in Azure.\" - Cold Tier too perhaps?  Nothing is stated about the access frequency and / or cost..."
      },
      {
        "date": "2020-03-27T05:36:00.000Z",
        "voteCount": 1,
        "content": "Sorry!  Ignore this - thinking of a Storage Account - oops! :("
      },
      {
        "date": "2020-03-12T01:16:00.000Z",
        "voteCount": 2,
        "content": "I thinks it misses the step to set backup policy to protect VM"
      },
      {
        "date": "2020-08-23T05:11:00.000Z",
        "voteCount": 1,
        "content": "That's going to be hard, considering that the backup policy for an on premise vm is configured in the backup agent."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16013-exam-az-103-topic-3-question-4-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g, copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may have more than one lab that you must complete. You can use as much time as you would like to complete each lab. But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br>You may now click next to proceed to the lab.<br><img src=\"/assets/media/exam-media/03048/0014200001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/03048/0014300001.jpg\" class=\"in-exam-image\"><br>You need to deploy two Azure virtual machines named VM1003a and VM1003b based on an Ubuntu Server image. The deployment must meet the following requirements:<br>✑ Provide a Service Level Agreement (SLA) of 99.95 percent availability.<br>✑ Use managed disks.<br>What should you do from the Azure portal?<br>",
    "options": [],
    "answer": "See solution below.",
    "answerDescription": "Step 1: Open the Azure portal.<br>Step 2: On the left menu, select All resources. You can sort the resources by Type to easily find your images.<br>Step 3: Select the image you want to use from the list. The image Overview page opens.<br>Step 4: Select Create VM from the menu.<br>Step 5: Enter the virtual machine information.<br>Select VM1003a as the name for the first Virtual machine.<br>The user name and password entered here will be used to log in to the virtual machine. When complete, select OK. You can create the new VM in an existing resource group, or choose Create new to create a new resource group to store the VM.<br>Step 6: Select a size for the VM. To see more sizes, select View all or change the Supported disk type filter.<br>Step 7: Under Settings, make changes as necessary and select OK.<br>Step 8: On the summary page, you should see your image name listed as a Private image. Select Ok to start the virtual machine deployment.<br>Repeat the procedure for the second VM and name it VM1003b.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/create-vm-generalized-managed",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-18T01:27:00.000Z",
        "voteCount": 33,
        "content": "99.99 -&gt; Availability Zone\n99.95 -&gt; Availability Set"
      },
      {
        "date": "2020-03-09T16:25:00.000Z",
        "voteCount": 19,
        "content": "where is the 99.95 SLA? do we need to setup availability set?"
      },
      {
        "date": "2020-05-16T09:19:00.000Z",
        "voteCount": 5,
        "content": "Yes need to create availability set"
      },
      {
        "date": "2020-06-13T14:34:00.000Z",
        "voteCount": 2,
        "content": "correct"
      },
      {
        "date": "2020-12-15T23:28:00.000Z",
        "voteCount": 1,
        "content": "According to https://azure.microsoft.com/en-us/support/legal/sla/virtual-machines/v1_9/ : \"For any Single Instance Virtual Machine using Premium SSD or Ultra Disk for all Operating System Disks and Data Disks, we guarantee you will have Virtual Machine Connectivity of at least 99.9%.\"  However, it seems like another solution would be to use an availability Zone or Availability set.  However, to ensure that you had both A and B available 99.95% of the time, I think you would have to have two availability zones (one for 2 instances of A and one for 2 instances of B).  Since,  and B are different images, and presumably do different roles."
      },
      {
        "date": "2020-09-08T01:23:00.000Z",
        "voteCount": 2,
        "content": "this is not about setting up a high availability solution. So no availability set / Availability zone. SLA can be at Disk level. \nhttps://azure.microsoft.com/en-us/support/legal/sla/virtual-machines/v1_9/"
      },
      {
        "date": "2022-03-26T09:49:00.000Z",
        "voteCount": 1,
        "content": "I agree with your opinion but the MS doc seems NOT supportive.  SLA for VMs:\n1. Availability Zones: 99.99%\n2. Availability Set: 99.95%\n3. Premium SSD: 99.9%\n4. Standard SSD: 99.5%\n5. Standard HDD: 95%\nSo to keep VMs SAL 99.95%, we have to create AS anyway for this case even though it has been asked for."
      },
      {
        "date": "2020-08-21T15:16:00.000Z",
        "voteCount": 1,
        "content": "Create an availability set.(with managed disk enabled) then During creation of the 2 VMs add the set from drop down. hope that is all needed for this."
      },
      {
        "date": "2020-08-19T05:26:00.000Z",
        "voteCount": 1,
        "content": "availability set - missing in the answer"
      },
      {
        "date": "2020-08-09T12:30:00.000Z",
        "voteCount": 2,
        "content": "Essentially, Avail Set, 99.95% - Avail Zone, 99.99%"
      },
      {
        "date": "2020-07-02T08:08:00.000Z",
        "voteCount": 1,
        "content": "SLA for 99.95--&gt; AV\nSAL for 99.9--&gt;AZ"
      },
      {
        "date": "2020-06-09T10:28:00.000Z",
        "voteCount": 1,
        "content": "https://azure.microsoft.com/en-in/support/legal/sla/summary/\nBased on this link we can crate an availability set for the 99.95. Therefore, create 2 VMs in an availability set and ur good"
      },
      {
        "date": "2020-06-03T14:10:00.000Z",
        "voteCount": 1,
        "content": "Will need a availability set"
      },
      {
        "date": "2020-05-30T11:50:00.000Z",
        "voteCount": 3,
        "content": "For all Virtual Machines that have two or more instances deployed in the same Availability Set or in the same Dedicated Host Group, we guarantee you will have Virtual Machine Connectivity to at least one instance at least 99.95% of the time.\n\nBased on this, an Availability Set is necessary prior to VM creation, since the question doesn't mention that we have a Dedicated Host Group service for those VMs."
      },
      {
        "date": "2020-05-24T02:57:00.000Z",
        "voteCount": 1,
        "content": "https://azure.microsoft.com/en-in/support/legal/sla/summary/\nYou need to create two VMs in an availability set from the image"
      },
      {
        "date": "2020-04-27T07:13:00.000Z",
        "voteCount": 1,
        "content": "single VM SLA 99.5 an VMs with AV is 99.95 and VMs with AZ 99.99 so answer is incorrect."
      },
      {
        "date": "2020-04-20T10:55:00.000Z",
        "voteCount": 2,
        "content": "Are they considered 2 instances? or 2 x single instance? If later, it won't need availability set, right?\n    For any Single Instance Virtual Machine using Premium SSD or Ultra Disk for all Operating System Disks and Data Disks, we guarantee you will have Virtual Machine Connectivity of at least 99.9%."
      },
      {
        "date": "2020-08-24T02:08:00.000Z",
        "voteCount": 2,
        "content": "99,9 is less than 99,95"
      },
      {
        "date": "2020-04-19T05:49:00.000Z",
        "voteCount": 4,
        "content": "1) Create an availability set.\n2) Creatd dd VM in the AS.\nWe cannot do it in reverse order."
      },
      {
        "date": "2020-04-04T11:23:00.000Z",
        "voteCount": 13,
        "content": "SLA for Virtual Machines\nLast updated: January 2020\n\nFor all Virtual Machines that have two or more instances deployed across two or more Availability Zones in the same Azure region, we guarantee you will have Virtual Machine Connectivity to at least one instance at least 99.99% of the time.\n\nFor all Virtual Machines that have two or more instances deployed in the same Availability Set or in the same Dedicated Host Group, we guarantee you will have Virtual Machine Connectivity to at least one instance at least 99.95% of the time.\n\nFor any Single Instance Virtual Machine using Premium SSD or Ultra Disk for all Operating System Disks and Data Disks, we guarantee you will have Virtual Machine Connectivity of at least 99.9%."
      },
      {
        "date": "2020-07-05T14:47:00.000Z",
        "voteCount": 1,
        "content": "Below are the steps.\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/linux/tutorial-availability-sets\n1. Create an availability set\n2. Create a VM in an availability set\n99.95% SLA - https://docs.microsoft.com/en-us/azure/virtual-machines/linux/availability#availability-sets"
      },
      {
        "date": "2020-03-17T03:07:00.000Z",
        "voteCount": 12,
        "content": "For all Virtual Machines that have two or more instances deployed in the same Availability Set, we guarantee you will have Virtual Machine Connectivity to at least one instance at least 99.95% of the time."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16038-exam-az-103-topic-3-question-5-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g, copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may have more than one lab that you must complete. You can use as much time as you would like to complete each lab. But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br>You may now click next to proceed to the lab.<br><img src=\"/assets/media/exam-media/03048/0014500001.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/03048/0014600001.jpg\" class=\"in-exam-image\"><br>You need to deploy an Azure virtual machine named VM1004a based on an Ubuntu Server image, and then configure VM1004a to meet the following requirements:<br>✑ The virtual machine must contain data disks that can store at least 15 TB of data.<br>✑ The data disks must be able to provide at least 2.000 IOPS.<br>✑ Storage costs must be minimized.<br>What should you do from the Azure portal?<br>",
    "options": [],
    "answer": "See solution below.",
    "answerDescription": "Step 1: Open the Azure portal.<br>Step 2: On the left menu, select All resources. You can sort the resources by Type to easily find your images.<br>Step 3: Select the image you want to use from the list. The image Overview page opens.<br>Step 4: Select Create VM from the menu.<br>Step 5: Enter the virtual machine information.<br>Select VM1004a as the name for the first Virtual machine.<br>The user name and password entered here will be used to log in to the virtual machine. When complete, select OK. You can create the new VM in an existing resource group, or choose Create new to create a new resource group to store the VM.<br>Step 6: Select a size for the VM. To see more sizes, select View all or change the Supported disk type filter.<br>To meet the requirements select Standard SSD E70.<br>Standard SSD E70: Up to 16 TB, IOPS up to 4000, $1,228.80/month<br>Standard SSD Managed Disks, a low-cost SSD offering, are optimized for test and entry-level production workloads requiring consistent latency.<br>Step 7: Under Settings, make changes as necessary and select OK.<br>Step 8: On the summary page, you should see your image name listed as a Private image. Select Ok to start the virtual machine deployment.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/create-vm-generalized-managed",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-09T21:22:00.000Z",
        "voteCount": 12,
        "content": "This should be an S70 and not an E70\nhttps://azure.microsoft.com/en-us/pricing/details/managed-disks/"
      },
      {
        "date": "2020-03-10T08:47:00.000Z",
        "voteCount": 12,
        "content": "BobRofl, an S70 disk provides \"up to 2000 IOPS\". The question ask for \"at least 2000 IOPS\".\nSo, an E70 disk."
      },
      {
        "date": "2020-03-15T07:22:00.000Z",
        "voteCount": 3,
        "content": "I agree with BobRofl. If a requirement is to have a car with at least 4 wheels, a car with max 4 wheels meets the requirements."
      },
      {
        "date": "2020-03-29T02:56:00.000Z",
        "voteCount": 17,
        "content": "Nope. Wheels are not the same as IOPS, ahaha.\n\n\"Up to 2000 IOPS\" means that's the maximum IOPS you will ever get, but you will operate below that most of the time, be certain of that.\n\nIf the requirement is AT LEAST, we can't settle for UP TO."
      },
      {
        "date": "2020-06-03T02:53:00.000Z",
        "voteCount": 2,
        "content": "it doesn't it may be a car with 3 wheels."
      },
      {
        "date": "2020-03-10T11:38:00.000Z",
        "voteCount": 10,
        "content": "S70 is up to 2000 iops and this is max not \"at least\". In my opinion standard ssd E70 is the right answer"
      },
      {
        "date": "2020-03-18T13:23:00.000Z",
        "voteCount": 1,
        "content": "Right, at least states a minimum required"
      },
      {
        "date": "2020-07-05T15:08:00.000Z",
        "voteCount": 1,
        "content": "Agree with bellapupa. It should be E70."
      },
      {
        "date": "2021-12-26T02:22:00.000Z",
        "voteCount": 1,
        "content": "Gen1 VMs has imitation of max 2TB disk size. VM should be Gen2."
      },
      {
        "date": "2021-02-04T05:00:00.000Z",
        "voteCount": 1,
        "content": "The data disks must be able to provide at least 2.000 IOPS - means performance must not go below 2000 IOPS. If you choose S70 it will always be maxed out and will not be healthy in the long run so may cause frequent replacement (in the end too costly) Choosing E70 will ensure that it can operate at 2000 and higher thus ensuring integrity during heavy operations that are 2000 and above IOPS."
      },
      {
        "date": "2021-01-05T19:47:00.000Z",
        "voteCount": 1,
        "content": "This should be an S70"
      },
      {
        "date": "2020-08-05T19:38:00.000Z",
        "voteCount": 2,
        "content": "Does anyone here know if the simulations on the test have the handy list of drives and their performance like when you click on Add Disk in the production version of Azure?"
      },
      {
        "date": "2020-06-15T19:37:00.000Z",
        "voteCount": 1,
        "content": "reviewed again. S70 is cheaper thus the more appropriate choice. \nhttps://azure.microsoft.com/en-us/pricing/details/managed-disks/\nE70 \t16 TiB \t$1,228.80 \tUp to 4,000 \tUp to 600 MB/second\nS70 \t16 TiB \t$491.52 \tUp to 2,000 \tUp to 500 MB/second"
      },
      {
        "date": "2020-06-09T19:31:00.000Z",
        "voteCount": 1,
        "content": "Correct VM size is S70 but when I wanted to do practice, could not see/select S70 for ubunti image. Is this can be limitation of subscription ?"
      },
      {
        "date": "2020-07-06T19:37:00.000Z",
        "voteCount": 1,
        "content": "S70 is the data disk size, not the VM size. We need to choose any VM size that supports more than 2000 IOPS. Than, we need to select the S70 disk size, wich is Standard HDD, for the purpose of minimizing costs."
      },
      {
        "date": "2020-06-09T10:49:00.000Z",
        "voteCount": 1,
        "content": "DIsk has to be AT LEAST 2000 IOPS. By saying at least, the questions is expecting the IOPS to be higher than 2000 so E70 is the right answer for this question"
      },
      {
        "date": "2020-06-12T02:38:00.000Z",
        "voteCount": 1,
        "content": "agree with you macco455 because E70 provides upto 4000 IOPS whereas S70 only 2000. So the option would be E70."
      },
      {
        "date": "2020-06-07T18:40:00.000Z",
        "voteCount": 1,
        "content": "reviewed this some more and the E70 answer is right."
      },
      {
        "date": "2020-06-03T02:58:00.000Z",
        "voteCount": 1,
        "content": "'the data disks' … shouldn't we create the VM first with a small disk for the OS, and then add a data disk after creation as per requirements and as per best practise?"
      },
      {
        "date": "2020-06-01T17:20:00.000Z",
        "voteCount": 1,
        "content": "per this link S70 is cheaper than E70 and matches the requirements of the question."
      },
      {
        "date": "2020-04-21T18:36:00.000Z",
        "voteCount": 2,
        "content": "Also with these questions don't forget the Terabyte vs Tebibyte component - Azure Portal states sizes in TiB, the question is stating in TB - there is a slight difference. \nIn this case E70 is still correct as it provides 16TiB which is 17.59TB, and up to 4000 IOPS."
      },
      {
        "date": "2020-04-13T07:08:00.000Z",
        "voteCount": 1,
        "content": "What about 16 To ? how we can check this ?"
      },
      {
        "date": "2020-04-15T18:43:00.000Z",
        "voteCount": 1,
        "content": "Both S70 &amp; E70 support upto 16TB. E70 makes more sense as an answer"
      },
      {
        "date": "2020-03-10T07:24:00.000Z",
        "voteCount": 1,
        "content": "S70 is more cheaper than E70 so its minimize the cost"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6130-exam-az-103-topic-3-question-6-discussion/",
    "body": "You have an Azure subscription that contains a virtual machine named VM1. VM1 hosts a line-of-business application that is available 24 hours a day. VM1 has one network interface and one managed disk. VM1 uses the D4s v3 size.<br>You plan to make the following changes to VM1:<br>✑ Change the size to D8s v3.<br>✑ Add a 500-GB managed disk.<br>✑ Add the Puppet Agent extension.<br>✑ Attach an additional network interface.<br>Which change will cause downtime for VM1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd the Puppet Agent extension.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange the size to D8s v3.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a 500-GB managed disk.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAttach an additional network interface."
    ],
    "answer": "B",
    "answerDescription": "While resizing the VM it must be in a stopped state.<br>References:<br>https://azure.microsoft.com/en-us/blog/resize-virtual-machines/",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-12T13:38:00.000Z",
        "voteCount": 26,
        "content": "Ok, Question says which \"change\" will cause Downtime  - [ Means we can change the size to D8s V3 but it restarts the VM results in downtime during the change ] , [ To add interface , we need to stop the VM first, which means change is not possible without downtime ] - So I will go with \"B\"."
      },
      {
        "date": "2020-07-05T15:15:00.000Z",
        "voteCount": 3,
        "content": "Agree with falthu. Explanation is clear.\nAnswer is B. Change the size to D8s v3."
      },
      {
        "date": "2019-12-02T08:19:00.000Z",
        "voteCount": 18,
        "content": "Have tried in Azure, B and D will cause downtime for VM1"
      },
      {
        "date": "2020-01-17T07:04:00.000Z",
        "voteCount": 4,
        "content": "You are right. Tried it on D4v3 VM. B caused a restart and D can only be done on a stopped VM."
      },
      {
        "date": "2021-12-26T02:25:00.000Z",
        "voteCount": 1,
        "content": "VM should be deallocated to add new NIC. So answer should be B &amp; D."
      },
      {
        "date": "2021-04-29T22:21:00.000Z",
        "voteCount": 1,
        "content": "D is also right. If we need to change network interface then we have to switch off the vm and then change it will give some downtime"
      },
      {
        "date": "2021-02-04T05:03:00.000Z",
        "voteCount": 1,
        "content": "Resizing the VM will need to be done while the VM is down to ensure data integrity."
      },
      {
        "date": "2021-01-05T19:49:00.000Z",
        "voteCount": 1,
        "content": "B and D"
      },
      {
        "date": "2021-01-02T07:59:00.000Z",
        "voteCount": 1,
        "content": "Tested in lab:\nB+D are among the correct answers\n\nA:  Not tested. I haven't created a puppet VM from the marketplace.  Has anyone tested this?\n\nB: Changing the VM size reboots the VM causing downtime for less then 30 seconds.  However you can change the size while running, on the fly.\n\nC:  You can add or remove a 500GB premium SSD disk without reboot or downtime (premium SSD is the only performance tier that offers above 500 iops, Good to know).  Ive done this before and it does not reboot the VM or cause downtime\n\nD: You must stop and deallocate the VM before attaching a new Nic.  Cannot be done on the fly while running."
      },
      {
        "date": "2020-11-25T10:52:00.000Z",
        "voteCount": 1,
        "content": "From my perspective, this question asks which action would \"cause\" a downtime. The change VM size would cause it as with a NIC you yourself have to first stop the VM"
      },
      {
        "date": "2020-10-23T13:17:00.000Z",
        "voteCount": 1,
        "content": "They might be trying to trick the question.. Resizing will cause the downtime; NIC can be done only when it is down, so it's not causing downtime? Lol, I don't know, maybe the credit will be given to either B or D"
      },
      {
        "date": "2020-08-26T05:37:00.000Z",
        "voteCount": 1,
        "content": "Answer i B &amp; D\nI tried to attach a new NIC .. it was in grayed out.. after shutting down only  it was able to attach a new NIC. So confirmed."
      },
      {
        "date": "2020-08-25T19:12:00.000Z",
        "voteCount": 1,
        "content": "tried to resize Vm while its turned on. resize works without shutting it off. the answer should be adding network interface to VM. the VM do not allow to add another interface without powering off."
      },
      {
        "date": "2020-08-04T10:58:00.000Z",
        "voteCount": 3,
        "content": "B &amp; D\n\nTo add a virtual NIC to an existing VM, you deallocate the VM, add the virtual NIC, then start the VM. Different VM sizes support a varying number of NICs, so size your VM accordingly."
      },
      {
        "date": "2020-08-03T10:16:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is D, you can't add a NIC whilst the VM is running, it must be stopped first"
      },
      {
        "date": "2020-07-27T04:30:00.000Z",
        "voteCount": 1,
        "content": "Adding a NIC is only possible when the VM is down."
      },
      {
        "date": "2020-07-13T13:01:00.000Z",
        "voteCount": 2,
        "content": "both B&amp;D"
      },
      {
        "date": "2020-07-09T08:06:00.000Z",
        "voteCount": 2,
        "content": "B,D shold be the answer."
      },
      {
        "date": "2020-06-28T11:49:00.000Z",
        "voteCount": 1,
        "content": "I just tested this.\nI knew that resizing the VM requires a reboot. But I was unsure about adding an extra network interface card. I just tested this and it made me shut down the VM before giving me the ability to add the Network card."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16024-exam-az-103-topic-3-question-7-discussion/",
    "body": "You have an Azure virtual machine named VM1 that you use for testing. VM1 is protected by Azure Backup.<br>You delete VM1.<br>You need to remove the backup data stored for VM1.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the Recovery Services vault.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the storage account.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStop the backup",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the backup policy."
    ],
    "answer": "D",
    "answerDescription": "Azure Backup provides backup for virtual machines \"\" created through both the classic deployment model and the Azure Resource Manager deployment model \"\" by using custom-defined backup policies in a Recovery Services vault.<br>With the release of backup policy management, customers can manage backup policies and model them to meet their changing requirements from a single window. Customers can edit a policy, associate more virtual machines to a policy, and delete unnecessary policies to meet their compliance requirements.<br>Incorrect Answers:<br>B: You can't delete a Recovery Services vault if it is registered to a server and holds backup data. If you try to delete a vault, but can't, the vault is still configured to receive backup data.<br>References:<br>https://azure.microsoft.com/en-in/updates/azure-vm-backup-policy-management/",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-09T17:07:00.000Z",
        "voteCount": 64,
        "content": "how about to stop the backup first? C:"
      },
      {
        "date": "2020-06-20T23:55:00.000Z",
        "voteCount": 26,
        "content": "I recreated in a lab for myself.\n\n- I created a vm\n- created recovery vault\n- created the backup policy \n- backed up the vm.\n- deleted the vm\n\nThe vm data remained in the recovery vault...\n\nThen when you click into the vm backup the \"delete backup data\" button is grayed out.\n\nI have to click the \"Stop backup\" button first. \n\nInterestingly, when you click stop back up, the next page allows you to delete the back up data as part of the same job. \n\n100% you have to stop the job first."
      },
      {
        "date": "2020-07-05T15:27:00.000Z",
        "voteCount": 4,
        "content": "Even I have tested this. We have to stop the backup item first."
      },
      {
        "date": "2021-06-25T22:39:00.000Z",
        "voteCount": 2,
        "content": "Answer:\nC. Stop the backup."
      },
      {
        "date": "2021-12-26T02:28:00.000Z",
        "voteCount": 1,
        "content": "Since the VM is deleted(so Backup is already stopped) then we left with Policy Modification only."
      },
      {
        "date": "2021-02-23T17:00:00.000Z",
        "voteCount": 1,
        "content": "D is correct. VM has been deleted, which is the condition. So it means the backup has been stopped. Then to move backup data, what to do? It's the policy."
      },
      {
        "date": "2021-06-25T22:39:00.000Z",
        "voteCount": 1,
        "content": "It's not said \"Deleted\" It says \"You delete VM\". Therefore, C is correct."
      },
      {
        "date": "2021-02-07T21:08:00.000Z",
        "voteCount": 2,
        "content": "Tested in my lab. Answer is C"
      },
      {
        "date": "2021-02-03T02:25:00.000Z",
        "voteCount": 2,
        "content": "I tested in lab, I created the VM, created the backup policy, did the backup, deleted the VM. When I went back to the backup items in my recovery services vault the option to delete backup was greyed out. I can only do the following:\n1. backup now\n2. restore vm\n3. file recovery\n4. stop backup\nI chose stop backup and the message is:\nStopping backup and deleting backup data for vmtest1"
      },
      {
        "date": "2020-11-25T10:54:00.000Z",
        "voteCount": 1,
        "content": "You can't modify the policy as it may be used by other backups so the correct option would be to stop the backup"
      },
      {
        "date": "2020-11-06T03:33:00.000Z",
        "voteCount": 1,
        "content": "C. Stop the backup"
      },
      {
        "date": "2020-10-29T09:33:00.000Z",
        "voteCount": 2,
        "content": "C stop and backup"
      },
      {
        "date": "2020-08-21T12:57:00.000Z",
        "voteCount": 2,
        "content": "That is one of the errors that you have to be aware. Correct is C."
      },
      {
        "date": "2020-08-09T12:54:00.000Z",
        "voteCount": 2,
        "content": "Stop the backup!"
      },
      {
        "date": "2020-07-26T09:27:00.000Z",
        "voteCount": 3,
        "content": "I did the lab for myself.  C is the correct answer.  yes you can delete the VM before you stop the backup. \nThe interesting thing is, if you think of modifying the backup policy, there is no relevance as the VM is already deleted.   I could understand what should I do with modify policy. :) :)"
      },
      {
        "date": "2020-06-20T17:21:00.000Z",
        "voteCount": 1,
        "content": "Answer is C, for those saying is D tell what you going to do with the backup policy?"
      },
      {
        "date": "2020-06-17T12:18:00.000Z",
        "voteCount": 1,
        "content": "Answer seems correct. It’s not going to be C as that would have to have been done before deleting the vm"
      },
      {
        "date": "2020-06-22T01:55:00.000Z",
        "voteCount": 1,
        "content": "you cant delete a vm without stopping its backup?"
      },
      {
        "date": "2020-06-14T12:01:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/backup/backup-azure-manage-vms#stop-protection-and-delete-backup-data. Check this link and make yourself clear."
      },
      {
        "date": "2020-06-13T15:33:00.000Z",
        "voteCount": 2,
        "content": "Letter D is correct you are being asked to remove the data not to stop the backup."
      },
      {
        "date": "2020-06-11T16:43:00.000Z",
        "voteCount": 1,
        "content": "That's D.   It's also the same question for Azure Fundamentals."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16039-exam-az-103-topic-3-question-8-discussion/",
    "body": "You have an Azure subscription named Subscription1.<br>You deploy a Linux virtual machine named VM1 to Subscription1.<br>You need to monitor the metrics and the logs of VM1.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe AzurePerformanceDiagnostics extension",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure HDInsight",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLinux Diagnostic Extension (LAD) 3.0",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Analysis Services"
    ],
    "answer": "A",
    "answerDescription": "You can use extensions to configure diagnostics on your VMs to collect additional metric data.<br>The basic host metrics are available, but to see more granular and VM-specific metrics, you need to install the Azure diagnostics extension on the VM. The Azure diagnostics extension allows additional monitoring and diagnostics data to be retrieved from the VM.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/linux/tutorial-monitoring",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-09T21:24:00.000Z",
        "voteCount": 41,
        "content": "Answer should be C as this is a Linux OS"
      },
      {
        "date": "2020-07-05T18:39:00.000Z",
        "voteCount": 3,
        "content": "Yes, C is right"
      },
      {
        "date": "2020-08-05T20:09:00.000Z",
        "voteCount": 6,
        "content": "Correct. \nReference: \nhttps://docs.microsoft.com/en-us/azure/virtual-machines/extensions/diagnostics-linux\n\nWhy A is wrong:\nPerformance Diagnostics Prerequisites: This extension can be installed on Windows Server 2008 R2, Windows Server 2012, Windows Server 2012 R2, and Windows Server 2016. It can also be installed on Windows 8.1 and Windows 10.\nReference: https://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/performance-diagnostics-vm-extension#prerequisites\n\nI believe some are confusing Linux PerfInsights with Performance Diagnostics because it is in the same section in the documentation as the Windows version, but as referenced above, the product specifically named Performance Diagnostics Extension is only for Windows."
      },
      {
        "date": "2020-03-17T19:24:00.000Z",
        "voteCount": 15,
        "content": "default answer A is correct as just to highlight that it apply to windows and linux\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/performance-diagnostics"
      },
      {
        "date": "2020-07-22T18:17:00.000Z",
        "voteCount": 1,
        "content": "This article doesn't talk about the Extension.  The extension for performance diagnostics for Linux is Linux Diagnostic Extension"
      },
      {
        "date": "2022-10-02T02:59:00.000Z",
        "voteCount": 1,
        "content": "answer is C\nUse Linux diagnostic extension 3.0 to monitor metrics and logs\nhttps://learn.microsoft.com/en-us/azure/virtual-machines/extensions/diagnostics-linux-v3"
      },
      {
        "date": "2021-03-21T03:19:00.000Z",
        "voteCount": 1,
        "content": "C\nhttps://docs.microsoft.com/en-us/troubleshoot/azure/virtual-machines/performance-diagnostics-vm-extension"
      },
      {
        "date": "2021-03-15T11:10:00.000Z",
        "voteCount": 1,
        "content": "Answer C for me\nAzurePerformance Diagnosctics is only for Windows OS. Check this links, this meet the requested \"monitor the metrics and the logs\"\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/extensions/diagnostics-linux"
      },
      {
        "date": "2021-02-23T17:11:00.000Z",
        "voteCount": 2,
        "content": "A is correct.\nhttps://docs.microsoft.com/en-us/troubleshoot/azure/virtual-machines/performance-diagnostics"
      },
      {
        "date": "2020-12-02T04:33:00.000Z",
        "voteCount": 2,
        "content": "It fell in my yesterday exam. I'm also of the opinion that option c is valid."
      },
      {
        "date": "2020-10-29T12:13:00.000Z",
        "voteCount": 2,
        "content": "C is abswer"
      },
      {
        "date": "2020-10-01T14:43:00.000Z",
        "voteCount": 3,
        "content": "C is the correct answer"
      },
      {
        "date": "2020-09-13T02:43:00.000Z",
        "voteCount": 2,
        "content": "Answer should be C.\n\nReference: https://docs.microsoft.com/en-us/azure/virtual-machines/extensions/diagnostics-linux"
      },
      {
        "date": "2020-08-29T12:32:00.000Z",
        "voteCount": 2,
        "content": "Performance diagnostics is used for troubleshooting only, it collects and monitors performance just for some time, the questions asks for continuos monitoring. so answer is C"
      },
      {
        "date": "2020-08-22T03:28:00.000Z",
        "voteCount": 1,
        "content": "It seems both A &amp; C are correct. Azure Performance Diagnosis extension and Linux Diagnosis Extension both can be used for  monitor metrics and logs. Can anyone explain why the answer C is not correct here?"
      },
      {
        "date": "2020-07-27T05:39:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/performance-diagnostics | Given answer is correct.\nYou can use the Download report button to download an HTML report that contains additional rich diagnostics information, such as storage and network configuration, performance counters, traces, list of processes, and logs"
      },
      {
        "date": "2020-07-26T13:50:00.000Z",
        "voteCount": 1,
        "content": "Such confusing question. LAD *IS* a Azure diagnostic extension.\nhttps://docs.microsoft.com/en-us/azure/azure-monitor/platform/diagnostics-extension-overview\nA and C are both \"correct\"\nThe provided \"tutorial monitoring\" proof/refence link doesn't support A."
      },
      {
        "date": "2020-07-26T13:52:00.000Z",
        "voteCount": 1,
        "content": "Also the term \"AzurePerformanceDiagnostics\" doesn't exist (now?)."
      },
      {
        "date": "2020-07-24T13:25:00.000Z",
        "voteCount": 3,
        "content": "C is the right answer."
      },
      {
        "date": "2020-07-14T02:21:00.000Z",
        "voteCount": 1,
        "content": "You can use Linux Diagnostic Extension to monitor metrics and logs:\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/extensions/diagnostics-linux\n\nHowever you can also use Performance diagnostics to collect logs and metrics (CPU, disk space, or memory) and it suports Linux as well:\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/performance-diagnostics\n\nSo for me options A and C, both are correct."
      },
      {
        "date": "2020-07-14T02:19:00.000Z",
        "voteCount": 2,
        "content": "You can use Linux Diagnostic Extension to monitor metrics and logs:\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/extensions/diagnostics-linux\n\nHowever you can also use Performance diagnostics to collect logs and metrics (CPU, disk space, or memory) and it suports Linuxa as well:\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/performance-diagnostics\n\nSo for me options A and C, both are correct."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/13806-exam-az-103-topic-3-question-9-discussion/",
    "body": "You have an Azure subscription that contains 100 virtual machines.<br>You regularly create and delete virtual machines.<br>You need to identify unattached disks that can be deleted.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Microsoft Azure Storage Explorer, view the Account Management properties.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure portal, configure the Advisor recommendations.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Azure Cost Management, view Advisor Recommendations.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Azure Cost Management, view Cost Analysis."
    ],
    "answer": "A",
    "answerDescription": "You can find unused disks in the Azure Storage Explorer console.Once you drill down to the Blob containers under a storage account, you can see the lease state of the residing VHD (the lease state determines if the VHD is being used by any resource) and the VM to which it is leased out. If you find that the lease state and the VM fields are blank, it means that the VHD in question is unused. The screenshot below shows two active VHDs being used by VMs as data and OS disks.<br>The name of the VM and lease state are shown in the \"VM Name\" and \"Lease State\" columns, respectively.<br>Reference:<br>https://cloud.netapp.com/blog/reduce-azure-storage-costs",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-23T15:24:00.000Z",
        "voteCount": 22,
        "content": "Going to go against the grain here and say Answer A - Azure Storage Explorer.\n\nThe wording on the answers is poor - I could not find an Azure Storage Explorer 'Account Management Properties' - but looking under the 'disks' section and viewing resource groups shows unallocated disks in black and white - very easy to see.\n\nFrom the Azure Cost Management section, I couldn't get any of the recommendations or cost analysis to trigger for unallocated disks and this article here even cites it as a weakness of the tool:\n\nhttps://www.cloudhealthtech.com/blog/optimize-azure-spend\n\n\"Similarly, there have been issues with the Azure Advisor being unable to identify unattached disks, and failing to notice over-provisioned resources. \""
      },
      {
        "date": "2020-03-29T14:53:00.000Z",
        "voteCount": 1,
        "content": "Both the question and  that articles are outdated. this question is not valid anymore. both A, C, D are not fully accurate answers."
      },
      {
        "date": "2020-04-05T09:43:00.000Z",
        "voteCount": 4,
        "content": "A is correct https://www.checkyourlogs.net/using-azure-storage-explorer-to-remove-unattached-vm-disks/"
      },
      {
        "date": "2021-07-17T16:49:00.000Z",
        "voteCount": 3,
        "content": "The question does not state that you need to go and delete unattached disks. Read the question, it states you need to 'identify' unattached disks to delete. The most appropriate and recommended way from Microsoft is to view Advisor recommendations. Then you can go and use storage explorer after \"identifying\" them in Advisor. As per usual, read the question, don't make assumptions."
      },
      {
        "date": "2020-02-22T21:02:00.000Z",
        "voteCount": 22,
        "content": "C is correct\nCost Management+Billing, Cost Management, Advisor recommendations,"
      },
      {
        "date": "2022-04-15T08:50:00.000Z",
        "voteCount": 1,
        "content": "yes ####this####"
      },
      {
        "date": "2024-03-20T07:21:00.000Z",
        "voteCount": 1,
        "content": "C is correct"
      },
      {
        "date": "2023-03-09T05:16:00.000Z",
        "voteCount": 1,
        "content": "Medium\nYou have disks which have not been attached to a VM for more than 30 days. Please evaluate if you still need the disk.\n5 Disks\n\nThis is what I saw in From Azure Cost Management, view Advisor Recommendations."
      },
      {
        "date": "2021-07-20T23:26:00.000Z",
        "voteCount": 1,
        "content": "Initially I was drawn to advisor and cost management. However, cost is not mentioned and it states you regularly delete machines. Therefore storage explorer seems much faster and more suitable for the requirement."
      },
      {
        "date": "2021-06-25T22:40:00.000Z",
        "voteCount": 2,
        "content": "Answer:\nC. From Azure Cost Management, view Advisor Recommendations."
      },
      {
        "date": "2021-02-23T17:26:00.000Z",
        "voteCount": 3,
        "content": "Cost Advisor contains many issues which might include the unattached disks. But the question is mainly ask about unattached disks because of creating and deleting VMs. So derictly check Storage Account and the disks' Properties."
      },
      {
        "date": "2021-01-04T09:30:00.000Z",
        "voteCount": 2,
        "content": "This question must be outdated! the correct answer is not even in options. To check an unattached disk, go to Disks and then add a column 'disk state'. This will show  you which ones are not attached to any VM."
      },
      {
        "date": "2020-11-30T00:23:00.000Z",
        "voteCount": 1,
        "content": "For this question, i would go for A since Azure Advisor would only detect the unattached disk after several days which the questions doesnt state which mean we need to find the unattached disk urgently without waiting."
      },
      {
        "date": "2020-11-15T22:23:00.000Z",
        "voteCount": 1,
        "content": "It can also be checked from Azure Advisor --&gt; All recommendations"
      },
      {
        "date": "2020-10-30T02:15:00.000Z",
        "voteCount": 1,
        "content": "A is correct"
      },
      {
        "date": "2020-09-22T03:17:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/find-unattached-disks"
      },
      {
        "date": "2020-09-22T03:16:00.000Z",
        "voteCount": 1,
        "content": "The answer A is correct. https://docs.microsoft.com/en-us/azure/virtual-machines/windows/find-unattached-disks"
      },
      {
        "date": "2020-08-24T18:38:00.000Z",
        "voteCount": 1,
        "content": "I believe the answer is A, we can see the unattached disks easily using A. C would also be a reasonable answer if you dont want to manually select"
      },
      {
        "date": "2020-08-16T11:15:00.000Z",
        "voteCount": 1,
        "content": "A is correct, to identify orphaned disk, we should check disk propoties"
      },
      {
        "date": "2020-08-09T13:02:00.000Z",
        "voteCount": 1,
        "content": "Yea, imma go with C."
      },
      {
        "date": "2020-07-27T00:36:00.000Z",
        "voteCount": 2,
        "content": "I'm looking for an MS document and find the below link.\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/disks-find-unattached-portal?toc=/azure/virtual-machines/linux/toc.json&amp;bc=/azure/virtual-machines/linux/breadcrumb/toc.json\n\nbasically, it says that;\nUnmanaged disks: Find and delete unattached disks\nUnmanaged disks are VHD files that are stored as page blobs in Azure storage accounts.\n\nIf you have unmanaged disks that aren't attached to a VM, no longer need the data on them, and would like to delete them, the following process explains how to do so from the Azure portal:\nSign in to the Azure portal.\nSearch for and select Disks (Classic).\nYou are presented with a list of all your unmanaged disks. Any disk that has \"-\" in the Attached to column is an unattached disk."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/10272-exam-az-103-topic-3-question-10-discussion/",
    "body": "You have an Azure virtual machine named VM1.<br>Azure collects events from VM1.<br>You are creating an alert rule in Azure Monitor to notify an administrator when an error is logged in the System event log of VM1.<br>You need to specify which resource type to monitor.<br>What should you specify?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmetric alert",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Log Analytics workspace",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tvirtual machine",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tvirtual machine extension"
    ],
    "answer": "D",
    "answerDescription": "Azure Monitor can collect data directly from your Azure virtual machines into a Log Analytics workspace for detailed analysis and correlation. Installing the Log<br>Analytics VM extension for Windows and Linux allows Azure Monitor to collect data from your Azure VMs.<br>Incorrect Answers:<br>B: Azure Log Analytics workspace is used for on-premises computers monitored by System Center Operations Manager.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/azure-monitor/learn/quick-collect-azurevm",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-07T13:04:00.000Z",
        "voteCount": 48,
        "content": "Thier answer is wrong. The answer is \"C\". Go to Azure Monitor &gt; Alerts &gt; New Alert &gt; Select Resource &gt; .... Here you can select a resource type, since the question refers to VM1, you need to select the virtual machine type. Selecting a type is not required but their answer is looking for virtual machine type."
      },
      {
        "date": "2020-05-13T08:58:00.000Z",
        "voteCount": 2,
        "content": "Bur the question is referring to \"System Events\" only"
      },
      {
        "date": "2020-08-26T06:51:00.000Z",
        "voteCount": 2,
        "content": "well aid.. I dunno why few are simply fooling .\nIts \"C\"\nhttps://www.udemy.com/course/microsoft-certified-azure-administrator/learn/lecture/13160056#overview\nSearch for monitor --&gt; metrics --&gt; select resource type --&gt; VM"
      },
      {
        "date": "2020-02-28T02:15:00.000Z",
        "voteCount": 34,
        "content": "I think the correct answer is B - Azure Log Analytics workspace.\nYou can collect Windows Event logs into Log Analytics workspace\nhttps://docs.microsoft.com/en-us/azure/azure-monitor/platform/data-sources-windows-events\nThen you can create alert rule, with resource type \"Azure Log Analytics workspace\" and specify the condition based on query from collected logs.\nhttps://docs.microsoft.com/en-us/azure/azure-monitor/platform/alerts-log"
      },
      {
        "date": "2020-04-21T20:33:00.000Z",
        "voteCount": 11,
        "content": "^^^^ THIS ^^^^\nEvent Logs are written to the Log Analytics Workspace.\nThe Alert rule needs to be triggered based on a Query run against the Log Analytics Workspace.\nTherefore the alert resource is the Log Analytics Workspace."
      },
      {
        "date": "2020-08-09T00:24:00.000Z",
        "voteCount": 4,
        "content": "I agree - nice described here: https://docs.microsoft.com/en-us/azure/azure-monitor/insights/monitor-vm-azure#configure-log-analytics-workspace"
      },
      {
        "date": "2024-03-13T03:59:00.000Z",
        "voteCount": 1,
        "content": "B is the right answer"
      },
      {
        "date": "2023-11-12T01:58:00.000Z",
        "voteCount": 1,
        "content": "Azure Log Analytics Workspace is the answer in 2023."
      },
      {
        "date": "2023-03-13T06:30:00.000Z",
        "voteCount": 1,
        "content": "Wow there's a lot of different answers. From Udemy:\nExplanation\nCorrect Answer(s):\n\nAzure Log Analytics workspace – Logs contain different kinds of data organized into records with different sets of properties for each type. You can create and test queries using Log Analytics in the Azure portal and then either directly analyze the data using these tools or save queries for use with visualizations or alert rules. You need to select your Log Analytics workspace as the resource, since this is a log based alert signal.\n\nhttps://docs.microsoft.com/en-us/windows-server/storage/storage-spaces/configure-azure-monitor\n\nWrong Answers:\n\nVirtual machine extension – This is to configure post-deployment configurations on a virtual machine.\n\n\n\nVirtual machine –Logs will be sent to Log destination like Log analytics workspace, nothing gets persisted inside a virtual machine.\n\n\n\nMetric alert – Metric is for alerts based on numbers like CPU usage, Memory usage etc."
      },
      {
        "date": "2022-04-15T08:46:00.000Z",
        "voteCount": 2,
        "content": "For the first step to create the new alert tule, under the Create Alert section, you are going to select your Log Analytics workspace as the resource, since this is a log based alert signal.\n\nThe log data goes to the analytics workspace and it is from there that the alert is triggered."
      },
      {
        "date": "2021-06-25T22:42:00.000Z",
        "voteCount": 2,
        "content": "Answer:\nB: Azure Log Analytics workspace is used for on-premises computers monitored by System Center Operations Manager.\n\nHighlighted answer is wrong but description is pretty clear :)"
      },
      {
        "date": "2021-06-20T12:15:00.000Z",
        "voteCount": 4,
        "content": "Just tested. Correct answer is B. Azure Log Analytics workspace. Reason although you can set alert on VM and VM extensions, only on Log Analytics can you get System event logs, to set alert on."
      },
      {
        "date": "2021-03-17T06:45:00.000Z",
        "voteCount": 2,
        "content": "From this doc, it seems the log analytics workspace is also considered a resource: https://docs.microsoft.com/en-us/azure/azure-monitor/vm/quick-collect-azurevm\nAnd the VM extension is also needed."
      },
      {
        "date": "2021-01-07T08:26:00.000Z",
        "voteCount": 2,
        "content": "The Clue is \"resource type to monitor.\" VM is the answer."
      },
      {
        "date": "2021-01-01T14:56:00.000Z",
        "voteCount": 1,
        "content": "Here is the correct answer.\n\nrefer pic at Point 4 ...from below source link\n\nSource:\nhttps://docs.microsoft.com/en-us/azure/azure-monitor/platform/alerts-log#creating-log-alert-for-log-analytics-and-application-insights-from-the-alerts-management.\n\n\nour test condition to monitor error is in LA workspace,,, azure monitor monitors this LA workspace ..."
      },
      {
        "date": "2021-01-01T14:57:00.000Z",
        "voteCount": 1,
        "content": "Typo.\n\n\nHere is the correct answer.\n\nrefer pic at Point 4 of \"\"\"\"Creating log alert for Log Analytics and Application Insights from the alerts management\"\"\"\"  ...from below source link\n\nSource:\nhttps://docs.microsoft.com/en-us/azure/azure-monitor/platform/alerts-log#creating-log-alert-for-log-analytics-and-application-insights-from-the-alerts-management.\n\n\nour test condition to monitor error is in LA workspace,,, azure monitor monitors this LA workspace ..."
      },
      {
        "date": "2020-11-17T02:20:00.000Z",
        "voteCount": 2,
        "content": "Good Answer is B. Azure Log Analytics workspace.\nYou can't monitor events with virtual machines.\nA &amp; D aren't resources."
      },
      {
        "date": "2020-11-12T06:14:00.000Z",
        "voteCount": 2,
        "content": "signal type: Log alerts, resource type: Log Analytics workspace"
      },
      {
        "date": "2020-10-30T02:17:00.000Z",
        "voteCount": 1,
        "content": "C. virtual machine"
      },
      {
        "date": "2020-10-29T12:52:00.000Z",
        "voteCount": 1,
        "content": "C. virtual machine"
      },
      {
        "date": "2020-10-09T11:43:00.000Z",
        "voteCount": 1,
        "content": "correct answer is C. I have tried it and the only option in the list one can choose as a resource is virtual machine."
      },
      {
        "date": "2020-08-18T11:43:00.000Z",
        "voteCount": 5,
        "content": "To test this out, I have created a VM and enabled logging on it. When you enable logging, Azure will create a default Log Analytics Workspace. Next, I went in monitor to create an alert for System Errors. In Monitor, we can either choose VM or Log Analytics as the source of the alert. If you select, VM as the source of the alert, there is no error log option but Activity Logs. If you select Log Analytics space, System Error option will be available to create an alert. May be the detail could be \"/...Azure collects events from VM1\". You collect the events somewhere, which is a Log Analytics Workspace. This is, in turn, the source of the alert. Quite confusing guys... I would go with B."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20714-exam-az-103-topic-3-question-11-discussion/",
    "body": "DRAG DROP -<br>You have an availability set named AS1 that contains three virtual machines named VM1, VM2, and VM3.<br>You attempt to reconfigure VM1 to use a larger size. The operation fails and you receive an allocation failure message.<br>You need to ensure that the resize operation succeeds.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03048/0015200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0015300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Stop VM1, VM, and VM3.<br>If the VM you wish to resize is part of an availability set, then you must stop all VMs in the availability set before changing the size of any VM in the availability set.<br>The reason all VMs in the availability set must be stopped before performing the resize operation to a size that requires different hardware is that all running VMs in the availability set must be using the same physical hardware cluster. Therefore, if a change of physical hardware cluster is required to change the VM size then all VMs must be first stopped and then restarted one-by-one to a different physical hardware clusters.<br>Step 2: Resize VM1.<br>Step 3: Start VM1, VM2, and VM3.<br>References:<br>https://azure.microsoft.com/es-es/blog/resize-virtual-machines/",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-16T19:47:00.000Z",
        "voteCount": 14,
        "content": "It's a correct answer"
      },
      {
        "date": "2020-06-27T02:30:00.000Z",
        "voteCount": 1,
        "content": "Yes, I agree"
      },
      {
        "date": "2020-07-05T20:07:00.000Z",
        "voteCount": 2,
        "content": "Yes, answer is correct.\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/windows/resize-vm#use-powershell-to-resize-a-vm-in-an-availability-set"
      },
      {
        "date": "2024-03-18T14:05:00.000Z",
        "voteCount": 1,
        "content": "Given answer is correct"
      },
      {
        "date": "2022-10-02T04:08:00.000Z",
        "voteCount": 1,
        "content": "last step should be start VM1\neven I thought we have to restart all the VMs at once but no we have to first start the resized VM and then we can start the other two.\nhttps://learn.microsoft.com/en-us/troubleshoot/azure/virtual-machines/restart-resize-error-troubleshooting#issue-error-when-resizing-an-existing-vm"
      },
      {
        "date": "2021-04-09T05:59:00.000Z",
        "voteCount": 1,
        "content": "It's a correct answer"
      },
      {
        "date": "2020-10-22T05:34:00.000Z",
        "voteCount": 3,
        "content": "The anwser is wrong - re-read the question:\n\"You need to ensure that the resize operation succeeds.\"\n\n=&gt; So the last step is to start VM1 (only!), because of two reasons:\n\n1. It addresses the requirement. No need for VM2 or VM3, you must ENSURE resizing.\n2. It is officially MS's solution: \"After all VMs stop, select the first VM, and then click Start. This step makes sure that a new allocation attempt is run and that a new cluster can be selected that has sufficient capacity.\"\n\nSource: https://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/allocation-failure\n\nOfcourse after VM1 has been resized and started, later you will also startup VM2 and VM3, but not in the same time as VM1 as the psyical/cluster allocation must be done before that."
      },
      {
        "date": "2020-09-16T22:15:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct.\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/windows/resize-vm"
      },
      {
        "date": "2020-08-09T13:39:00.000Z",
        "voteCount": 2,
        "content": "Given answer appears correct.\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/allocation-failure\n\n\"then restart each one\""
      },
      {
        "date": "2020-08-09T07:19:00.000Z",
        "voteCount": 2,
        "content": "The main answer is correct.  You have to stop all VMs in the availability set.  Then, resize the VM and then start all of the VMs.  Here is a link showing the way to do it using Powershell.  Specifically states these steps if you scroll down to Use PowerShell to resize a VM in an availability set\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/windows/resize-vm"
      },
      {
        "date": "2020-07-30T11:44:00.000Z",
        "voteCount": 2,
        "content": "The last answer should be \"start VM 1\"\n\nStop (deallocate) all VMs in the same availability set, then restart each one. To stop: Click Resource groups &gt; [your resource group] &gt; Resources &gt; [your availability set] &gt; Virtual Machines &gt; [your virtual machine] &gt; Stop. After all VMs stop, select the first VM, and then click Start. This step makes sure that a new allocation attempt is run and that a new cluster can be selected that has sufficient capacity \n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/allocation-failure"
      },
      {
        "date": "2020-07-20T00:52:00.000Z",
        "voteCount": 2,
        "content": "If the VM can be part of a different availability set, create a VM in a different availability set (in the same region). This new VM can then be added to the same virtual network.\n\nStop (deallocate) all VMs in the same availability set, then restart each one. To stop: Click Resource groups &gt; [your resource group] &gt; Resources &gt; [your availability set] &gt; Virtual Machines &gt; [your virtual machine] &gt; Stop. After all VMs stop, select the first VM, and then click Start. This step makes sure that a new allocation attempt is run and that a new cluster can be selected that has sufficient capacity.\n\n1st 2 options are correct and 3rd Option \"Start VM1\".\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/allocation-failure"
      },
      {
        "date": "2020-07-20T00:54:00.000Z",
        "voteCount": 1,
        "content": "Then Start VM2, VM3. So the given answer is right. :)"
      },
      {
        "date": "2020-07-11T02:32:00.000Z",
        "voteCount": 4,
        "content": "Stop Vm1,Vm2,vm3\nResize Vm1\nStart Vm1\ncheck link: https://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/allocation-failure\nThe cluster need to be updated to support new vm size. So only Vm1 should be started after resize. then vm2 and vm3"
      },
      {
        "date": "2020-07-13T08:24:00.000Z",
        "voteCount": 2,
        "content": "guys this is the correct answer please check link\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/allocation-failure"
      },
      {
        "date": "2020-06-22T02:12:00.000Z",
        "voteCount": 3,
        "content": "resizing VM1 will reboot it so step 3 should be Start VM2 and VM3.\nVM1 is already in running state after resizing."
      },
      {
        "date": "2020-06-25T20:46:00.000Z",
        "voteCount": 4,
        "content": "you are right. it seems this certificate makes the people very confused."
      },
      {
        "date": "2020-06-30T02:48:00.000Z",
        "voteCount": 22,
        "content": "I just tried it. Resizing the Stopped VM doesn't make it start. Don't spread false information."
      },
      {
        "date": "2021-03-25T17:41:00.000Z",
        "voteCount": 1,
        "content": "wrong, machine wont restart unless you start after resizing"
      },
      {
        "date": "2020-05-24T21:41:00.000Z",
        "voteCount": 1,
        "content": "Lot's of blogs etc. \nBest Azure Docs reference is the reference to Allocation Failure here:\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/restart-resize-error-troubleshooting#issue-error-when-starting-a-stopped-vm"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/10739-exam-az-103-topic-3-question-12-discussion/",
    "body": "You plan to back up an Azure virtual machine named VM1.<br>You discover that the Backup Pre-Check status displays a status of Warning.<br>What is a possible cause of the Warning status?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVM1 is stopped.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVM1 does not have the latest version of WaAppAgent.exe installed.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVM1 has an unmanaged disk.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Recovery Services vault is unavailable."
    ],
    "answer": "B",
    "answerDescription": "The Warning state indicates one or more issues in VM's configuration that might lead to backup failures and provides recommended steps to ensure successful backups. Not having the latest VM Agent installed, for example, can cause backups to fail intermittently and falls in this class of issues.<br>References:<br>https://azure.microsoft.com/en-us/blog/azure-vm-backup-pre-checks/",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-23T12:35:00.000Z",
        "voteCount": 12,
        "content": "Answer B . If the backup agent on the server is not up to date. Refer: https://azure.microsoft.com/en-gb/blog/azure-vm-backup-pre-checks/"
      },
      {
        "date": "2020-05-05T10:44:00.000Z",
        "voteCount": 1,
        "content": "true:\nWarning: This state indicates one or more issues in VM’s configuration that might lead to backup failures and provides recommended steps to ensure successful backups. Not having the latest VM Agent installed, for example, can cause backups to fail intermittently and falls in this class of issues."
      },
      {
        "date": "2020-07-05T20:12:00.000Z",
        "voteCount": 1,
        "content": "Agree with prb."
      },
      {
        "date": "2020-05-19T09:20:00.000Z",
        "voteCount": 8,
        "content": "Answer is correct. Please see video\nhttps://azure.microsoft.com/en-us/blog/azure-vm-backup-pre-checks/"
      },
      {
        "date": "2024-03-19T01:13:00.000Z",
        "voteCount": 1,
        "content": "B is right"
      },
      {
        "date": "2022-11-14T10:34:00.000Z",
        "voteCount": 2,
        "content": "Answer is correct! Please refer to this link\nhttps://azure.microsoft.com/en-us/blog/azure-vm-backup-pre-checks/"
      },
      {
        "date": "2020-11-06T03:42:00.000Z",
        "voteCount": 1,
        "content": "B. VM1 does not have the latest version of WaAppAgent.exe installed."
      },
      {
        "date": "2020-10-28T17:22:00.000Z",
        "voteCount": 1,
        "content": "B is correct:\n\nhttps://azure.microsoft.com/en-us/blog/azure-vm-backup-pre-checks/#:~:text=We%20are%20excited%20to%20announce,Checks%20for%20Azure%20Virtual%20Machines.&amp;text=Warning%3A%20This%20state%20indicates%20one,steps%20to%20ensure%20successful%20backups."
      },
      {
        "date": "2020-08-09T13:50:00.000Z",
        "voteCount": 1,
        "content": "The Azure VM Agent is needed for Azure VM Backups...as mrshahid linked to below;\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-arm-vms-prepare#optional-steps-install-agentallow-outbound\n\nSee 'Optional steps'...if the VM Agent is missing or not updated it will cause a Warning!\n\nAZ-900 Fundamentals Q btw."
      },
      {
        "date": "2020-07-27T15:29:00.000Z",
        "voteCount": 3,
        "content": "Answer B!!"
      },
      {
        "date": "2020-06-23T16:39:00.000Z",
        "voteCount": 1,
        "content": "The given answer B is correct."
      },
      {
        "date": "2020-05-29T12:14:00.000Z",
        "voteCount": 1,
        "content": "Answer which simpledba noted for warning is correct according to the documentation."
      },
      {
        "date": "2020-02-09T22:32:00.000Z",
        "voteCount": 1,
        "content": "D. A Recovery Services vault is unavailable.\n\nWaAppAgent.exe, optional step only when you have a Custom VM or on-premise migrated to Azure.\nRead: https://docs.microsoft.com/en-us/azure/backup/backup-azure-arm-vms-prepare#optional-steps-install-agentallow-outbound"
      },
      {
        "date": "2020-02-09T22:36:00.000Z",
        "voteCount": 4,
        "content": "I also saw this article:\nWarning: This state indicates one or more issues in VM’s configuration that might lead to backup failures and provides recommended steps to ensure successful backups. Not having the latest VM Agent installed, for example, can cause backups to fail intermittently and falls in this class of issues.\n\nSource: https://azure.microsoft.com/en-us/blog/azure-vm-backup-pre-checks/\n\nQuestion is not very clear."
      },
      {
        "date": "2020-03-24T00:42:00.000Z",
        "voteCount": 7,
        "content": "Seems quite clear cut to me:\n\nIn the question \"What is a possible cause of the Warning status?\"\n\nhttps://azure.microsoft.com/en-us/blog/azure-vm-backup-pre-checks/ \n\n\"Warning: This state indicates one or more issues in VM’s configuration that might lead to backup failures and provides recommended steps to ensure successful backups. Not having the latest VM Agent installed, for example, can cause backups to fail intermittently and falls in this class of issues.\"\n\n..out of date Agent is cited as an example of a warning.  If a Recovery Services vault is unavailable, would this not be a 'Critical' level status?"
      },
      {
        "date": "2019-12-20T23:23:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/backup/backup-azure-arm-vms-prepare#optional-steps-install-agentallow-outbound"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17289-exam-az-103-topic-3-question-13-discussion/",
    "body": "You have an Azure subscription named Subscription1 that is used by several departments at your company. Subscription1 contains the resources in the following table.<br><img src=\"/assets/media/exam-media/03048/0015400001.png\" class=\"in-exam-image\"><br>Another administrator deploys a virtual machine named VM1 and an Azure Storage account named Storage2 by using a single Azure Resource Manager template.<br>You need to view the template used for the deployment.<br>From which blade can you view the template that was used for the deployment?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tContainer1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRG1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVM1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStorage2"
    ],
    "answer": "B",
    "answerDescription": "View template from deployment history<br>1. Go to the resource group for your new resource group. Notice that the portal shows the result of the last deployment. Select this link.<br><img src=\"/assets/media/exam-media/03048/0015500001.png\" class=\"in-exam-image\"><br>2. You see a history of deployments for the group. In your case, the portal probably lists only one deployment. Select this deployment.<br><img src=\"/assets/media/exam-media/03048/0015600001.png\" class=\"in-exam-image\"><br>3. The portal displays a summary of the deployment. The summary includes the status of the deployment and its operations and the values that you provided for parameters. To see the template that you used for the deployment, select View template.<br><img src=\"/assets/media/exam-media/03048/0015600002.png\" class=\"in-exam-image\"><br>References:<br>https://docs.microsoft.com/en-us/azure/azure-resource-manager/resource-manager-export-template",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-01T02:49:00.000Z",
        "voteCount": 10,
        "content": "Came in exam 1st  Aug 2020"
      },
      {
        "date": "2020-07-06T01:56:00.000Z",
        "voteCount": 8,
        "content": "Came in Exam , Exam given on 06.07.2020"
      },
      {
        "date": "2021-05-15T12:56:00.000Z",
        "voteCount": 1,
        "content": "I think it is StoageAccount2 blade.\nA blade is the title of the page. When you go to Resource Group blade and click on Deployments it take you to the deployments blade. When  you click on the stroage account, you are in storage account overview black, from there you can click on Template"
      },
      {
        "date": "2021-01-15T04:21:00.000Z",
        "voteCount": 2,
        "content": "You can see Deployments blade in resource group."
      },
      {
        "date": "2021-01-14T09:38:00.000Z",
        "voteCount": 1,
        "content": "I think it is From \"Storage2\". checked my own storage account and there is also an \"Export template\" option."
      },
      {
        "date": "2021-01-14T09:46:00.000Z",
        "voteCount": 1,
        "content": "Just thinking about it little more. You Deploy a VM, and create a storage account. You can create multiple Storage accounts in your resource group. So to sum up, I think it is RG1 in stead of Storage2."
      },
      {
        "date": "2020-11-29T00:16:00.000Z",
        "voteCount": 5,
        "content": "in exam az-104 29nov 2020"
      },
      {
        "date": "2020-08-15T05:10:00.000Z",
        "voteCount": 4,
        "content": "'Another administrator deploys a virtual machine named VM1 \"and\" an Azure Storage account'\nThis is why RG1 is the answer...else you would need to view each one at a time..."
      },
      {
        "date": "2020-07-29T08:15:00.000Z",
        "voteCount": 1,
        "content": "If resource group info is not mentioned that is being used to deploy VM1 , then in that case using VM1 to view/download templates make more sense rather than checking RG1 option. Answer should be VM1"
      },
      {
        "date": "2020-07-12T12:55:00.000Z",
        "voteCount": 2,
        "content": "Ok - but why not check the template on the VM1 ?\nIs there a difference?"
      },
      {
        "date": "2020-07-23T05:39:00.000Z",
        "voteCount": 1,
        "content": "You can get it from there too, but it's not part of the options, so given is correct"
      },
      {
        "date": "2020-07-29T08:16:00.000Z",
        "voteCount": 2,
        "content": "VM1 option is provided, so that can be right one"
      },
      {
        "date": "2020-08-04T14:23:00.000Z",
        "voteCount": 1,
        "content": "here, I think they are asking for the template to deploy the VM and the account storage, that's why"
      },
      {
        "date": "2020-06-14T07:24:00.000Z",
        "voteCount": 2,
        "content": "RIGHT QUESTION I DID A LAB TEST"
      },
      {
        "date": "2020-04-27T07:59:00.000Z",
        "voteCount": 1,
        "content": "yes answer is correct ..but Resource group is not a blade :)"
      },
      {
        "date": "2020-04-05T13:20:00.000Z",
        "voteCount": 6,
        "content": "Answer is correct. \nAs all templates can be found from the ResourceGroups-&gt;Export Template."
      },
      {
        "date": "2020-07-22T22:00:00.000Z",
        "voteCount": 1,
        "content": "No that will give you all the things that were deployed in RG. You just want to see the latest one where you deployed the VM1 &amp; Storage account 2...hence go to Deployments in RG Blade..select the latest deployment &amp; click on view template"
      },
      {
        "date": "2020-03-22T20:02:00.000Z",
        "voteCount": 3,
        "content": "question is weird, it does not even say which resource group was used for storage account creation"
      },
      {
        "date": "2020-03-24T00:50:00.000Z",
        "voteCount": 5,
        "content": "Yeah I agree - poorly worded.  We'll have to assume it is the same as the initial question.  I guess it is more a question of \"Which blade can you use to check past template deployments made by another user\""
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16088-exam-az-103-topic-3-question-14-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/03048/0015700001.png\" class=\"in-exam-image\"><br>VM1 connects to VNET1.<br>You need to connect VM1 to VNET2.<br>Solution: You create a new network interface, and then you add the network interface to VM1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "Instead you should delete VM1. You recreate VM1, and then you add the network interface for VM1.<br>Note: When you create an Azure virtual machine (VM), you must create a virtual network (VNet) or use an existing VNet. You can change the subnet a VM is connected to after it's created, but you cannot change the VNet.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/network-overview",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-10T05:58:00.000Z",
        "voteCount": 23,
        "content": "Each NIC attached to a VM must exist in the same location and subscription as the VM. Each NIC must be connected to a VNet that exists in the same Azure location and subscription as the NIC."
      },
      {
        "date": "2020-08-01T02:50:00.000Z",
        "voteCount": 11,
        "content": "Came in exam 1st  Aug 2020"
      },
      {
        "date": "2020-07-27T05:07:00.000Z",
        "voteCount": 1,
        "content": "VPC peering can't be the answer because we want the VM to BE directly attached to vnet2.\nwe gotta delete and re-create it."
      },
      {
        "date": "2020-06-17T16:24:00.000Z",
        "voteCount": 2,
        "content": ".Vnet to Vnet(Vnet to Vnet peering should be done)\nStop and deallocate the VM then delete only VM,then create the VM used by it’s old disk.\nAnother method create a snap of the disk,them from the snap create disk then create VM from that disk.\n\nOnce after attach the other disks of the old VM to the new VM."
      },
      {
        "date": "2020-06-17T16:26:00.000Z",
        "voteCount": 1,
        "content": "IN which case, Answer is B. Replacing the NIC will not work to change VNETs, you need to save the disks, delete the VM, create new VM and readd the old disks."
      },
      {
        "date": "2020-06-01T17:47:00.000Z",
        "voteCount": 1,
        "content": "Can I move my services in and out of VNets?\nNo. You cannot move services in and out of VNets. To move a resource to another VNet, you have to delete and redeploy the resource."
      },
      {
        "date": "2020-05-28T01:56:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/virtual-network/virtual-networks-faq#can-i-move-my-services-in-and-out-of-vnets"
      },
      {
        "date": "2020-04-30T10:01:00.000Z",
        "voteCount": 9,
        "content": "If they want to move the VM1 to VNET2 the answer would be Yes:\nDelete the VM1 and then recreate VM1 in VNET2\n\nHowever if they want to connect VM1 to VNET2, the answer would be No:\nA VNET peering would be the answer."
      },
      {
        "date": "2020-04-27T08:03:00.000Z",
        "voteCount": 5,
        "content": "typo in description ...VNET1 and VNET2 are virtual network not VM"
      },
      {
        "date": "2020-04-16T10:08:00.000Z",
        "voteCount": 1,
        "content": "From what I have read you cannot move VMs between VNETS. You would have to delete the VM and recreate it in the new VNET or back it up and restore it to the new VNET"
      },
      {
        "date": "2020-04-13T08:14:00.000Z",
        "voteCount": 1,
        "content": "Even if we have the vnet in the same region as the VM, when can not change the Vnet of the VM. So the answer is correct also the note."
      },
      {
        "date": "2020-03-26T14:58:00.000Z",
        "voteCount": 1,
        "content": "even if you stop your vm, if you try to create new it wont allow you to select different vNet"
      },
      {
        "date": "2020-03-22T20:05:00.000Z",
        "voteCount": 1,
        "content": "I still think, this is yes. One virtual machine can have many network interfaces and all of them can connect to different networks. this is networking 101"
      },
      {
        "date": "2020-03-24T01:00:00.000Z",
        "voteCount": 2,
        "content": "No - VNets cannot span regions:\n\nhttps://docs.microsoft.com/en-us/azure/virtual-network/virtual-networks-faq\n\n\"Can a VNet span regions?\nNo. A VNet is limited to a single region. A virtual network does, however, span availability zones. To learn more about availability zones, see Availability zones overview. You can connect virtual networks in different regions with virtual network peering. For details, see Virtual network peering overview\"\n\nThe question specifically mentions changing the machine from VNET1 (West US) to VNET2 (East Asia) - this is only possible by deleting and re-creating the machine.\n\nVNet peering would be possible between VNET1 and VNET2, however, in this case you would have the VM having a NIC attached to single one of these VNETs depending on the region it was in and logically it would have access to the other - you wouldn't add both to the same VM."
      },
      {
        "date": "2020-03-24T01:03:00.000Z",
        "voteCount": 6,
        "content": "Just realised that doesn't answer the question about the machine itself having multiple NICs in different regions but this reinforces the point:\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/windows/multiple-nics\n\n\"Virtual machines (VMs) in Azure can have multiple virtual network interface cards (NICs) attached to them. A common scenario is to have different subnets for front-end and back-end connectivity. You can associate multiple NICs on a VM to multiple subnets, but those subnets must all reside in the same virtual network (vNet).\""
      },
      {
        "date": "2020-03-29T03:25:00.000Z",
        "voteCount": 4,
        "content": "This doesn't only reinforces your point. Instead, it proves it.\n\nWe can't have NICs attached to different VNets in the same VM.\n\nI found that weird too, so I tried it out. Turns out you really can't!"
      },
      {
        "date": "2020-03-19T02:26:00.000Z",
        "voteCount": 9,
        "content": "I would setup a peering to solve this"
      },
      {
        "date": "2020-06-09T12:44:00.000Z",
        "voteCount": 1,
        "content": "VNet peering cannot be used between VNets in different regions."
      },
      {
        "date": "2020-06-14T07:27:00.000Z",
        "voteCount": 7,
        "content": "you are wrong !!! Global VNet Peering is now generally available in four additional regions: Europe West, US East 2, Asia South East, and Central US.\n\nGlobal VNet Peering enables resources in your virtual network to communicate across Azure regions privately through the Microsoft backbone."
      },
      {
        "date": "2020-06-17T16:02:00.000Z",
        "voteCount": 2,
        "content": "Agreed. Global VNets can be created."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24167-exam-az-103-topic-3-question-15-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/03048/0015800001.png\" class=\"in-exam-image\"><br>VM1 connects to VNET1.<br>You need to connect VM1 to VNET2.<br>Solution: You turn off VM1, and then you add a new network interface to VM1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "Instead you should delete VM1. You recreate VM1, and then you add the network interface for VM1.<br>Note: When you create an Azure virtual machine (VM), you must create a virtual network (VNet) or use an existing VNet. You can change the subnet a VM is connected to after it's created, but you cannot change the VNet.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/network-overview",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-24T02:59:00.000Z",
        "voteCount": 1,
        "content": "delete VM1. You recreate VM1, and then you create a new network interface for VM1"
      },
      {
        "date": "2020-06-26T11:13:00.000Z",
        "voteCount": 1,
        "content": "Same scenario, I think they need to be in same region."
      },
      {
        "date": "2020-06-28T17:23:00.000Z",
        "voteCount": 4,
        "content": "Has nothing to do with region. I actually needed to do this for a real project and I was unable to do it. You can only move subnets but not Vnets"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17913-exam-az-103-topic-3-question-16-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/03048/0015900001.png\" class=\"in-exam-image\"><br>VM1 connects to VNET1.<br>You need to connect VM1 to VNET2.<br>Solution: You delete VM1. You recreate VM1, and then you create a new network interface for VM1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "Instead you should delete VM1. You recreate VM1, and then you add the network interface for VM1.<br>Note: When you create an Azure virtual machine (VM), you must create a virtual network (VNet) or use an existing VNet. You can change the subnet a VM is connected to after it's created, but you cannot change the VNet.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/network-overview",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-16T10:10:00.000Z",
        "voteCount": 8,
        "content": "This answer is correct you have to delete and recreate the VM"
      },
      {
        "date": "2020-08-15T05:49:00.000Z",
        "voteCount": 2,
        "content": "Yep, or just create a new VM...and assign it to VNet2"
      },
      {
        "date": "2020-08-01T02:50:00.000Z",
        "voteCount": 8,
        "content": "Came in exam 1st  Aug 2020"
      },
      {
        "date": "2020-10-29T13:20:00.000Z",
        "voteCount": 3,
        "content": "Stop.... Give discussion. Dont concentrate on these messages."
      },
      {
        "date": "2024-02-21T03:09:00.000Z",
        "voteCount": 1,
        "content": "Yes is correct"
      },
      {
        "date": "2020-12-01T19:55:00.000Z",
        "voteCount": 6,
        "content": "Terrible wordings.\nNo one mentioned that VM1 is recreated on West US or not.\n\nIf the question means the VM1 is recreated (within VNET1), the answer is No.\nIf the question means the VM1 is recreated in VNET2, the answer should be Yes.\n\nYou should choose the Virtual network while creating the VM. \nThe key word - \"then you create a new network interface for VM1 connect it to VNET2\".\nIf you create the VM within East Asia, you no need to mention that you create another NIC for the VM for connection. So I guess the question means the VM is recreated within West US and create an additional network interface to connect to VNet2. -&gt; There is 2 NICs for the VM1. In this case, the answer is No."
      },
      {
        "date": "2022-03-26T10:56:00.000Z",
        "voteCount": 1,
        "content": "VM1 in VNet1 is NOT supposed to be the same as the VM1 in VNet2 either."
      },
      {
        "date": "2020-07-23T14:38:00.000Z",
        "voteCount": 1,
        "content": "Ideally it should be B, the question is a bit ambiguous, I believe it is missing some parts or poorly worded"
      },
      {
        "date": "2020-07-14T09:16:00.000Z",
        "voteCount": 3,
        "content": "Answer: Yes, delete and recreate the VM"
      },
      {
        "date": "2020-06-26T11:22:00.000Z",
        "voteCount": 1,
        "content": "it seems the answer is correct. If you want to connect VM to VNET2, you need to delete it and recreate again in same region and same subscription."
      },
      {
        "date": "2020-06-24T19:25:00.000Z",
        "voteCount": 1,
        "content": "The answer maybe correct but the wordings are really really weird"
      },
      {
        "date": "2020-06-17T16:27:00.000Z",
        "voteCount": 2,
        "content": ".Vnet to Vnet(Vnet to Vnet peering should be done)\nStop and deallocate the VM then delete only VM,then create the VM used by it’s old disk.\nAnother method create a snap of the disk,them from the snap create disk then create VM from that disk.\n\nOnce after attach the other disks of the old VM to the new VM.\n\nTherefore answer is A"
      },
      {
        "date": "2020-06-07T20:38:00.000Z",
        "voteCount": 1,
        "content": "Poorly worded solution, it does not specify where the new vm is deployed. But assuming that the only way is to recreate the vm in the same Region as the VNET2, then i suppose the answer is correct"
      },
      {
        "date": "2020-06-01T17:58:00.000Z",
        "voteCount": 2,
        "content": "answer is correct. yo uhave to delete the VM and recreate in the new region/VNET."
      },
      {
        "date": "2020-05-16T01:13:00.000Z",
        "voteCount": 2,
        "content": "The answers is correct, as they should in same region."
      },
      {
        "date": "2020-05-11T20:10:00.000Z",
        "voteCount": 3,
        "content": "The answer is correct. The VM will recreate from the new region where the Vnet2 resides."
      },
      {
        "date": "2020-04-28T12:25:00.000Z",
        "voteCount": 5,
        "content": "Each NIC attached to a VM must exist in the same location and subscription as the VM. Each NIC must be connected to a VNet that exists in the same Azure location and subscription as the NIC. You can change the subnet a VM is connected to after it's created, but you cannot change the VNet. Each NIC attached to a VM is assigned a MAC address that doesn't change until the VM is deleted.\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/windows/network-overview"
      },
      {
        "date": "2020-07-05T20:27:00.000Z",
        "voteCount": 1,
        "content": "Agree with DamianDeLaVinya84.\nAnswer is YES."
      },
      {
        "date": "2020-04-16T03:55:00.000Z",
        "voteCount": 1,
        "content": "B.. but still unclear,, machine should be spawned in VNET2"
      },
      {
        "date": "2020-04-22T17:01:00.000Z",
        "voteCount": 5,
        "content": "No, it can´t be spaned, to assign a vnet to and VM the must be in the region. that´s y the answer is correct. Delete the VM then recreate it and assign the new vnet based on the same region."
      },
      {
        "date": "2020-08-11T17:38:00.000Z",
        "voteCount": 2,
        "content": "You are wrong! A VM can be attached to only one Vnet. So after deletion while creating the VM, it needs to be attached to VNet 2. Just adding a Network interface isnt gonna work"
      },
      {
        "date": "2023-09-15T07:11:00.000Z",
        "voteCount": 1,
        "content": "if you have more than 1 nic you can attach it to more than 1 network"
      },
      {
        "date": "2020-04-05T07:18:00.000Z",
        "voteCount": 1,
        "content": "Shouldn't the answer be B, the description says delete"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/5946-exam-az-103-topic-3-question-17-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure virtual machine named VM1. VM1 was deployed by using a custom Azure Resource Manager template named ARM1.json.<br>You receive a notification that VM1 will be affected by maintenance.<br>You need to move VM1 to a different host immediately.<br>Solution: From the Overview blade, you move the virtual machine to a different subscription.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "You would need to redeploy the VM.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/redeploy-to-new-node",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-03T07:02:00.000Z",
        "voteCount": 16,
        "content": "moving the VM to a different subscription doesn't mean moving it to a different host. So this would be sufficient and answer is no."
      },
      {
        "date": "2020-10-01T20:33:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct. But implementing High Availability set will be best option. HA with avaiability set. If VM uses critical application then HA zone required."
      },
      {
        "date": "2020-10-01T20:35:00.000Z",
        "voteCount": 1,
        "content": "forgot to add \nthis require 1 additional vm . 2 minimum vm."
      },
      {
        "date": "2020-08-15T06:02:00.000Z",
        "voteCount": 3,
        "content": "Answer is correct, and reference link supports this.\nUsing at least two VMs in Availability Sets would've been useful to alleviate this as well."
      },
      {
        "date": "2020-07-27T05:14:00.000Z",
        "voteCount": 2,
        "content": "the answer is right, the explanation is wrong. \nwe need to live migrate the machine to a different physical host."
      },
      {
        "date": "2020-06-01T18:02:00.000Z",
        "voteCount": 4,
        "content": "answer is right. tested this out. you can move the VM to another RG and it doesnt require a restart."
      },
      {
        "date": "2019-10-05T04:00:00.000Z",
        "voteCount": 1,
        "content": "You would need to Redeploy the VM.\nReferences:\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/windows/redeploy-to-new-node"
      },
      {
        "date": "2020-05-31T17:10:00.000Z",
        "voteCount": 1,
        "content": "answer is yes: https://docs.microsoft.com//en-us/azure/virtual-machines/windows/move-vm\n\"You do not need to start the VM in order to move it and it should continue to run during the move.\""
      },
      {
        "date": "2021-01-23T04:14:00.000Z",
        "voteCount": 1,
        "content": "Are you serious?  :))   Read the question carefully !!!"
      },
      {
        "date": "2019-10-02T02:57:00.000Z",
        "voteCount": 1,
        "content": "Good point, cdj."
      },
      {
        "date": "2019-10-01T15:10:00.000Z",
        "voteCount": 3,
        "content": "Why would this not meet the ask? Please see: icrosoft.com/en-us/azure/virtual-machines/windows/move-vm\nhttps://docs.microsoft.com/en-us/azure/azure-resource-manager/resource-group-move-resources\nhttps://docs.microsoft.com/en-us/azure/azure-resource-manager/move-limitations/virtual-machines-move-limitations"
      },
      {
        "date": "2019-10-01T22:53:00.000Z",
        "voteCount": 11,
        "content": "In the first link your posted, the following is stated in the first paragraph: \"You do not need to start the VM in order to move it and it should continue to run during the move.\"\nTo my knowledge this means that the VM will continue to run on the same host node both before, during and after the move."
      },
      {
        "date": "2020-07-05T20:20:00.000Z",
        "voteCount": 2,
        "content": "Agree with cdj. Answer is NO."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6107-exam-az-103-topic-3-question-18-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure virtual machine named VM1. VM1 was deployed by using a custom Azure Resource Manager template named ARM1.json.<br>You receive a notification that VM1 will be affected by maintenance.<br>You need to move VM1 to a different host immediately.<br>Solution: From the Redeploy blade, you click Redeploy.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "When you redeploy a VM, it moves the VM to a new node within the Azure infrastructure and then powers it back on, retaining all your configuration options and associated resources.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/redeploy-to-new-node",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-28T17:27:00.000Z",
        "voteCount": 6,
        "content": "Correct :\nTry redeploying your virtual machine, which will migrate it to a new Azure host. If you continue, the virtual machine will be restarted and you will lose any data on the temporary drive. While the redeployment is in progress, the virtual machine will be unavailable."
      },
      {
        "date": "2021-02-23T18:04:00.000Z",
        "voteCount": 1,
        "content": "Where is the 'Redeploy Blade'? That's a weird question! It should be to go to the VM, on the left blade choose Redeploy + Reapply."
      },
      {
        "date": "2020-12-16T10:48:00.000Z",
        "voteCount": 2,
        "content": "In the documentation about maintenance notifications, they say the following: \nhttps://docs.microsoft.com/en-us/azure/virtual-machines/maintenance-notifications\n\"Self-service maintenance might not be available for all of your VMs. To determine if proactive redeploy is available for your VM, look for the Start now in the maintenance status. Self-service maintenance is currently not available for Cloud Services (Web/Worker Role) and Service Fabric.\"\n\nThis makes me wonder if they are actually trying to ask about immediately doing the maintenance and redeploying your VM, rather than waiting. Just redeploying it using the manner in the question will not avoid the maintenance problem,  since it will redeploy in the same region that is scheduled for maintenance.  It might very well still be scheduled for maintenance after redeploying this way.  Instead, by using the \"Start now\" in the maintenance status will do the maintenance now and redeploy the VM, and thus avoid the problem.  Thus, the correct answer is no."
      },
      {
        "date": "2020-11-17T20:50:00.000Z",
        "voteCount": 2,
        "content": "The answer is correct. we need to redeploy."
      },
      {
        "date": "2020-06-13T07:13:00.000Z",
        "voteCount": 4,
        "content": "I presume that host is the same as node: If you have been facing difficulties troubleshooting Remote Desktop (RDP) connection or application access to Windows-based Azure virtual machine (VM), redeploying the VM may help. When you redeploy a VM, Azure will shut down the VM, move the VM to a new node within the Azure infrastructure, and then power it back on, retaining all your configuration options and associated resources. This article shows you how to redeploy a VM using Azure PowerShell or the Azure portal.\nREDEPLOY will get the job done:\nhttps://docs.microsoft.com//en-us/azure/virtual-machines/windows/move-vm"
      },
      {
        "date": "2020-06-03T23:04:00.000Z",
        "voteCount": 1,
        "content": "No - although it will move the VM there will be downtime - and although the question doesn't explicitly state you should move the VM to avoid downtime, it is an implied requirement because of the word 'immediately'."
      },
      {
        "date": "2020-06-03T23:48:00.000Z",
        "voteCount": 3,
        "content": "ignore the above - answer is yes - there is insufficient information in the question about the planned maintenance event so they are probably just looking for the 'redeploy' option here."
      },
      {
        "date": "2020-06-02T12:16:00.000Z",
        "voteCount": 2,
        "content": "The Answer is No.\n\nI'm testing right now, when you go to Redeploy it's clealy stating that the VM will be unavailable. And this is for when you can't connect to the VM.\n\n\"Can't connect to your virtual machine?\nTry redeploying your virtual machine, which will migrate it to a new Azure host. If you continue, the virtual machine will be restarted and you will lose any data on the temporary drive. While the redeployment is in progress, the virtual machine will be unavailable\""
      },
      {
        "date": "2020-06-01T20:16:00.000Z",
        "voteCount": 2,
        "content": "Redeploying the VM is not the solutions as redeployment is meant for instances where you cant access via RDP or other means. in this instance you have full access to your VM but need to move it to avoid downtime that will be created by maintenance so it wont make any sense to crate down time in order to avoid downtime. Moving the VM does not stop the VM and does not create down time so IMO the answer is B, the solution does not meet the requirement  \nMove: https://docs.microsoft.com//en-us/azure/virtual-machines/windows/move-vm"
      },
      {
        "date": "2020-06-01T18:04:00.000Z",
        "voteCount": 3,
        "content": "answer is correct. hart232 answer is from the azure portal."
      },
      {
        "date": "2020-01-31T02:21:00.000Z",
        "voteCount": 1,
        "content": "Try redeploying your virtual machine, which will migrate it to a new Azure host. If you continue, the virtual machine will be restarted and you will lose any data on the temporary drive. While the redeployment is in progress, the virtual machine will be unavailable."
      },
      {
        "date": "2019-10-04T18:16:00.000Z",
        "voteCount": 2,
        "content": "This will cause some downtime however. But it's better than waiting for maintenance to be completed on the host."
      },
      {
        "date": "2021-02-23T18:06:00.000Z",
        "voteCount": 1,
        "content": "Do you know how long will maintenance take? To redeploy VM only need 5 mins. If the downtime cannot be avoided, what's your selection?"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21850-exam-az-103-topic-3-question-19-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have an Azure virtual machine named VM1. VM1 was deployed by using a custom Azure Resource Manager template named ARM1.json.<br>You receive a notification that VM1 will be affected by maintenance.<br>You need to move VM1 to a different host immediately.<br>Solution: From the Update management blade, you click Enable.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "You would need to redeploy the VM.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/redeploy-to-new-node",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-02T12:19:00.000Z",
        "voteCount": 5,
        "content": "The Answer is correct as B, however the explanation is wrong when you do Redeploy it doesn't let you select another host at all. It just starts redeploying automatically to the same RG."
      },
      {
        "date": "2020-08-24T04:17:00.000Z",
        "voteCount": 2,
        "content": "Same RG but different Node"
      },
      {
        "date": "2020-06-01T18:05:00.000Z",
        "voteCount": 2,
        "content": "previous Q answer applies here. redeploy."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16167-exam-az-103-topic-3-question-20-discussion/",
    "body": "HOTSPOT -<br>You have an Azure subscription named Subscription1. Subscription1 contains two Azure virtual machines named VM1 and VM2. VM1 and VM2 run Windows<br>Server 2016.<br>VM1 is backed up daily by Azure Backup without using the Azure Backup agent.<br>VM1 is affected by ransomware that encrypts data.<br>You need to restore the latest backup of VM1.<br>To which location can you restore the backup? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03048/0016300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0016400001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-24T15:18:00.000Z",
        "voteCount": 16,
        "content": "Individual File restore requires the MARS agent, which is only supported on specific Operating Systems: https://docs.microsoft.com/en-us/azure/backup/backup-support-matrix-mars-agent. \n\nSo that removes the option for \"any windows machine on the internet\". VM1 does not have the MARS agent installed which would not allow it to restore individual files. Furthermore, VM1 is compromised by ransomware, which typically encrypts a whole HDD, rendering it unusable. Therefore, I would say that box 1 should be \"VM2 Only\". \n\nI agree that box 2 should be \"restore to a new VM\"."
      },
      {
        "date": "2020-04-29T12:26:00.000Z",
        "voteCount": 2,
        "content": "correct for both"
      },
      {
        "date": "2020-08-03T00:06:00.000Z",
        "voteCount": 14,
        "content": "In the exams the answers are changed.\nIt should be:\n1. VM1 only\n2. VM1 and new VM"
      },
      {
        "date": "2020-08-24T04:24:00.000Z",
        "voteCount": 4,
        "content": "You are definately wrong about the first... Ofcourse you can not only restore files to the computer you have lost control of due to ransomware encryption."
      },
      {
        "date": "2023-10-20T19:01:00.000Z",
        "voteCount": 1,
        "content": "VM1 can be restored to itself by REPLACE or can be restored to a NEW VM e.g. VM3. As per the documentation : \nhttps://learn.microsoft.com/en-us/azure/backup/backup-azure-arm-restore-vms#restore-options"
      },
      {
        "date": "2023-10-20T19:02:00.000Z",
        "voteCount": 1,
        "content": "However since the VM1 is attacked by ransomware and if you restore by replace then it might not work because the disk might be encrypted by the virus."
      },
      {
        "date": "2023-03-04T10:46:00.000Z",
        "voteCount": 1,
        "content": "When a network security group (NSG) is applied to a subnet and to a network interface card (NIC) of a virtual machine (VM), the rules of both NSGs are evaluated in the following order:\n\nInbound traffic from the internet or other subnets is evaluated against the rules of the NSG applied to the subnet.\n\nIf the traffic is allowed by the subnet NSG, the inbound traffic is then evaluated against the rules of the NSG applied to the NIC.\n\nIf the traffic is allowed by both the subnet NSG and the NIC NSG, the traffic is allowed to the virtual machine.\n\nIf the traffic is denied by either the subnet NSG or the NIC NSG, the traffic is blocked and not allowed to the virtual machine."
      },
      {
        "date": "2022-05-30T00:04:00.000Z",
        "voteCount": 1,
        "content": "Restoring involves copying backup files from a secondary storage (backup media) to disk. This can be done to replace damaged files or to copy/move a database to a new location.\n\nRecovery is the process of applying redo logs to the database to roll it forward. One can roll-forward until a specific point-in-time (before the disaster occurred), or roll-forward until the last transaction recorded in the log files.\n\nBox2(Restore)= New VM (new location)\nBox1(Recovery) = VM1 roll-forward until a specific point in time before disaster occured"
      },
      {
        "date": "2021-11-09T17:47:00.000Z",
        "voteCount": 3,
        "content": "I think the answer is wrong, 1. Any Windows with Internet Connectivity. https://docs.microsoft.com/en-us/azure/backup/backup-azure-restore-files-from-vm\n2. its VM1 and any new VM"
      },
      {
        "date": "2021-04-27T15:02:00.000Z",
        "voteCount": 3,
        "content": "BOX1: A new Azure virtual machinne only\nBecause VM1 does not have the Azure Backup agent installed and which is only supported on specific Operating Systems:\nEvidence: https://docs.microsoft.com/en-us/azure/backup/backup-support-matrix-mars-agent\n\nBOX2: VM1 and A new Azure virtual machinne only\nEvidence: https://docs.microsoft.com/en-us/azure/backup/backup-azure-arm-restore-vms\n\nThe image must be wrong, I found the same question with a different image that matches my answers.\nhttps://www.exam4training.com/to-which-location-can-you-restore-the-backup-4/"
      },
      {
        "date": "2021-02-04T05:38:00.000Z",
        "voteCount": 3,
        "content": "Why would you do a file recovery on VM2? The one that got encrypted was VM1 only so makes sense that you only need to recover the unencrypted files to the same VM."
      },
      {
        "date": "2021-01-08T11:29:00.000Z",
        "voteCount": 1,
        "content": "DO note 'file recovery' vs 'restore' are different cocnepts:\n1.should be VM2 only\nAs per below article,a script is required to be run which is not possible to run on original VM as we cannot log into it due to encryption.\nFurther there are strict guidelines on matching OS as described in step 3:\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-restore-files-from-vm\n\n2.should be any Windows VM on Internet.\nIn general, options to create new VM/restore disk (which can be connected to existing Windows VM or used to create new VM)/replace existing.\n\nReplace existing may not work as described here:\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-vms-encryption"
      },
      {
        "date": "2021-01-08T11:33:00.000Z",
        "voteCount": 1,
        "content": "apologies, based on my inference of 2, answer should have said 'VM2 or new VM'.\nI dont think the disk can be attached to any Windows VM on internet like a file share."
      },
      {
        "date": "2020-12-29T09:14:00.000Z",
        "voteCount": 10,
        "content": "Do not be tricked by \"without using the Azure Backup agent\". This agent is only needed for on premise VMs.\n\nBox 1: Any computer with internet connectivity.\nBox 2: VM1 or New VM. (Option is missing). During full VM restore. You can restore to a new VM or Replace existing."
      },
      {
        "date": "2021-01-15T12:01:00.000Z",
        "voteCount": 1,
        "content": "You are right."
      },
      {
        "date": "2021-04-09T06:41:00.000Z",
        "voteCount": 1,
        "content": "I agree with your answer."
      },
      {
        "date": "2020-11-26T03:39:00.000Z",
        "voteCount": 1,
        "content": "Just performed a file restore and you can restore files from any internet connected machine because you run a script that mounts a drive using iscsi and from this mount you can restore files."
      },
      {
        "date": "2020-11-19T11:25:00.000Z",
        "voteCount": 7,
        "content": "BOX1: VM1 and VM2 only - ransomware encrypts files/data, not filesystem itself, the idea is to leave OS functional, so they can ask for ransom. So, you can restore files to VM1.\nBOX2: VM1 and new Azure VM. Here, you can have 2 answers in BOX 2, because they are separated.\n\nYou can find explanations on these links:\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-arm-restore-vms\nhttps://docs.microsoft.com/en-us/azure/backup/about-azure-vm-restore"
      },
      {
        "date": "2020-12-18T21:31:00.000Z",
        "voteCount": 3,
        "content": "Agreed:\nBox1: \nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-restore-files-from-vm\nBOX2 explanation --&gt; look at the restore options:\nhttps://docs.microsoft.com/en-us/azure/backup/backup-azure-arm-restore-vms#restore-options"
      },
      {
        "date": "2020-10-30T02:33:00.000Z",
        "voteCount": 1,
        "content": "VM2 only\nNew VM"
      },
      {
        "date": "2020-11-19T05:13:00.000Z",
        "voteCount": 1,
        "content": "In newer version VM2 only is not an option"
      },
      {
        "date": "2020-08-24T07:27:00.000Z",
        "voteCount": 5,
        "content": "It should be:\n1. ON any VMs or computer(For computer it will need internet).\n2. VM1 and new VM"
      },
      {
        "date": "2020-08-25T05:49:00.000Z",
        "voteCount": 15,
        "content": "Finished the exam couple of hours ago. This question came up, and the answers as mentioned above were quite different. Based on the given scenario, I went for;\n1) File recovery - Any windows computer with internet connectivity \n2) Restore VM - VM1 or new VM\n\nThere other options once you review the question doesn't really make sense to me, hence my choices above."
      },
      {
        "date": "2020-08-01T02:52:00.000Z",
        "voteCount": 5,
        "content": "Came in exam 1st  Aug 2020. Choices were different."
      },
      {
        "date": "2020-07-26T09:42:00.000Z",
        "voteCount": 1,
        "content": "I'd say any for Box 1  - as doesn't give you any context to say you have access to another machine or not! Very misleading question."
      },
      {
        "date": "2020-07-21T21:06:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/backup/about-azure-vm-restore\nImage restore can be done on both Vm1 and Vm2. \nFile restore can be done on \nRestore can be done in 3 ways : OLR, ALR and ILR.\nOLR replaces the disks at same VM (VM1). ALR restores onto a different VM (VM2). \nILR restores to any machine with internet connectivity."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21155-exam-az-103-topic-3-question-21-discussion/",
    "body": "You download an Azure Resource Manager template based on an existing virtual machine. The template will be used to deploy 100 virtual machines.<br>You need to modify the template to reference an administrative password. You must prevent the password from being stored in plain text.<br>What should you create to store the password?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure Key Vault and an access policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Recovery Services vault and a backup policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Active Directory (AD) Identity Protection and an Azure policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure Storage account and an access policy"
    ],
    "answer": "A",
    "answerDescription": "You can use a template that allows you to deploy a simple Windows VM by retrieving the password that is stored in a Key Vault. Therefore, the password is never put in plain text in the template parameter file.<br>References:<br>https://azure.microsoft.com/en-us/resources/templates/101-vm-secure-password/",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-22T11:02:00.000Z",
        "voteCount": 7,
        "content": "A is correct answer. \nhttps://docs.microsoft.com/en-us/azure/virtual-machines/linux/disk-encryption-key-vault"
      },
      {
        "date": "2020-06-26T11:47:00.000Z",
        "voteCount": 7,
        "content": "came in exam."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16477-exam-az-103-topic-3-question-22-discussion/",
    "body": "HOTSPOT -<br>You create a virtual machine scale set named Scale1. Scale1 is configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/03048/0016600001.jpg\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03048/0016700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0016700002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: 6 virtual machines -<br>The Autoscale scale out rule increases the number of VMs by 2 if the CPU threshold is 80% or higher. The initial instance count is 4 and rises to 6 when the 2 extra instances of VMs are added.<br><br>Box 2: 2 virtual machnes -<br>The Autoscale scale in rule decreases the number of VMs by 4 if the CPU threshold is 30% or lower. The initial instance count is 4 and thus cannot be reduced to<br>0 as the minimum instances is set to 2. Instances are only added when the CPU threshold reaches 80%.<br>References:<br>https://docs.microsoft.com/en-us/azure/azure-monitor/platform/autoscale-overview https://docs.microsoft.com/en-us/azure/azure-monitor/platform/autoscale-best-practices https://docs.microsoft.com/en-us/azure/azure-monitor/platform/autoscale-common-scale-patterns",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-02T12:49:00.000Z",
        "voteCount": 22,
        "content": "The answers given are correct. 1st question 6, the only info given is that the starting count of vm instances is 4 and 2 are added for 6 total. 2nd question the minimum it can go is 2 and it stays at 2 for the questions. 6 and 2 are the correct answers."
      },
      {
        "date": "2020-03-15T11:50:00.000Z",
        "voteCount": 17,
        "content": "krkr20202020, you are right about the scale-out interval, but scale-in seems to be hardcoded at 5 minutes in the default template. So it should be 4 and 2. Source: just tried to create a simple scale set and looked through the template."
      },
      {
        "date": "2021-01-05T20:31:00.000Z",
        "voteCount": 2,
        "content": "is correct start in 4 next 2 more"
      },
      {
        "date": "2020-10-30T03:01:00.000Z",
        "voteCount": 1,
        "content": "Given answer correct 6,2\nlook at link https://docs.microsoft.com/en-us/answers/questions/7989/azure-vmss-autoscale.html"
      },
      {
        "date": "2020-10-13T07:57:00.000Z",
        "voteCount": 3,
        "content": "Question is clear, both scenaries are not one after another, therefore the answers are: 6-2 , i have no doubt."
      },
      {
        "date": "2020-08-21T17:43:00.000Z",
        "voteCount": 4,
        "content": "There is not complete information, because we do not know nothing about how many minutes  the scale set waits in order to scale in or out. The default is 10 minutes, but may I suppose the default configuration?"
      },
      {
        "date": "2020-08-19T08:30:00.000Z",
        "voteCount": 1,
        "content": "I just tested the scale-in approach.  Created a scaleset just as shown.  Once deployed, it took 3 minutes to scale in.  at that point, I had 2 VMs running.  so, the answers for the first box is 4 due to not going over 10 minutes as this would be the default.  Scale in must be having a 1 minute time span as I am guessing it took about 2 minutes to actually launch the machines.  But it definitely scaled in before the 6 minutes below 25% usage.  I say test it yourself to be sure.  But this is what I'm coming up with."
      },
      {
        "date": "2020-07-24T18:50:00.000Z",
        "voteCount": 4,
        "content": "Answer is 4 and 4; Here cooling period and duration for scale in and out are not displayed in the graphical view. So we need to consider the default values for these settings.\n\nCool down (minutes) : The amount of time to wait before the rule is applied again so that the autoscale actions have time to take effect. Default is 5 minutes.\n\nDuration : The amount of time monitored before the metric and threshold values are compared. Default is 10 minutes."
      },
      {
        "date": "2020-07-12T13:47:00.000Z",
        "voteCount": 1,
        "content": "One more time :\n\n\"This is amount of time that Autoscale engine will look back for metrics. For example, 10 minutes means that every time autoscale runs, it will query metrics for the past 10 minutes. This allows your metrics to stabilize and avoids reacting to transient spikes. The Storage queue Approximate Message Count and Service Bus Message Count metrics are special in that these metrics are point in time only and have no history. For these metrics, the duration field will be ignored by the Autoscale engine.\""
      },
      {
        "date": "2020-07-12T13:56:00.000Z",
        "voteCount": 2,
        "content": "I just tried creating a new scale-set - The new interface had an extra line :\nDuration in minutes   ( defaults  to 10)\nW/O this knowledge this Q is invalid."
      },
      {
        "date": "2020-07-06T01:57:00.000Z",
        "voteCount": 3,
        "content": "Came in Exam , Exam given on 06.07.2020"
      },
      {
        "date": "2020-07-11T15:47:00.000Z",
        "voteCount": 7,
        "content": "ok... what did you answer"
      },
      {
        "date": "2020-10-29T14:39:00.000Z",
        "voteCount": 1,
        "content": "They just want to loose concentration."
      },
      {
        "date": "2020-06-28T17:56:00.000Z",
        "voteCount": 4,
        "content": "Duration (in minutes) Default is 10 \nI literally just checked this. Unless you changed the duration time from 10 to 5 minutes nothing will happen In this scenario."
      },
      {
        "date": "2020-06-26T09:30:00.000Z",
        "voteCount": 5,
        "content": "Box 1: \n\nStarting VM's = 4\n\n85% utilization will cause scale out as the threshold is 80% and increase by 2 \nAfter 6 minutes we will have 6 VM's\n\n6 VM's\n\nBox 2:\n\nStarting VM's = 4\n\nUtilization at 25% cause a scale in of 4 V.M's but minimum number of V.M's has to be 2. \nUtilization at 50% doesnt matter as doesnt reach scale out threshold so we still have the 2 V.M's\n\n2 V.M's\n\nAnswer: 6 &amp; 2"
      },
      {
        "date": "2020-06-28T11:45:00.000Z",
        "voteCount": 5,
        "content": "The Azure default duration for scale in and out is 10 minutes to trigger the rules. Both the scenarios above specifically state only 6min. Because the utilization is 6min (less than 10min), it does not trigger the rules. The VM scale remains unchanged. Hence the answer should be 4 and 4."
      },
      {
        "date": "2020-12-01T04:48:00.000Z",
        "voteCount": 1,
        "content": "I agree with LTTAM, when you move cursor to \"Duration in minutes\" below displayed.\n\"This is amount of time that Autoscale engine will look back for metrics. For example, 10 minutes means that every time autoscale runs, it will query metrics for the past 10 minutes. This allows your metrics to stabilize and avoids reacting to transient spikes. The Storage queue Approximate Message Count and Service Bus Message Count metrics are special in that these metrics are point in time only and have no history. For these metrics, the duration field will be ignored by the Autoscale engine.\""
      },
      {
        "date": "2020-07-05T20:54:00.000Z",
        "voteCount": 1,
        "content": "Yes, specified answers are correct."
      },
      {
        "date": "2020-06-12T08:36:00.000Z",
        "voteCount": 1,
        "content": "so you would have to interpret the question in the exam - can you apply default values for scale-in or out if they are absent in the question - bearing in mind the scaling may be triggered simply by reaching the given threshold values - depends how it is worded."
      },
      {
        "date": "2020-06-12T08:33:00.000Z",
        "voteCount": 1,
        "content": "Yes we cannot see ant time metrics in this question - so assume default values in their absence - from MS site ; Two metric rules in this profile: one for scale out, and one for scale in.\nThe scale-out rule is triggered when the virtual machine scale set's average percentage CPU metric is greater than 85 percent for the past 10 minutes.\nThe scale-in rule is triggered when the virtual machine scale set's average is less than 60 percent for the past minute."
      },
      {
        "date": "2020-06-01T18:14:00.000Z",
        "voteCount": 4,
        "content": "correct answer is 6/2"
      },
      {
        "date": "2020-06-09T13:07:00.000Z",
        "voteCount": 4,
        "content": "Only if the question in the test specifies the timing as 5 minutes..if it does not specify the timing thus using default time then answers are 4&amp;4"
      },
      {
        "date": "2020-05-30T13:20:00.000Z",
        "voteCount": 11,
        "content": "I just created a Scale Set now to test all these theories/comments people have posted.  The default duration for scale in and out is 10 minutes.  Not sure how folks here get 5min and 1min as default scale out and in duration.  Since the scenarios presented only lasts for 6min, it does not trigger the rules.  Because the scenarios do not mention set duration (minutes) it is assumed the default values are used (10min). The correct answer is 4 and 4."
      },
      {
        "date": "2020-06-09T13:07:00.000Z",
        "voteCount": 4,
        "content": "Agreed, most likely in the test they will show the duration settings and they will be at 5 minutes, which makes the answer 6&amp;2. BUT given the information we have here the answer would be 4&amp;4. So, must decipher the question as is not based on assumptions here."
      },
      {
        "date": "2020-06-22T02:58:00.000Z",
        "voteCount": 2,
        "content": "excellent explanation"
      },
      {
        "date": "2020-05-16T11:09:00.000Z",
        "voteCount": 3,
        "content": "The answers here are correct.  The default \"time grain\" is 1 minute.  The default \"time window\" for comparison is 5 minutes.  So part one of the question:  it starts with 4 instances, after 5 minutes it gets another 2 instances, and the question states 6 minutes so it's currently at 6 instances.  Part 2 of the question:  It starts with 4 instances, after 6 minutes it's scaled itself down 2 instances to the rule minimum of 2 instances."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16169-exam-az-103-topic-3-question-23-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g, copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may have more than one lab that you must complete. You can use as much time as you would like to complete each lab. But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br>You may now click next to proceed to the lab.<br>Use the following login credentials as needed:<br><br>Azure Username: XXXXXXX -<br><br>Azure Password: XXXXXXX -<br>The following information is for technical support purposes only:<br><br>Lab Instance: 9172796 -<br><img src=\"/assets/media/exam-media/03048/0016900001.jpg\" class=\"in-exam-image\"><br>You plan to back up all the Azure virtual machines in your Azure subscription at 02:00 Coordinated Universal Time (UTC) daily.<br>You need to prepare the Azure environment to ensure that any new virtual machines can be configured quickly for backup. The solution must ensure that all the daily backups performed at 02:00 UTC are stored for only 90 days.<br>What should you do from your Recovery Services vault on the Azure portal?<br>",
    "options": [],
    "answer": "See solution below.",
    "answerDescription": "Task A: Create a Recovery Services vault (if a vault already exists skip this task, go to Task B below)<br>A1. From Azure Portal, On the Hub menu, click All services and in the list of resources, type Recovery Services and click Recovery Services vaults.<br>If there are recovery services vaults in the subscription, the vaults are listed.<br>A2. On the Recovery Services vaults menu, click Add.<br>A3. The Recovery Services vault blade opens, prompting you to provide a Name, Subscription, Resource group, and Location<br>Task B.<br>B1. On the Recovery Services vault blade (for the vault you just created), in the Getting Started section, click Backup, then on the Getting Started with Backup blade, select Backup goal.<br>The Backup Goal blade opens. If the Recovery Services vault has been previously configured, then the Backup Goal blades opens when you click Backup on the<br>Recovery Services vault blade.<br>B2. From the Where is your workload running? drop-down menu, select Azure.<br>B3. From the What do you want to backup? menu, select Virtual Machine, and click OK.<br><img src=\"/assets/media/exam-media/03048/0017100001.png\" class=\"in-exam-image\"><br>B4. Finish the Wizard.<br>Task C. create a backup schedule<br>C1. Open the Microsoft Azure Backup agent. You can find it by searching your machine for Microsoft Azure Backup.<br><img src=\"/assets/media/exam-media/03048/0017100002.png\" class=\"in-exam-image\"><br>C2. In the Backup agent's Actions pane, click Schedule Backup to launch the Schedule Backup Wizard.<br><img src=\"/assets/media/exam-media/03048/0017200001.png\" class=\"in-exam-image\"><br>C3. On the Getting started page of the Schedule Backup Wizard, click Next.<br>C4. On the Select Items to Backup page, click Add Items.<br>The Select Items dialog opens.<br>C5. Select Blob Storage you want to protect, and then click OK.<br>C6. In the Select Items to Backup page, click Next.<br>On the Specify Backup Schedule page, specify<br><br>Schedule a backup every: day -<br><br>At the following times: 2.00 AM -<br><img src=\"/assets/media/exam-media/03048/0017300001.jpg\" class=\"in-exam-image\"><br>C7. On the Select Retention Policy page, set it to 90 days, and click Next.<br><img src=\"/assets/media/exam-media/03048/0017300002.jpg\" class=\"in-exam-image\"><br>C8. Finish the Wizard.<br>References:<br>https://docs.microsoft.com/en-us/azure/backup/backup-configure-vault",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-10T14:44:00.000Z",
        "voteCount": 47,
        "content": "imho complete nonsense, all you have to do is to prepare a new backup policy"
      },
      {
        "date": "2020-03-31T09:38:00.000Z",
        "voteCount": 1,
        "content": "thank you for that"
      },
      {
        "date": "2020-06-04T02:21:00.000Z",
        "voteCount": 1,
        "content": "agreed. instead of accepting the default policy just create a new one with the given parameters."
      },
      {
        "date": "2020-05-08T23:03:00.000Z",
        "voteCount": 9,
        "content": "Answer is somehow misleading. The question is \"What should you do from your Recovery Services vault on the Azure portal?\" This means that we stay on portal and in RSV blade we configure a new backup policy for the VMs. No more, no less."
      },
      {
        "date": "2020-07-06T08:11:00.000Z",
        "voteCount": 3,
        "content": "Agree with CristianN.\nJust create a new backup policy in RSV."
      },
      {
        "date": "2021-02-03T04:08:00.000Z",
        "voteCount": 2,
        "content": "Just go to the Recovery Services Vault then click on the backup policy for the VM and adjust the schedule there."
      },
      {
        "date": "2020-09-25T13:28:00.000Z",
        "voteCount": 4,
        "content": "no simulators in exams right now, just questions...."
      },
      {
        "date": "2020-08-21T18:07:00.000Z",
        "voteCount": 1,
        "content": "In the provided answer why they are configuring scheduled backup inside the VM in a azure environment?"
      },
      {
        "date": "2020-07-23T21:46:00.000Z",
        "voteCount": 1,
        "content": "You can create a New Backup policy or modify the existing policy to accommodate the Time of Backup &amp; retention Period. However you should create a policy like Configure Backup on VM &amp; assign the Vault &amp; created Backup policy , to achieve the objective."
      },
      {
        "date": "2020-07-23T21:49:00.000Z",
        "voteCount": 2,
        "content": "Better than creating a new policy, modify the default one."
      },
      {
        "date": "2020-08-05T09:30:00.000Z",
        "voteCount": 1,
        "content": "question asks what you should do 'from the Recovery Services Vault...'"
      },
      {
        "date": "2020-06-12T09:25:00.000Z",
        "voteCount": 1,
        "content": "To switch policies, select a different policy and then select Save. The new policy is immediately applied to the vault."
      },
      {
        "date": "2020-05-30T07:02:00.000Z",
        "voteCount": 3,
        "content": "just need to add simple backup policy. set it to backup at 02:00 AM UTC and retention 90 days."
      },
      {
        "date": "2020-04-20T18:10:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/backup/backup-azure-arm-vms-prepare"
      },
      {
        "date": "2020-04-20T18:03:00.000Z",
        "voteCount": 1,
        "content": "Better steps provided here: https://docs.microsoft.com/en-us/azure/backup/backup-azure-manage-vms"
      },
      {
        "date": "2020-04-20T10:58:00.000Z",
        "voteCount": 4,
        "content": "I think there is an inbuilt policy which will enable auto backup to newly created VM Refer the link ---https://docs.microsoft.com/en-us/azure/backup/backup-azure-auto-enable-backup"
      },
      {
        "date": "2020-04-28T02:45:00.000Z",
        "voteCount": 1,
        "content": "So it should be, set the backup policy with the correct retention and set and azure policy on the resource group to auto backup VMs."
      },
      {
        "date": "2020-08-24T04:51:00.000Z",
        "voteCount": 1,
        "content": "No the question says \"CAN\" be configured easy"
      },
      {
        "date": "2020-04-15T04:10:00.000Z",
        "voteCount": 3,
        "content": "complete useless answer - as a lot of other backup answers. It seems there only exists only one answer for backup -&gt; install a agent and configure it.\nVery handy solution if you deploy 10.000 VMs by hand... ;-)"
      },
      {
        "date": "2020-04-02T21:09:00.000Z",
        "voteCount": 2,
        "content": "create a backup policy"
      },
      {
        "date": "2020-03-22T09:26:00.000Z",
        "voteCount": 7,
        "content": "Imho ;-) \nYou just have to edit the \"DefaultPolicy\" retention range from 30 to 90.\nAssing this to the VM's (if it isn't already)"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16170-exam-az-103-topic-3-question-24-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g, copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may have more than one lab that you must complete. You can use as much time as you would like to complete each lab. But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br>You may now click next to proceed to the lab.<br>Use the following login credentials as needed:<br><br>Azure Username: XXXXXXX -<br><br>Azure Password: XXXXXXX -<br>The following information is for technical support purposes only:<br><br>Lab Instance: 9172796 -<br><img src=\"/assets/media/exam-media/03048/0017500001.jpg\" class=\"in-exam-image\"><br><br>Task5 -<br>You plan to connect several virtual machines to the VNET01-USEA2 virtual network.<br>In the Web-RGlod9272261 resource group, you need to create a virtual machine that uses the Standard_B2ms size named Web01 that runs Windows Server<br>2016. Web01 must be added to an availability set.<br>What should you do from the Azure portal?<br>",
    "options": [],
    "answer": "See solution below.",
    "answerDescription": "Step 1: Choose Create a resource in the upper left-hand corner of the Azure portal.<br>Step 2: In the Basics tab, under Project details, make sure the correct subscription is selected and then choose Web-RGlod9272261 resource group<br><img src=\"/assets/media/exam-media/03048/0017600001.jpg\" class=\"in-exam-image\"><br>Step 3: Under Instance details type/select:<br><br>Virtual machine name: Web01 -<br><br>Image: Windows Server 2016 -<br><br>Size: Standard_B2ms size -<br>Leave the other defaults.<br><img src=\"/assets/media/exam-media/03048/0017700001.png\" class=\"in-exam-image\"><br>Step 4: Finish the Wizard",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-10T14:45:00.000Z",
        "voteCount": 22,
        "content": "Again wrong .. the availability set is missing!"
      },
      {
        "date": "2020-03-16T09:38:00.000Z",
        "voteCount": 16,
        "content": "first create availability set in the resource group, then create the vm and point network to a subnet in the mentioned vnet"
      },
      {
        "date": "2020-05-30T09:39:00.000Z",
        "voteCount": 8,
        "content": "For this solution create a new VM and than a new availability set in the same build. nothing fancy needs to be done. \nGiven answer doesnt even mention availability set which is a requirement on the question."
      },
      {
        "date": "2020-05-08T23:14:00.000Z",
        "voteCount": 4,
        "content": "You don't have to create an AS BEFORE creating a VM. When creating FIRST VM instance of the AS, you choose Availability options-&gt;AS and use \"create new\" for the AS, and use it for the next VMs deployment.\nSelecting a VNet during deployment, requires to define a subnet for the dedicate VNet, which, generally speaking, we have no info about."
      },
      {
        "date": "2020-07-06T09:03:00.000Z",
        "voteCount": 5,
        "content": "Agree with CristianN.\nCreate a new VM and select Resource Group as 'Web-RGlod9272261' enter the the VM name as 'Web01', select 'Availability Set' under Availability options.\nCreate new Availability Set. Select Image as 'Windows Server 2016 Datacenter' and size as 'Standard_B2ms'.\nUnder 'Networking' tab, select the existing VNet - VNET01-USEA2. Set the remaining as defaults. Then create."
      },
      {
        "date": "2020-04-26T12:23:00.000Z",
        "voteCount": 1,
        "content": "Also, provided answer does not mention to select the existing virtual network under Networking tab during VM creation."
      },
      {
        "date": "2020-04-20T05:30:00.000Z",
        "voteCount": 2,
        "content": "Guys, this is from the portal  'The availability set can only be configured when creating a virtual machine. You must recreate the virtual machine to move it in or out of an availability set.'\nDelete and re-create a new one should be the answer but the assumption should be you need to re-attach the disks?"
      },
      {
        "date": "2020-08-24T04:54:00.000Z",
        "voteCount": 1,
        "content": "Yes availability sets can only be configured for the vm while creating the VM, but the availabilityset can be created ahead of time...\nWhat the portal tels you is that you can not move an existing vm into a availabilityset."
      },
      {
        "date": "2020-04-05T07:08:00.000Z",
        "voteCount": 2,
        "content": "You cannot create availability set on the RG, it must be created during the VM creation."
      },
      {
        "date": "2020-04-21T21:12:00.000Z",
        "voteCount": 3,
        "content": "Availability sets can be created ahead of time.\nNo need to create the set during VM creation.\nAlthough in this case it won't make a difference, as long as the AS is assigned at VM creation time."
      },
      {
        "date": "2020-03-22T20:25:00.000Z",
        "voteCount": 6,
        "content": "all the questions about the availability set have wrong answers. az-900 questions were well answered, dont know why az-103 is this way"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17636-exam-az-103-topic-3-question-25-discussion/",
    "body": "You plan to automate the deployment of a virtual machine scale set that uses the Windows Server 2016 Datacenter image.<br>You need to ensure that when the scale set virtual machines are provisioned, they have web server components installed.<br>Which two actions should you perform? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the extensionProfile section of the Azure Resource Manager template.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an automation account.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpload a configuration script.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new virtual machine scale set in the Azure portal.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Azure policy."
    ],
    "answer": "AD",
    "answerDescription": "Virtual Machine Scale Sets can be used with the Azure Desired State Configuration (DSC) extension handler. Virtual machine scale sets provide a way to deploy and manage large numbers of virtual machines, and can elastically scale in and out in response to load. DSC is used to configure the VMs as they come online so they are running the production software.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-dsc",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-27T09:43:00.000Z",
        "voteCount": 16,
        "content": "I think is A and C. Check this link \nhttps://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-deploy-app"
      },
      {
        "date": "2020-05-19T01:23:00.000Z",
        "voteCount": 14,
        "content": "AD AE AC Come on guys dont spam around"
      },
      {
        "date": "2021-12-26T06:46:00.000Z",
        "voteCount": 1,
        "content": "So we don't need to upload the script ?"
      },
      {
        "date": "2021-06-25T22:46:00.000Z",
        "voteCount": 6,
        "content": "Answers:\nA. Modify the extensionProfile section of the Azure Resource Manager template.\nC. Upload a configuration script."
      },
      {
        "date": "2021-06-02T21:22:00.000Z",
        "voteCount": 2,
        "content": "A. Modify the extensionProfile section of the Azure Resource Manager template.\nB. Create an automation account.\nC. Upload a configuration script.\n\nboth need?"
      },
      {
        "date": "2021-05-30T19:34:00.000Z",
        "voteCount": 1,
        "content": "A is for user.\nThe other one, mmm. You can't create a vmss with a configuration script, in purpose of that you need a ARM template. There are no option for that, so the only near possibility is D. \nSo answer is A &amp; D"
      },
      {
        "date": "2020-10-30T03:09:00.000Z",
        "voteCount": 7,
        "content": "A. Modify the extensionProfile section of the Azure Resource Manager template.\nC. Upload a configuration script."
      },
      {
        "date": "2020-09-13T03:23:00.000Z",
        "voteCount": 3,
        "content": "100% sure the answer is AC."
      },
      {
        "date": "2020-09-02T01:32:00.000Z",
        "voteCount": 2,
        "content": "The answer is A &amp; C\nin the question it states that \"You plan to automate the deployment of a virtual machine scale set that uses the Windows Server 2016 Datacenter image\"\nD defeats the purpose of the automation requirement, so C is 100% correct.\n\nInstall an app with the Custom Script Extension\nThe Custom Script Extension downloads and executes scripts on Azure VMs. This extension is useful for post deployment configuration, software installation, or any other configuration / management task. Scripts can be downloaded from Azure storage or GitHub, or provided to the Azure portal at extension run-time.\nhttps://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-deploy-app#already-provisioned\n\nAlso check this\nhttps://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/tutorial-install-apps-template#what-is-the-azure-custom-script-extension"
      },
      {
        "date": "2020-08-24T05:16:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/tutorial-install-apps-template\nI have to agree with original answer, but I'm not happy about the frase \"automate deployment\" as we are creating the scaleset manually in the portal.\nWith given answers, I would go for A and D"
      },
      {
        "date": "2020-08-09T10:49:00.000Z",
        "voteCount": 1,
        "content": "This is a correct answer.  You have to create a scaleset since one is not mentioned to have been created already.  You also have to adjust the ARM extensionProfile to add the DSC.  Found answer here\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/extensions/dsc-template?toc=/azure/virtual-machines/windows/toc.json"
      },
      {
        "date": "2020-07-24T02:37:00.000Z",
        "voteCount": 3,
        "content": "I think there are 2 ways to achieve this:\n1) Is to do it through Custom Script Extension (A). It can specify the script location &amp; the command to run\n2) Store the Configuration File &amp; specify the location in Azure Template (C). This is specifically used when you have some sensitive data like certificate ( If you like HTTPS in website)\nSo You don't need to do both...but for 2nd one..u still need to use the custom script extension...I think the questions are not worded properly\n\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/extensions/custom-script-windows"
      },
      {
        "date": "2020-12-28T02:05:00.000Z",
        "voteCount": 1,
        "content": "totally agree wit you"
      },
      {
        "date": "2020-07-24T02:33:00.000Z",
        "voteCount": 2,
        "content": "I think there are 2 ways to achieve this:\n1) Is to do it through Custom Script Extension (A). It can specify the script location &amp; the command to run\n2) Store the Configuration File &amp; specify the location in Azure Template (C). This is specifically used when you have some sensitive data like certificate ( If you like HTTPS in website)\nSo You don't need to do both...but for 2nd one..u still need to use the custom script extension...I think the questions are not worded propely"
      },
      {
        "date": "2020-07-13T12:10:00.000Z",
        "voteCount": 2,
        "content": "Please confirm A and C or A and D ?"
      },
      {
        "date": "2020-08-01T06:48:00.000Z",
        "voteCount": 2,
        "content": "A and D"
      },
      {
        "date": "2020-07-12T14:11:00.000Z",
        "voteCount": 8,
        "content": "All,\nI have done this. \nYou can create a script, upload to Azure and have your VM execute the script after the VM is built. \nIf you were doing thru CLI, you would do something like this :\n\naz vm extension set \\\n  --resource-group $RESOURCEGROUP \\\n  --vm-name simpleLinuxVM \\\n  --name customScript \\\n  --publisher Microsoft.Azure.Extensions \\\n  --version 2.0 \\\n  --settings '{\"fileUris\":[\"https://raw.githubusercontent.com/MicrosoftDocs/mslearn-welcome-to-azure/master/configure-httpd.sh\"]}' \\\n  --protected-settings '{\"commandToExecute\": \"./configure-httpd.sh\"}'\n\nThis means you need to tell the VM to run a script and you need to tell the VM-template where the script is.\nMy answer is :\nA and C"
      },
      {
        "date": "2020-07-06T02:01:00.000Z",
        "voteCount": 6,
        "content": "Came in Exam , Exam given on 06.07.2020"
      },
      {
        "date": "2020-07-04T03:25:00.000Z",
        "voteCount": 1,
        "content": "A &amp; C (Modify the extensionProfile section of the Azure Resource Manager template, Upload configurational script look correct  \nhttps://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/virtual-machine-scale-sets-deploy-app"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16414-exam-az-103-topic-3-question-26-discussion/",
    "body": "DRAG DROP -<br>You have two Azure virtual machines named VM1 and VM2. VM1 has a single data disk named Disk1.<br>You need to attach Disk1 to VM2. The solution must minimize downtime for both virtual machines.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03048/0017800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0017900001.png\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Stop VM1.<br>Step 2: Detach Disk1 from VM1.<br><br>Step 3: Attach Disk1 to VM2 -<br><br>Attach an existing disk -<br>Follow these steps to reattach an existing available data disk to a running VM.<br>1. Select a running VM for which you want to reattach a data disk.<br>2. From the menu on the left, select Disks.<br>3. Select Attach existing to attach an available data disk to the VM.<br>4. From the Attach existing disk pane, select OK.<br>Step 4: Start VM1.<br>Detach a data disk using the portal<br>1. In the left menu, select Virtual Machines.<br>2. Select the virtual machine that has the data disk you want to detach and click Stop to deallocate the VM.<br>3. In the virtual machine pane, select Disks.<br>4. At the top of the Disks pane, select Edit.<br>5. In the Disks pane, to the far right of the data disk that you would like to detach, click the Detach button image detach button.<br>6. After the disk has been removed, click Save on the top of the pane.<br>7. In the virtual machine pane, click Overview and then click the Start button at the top of the pane to restart the VM.<br>8. The disk stays in storage but is no longer attached to a virtual machine.<br>References:<br>https://docs.microsoft.com/en-us/azure/virtual-machines/windows/detach-disk https://docs.microsoft.com/en-us/azure/lab-services/devtest-lab-attach-detach-data-disk",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-29T13:05:00.000Z",
        "voteCount": 40,
        "content": "You sould start VM1 before attaching the disk to VM2 in order to minimize downtime.\nSo the order should be: Stop VM1, Detach Disk from V1, Start VM1, Attach Disk To VM2"
      },
      {
        "date": "2020-03-31T09:46:00.000Z",
        "voteCount": 1,
        "content": "I second that"
      },
      {
        "date": "2020-04-03T04:24:00.000Z",
        "voteCount": 1,
        "content": "agreed 100%"
      },
      {
        "date": "2020-05-24T01:02:00.000Z",
        "voteCount": 1,
        "content": "Exactly my thoughts! I agree with this order"
      },
      {
        "date": "2021-04-01T06:29:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct, you do not need to stop vm for attaching the disk, but white detaching you need to stop the VM."
      },
      {
        "date": "2020-03-14T10:24:00.000Z",
        "voteCount": 26,
        "content": "Stop VM1\nDetach Disk 1 to VM1\nStart VM2\nAttach Disk1 to VM2\n\nYou can only attach a data disk to a VM that is running. Make sure the VM is running before you try to attach a data disk."
      },
      {
        "date": "2020-04-21T21:22:00.000Z",
        "voteCount": 7,
        "content": "But VM1 doesn't need to be shutdown for the disk to be detached...\nIMO I think the question is old."
      },
      {
        "date": "2020-07-23T20:09:00.000Z",
        "voteCount": 7,
        "content": "I dont think VM2 was even stopped so why do you have to start it."
      },
      {
        "date": "2020-09-25T23:24:00.000Z",
        "voteCount": 4,
        "content": "That's so wrong notice you have put there. For what? to confuse everyone? \n\"You can only attach a data disk to a VM that is running\". \nNo need for the VM to be running. I have tested it myself. Both my machines where shut down when I detach and attach the same disk. Then started VM2."
      },
      {
        "date": "2021-03-25T18:18:00.000Z",
        "voteCount": 3,
        "content": "why are you confusing others?"
      },
      {
        "date": "2024-03-18T14:19:00.000Z",
        "voteCount": 1,
        "content": "- Stop VM1\n- Detach Disk1 from VM1\n- Start VM1\n- Attach Disk1 from VM2"
      },
      {
        "date": "2022-01-20T18:04:00.000Z",
        "voteCount": 1,
        "content": "Ok so now adays can't you perform this activity in 2 steps?"
      },
      {
        "date": "2021-03-17T00:08:00.000Z",
        "voteCount": 3,
        "content": "keyword minimize \"downtime\". so if you want until you finish attach the disk to vm2 and then only bring up VM1, the downtime has been longer. so the answer should \n\nStop VM1\nDetach from VM1\nStart VM1\nAttach disk to VM2"
      },
      {
        "date": "2021-02-23T18:27:00.000Z",
        "voteCount": 1,
        "content": "To minimize downtime. And attaching disk to VM only when it is working. Then the given answer is correct."
      },
      {
        "date": "2021-01-02T12:33:00.000Z",
        "voteCount": 1,
        "content": "In a lab, I was able to detach a data disk from one running Windows 2016 Server VM and attach it to another running Windows 2016 server VM on the fly, without stopping the VMs.  However the disk was not configured in the OS as a volume yet. it was not provisioned, mounted, drive letter assigned and not formatted.  does that matter?"
      },
      {
        "date": "2020-10-30T03:18:00.000Z",
        "voteCount": 1,
        "content": "we can attach and  deattach running VMs  as per microsoft documentation but I prefer given answer of website"
      },
      {
        "date": "2020-08-24T05:26:00.000Z",
        "voteCount": 2,
        "content": "Well you can hot detach a data disk, but then you have to be sure that nothing is using the disk at the moment. I would stop the wm to ensure data consistency...\nStop VM1\nDetach\nStart VM1\nAttach to VM2"
      },
      {
        "date": "2020-08-23T15:31:00.000Z",
        "voteCount": 4,
        "content": "The reason to stop VM1 is because \"may be\" it was being used it, not because it was impossible to detach a data disk from a running VM. So, in order to not loose data, the correct action is to stop VM. But in order to have less downtime, the order might be\n1) stop VM1\n2) detach disk from VM1\n3) start VM1\n4) attach data disk to VM2"
      },
      {
        "date": "2020-08-10T02:38:00.000Z",
        "voteCount": 1,
        "content": "stop vm1 - start vm1 - attach - detach"
      },
      {
        "date": "2020-08-09T10:58:00.000Z",
        "voteCount": 3,
        "content": "You can hot detach a data disk.  It's just you have to make sure the disk isn't being used during this process.  Look at this\nhttps://docs.microsoft.com/en-us/azure/virtual-machines/windows/detach-disk\n\nI would say the safe bet would be to shut down the VM first.  And also, the questions states to minimize downtime for both VMs.  In this case, it should be the following\nStop VM1\ndetach disk\nStart VM1\nAttach disk to VM2"
      },
      {
        "date": "2020-08-06T08:38:00.000Z",
        "voteCount": 2,
        "content": "You don't need to stop any VM. I just tested with 2 ubuntu machines.\ndetach from vm1\nattach to vm2\n(click edit at the top of the disk blade before you try to detach it)"
      },
      {
        "date": "2020-08-04T00:51:00.000Z",
        "voteCount": 5,
        "content": "I think this order should minimize the downtime of both VM:\n1.Stop VM1\n2.Detach Disk 1 to VM1\n3.Start VM1\n4.Attach Disk1 to VM2"
      },
      {
        "date": "2020-08-04T15:26:00.000Z",
        "voteCount": 2,
        "content": "agree with you !! The solution must minimize downtime for both virtual machines !!"
      },
      {
        "date": "2020-07-27T06:45:00.000Z",
        "voteCount": 2,
        "content": "This is a nonsense, I guess it's not a valid question any more."
      },
      {
        "date": "2020-07-17T06:46:00.000Z",
        "voteCount": 7,
        "content": "VM1 and VM2 are running. No where in question its mentioned that VM2 is stopped. So why choose start VM2 again? To minimized downtime we need to stop/start VM1 as soon as possible. So the answer should be:\n1. Stop VM1\n2. Detach Disk 1 from VM1\n3. Start VM1\n4. Attach Disk1 to VM2"
      },
      {
        "date": "2020-07-12T14:57:00.000Z",
        "voteCount": 2,
        "content": "Stop VM1\nDetach the disk. \nStart VM1 ( now your VM2 is back and downtime is minimized )\nAttach disk to VM2"
      },
      {
        "date": "2020-07-12T14:59:00.000Z",
        "voteCount": 1,
        "content": "I mean to say \n\"Start VM1 ( now your &lt;&lt;VM1&gt;&gt; is back and downtime is minimized )\""
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/16475-exam-az-103-topic-3-question-27-discussion/",
    "body": "HOTSPOT -<br>You have an Azure subscription named Subscription1. Subscription1 contains the resources in the following table.<br><img src=\"/assets/media/exam-media/03048/0018000001.png\" class=\"in-exam-image\"><br>VNet1 is in RG1. VNet2 is in RG2. There is no connectivity between VNet1 and VNet2.<br>An administrator named Admin1 creates an Azure virtual machine named VM1 in RG1. VM1 uses a disk named Disk1 and connects to VNet1. Admin1 then installs a custom application in VM1.<br>You need to move the custom application to VNet2. The solution must minimize administrative effort.<br>Which two actions should you perform? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03048/0018100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0018200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "We cannot just move a virtual machine between networks.  What we need to do is identify the disk used by the VM, delete the VM itself while retaining the disk, and recreate the VM in the target virtual network and then attach the original disk to it.<br>Reference:<br>https://blogs.technet.microsoft.com/canitpro/2014/06/16/step-by-step-move-a-vm-to-a-different-vnet-on-azure/ https://4sysops.com/archives/move-an-azure-vm-to-another-virtual-network-vnet/#migrate-an-azure-vm-between-vnets<br>Deploy and manage virtual machines (VMs)",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-14T13:19:00.000Z",
        "voteCount": 15,
        "content": "wrong, move is failing because of unsupported ressource-types (IP-Endpoint), displayed answer is correct"
      },
      {
        "date": "2020-06-26T03:02:00.000Z",
        "voteCount": 11,
        "content": "In exam"
      },
      {
        "date": "2024-03-18T14:32:00.000Z",
        "voteCount": 1,
        "content": "Given answer is correct"
      },
      {
        "date": "2022-01-26T07:33:00.000Z",
        "voteCount": 1,
        "content": "Delete first and create a new one in second"
      },
      {
        "date": "2021-03-17T00:10:00.000Z",
        "voteCount": 2,
        "content": "in another word, to move VMs between different vnets.. the term is \"redeploy\" which means delete and create new VM.."
      },
      {
        "date": "2021-02-23T18:35:00.000Z",
        "voteCount": 4,
        "content": "Answer is correct. If you reviewed all the questions then you would find out there has another question testing the same conception. The 2 Vnets has no connection is the condition, APP on VM1, VM1 in RG1, now need move APP in RG2 within no network connection what to do? Delete the old VM and create new VM, which is the less cost."
      },
      {
        "date": "2020-11-19T02:49:00.000Z",
        "voteCount": 2,
        "content": "One cannot just move a virtual machine between networks. What we need to do is identify the disk used by the VM, delete the VM itself while retaining the disk, and recreate the new VM in the target virtual network and then attach the original disk to it."
      },
      {
        "date": "2020-10-30T03:35:00.000Z",
        "voteCount": 5,
        "content": "Delete VM\nCreate VM"
      },
      {
        "date": "2020-08-21T12:18:00.000Z",
        "voteCount": 1,
        "content": "I don't get this, in my mind, the easiest (least administrative effort) solution, is to shut down the VM, attach a new NIC on the second vNet, then detach the first NIC and start the VM.\nWouldn't this work? Nowhere does it say the VM needs to be migrated or moved, it just needs to be connected to the 2nd VNET."
      },
      {
        "date": "2020-08-21T12:22:00.000Z",
        "voteCount": 1,
        "content": "I just tested this in the Azure portal and it works just fine, i see some articles saying it is not possible, however Azure must have fixed this."
      },
      {
        "date": "2020-08-24T05:41:00.000Z",
        "voteCount": 4,
        "content": "That is simply just not true... You can only attach a new NIC from the same VNET...\nI have tested this as well, please don't spam."
      },
      {
        "date": "2020-08-29T08:32:00.000Z",
        "voteCount": 3,
        "content": "correct. Delete and recreate VM is only option here."
      },
      {
        "date": "2020-07-16T09:14:00.000Z",
        "voteCount": 2,
        "content": "this is correct"
      },
      {
        "date": "2020-07-06T09:46:00.000Z",
        "voteCount": 2,
        "content": "Answer is correct.\nhttp://techgenix.com/moving-a-vm/\nhttps://4sysops.com/archives/move-an-azure-vm-to-another-virtual-network-vnet/"
      },
      {
        "date": "2020-06-27T03:41:00.000Z",
        "voteCount": 2,
        "content": "https://4sysops.com/archives/move-an-azure-vm-to-another-virtual-network-vnet/\nHistorically, the Vnet-to-Vnet migration process in Azure required the following steps:\n\n    Stop and deallocate the VM.\n    Delete the VM, but save its virtual hard disks (VHDs).\n    Recreate the VM in the target Vnet by specifying the original disk.\n\nYou can accomplish the preceding (tedious) procedure by using many different methods, including:\nAzure PowerShell\nAzure Resource Manager (ARM) templates"
      },
      {
        "date": "2020-06-15T04:19:00.000Z",
        "voteCount": 1,
        "content": "Why can't we just redeploy the VM? https://docs.microsoft.com/en-us/azure/virtual-machines/troubleshooting/redeploy-to-new-node-windows"
      },
      {
        "date": "2020-06-11T09:53:00.000Z",
        "voteCount": 1,
        "content": "I think it's First: Create a Network interface in RG2 Sec: Move VM1 to RG2 https://docs.microsoft.com/en-us/azure/virtual-machines/windows/move-vm"
      },
      {
        "date": "2020-07-21T14:10:00.000Z",
        "voteCount": 1,
        "content": "You cannot move the VM from one RG to another RG just like that... You need to delete and create a new VM"
      },
      {
        "date": "2020-08-17T12:20:00.000Z",
        "voteCount": 1,
        "content": "You can move a VM to another RG, that is exactly what link is explaining.\n\nDelete the interface.\nMove the VM.\nLeast administrative effort."
      },
      {
        "date": "2020-06-07T21:13:00.000Z",
        "voteCount": 9,
        "content": "You can't move a VM from one VNet to other. You must recreate the VM in that VNet."
      },
      {
        "date": "2020-04-25T13:40:00.000Z",
        "voteCount": 3,
        "content": "Answer seems ok if we have backup of VM1. Then we can redeploy VM to RG2? And another question is do we exactly need to delete VM1 from RG1?"
      },
      {
        "date": "2020-04-16T04:25:00.000Z",
        "voteCount": 1,
        "content": "answers seem OK but description missing more info for the scenario."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "3"
  }
]