[
  {
    "topic": 11,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/56875-exam-az-304-topic-11-question-1-discussion/",
    "body": "You need to recommend a data storage strategy for WebApp1.<br>What should you include in the recommendation?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta vCore-based Azure SQL database\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure virtual machine that runs SQL Server",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure SQL Database elastic pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta fixed-size DTU Azure SQL database"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-08T00:04:00.000Z",
        "voteCount": 24,
        "content": "I think A is correct - hybrid benefit is available for vcore-based servers and this would be more cost effective than vm-based - \"Azure Hybrid Benefit for SQL Server is available to all vCore-based options: SQL Database Managed Instance, Single Database and Elastic Pool\""
      },
      {
        "date": "2021-08-10T02:02:00.000Z",
        "voteCount": 2,
        "content": "This question is made for this requirement \"Whenever possible, existing on-premises licenses must be used to reduce cost.\""
      },
      {
        "date": "2021-09-29T18:38:00.000Z",
        "voteCount": 19,
        "content": "The question is for data storage solution not for WebApp1. Below are requirments for WebApp1 database\n\n1. Database metrics for the production instance of WebApp1 must be available for analysis so that database administrators can optimize the performance settings.\n\n2. To avoid disrupting customer access, database downtime must be minimized when databases are migrated.\n\n3. Database backups must be retained for a minimum of seven years to meet compliance requirements.\n\nBatabase backup for minimum 7 years. The better choice is Long-term backup retention (LTR) which leverages the full database backups that are automatically created to enable point in time restore (PITR). LTR only support for Azure SQL Database and Azure SQL Managed Instance. Therefore B is eliminated.\n\nTo optimize the performance setting, a fixed-size DTU can not meet tunning requirements. Therfore D is eliminated.\n\nC has nothing to do with above 3 requirements. So I would choose A as the answer"
      },
      {
        "date": "2021-11-26T05:25:00.000Z",
        "voteCount": 3,
        "content": "thanks for explanation"
      },
      {
        "date": "2021-12-05T06:55:00.000Z",
        "voteCount": 2,
        "content": "Reviewing the question I think the correct answer is actually C and I'll explain why:\n\nFrom my point of view here the requirement for a database storage strategy is the following:\n\n\"The use of WebApp1 is unpredictable. At peak times, users often report delays. At other times, many resources for WebApp1 are underutilized.\"\n\nIf you go to the official Microsoft documentation on Elastic Pools you will find the following:\n\n\"Azure SQL Database elastic pools are a simple, cost-effective solution for managing and scaling multiple databases that have varying and unpredictable usage demands.\"\n\nTo aprofound the topic please refer to the following document:\n\nhttps://docs.microsoft.com/en-us/azure/azure-sql/database/elastic-pool-overview"
      },
      {
        "date": "2021-12-13T06:40:00.000Z",
        "voteCount": 4,
        "content": "Elastic Pools only make sense if you have multiple DBs that can share the capcities of the pool they are in.\nWe only have one DB here. So there's no point in using a pool imho."
      },
      {
        "date": "2022-01-02T15:32:00.000Z",
        "voteCount": 2,
        "content": "not sure we are only talking about 1 DB, as per:\n-To avoid disrupting customer access, database downtime must be minimized when databases are migrated."
      },
      {
        "date": "2022-07-22T06:07:00.000Z",
        "voteCount": 1,
        "content": "Good point. Also it would be strange for a whole app to have just 1 DB. I thought C"
      },
      {
        "date": "2022-10-15T08:51:00.000Z",
        "voteCount": 1,
        "content": "A is the correct answer.\nTo be more specific, it should be Azure SQL database serverless"
      },
      {
        "date": "2021-12-22T02:54:00.000Z",
        "voteCount": 1,
        "content": "On exam today 22-Dec-21"
      },
      {
        "date": "2021-12-06T04:38:00.000Z",
        "voteCount": 1,
        "content": "Where can I find requirement of this question?"
      },
      {
        "date": "2021-09-28T17:32:00.000Z",
        "voteCount": 2,
        "content": "Since the company already has existing Microsoft licenses with software assurance, they can opt for a hybrid model in which they can benefit from huge discounts.\n\nhttps://docs.microsoft.com/en-us/azure/azure-sql/azure-hybrid-benefit?tabs=azure-powershell"
      },
      {
        "date": "2021-09-27T12:43:00.000Z",
        "voteCount": 1,
        "content": "a strategy will be vCore instead of fixed-size DTU. So (A) is better than (C). In order to achieve the goal (hybrid benefit etc to reduce cost), (C) still needs to use vCore."
      },
      {
        "date": "2021-08-19T05:56:00.000Z",
        "voteCount": 2,
        "content": "Correct answer: B. an Azure virtual machine that runs SQL Server\nWe need to have: minimal downtime during migration and hybrid benefits. The both are in B.\nC - doesn't make any sense (no elastic pool case)\nD - doesn't have hybrid benefit.\nWhy A is incorrect? Because we don't have zero-migration downtime. \nThe Managed Instance solution will be the best (online migration, easy to manage and hybrid benefit) but we don't have this option"
      },
      {
        "date": "2022-01-19T14:41:00.000Z",
        "voteCount": 1,
        "content": "Agree with this thinking. We can't replace a full server with just a database. For transaction log based migration, we can only use SQL MI, or SQL Server VM and we would use the SQL IaaS extension in full managed mode."
      },
      {
        "date": "2022-01-22T11:10:00.000Z",
        "voteCount": 1,
        "content": "Supported configurations\nAzure SQL Database can only be the push subscriber of a SQL Server publisher and distributor.\nThe SQL Server instance acting as publisher and/or distributor can be an instance of SQL Server running on-premises, an Azure SQL Managed Instance, or an instance of SQL Server running on an Azure virtual machine in the cloud.\nThe distribution database and the replication agents cannot be placed on a database in Azure SQL Database.\nSnapshot and one-way transactional replication are supported. Peer-to-peer transactional replication and merge replication are not supported.\nVersions\nTo successfully replicate to a database in Azure SQL Database, SQL Server publishers and distributors must be using (at least) one of the following versions:\n\nPublishing to any Azure SQL Database from a SQL Server database is supported by the following versions of SQL Server:\n\nSQL Server 2016 and greater\nSQL Server 2014 RTM CU10 (12.0.4427.24) or SP1 CU3 (12.0.2556.4)\nSQL Server 2012 SP2 CU8 (11.0.5634.1) or SP3 (11.0.6020.0)"
      },
      {
        "date": "2022-01-22T11:11:00.000Z",
        "voteCount": 1,
        "content": "Also, https://techcommunity.microsoft.com/t5/datacat/migration-from-sql-server-to-azure-sql-database-using/ba-p/305428"
      },
      {
        "date": "2021-08-13T06:35:00.000Z",
        "voteCount": 1,
        "content": "If someone expects that a DB once runing on Microsoft SQL Server 2016 will run quickly or flawlesly - see: \"To avoid disrupting customer access, database downtime must be minimized when databases are migrated.\" - after migrated to Azure SQL, then: GOOD LUCK! As Azure SQL MAnaged instance areot mentioned, there is nothing to deliberate about. It must go on a VM based SQL to provide 100% compability. If not then refactoring is demanded,refactorig here not mentioned."
      },
      {
        "date": "2021-07-25T10:34:00.000Z",
        "voteCount": 3,
        "content": "Elastic Pool  can be based on either DTU or vCore\nhttps://docs.microsoft.com/en-us/azure/azure-sql/database/elastic-pool-overview\n\nvCore vs DTU\nhttps://www.youtube.com/watch?v=1AKDj0_wOFs\n\n\nTherefore, the answer can be Elastic Pool and vCore"
      },
      {
        "date": "2021-08-19T05:32:00.000Z",
        "voteCount": 1,
        "content": "Elastic pool is not db equivalent for VM scale set. It is only cost optimize solution in many DBs case. Here we have only 1 db. So elastic pool doesn't have any sens."
      },
      {
        "date": "2021-07-15T16:40:00.000Z",
        "voteCount": 5,
        "content": "C. an Azure SQL Database elastic pool\nThe elastic pool also has V-Core purchasing model and Hybrid Benefits.\nhttps://azure.microsoft.com/en-au/pricing/details/azure-sql-database/elastic/\nThe use of WebApp1 is unpredictable. At peak times, users often report delays. At other times, many resources for WebApp1 are underutilized."
      },
      {
        "date": "2021-08-19T05:31:00.000Z",
        "voteCount": 1,
        "content": "Elastic pool is not db equivalent for VM scale set. It is only cost optimize solution in many DBs case. Here we have only 1 db. So elastic pool doesn't have any sens."
      },
      {
        "date": "2022-01-02T23:51:00.000Z",
        "voteCount": 1,
        "content": "It is highly unlikely  that a  international company this size with offices across Europe service offering would have one database. \n\"To avoid disrupting customer access, database downtime must be minimized when databases are migrated.\""
      },
      {
        "date": "2021-08-27T09:18:00.000Z",
        "voteCount": 1,
        "content": "Where does it say there is only one DB? it specifically says downtime must be minimised when the databases are migrated, suggesting there are multiple databases.\n\n\"To avoid disrupting customer access, database downtime must be minimized when databases are migrated.\""
      },
      {
        "date": "2021-07-13T05:08:00.000Z",
        "voteCount": 3,
        "content": "\"The use of WebApp1 is unpredictable. At peak times, users often report delays. At other times, many resources for WebApp1 are underutilized.\" shouldnt be SQL Database elastic pool with V-Core pricing model? A &amp; C combo"
      },
      {
        "date": "2021-08-19T05:31:00.000Z",
        "voteCount": 1,
        "content": "Elastic pool is not db equivalent for VM scale set. It is only cost optimize solution in many DBs case. Here we have only 1 db. So elastic pool doesn't have any sens."
      },
      {
        "date": "2021-07-01T23:47:00.000Z",
        "voteCount": 7,
        "content": "I'd choose B\nwhat they have:\nWebApp1 has a web tier that uses Microsoft Internet Information Services (IIS) and a database tier that runs Microsoft SQL Server 2016. The web tier and the database tier are deployed to virtual machines that run on Hyper-V.\nFabrikam purchases all Microsoft licenses through a Microsoft Enterprise Agreement that includes Software Assurance.\n\nfrom req:\nWhenever possible, existing on-premises licenses must be used to reduce cost.\nDatabase metrics for the production instance of WebApp1 must be available for analysis so that database administrators can optimize the performance settings.\nTo avoid disrupting customer access, database downtime must be minimized when databases are migrated.\n\nsuggest hybrid benefit and azure migration"
      },
      {
        "date": "2021-07-11T21:03:00.000Z",
        "voteCount": 1,
        "content": "Azure Hybrid Benefit and enable in Azure SQL Database (vCore base) too"
      },
      {
        "date": "2021-07-11T21:03:00.000Z",
        "voteCount": 1,
        "content": "can enable*"
      }
    ],
    "examNameCode": "az-304",
    "topicNumber": "11"
  }
]