[
  {
    "topic": 14,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35969-exam-pl-100-topic-14-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to create the solution assets.<br>What should you use to create the visualizations? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04323/0028900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0028900002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: PowerBI Desktop -<br>The Sales dashboard must reside in the Sales channel and must include information about active quotes, sales pipeline, and year-to-date sales KPIs for sales quotas by region.<br>PowerBI Desktop to support many data source.<br>Box 2: PowerBI Desktop or Power BI Service on<br>A dashboard that shows a capacity Heat map by month as well as expected sales that are likely to close for the next month.<br>Both support visualizations.<br>Reference:<br>https://docs.microsoft.com/en-us/power-bi/fundamentals/service-service-vs-desktop",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-10T03:06:00.000Z",
        "voteCount": 36,
        "content": "There are no dashboards in Power BI Desktop. So both answers should be only Power BI service.\nRef:\nhttps://docs.microsoft.com/en-us/power-bi/fundamentals/service-service-vs-desktop"
      },
      {
        "date": "2021-01-10T13:32:00.000Z",
        "voteCount": 1,
        "content": "Are you certain on this?  Looks like question 1 should be Power Bi Desktop?"
      },
      {
        "date": "2023-05-10T02:43:00.000Z",
        "voteCount": 3,
        "content": "Do not agree. Visualization is supported by both."
      },
      {
        "date": "2021-01-16T10:01:00.000Z",
        "voteCount": 14,
        "content": "there are no dashboards in Power BI Desktop. So, answers should be Power BI Service."
      },
      {
        "date": "2021-01-24T06:02:00.000Z",
        "voteCount": 3,
        "content": "Exactly what I thought!"
      },
      {
        "date": "2023-01-07T23:17:00.000Z",
        "voteCount": 2,
        "content": "Both are: Service only"
      },
      {
        "date": "2022-12-29T13:42:00.000Z",
        "voteCount": 1,
        "content": "Sales: Power Bi Service\nManufacturing: Both"
      },
      {
        "date": "2022-08-23T09:21:00.000Z",
        "voteCount": 3,
        "content": "Dashboards for sales: Power BI Service\nManufacturing requirements: Can be achieved with either Desktop or Service."
      },
      {
        "date": "2022-06-11T11:00:00.000Z",
        "voteCount": 1,
        "content": "Dashboards are created in Power BI service (only).  Visualizations can be created with either Power BI Desktop or Power BI service.  See https://docs.microsoft.com/en-us/power-bi/fundamentals/service-service-vs-desktop"
      },
      {
        "date": "2021-10-11T23:49:00.000Z",
        "voteCount": 1,
        "content": "Power BI Desktop\nPower BI Service"
      },
      {
        "date": "2021-10-11T23:29:00.000Z",
        "voteCount": 1,
        "content": "both correct"
      },
      {
        "date": "2021-10-10T19:15:00.000Z",
        "voteCount": 2,
        "content": "Power BI Desktop or Power BI Service as both of them allow visualizations.\nPower BI Service, only it can use gateway."
      },
      {
        "date": "2021-10-10T19:21:00.000Z",
        "voteCount": 2,
        "content": "Power BI Desktop for connecting many datasource\nPower BI Service"
      },
      {
        "date": "2021-04-22T05:53:00.000Z",
        "voteCount": 8,
        "content": "People are concentrating way too hard on “dashboards” when the question asks about creating “VISUALIZATIONS” ... Power Bi Desktop contains visualizations , so is not automatically written off as an answer"
      },
      {
        "date": "2021-03-21T02:30:00.000Z",
        "voteCount": 2,
        "content": "1. Include a dashboard that shows all currently active quotes, their status in the sales cycle, the probability of closing, and estimated manufacturing and installation dates, by customer, product division, status, and salesperson.\n\nRequires transformation/aggregation the data, so I believe Desktop is correct"
      },
      {
        "date": "2021-03-21T02:32:00.000Z",
        "voteCount": 1,
        "content": "The second one probably is correct as well"
      },
      {
        "date": "2021-01-31T05:58:00.000Z",
        "voteCount": 5,
        "content": "Both Service, Dashboards can not be created in Power BI Desktop. https://docs.microsoft.com/en-us/power-bi/create-reports/service-dashboard-create link to support.  \"Dashboards are a feature of the Power BI service, not Power BI Desktop. Although you don't create dashboards in the Power BI mobile apps, you can view and share there\""
      },
      {
        "date": "2021-03-10T10:53:00.000Z",
        "voteCount": 9,
        "content": "The question is where you create visualizations, not Dashboards."
      },
      {
        "date": "2023-01-24T11:55:00.000Z",
        "voteCount": 1,
        "content": "You should not just read the question, but also the information provided by the case study, which says \"Include a dashboard that shows all currently active quotes, their status in the sales cycle, the probability of closing, and estimated manufacturing and installation dates, by customer, product division, status, and salesperson.\""
      },
      {
        "date": "2020-12-13T13:19:00.000Z",
        "voteCount": 9,
        "content": "Sales data will be stored in CDS so you need PowerBi desktop. For manufacturing report, data is stored in on-prem SQL server so you need to use a gateway. For gateway connections, you need PowerBi service."
      },
      {
        "date": "2021-01-10T13:30:00.000Z",
        "voteCount": 1,
        "content": "so what would that make the answers then?"
      },
      {
        "date": "2021-01-24T06:19:00.000Z",
        "voteCount": 1,
        "content": "could use desktop to connect to SQL gateway so answer = both desktop/service \n\nhttps://docs.microsoft.com/en-us/power-bi/paginated-reports/paginated-reports-report-builder-power-bi#compare-power-bi-reports-and-paginated-reports"
      },
      {
        "date": "2021-02-04T02:57:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/power-bi/fundamentals/service-service-vs-desktop \nMicrosoft puts Gateways in the Service only circle, so answer is Service not both."
      },
      {
        "date": "2020-12-12T05:02:00.000Z",
        "voteCount": 3,
        "content": "The Sales have a onpremise SQL server, so then it would need PowerBI service right? \n\nhttps://docs.microsoft.com/nl-nl/power-bi/fundamentals/service-service-vs-desktop"
      },
      {
        "date": "2021-05-21T07:25:00.000Z",
        "voteCount": 1,
        "content": "Power BI desktop can connect to SQL server. You indeed need a gateway if you want to connect to an on-prem SQL service from the Power BI service, so you could say both can be used. \nHowever, this gateway needs to be installed so Power BI service can not be used stand-alone. In fact, you might also need Power BI desktop to setup the whole thing (can't confirm this, but below tutorial appears to suggest that).\nhttps://docs.microsoft.com/en-us/power-bi/connect-data/service-gateway-sql-tutorial\n\nTo setup a connection with Dataverse and be able to create the visualizations you also have to use Power BI desktop initially. You can use Power BI service after publication but I don't see how it can be used by itself to do this."
      },
      {
        "date": "2020-11-03T15:46:00.000Z",
        "voteCount": 1,
        "content": "I would have thought the answer for both would be Power BI desktop, because you can't create a dataset that connects to Common Data Service (where the data is stored) from Power BI Service"
      },
      {
        "date": "2020-11-03T15:47:00.000Z",
        "voteCount": 3,
        "content": "No, I just re-read the question, and the manufacturing data is in SQL Server, which you can connect to from Power BI Service."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "14"
  }
]