[
  {
    "topic": 15,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30574-exam-mb-500-topic-15-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to implement the integration for the Vendor Exclusion List form.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04327/0006000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04327/0006100001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Table extension -<br>Isolate all new vendor exclusion codes as a new assembly by creating a table named VendExclusions.<br>Implement the Excel integration for the Vendor Exclusion List form.<br>The table extension object allows you to add additional fields or to change some properties on a table provided by the Dynamics 365 Business Central service. In this way, you can add data to the same table and treat it as a single table.<br><br>Box 2: Unique key -<br>Create an index for the table named PrimaryIdx that uses the following fields: CustAccount, ItemId, VendAccount.<br>Box 3: Build and synchronize the database.<br>A project property lets you specify that the synchronize operation for the database should be performed every time that you build the project. This can be useful when you're making changes to the table structure for an application. Each time that you build, you will know that the database is synchronized with the tables as they are defined in the project.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/business-central/dev-itpro/developer/devenv-table-ext-object https://docs.microsoft.com/en-us/dynamics365/fin-ops-core/dev-itpro/dev-tools/build-operations#synchronizing-the-database-at-each-build",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-04T05:45:00.000Z",
        "voteCount": 15,
        "content": "Excel integration is done with data entities"
      },
      {
        "date": "2020-10-01T11:15:00.000Z",
        "voteCount": 9,
        "content": "The table extension is not required, data entity instead"
      },
      {
        "date": "2022-03-02T05:39:00.000Z",
        "voteCount": 4,
        "content": "You need to create Data entity for excel integration. Data entity needs Unique entity key. Data entities require build and database sync."
      },
      {
        "date": "2022-01-05T08:00:00.000Z",
        "voteCount": 7,
        "content": "Answer is \nData entity \nUnique Key\nBuild and Sync"
      }
    ],
    "examNameCode": "mb-500",
    "topicNumber": "15"
  },
  {
    "topic": 15,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30576-exam-mb-500-topic-15-question-2-discussion/",
    "body": "HOTSPOT -<br>The system includes the following code: (Line numbers are included for reference only.)<br><img src=\"/assets/media/exam-media/04327/0006200001.jpg\" class=\"in-exam-image\"><br>You need to apply changes to address User2's issues.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04327/0006300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04327/0006300002.png\" class=\"in-exam-image\">",
    "answerDescription": "Scenario: User2 reports performance issues when they generate direct delivery purchase orders after current updates are applied.<br>Also: You must implement validation to check whether a proposed direct delivery purchase order vendor is on the exclusion list for the customer and product combination.<br><br>Box 1: No -<br>The firstOnly keyword helps speed up the fetch by returning only the first row.<br><br>Box 2: No -<br><br>Box 3: Yes -<br><br>Box 4: Yes -<br>RecId stands for Record Identifier. It is often called RowId (row identifier). It is a unique and incremental value stored with each and every row of the table. In<br>Microsoft Dynamics AX 2012 and Microsoft Dynamics 365 for Finance and Operations, RecId is used as unique identifiers and to create relations between tables.<br>Another important point is the difference between RecId and Id. In simple words, RecId is generated by the kernel whereas the Id is generated by the application itself.<br>RecId is used to find out the unique row in the table.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/fin-ops-core/dev-itpro/dev-ref/xpp-data-query https://community.dynamics.com/ax/b/nevoitechax/posts/what-is-recid-in-microsoft-dynamics-ax-365fo",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-27T09:00:00.000Z",
        "voteCount": 20,
        "content": "Yes: Select firstonly increase performance and with field list it is added performance boost.\nNo: No need for Cluster index setting here\nYes: Configure Primary index on table is must\nYes: RecId in select list will help avoiding load on DB to fetch full list of fields"
      },
      {
        "date": "2022-01-20T08:26:00.000Z",
        "voteCount": 2,
        "content": "i assume the primary Index is already configured as stated in the requirements :\n\"Create an index for the table named PrimaryIdx that uses the following fields: CustAccount, ItemId, VendAccount.\"\n why would i configure it again?"
      },
      {
        "date": "2023-10-30T03:01:00.000Z",
        "voteCount": 1,
        "content": "I would say Clustered index is useful here. Check this reference: https://learn.microsoft.com/en-us/dynamicsax-2012/developer/clustered-indexes\n\nOrganizing your tables with a clustered index usually has performance advantages. The general rules are as follows:\n- If only one index is created on the table, make it clustered.\n- Create a clustering index on the key on all group and main tables."
      },
      {
        "date": "2022-03-02T05:52:00.000Z",
        "voteCount": 3,
        "content": "Yes: always use firstonly keyword when you want to fetch just single record\nNo: records are physically ordered by clustered index in the database → nothing about the performance\nNo/Yes: index on these fields is already created in requirement, but if It wasn't it would definitely help with the performance to create it\nYes: term is usually \"field list\" not \"column list\". Fetching only required fields surely helps with the performance here and only RecId is actually required here."
      },
      {
        "date": "2022-01-05T08:01:00.000Z",
        "voteCount": 2,
        "content": "For me it will be Yes,Yes,No,Yes"
      },
      {
        "date": "2021-01-01T19:25:00.000Z",
        "voteCount": 2,
        "content": "Yes, No, Yes, Yes.\nClustered index are necessarily unique combination which is required in this case for exclusion list, Customer, Item and Vendor. First only and selecting fields used are best practices to increase performance by decreasing packet size during round trip."
      },
      {
        "date": "2020-12-16T19:04:00.000Z",
        "voteCount": 2,
        "content": "I think is Yes,Yes,No,Yes"
      },
      {
        "date": "2020-11-13T01:07:00.000Z",
        "voteCount": 1,
        "content": "so which the correct answer?"
      },
      {
        "date": "2020-09-04T05:56:00.000Z",
        "voteCount": 1,
        "content": "I would do Yes, Yes, No, NO"
      }
    ],
    "examNameCode": "mb-500",
    "topicNumber": "15"
  }
]