[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/52906-exam-sc-300-topic-7-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to meet the technical requirements for the probability that user identities were compromised.<br>What should the users do first, and what should you configure? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04262/0006300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04262/0006300002.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-policies",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-28T10:02:00.000Z",
        "voteCount": 20,
        "content": "IMO, you would need to set up MFA before SSPR when as per requirement protecting against leaked credentials by implementing a sign-in risk remediation policy without blocking access. Ref. https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/howto-identityprotection-remediate-unblock ."
      },
      {
        "date": "2022-01-10T02:35:00.000Z",
        "voteCount": 24,
        "content": "I agree that in reality, you would enable MFA as that is the best way to protect accounts, but I think this question is about setting up a User Risk Policy, and in that policy one of the settings is \"Identity Protection -&gt; User Risk Policy -&gt; Controls -&gt; Allow access -&gt; Require password change\".  Therefore setting up SSPR is required to complete this task."
      },
      {
        "date": "2021-09-28T03:32:00.000Z",
        "voteCount": 14,
        "content": "The answers are correct.\nThe question is about probability that user identities were compromised\n\nUser risk is a calculation of probability that an \"identity\" has been compromised.\nAdministrators can choose to block access, allow access, or allow access but require a password change using Azure AD self-service password reset."
      },
      {
        "date": "2021-11-24T08:23:00.000Z",
        "voteCount": 1,
        "content": "You are correct."
      },
      {
        "date": "2024-07-18T06:36:00.000Z",
        "voteCount": 3,
        "content": "On exam 7/18/24, used answered provided\nIn the requirements: Users must be forced to change their password if there is a probability that the users' identity was compromised.\nYou would need to register users for SSPR first and then create a user-risk policy that forces them to change their password."
      },
      {
        "date": "2024-01-30T15:16:00.000Z",
        "voteCount": 2,
        "content": "In the requirements: Users must be forced to change their password if there is a probability that the users' identity was compromised.\n\nYou would need to register users for SSPR first and then create a user-risk policy that forces them to change their password."
      },
      {
        "date": "2023-07-04T10:22:00.000Z",
        "voteCount": 1,
        "content": "SSPR\nA user risk policy"
      },
      {
        "date": "2023-01-26T12:55:00.000Z",
        "voteCount": 3,
        "content": "It's really hard to say. The Microsoft says the pros and cons.\n\n\"To perform secure password change to self-remediate a user risk:\nThe user must have registered for Azure AD MFA.\"\n\nand after some lines\n\"\nSelf-remediation with self-service password reset\nIf a user has registered for self-service password reset (SSPR), then they can also remediate their own user risk by performing a self-service password reset.\"\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/identity-protection/howto-identity-protection-remediate-unblock"
      },
      {
        "date": "2022-10-03T23:11:00.000Z",
        "voteCount": 6,
        "content": "MFA and user risk policy is the answer for me.\n\n\"When a user risk policy triggers:\nAdministrators can require a secure password reset, requiring Azure AD MFA be done before the user creates a new password with SSPR, resetting the user risk.\"\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/identity-protection/howto-identity-protection-configure-risk-policies"
      },
      {
        "date": "2022-09-12T10:16:00.000Z",
        "voteCount": 5,
        "content": "It's User Risk and SSPR\n\nWithin a User Risk policy, when setting the Controls - Access section, you only have two options:\n1)  you completely block the user\n2)  you allow the user access still, but they \"Require password change\"\n\nMFA would be related to Sign-In risk policy, not User Risk."
      },
      {
        "date": "2022-08-29T02:48:00.000Z",
        "voteCount": 1,
        "content": "MFA is a requirement here."
      },
      {
        "date": "2022-06-29T12:51:00.000Z",
        "voteCount": 4,
        "content": "MFA ans SSPR are two duistincts setups that look similar and therefore lots of people are getting confused. That is why Azure is now forccing the combined setup :\n\nBefore combined registration, users registered authentication methods for Azure AD Multi-Factor Authentication and self-service password reset (SSPR) separately. People were confused that similar methods were used for Multi-Factor Authentication and SSPR but they had to register for both features. Now, with combined registration, users can register once and get the benefits of both Multi-Factor Authentication and SSPR. \nhttps://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-registration-mfa-sspr-combined\nBut since there is no mention of cpmbined setup SSPR it is"
      },
      {
        "date": "2022-06-21T10:29:00.000Z",
        "voteCount": 5,
        "content": "MFA is a requirement for enabling SSPR and there's no mention in the Introductory Info that MFA is already setup.\nSee below URL for reference;\n\nhttps://docs.microsoft.com/en-us/azure/active-directory/authentication/tutorial-enable-sspr\n\nSo for me it's MFA and User Risk Pol"
      },
      {
        "date": "2022-06-19T15:25:00.000Z",
        "voteCount": 2,
        "content": "Users-risky situation. Users must first have SSPR enabled first. And then you will need to configure User-risk policy"
      },
      {
        "date": "2022-03-29T22:12:00.000Z",
        "voteCount": 1,
        "content": "On the exam - March 28, 2022"
      },
      {
        "date": "2022-03-21T05:40:00.000Z",
        "voteCount": 4,
        "content": "just pass the exam today. This came in the question. MFA + User Risk Policy"
      },
      {
        "date": "2022-03-13T15:07:00.000Z",
        "voteCount": 1,
        "content": "IMO, it is SSPR since MFA is not one of the requirements making me assuming MFA is already enabled. Also, in order to automate a password reset, SSPR needs to be enabled when the risky-user policy kicks in."
      },
      {
        "date": "2022-03-10T11:36:00.000Z",
        "voteCount": 2,
        "content": "Require the user to reset password - Requiring the users to reset passwords enables self-recovery without contacting help desk or an administrator. This method only applies to users that are registered for Azure AD MFA and SSPR. For users that haven't been registered, this option isn't available."
      },
      {
        "date": "2022-03-10T11:29:00.000Z",
        "voteCount": 1,
        "content": "Yes, correct."
      }
    ],
    "examNameCode": "sc-300",
    "topicNumber": "7"
  }
]