[
  {
    "topic": 24,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/50659-exam-pl-400-topic-24-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to configure the fields with the appropriate type.<br>Which type should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04332/0004700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04332/0004800001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Lookup -<br>Fields for the doctor's name and phone number must be displayed in the customer record.<br>Lookup: A field that allows setting a reference to a single record of a specific type of entity.<br><br>Box 2:  Calculated -<br>Refill dates for customer prescriptions should be automatically determined and a notification should be sent to the customer.<br>Calculated field: Contains calculations that use fields from the current entity or related parent entities.<br><br>Box 3: Text -<br>Field data type: Single Line of Text:<br>This field can contain up to 4,000 text characters. You can set the maximum length to be less than this. This field has several format options that will change the presentation of the text. These options are Email, Text, Text Area, URL, Ticker Symbol, and Phone.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/types-of-fields",
    "votes": [],
    "comments": [
      {
        "date": "2021-04-21T08:14:00.000Z",
        "voteCount": 17,
        "content": "I believe that the given answers are correct"
      },
      {
        "date": "2023-03-18T10:36:00.000Z",
        "voteCount": 1,
        "content": "Correct to me"
      },
      {
        "date": "2021-11-15T01:31:00.000Z",
        "voteCount": 3,
        "content": "Correct!!"
      },
      {
        "date": "2021-08-04T02:38:00.000Z",
        "voteCount": 3,
        "content": "Correct. Doctors name should just be text on Doctor entity for adding new doctors. Lookup from Customer entity to Doctor. Refill date is auto-calculated so Calculated makes most sense"
      },
      {
        "date": "2021-05-24T11:57:00.000Z",
        "voteCount": 3,
        "content": "I think so"
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "24"
  },
  {
    "topic": 24,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81939-exam-pl-400-topic-24-question-2-discussion/",
    "body": "DRAG DROP -<br>You need to assign the minimum environmental security role to the appropriate users.<br>Which security roles should you use? To answer, drag the appropriate security roles to the correct users. Each security role may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04332/0005000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04332/0005100001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Environment Maker -<br>UserA must be able to create and publish Power Apps apps.<br>The Environment Maker role can create resources within an environment including apps, connections, custom connectors, gateways, and flows using Power<br>Automate.<br><br>Box 2: System Administrator -<br>UserB must be the owner of all the systems and be able to provide permissions and create all new environments.<br>The System Administrator has full permission to customize the system. Can view all data in the system.<br><br>Box 3: System Customizer -<br>UserC must be able to create apps connected to the systems and update the security roles and entities.<br>The System Customizer has full permission to customize the system. Can only view rows for system tables that they create.<br>The difference between the System Administrator and System Customizer security roles is that a system administrator has read privileges on most rows in the system and can see everything. Assign the System Customizer role to someone who needs to perform customization tasks but shouldn't see any data in the system tables.<br><br>Box 4: Common Data Service User -<br>To stay consistent with our product rebranding effort, the security role Common Data Service User is being changed to Basic User.<br>The Basic User security role primarily contains Basic privileges for core entities where the user can write, update, and delete records that they created or owned.<br>Reference:<br>https://docs.microsoft.com/en-us/power-platform/admin/environments-overview https://docs.microsoft.com/en-us/powerapps/maker/model-driven-apps/privileges-required-customization#system-administrator-and-system-customizer-security- roles https://docs.microsoft.com/en-us/power-platform-release-plan/2020wave2/data-platform/common-data-service-user-security-role-renamed-basic-user",
    "votes": [],
    "comments": [
      {
        "date": "2023-08-05T02:58:00.000Z",
        "voteCount": 4,
        "content": "answers provided are correct\nenvironment maker\nsystem admin\nsystem customizer\ncommon data service user"
      },
      {
        "date": "2023-07-16T19:27:00.000Z",
        "voteCount": 1,
        "content": "UserC needs permission for Security roles which is System Administrator. System Customer doesn't have permission to update security Roles.\nSo Answers should be\n1. Environment Maker\n2. System Customizer\n3. System Administrator\n4. Common Data Service User"
      },
      {
        "date": "2023-08-07T07:00:00.000Z",
        "voteCount": 1,
        "content": "The given answer by exam topics is correct.\nFor UserC read:\n\n'Users who make apps that connect to the database and need to create or update entities and security roles must have the System Customizer role in addition to the Environment Maker role. The Environment Maker role doesn't have privileges on the environment's data.'\n\nhttps://learn.microsoft.com/en-us/power-platform/admin/database-security#environments-with-a-dataverse-database\n\nThere is a difference between updating a security role and changing privliges."
      },
      {
        "date": "2023-03-18T10:46:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2022-09-13T00:11:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "24"
  },
  {
    "topic": 24,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81938-exam-pl-400-topic-24-question-3-discussion/",
    "body": "You need to create an application to deploy to other pharmacies.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecreate customizations in a new environment.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a customer connector to connect the pharmacies' systems to the company's systems.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExport the solution as a managed solution.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWrite a Web API to move customizations."
    ],
    "answer": "C",
    "answerDescription": "When you export a managed solution, it contains all the changes that have been applied for that solution into a file that you can then import into a different<br>Dataverse environment.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/developer/data-platform/introduction-solutions",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-18T10:47:00.000Z",
        "voteCount": 4,
        "content": "Correct"
      },
      {
        "date": "2022-09-13T00:11:00.000Z",
        "voteCount": 3,
        "content": "correct"
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "24"
  },
  {
    "topic": 24,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/85487-exam-pl-400-topic-24-question-4-discussion/",
    "body": "DRAG DROP -<br>You need to set up security to meet the requirements.<br>How should you configure security? To answer, drag the appropriate security mechanisms to the correct users. Each security mechanism may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04332/0005300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04332/0005400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Field level security -<br>Only supervisors must be able to view phone numbers in the Accounts form.<br>You use field security tables to apply field-level security, which restricts field access to specified users and teams. The scope of field-level security is global, which means that it applies to all records within the organization, regardless of the business unit hierarchical level to which the record or the user belongs. Field security works in all Microsoft Dataverse clients, including the Web client, Dynamics 365 for Outlook, and Dynamics. It applies to all components, such as the Dataverse web services, reports, search, offline, filtered views, auditing, and duplicate detection.<br><br>Box 2: Team Security -<br>Sales users must only have access to their own records.<br>Owner team: An owner team owns records and has security roles assigned to the team. A user's privileges can come from their individual security roles, those of the teams that they're part of or the ones they inherit. A team has full access rights on the records that the team owns. Team members are added manually to the owner team.<br><br>Box 3: Environment security -<br>Developers must be able to create new apps for all users.<br>Environment maker: Can create new resources associated with an environment, including apps, connections, custom APIs, gateways, and flows using Microsoft<br>Power Automate. However, this role doesn't have any privileges to access data within an environment.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/developer/data-platform/field-security-entities https://docs.microsoft.com/en-us/power-platform/admin/database-security https://docs.microsoft.com/en-us/power-platform/admin/manage-teams#types-of-teams",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-14T10:50:00.000Z",
        "voteCount": 11,
        "content": "I think for salespeople it should be security role."
      },
      {
        "date": "2022-12-07T04:30:00.000Z",
        "voteCount": 5,
        "content": "I agree with you, because \"Sales users must only have access to their own records.\" not to team records. So salespeople should have security role."
      },
      {
        "date": "2023-10-02T09:21:00.000Z",
        "voteCount": 1,
        "content": "I think the second one is the security role.\nThe third one is security roles as well because Environment security mechanisms this is about the creation of security groups and adding users and groups to the environment.\nhttps://learn.microsoft.com/en-us/power-platform/admin/control-user-access"
      },
      {
        "date": "2023-08-03T09:12:00.000Z",
        "voteCount": 2,
        "content": "salespeople should have security roles with the table set to User"
      },
      {
        "date": "2023-03-16T14:28:00.000Z",
        "voteCount": 1,
        "content": "I'm not sure about the second one since we have  a user/team security access level for a role in Dataverse. \"Their own records\" means they need user/team security level access"
      },
      {
        "date": "2023-01-19T04:45:00.000Z",
        "voteCount": 4,
        "content": "Environment Maker is not Environment Security, it is a security role.\nRow level security is also implemented by security role."
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "24"
  }
]