[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32853-exam-az-102-topic-2-question-2-discussion/",
    "body": "DRAG DROP -<br>You have an on-premises file server named Server1 that runs Windows Server 2016.<br>You have an Azure subscription that contains an Azure file share.<br>You deploy an Azure File Sync Storage Sync Service, and you create a sync group.<br>You need to synchronize files from Server1 to Azure.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02520/0006200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02520/0006300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: Install the Azure File Sync agent on Server1<br>The Azure File Sync agent is a downloadable package that enables Windows Server to be synced with an Azure file share<br>Step 2: Register Server1.<br>Register Windows Server with Storage Sync Service<br>Registering your Windows Server with a Storage Sync Service establishes a trust relationship between your server (or cluster) and the Storage Sync Service.<br><br>Step 3: Add a server endpoint -<br>Create a sync group and a cloud endpoint.<br>A sync group defines the sync topology for a set of files. Endpoints within a sync group are kept in sync with each other. A sync group must contain one cloud endpoint, which represents an Azure file share and one or more server endpoints. A server endpoint represents a path on registered server.<br>References:<br>https://docs.microsoft.com/en-us/azure/storage/files/storage-sync-files-deployment-guide",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-26T11:37:00.000Z",
        "voteCount": 1,
        "content": "correct answer"
      }
    ],
    "examNameCode": "az-102",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19067-exam-az-102-topic-2-question-8-discussion/",
    "body": "HOTSPOT -<br>You have an Azure Service Bus.<br>You create a queue named Queue1. Queue1 is configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/02520/0007400001.jpg\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02520/0007500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02520/0007600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: deleted after two hours -<br>All messages sent into a queue or topic are subject to a default expiration that is set at the entity level with the defaultMessageTimeToLive property and which can also be set in the portal during creation and adjusted later. The default expiration is used for all messages sent to the entity where TimeToLive is not explicitly set.<br>The default expiration also functions as a ceiling for the TimeToLive value. Messages that have a longer TimeToLive expiration than the default value are silently adjusted to the defaultMessageTimeToLive value before being enqueued.<br><br>Box 2: deleted in one hour -<br>References:<br>https://docs.microsoft.com/en-us/azure/service-bus-messaging/message-expiration",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-28T23:25:00.000Z",
        "voteCount": 1,
        "content": "Box 1.......retained until manually deleted\nBox 2........deleted immediately"
      },
      {
        "date": "2020-04-25T15:34:00.000Z",
        "voteCount": 1,
        "content": "why Box 2 answers is deleted in one hour . Should not it be deleted after it is read."
      }
    ],
    "examNameCode": "az-102",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21862-exam-az-102-topic-2-question-9-discussion/",
    "body": "You have an Azure subscription that contains the resources in the following table.<br><img src=\"/assets/media/exam-media/02520/0007700001.png\" class=\"in-exam-image\"><br>Store1 contains a file share named Data. Data contains 5,000 files.<br>You need to synchronize the files in Data to an on-premises server named Server1.<br>Which three actions should you perform? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the Azure File Sync agent on Server1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a container instance.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDownload an automation script.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a sync group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRegister Server1."
    ],
    "answer": "ADE",
    "answerDescription": "Azure synchronize files on-premises agent<br>A: The Azure File Sync agent is a downloadable package that enables Windows Server to be synced with an Azure file share.<br>D: A sync group defines the sync topology for a set of files. Endpoints within a sync group are kept in sync with each other. A sync group must contain one cloud endpoint, which represents an Azure file share and one or more server endpoints. A server endpoint represents a path on registered server. A server can have server endpoints in multiple sync groups. You can create as many sync groups as you need to appropriately describe your desired sync topology.<br>E: Registering your Windows Server with a Storage Sync Service establishes a trust relationship between your server (or cluster) and the Storage Sync Service. A server can only be registered to one Storage Sync Service and can sync with other servers and Azure file shares associated with the same Storage Sync Service.<br>Incorrect Answers:<br>B: The Resource group is used in a container.<br>References:<br>https://docs.microsoft.com/en-us/azure/storage/files/storage-sync-files-deployment-guide",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-01T21:51:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct\nSequence\n1. Create sync Group\n2. Install Azure file sync agent\n3. Register server"
      }
    ],
    "examNameCode": "az-102",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/12669-exam-az-102-topic-2-question-12-discussion/",
    "body": "DRAG DROP -<br>You have an Azure subscription that contains an Azure file share.<br>You have an on-premises server named Server1 that runs Windows Server 2016.<br>You plan to set up Azure File Sync between Server1 and the Azure file share.<br>You need to prepare the subscription for the planned Azure File Sync.<br>Which two actions should you perform in the Azure subscription? To answer, drag the appropriate actions to the correct targets. Each action may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02520/0008400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02520/0008500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "First action: Create a Storage Sync Service<br>The deployment of Azure File Sync starts with placing a Storage Sync Service resource into a resource group of your selected subscription.<br>Second action:  Run Server Registration<br>Registering your Windows Server with a Storage Sync Service establishes a trust relationship between your server (or cluster) and the Storage Sync Service. A server can only be registered to one Storage Sync Service and can sync with other servers and Azure file shares associated with the same Storage Sync Service.<br>The Server Registration UI should open automatically after installation of the Azure File Sync agent.<br><img src=\"/assets/media/exam-media/02520/0008600001.png\" class=\"in-exam-image\"><br>Incorrect Answers:<br>Not Install the Azure File Sync agent: The Azure File Sync agent is a downloadable package that enables Windows Server to be synced with an Azure file share.",
    "votes": [],
    "comments": [
      {
        "date": "2020-01-24T07:31:00.000Z",
        "voteCount": 7,
        "content": "First Action: Create a Storage Sync Service\nSecond Action: Create a sync group\n\nThese are the only actions you perform in the Azure Subscription. \nInstall Azure File Sync Agent and Server Registration are performed from the server endpoints, which in this case is the on-premise server named Server1."
      }
    ],
    "examNameCode": "az-102",
    "topicNumber": "2"
  }
]