[
  {
    "topic": 2,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/90130-exam-pl-500-topic-2-question-7-discussion/",
    "body": "Case study -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study:<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br>Background:<br>Contoso Pharmaceuticals distributes specialty pharmaceuticals, ingredients, and raw materials throughout North America. The company has 33 offices and 12 warehouses across the US, Mexico, and Canada. As their customers’ needs grow in sophistication, Contoso wants to delight customers with breakthrough products, exceptional service, and on-time delivery of materials. They want to automate time consuming and manual processes that are prone to error. Contoso wants to consolidate and automate ordering and fulfillment processes.<br><br>* The company has a fleet of 500 delivery trucks. The company has 150 drivers and uses third-party contractors to deliver goods.<br>* The company has 400 warehouse workers and 30 finance clerks.<br>* Contoso has 85 sales representatives and 50 customer service representatives. Sales representatives spend most of their time on the road visiting customers or prospects.<br>* The IT department consists of four system administrators and six system analysts.<br><br>Current environment:<br>Contoso Pharmaceuticals has a custom enterprise resource management (ERP) system. It is difficult to integrate other applications and services with the system. Office staff manually key in purchase orders, customer orders, and invoices after they receive a scan or hard copy of an agreement.<br><br>Applications:<br>* The company uses a custom supplier management system named SMSApps that runs on each user’s workstation. The system is costly to run and maintain. SMSApp does not have an API.<br>* Sales representatives manage customer requests by using Dynamics 365 Sales.<br>* Contoso has Microsoft Power Platform development, user acceptance testing (UAT), and production environments.<br>* Administrators create one Accounts Payable (AP) mailbox for each environment to support testing.<br>* The use of a DLP policy and Desktop Flow development is specified as part of the automation requirements.<br><br>Business Process:<br>1. Sales representatives create quotes by using a Microsoft Word document template. The template allows representatives to include product, quantity, and cost estimation details that will be needed to fulfil an order. The representative converts quotes to a PDF file and emails the file to the customer for approval.<br>2. The sales representative alerts the finance team about the new order and emails the finance team a copy of the quote for processing.<br>3. The finance team prints the quote and manually creates a purchase order (PO) into SMSApp to request materials from a known and trusted vendor.<br>4. The SMSApp distributes the PO to stakeholders. The system sends a copy to a shared finance team mailbox.<br>5. Once a PO is fulfilled by a vendor, the system sends an email to the finance mailbox. The finance team releases an order to the warehouse.<br>6. Materials are shipped from the vendor to one of Contoso’s warehouses. Warehouse workers enter key information from the waybill into SMSApp. The materials are unloaded and racked in the warehouse until they are shipped to customers.<br>7. Upon checking for new daily orders in SMSApp, they see an open order is pending that is awaiting the newly received materials.<br>8. The Warehouse worker loads an order onto a truck for delivery and marks the order as complete in SMSApp.<br>9. Sales representatives provide fulfillment status and tracking information for orders.<br>10. A finance clerk prepares an invoice and sends the invoice to the customer by email. The clerk sends a copy of the email to the shared AP mailbox.<br>11. The AP team monitors the shared mailbox to confirm that the customer has paid the invoice.<br>Functional requirements:<br>* Large volume orders must be processed before other orders.<br>* Invoices must be cross-checked with received items against packing slip for shipments.<br>* The finance team must be able to analyze patterns in transactional data to conduct fraud prevention activities.<br>* You must automate the process of entering data about incoming orders into SMSApp.<br>* The solution must follow the principle of least privilege.<br><br>Purchase Order Quantity flow:<br>* You must create an unmanaged solution to update purchase order details in SMSApp. The flow must use a manual trigger.<br>* Members of Accounts Payable team will be testers for the solution. They must be able to access the Purchase Order Quantity flow.<br>Flow for processing invoice data:<br>* You must create a flow to monitor the AP mailbox. When an invoice arrives as an attachment in the inbox, the flow must automatically process the invoice data by using a form processing model. The flow must cross-check the received items against the packing slip.<br>* You must use different Accounts Payable email addresses for development, user acceptance testing (UAT), and production environments.<br>* You must use an environment variable to represent the Accounts Payable mailbox for the environment in use.<br>* You must be able to use the environment variable across multiple cloud flows, a custom connector, and a canvas app.<br>Technical requirements:<br>* Users must only be allowed to connect to and access systems that are required for the employee to perform required job tasks.<br>* All automation flows must be either co-owned or shared between staff.<br>* All employees must be able to access the new environment to build personal productivity automations.<br>* You must distribute the workload for desktop flows to optimize productivity.<br><br>Monitor flows:<br>* All data extracted from Invoices should be stored in a custom Dataverse entity. Only employees who are part of Finance role should be able to edit all Invoice data but must be prevented from creating or deleting one.<br><br>Invoice data:<br>All users report that they can see and modify invoice data.<br><br>New environment:<br>* The IT department creates a new environment. A user creates a cloud flow named FlowA in the environment that triggers a desktop flow. A user reports that the cloud flow does not trigger the desktop flow to run.<br>* Microsoft Dataverse is not provisioned in the new environment. You attempt to create a Desktop flow in the default environment but receive a Dataverse error message and cannot proceed.<br><br>Data entry automation flow:<br>An administrator runs a new desktop flow in the development environment to automate data entry into SMSApp. The flow automatically reverts to a suspended state.<br><br>Order fulfillment flow:<br>You must automate the customer communication process by using an unattended desktop flow. The flow must check the fulfilment status of each active order in SMSApp. If an order is fulfilled, the flow must send the customer an email that includes tracking information for their order.<br><br><br>You need to configure permissions for the Purchase order quantity flow.<br>Which permission should you assign?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCo-owner",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUser",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun-only user\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOwner"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-12-05T12:50:00.000Z",
        "voteCount": 7,
        "content": "isn't this A?\n\n* All automation flows must be either co-owned or shared between staff."
      },
      {
        "date": "2023-02-27T10:45:00.000Z",
        "voteCount": 4,
        "content": "C is correct because they just want Members of Accounts Payable team to be able to access the Purchase Order Quantity flow =&gt; they don't want AP team to edit or share the flows =&gt; AP must be run-only users"
      },
      {
        "date": "2022-12-07T02:41:00.000Z",
        "voteCount": 3,
        "content": "I think this is about the manual trigger flow (so they might mean this for the Automated cloud flows). Also: only the manual triggered (instant) flows can be used as run-only users."
      },
      {
        "date": "2024-04-19T00:22:00.000Z",
        "voteCount": 1,
        "content": "Manual trigger cloud flow --&gt; Instant cloud flow.\n\"Run-only user\" role is ONLY exists in instant cloud flow"
      },
      {
        "date": "2024-01-25T00:38:00.000Z",
        "voteCount": 2,
        "content": "C. Run-only user"
      },
      {
        "date": "2023-06-08T03:11:00.000Z",
        "voteCount": 1,
        "content": "It should be A manually run flow can be run manually by owners so it has to be shared as owner"
      },
      {
        "date": "2023-04-01T11:09:00.000Z",
        "voteCount": 4,
        "content": "It seems C is correct.  Member of Accounts Payable just need to run the flow to test it. No need to edit it."
      },
      {
        "date": "2023-03-30T15:31:00.000Z",
        "voteCount": 2,
        "content": "This is a vague question. It doesn't specify the user group. It does, however; a state that All automated must be either co-owned or shared. This would make the answer A?"
      },
      {
        "date": "2022-12-20T06:49:00.000Z",
        "voteCount": 1,
        "content": "Member of AP teams should be able only to test this flow. Sharing a flow also mean sharing it to users as run-only users. So I think C is correct."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/90276-exam-pl-500-topic-2-question-8-discussion/",
    "body": "HOTSPOT -<br>You need to determine the causes for the reported issues.<br>What are the causes? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/pl-500/image3.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image4.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-12-07T02:46:00.000Z",
        "voteCount": 9,
        "content": "I'd choose C/A/C, because when Admin mode has been turned OFF, an effect can be:\n\n\"After taking the environment out of admin mode, flows may not trigger as expected until caches have been cleared; this can take up to 24 hours.\"\n- https://learn.microsoft.com/en-us/power-platform/admin/admin-mode"
      },
      {
        "date": "2023-04-13T04:21:00.000Z",
        "voteCount": 1,
        "content": "pls explain the last one..."
      },
      {
        "date": "2023-04-01T12:02:00.000Z",
        "voteCount": 5,
        "content": "C.\nA. admin do manage flow permission. https://learn.microsoft.com/en-us/power-platform/admin/manage-power-automate\nA. the question itself states no Dataverse is provisioned."
      },
      {
        "date": "2023-04-01T12:02:00.000Z",
        "voteCount": 3,
        "content": "C.\nA. admin do NOT manage flow permission, only enable/disable/delete/share/view. https://learn.microsoft.com/en-us/power-platform/admin/manage-power-automate\nA. the question itself states no Dataverse is provisioned."
      },
      {
        "date": "2024-05-21T21:16:00.000Z",
        "voteCount": 2,
        "content": "For me the answer is:\n- Admin mode is turned on: Documentation states that \"If an environment’s admin mode is turned on, all background processes, including flows will be turned off, causing the flow to not trigger.\" See ref: https://learn.microsoft.com/en-us/power-automate/triggers-troubleshoot?tabs=classic-designer#verify-if-admin-mode-is-turned-on\n- FlowA: The user does not have the correct permissions.\n- There is no Microsoft Dataverse database provisioned: Although it is true that the error is not appearing in the new environment, it says that it appears on the DEFAULT environment (\"you attempt to create a Desktop flow in the default environment but receive a Dataverse error message and cannot proceed.\"). So, the only one that makes sense is this one (Because the other one mentions the \"DEVELOPMENT\" environment)"
      },
      {
        "date": "2024-01-25T00:00:00.000Z",
        "voteCount": 3,
        "content": "Admin mode is turned off.\nThe us is in the wrong environment.\nMicrosoft Dataverse was not shared with the user from the development environment."
      },
      {
        "date": "2024-01-17T03:12:00.000Z",
        "voteCount": 1,
        "content": "Why everyone says the last is C? The questions says \"No dataverse provisioned\", then it should be A, no? Please explain me"
      },
      {
        "date": "2023-12-21T22:32:00.000Z",
        "voteCount": 2,
        "content": "B (In admin mode, flows don't work)\nB (user might not have necessary permissions)\nA (Given in the question that Dataverse is not provisioned in new environment)"
      },
      {
        "date": "2023-10-10T19:30:00.000Z",
        "voteCount": 3,
        "content": "BBC is correct"
      },
      {
        "date": "2023-03-09T00:24:00.000Z",
        "voteCount": 2,
        "content": "why is not B A C"
      },
      {
        "date": "2023-02-22T20:29:00.000Z",
        "voteCount": 2,
        "content": "C,A,C,\n1. C, agree what said Stinow: when environment out of admin mode, flows may not trigger as expected up to 24 hours\n2. A, New environment was created and wasn't properly selected\n3. C, Correct"
      },
      {
        "date": "2023-01-11T06:52:00.000Z",
        "voteCount": 2,
        "content": "The Desktop Flows require the database, In the new environment the database is not provisioned: https://learn.microsoft.com/en-us/power-automate/desktop-flows/requirements"
      },
      {
        "date": "2022-12-22T21:01:00.000Z",
        "voteCount": 1,
        "content": "DAC, i think"
      },
      {
        "date": "2022-12-06T11:40:00.000Z",
        "voteCount": 2,
        "content": "I think it's B/A/C\n\"An Administrator runs a new desktop flow in the DEVELOPMENT environment\""
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/90277-exam-pl-500-topic-2-question-9-discussion/",
    "body": "You need to resolve the fulfillment status flow issue.<br>Which three actions should you perform? Each correct answer presents part of the solution.<br>NOTE: Each connect selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnsure that the flow instance does not remain in the queue for more than three hours.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnsure that all users are signed out from the target machine.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse different local Windows accounts for all machines.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnsure that the flow is not using elevated privileges.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrigger the flow by using an on-premises data gateway.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "ABE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "ABE",
        "count": 4,
        "isMostVoted": true
      },
      {
        "answer": "ABD",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-02-22T20:48:00.000Z",
        "voteCount": 6,
        "content": "A,B,E\n- E is correct, because to create a connection between a cloud flow and a desktop flow its necessary to use on-premises data gateway. See:\nhttps://learn.microsoft.com/en-us/power-automate/desktop-flows/desktop-flow-connections"
      },
      {
        "date": "2024-05-10T09:07:00.000Z",
        "voteCount": 1,
        "content": "A. Ensure that the flow instance does not remain in the queue for more than three hours.\nD. Ensure that the flow is not using elevated privileges.\nE. Trigger the flow by using an on-premises data gateway."
      },
      {
        "date": "2024-03-14T19:22:00.000Z",
        "voteCount": 2,
        "content": "\"Unattended desktop flows can't run with elevated privileges.\" -- D correct"
      },
      {
        "date": "2024-01-25T00:04:00.000Z",
        "voteCount": 2,
        "content": "A. Ensure that the flow instance does not remain in the queue for more than three hours.\nB. Ensure that all users are signed out from the target machine.\nD. Ensure that the flow is not using elevated privileges."
      },
      {
        "date": "2023-10-12T20:18:00.000Z",
        "voteCount": 1,
        "content": "correction.\n\nD because it says flow needs to be unattended and unattended desktop flows cannot run with elevated rights"
      },
      {
        "date": "2023-10-10T19:37:00.000Z",
        "voteCount": 1,
        "content": "ABE as per me"
      },
      {
        "date": "2023-10-10T19:40:00.000Z",
        "voteCount": 1,
        "content": "I need to change. BDE is correct. Unattended flows can't run with elevated privileges."
      },
      {
        "date": "2023-04-01T12:16:00.000Z",
        "voteCount": 3,
        "content": "A. 3 hours will timeout the flow.\nB. unattended=signed out\nE. deprecated but still works."
      },
      {
        "date": "2023-03-30T15:43:00.000Z",
        "voteCount": 1,
        "content": "Anyone know why it's not A?"
      },
      {
        "date": "2023-03-30T15:42:00.000Z",
        "voteCount": 1,
        "content": "Sure B and D are correct. B as it mentions unattended. E is not correct. A is debatable as there is a 3 hour timeout on cloud flow waits however; I assume it's not A due to the flow already hitting the pc."
      },
      {
        "date": "2023-02-24T18:54:00.000Z",
        "voteCount": 1,
        "content": "Why A ? please explain"
      },
      {
        "date": "2023-02-07T06:25:00.000Z",
        "voteCount": 1,
        "content": "E is incorrect, gateways have been deprecated, and it now uses machines and machine groups. \n\nA,B,D\n\nThere is a timeout of 3 hours.\nhttps://learn.microsoft.com/en-us/power-automate/desktop-flows/run-desktop-flows-sequentially?source=recommendations"
      },
      {
        "date": "2023-02-22T21:02:00.000Z",
        "voteCount": 2,
        "content": "D is incorrect, it is irrelevant whether or not you have elevated privileges because \"When a desktop flow is triggered by a cloud flow, the actions contained in the desktop flow that require elevated privileges won't have any effect.\", see:\nhttps://learn.microsoft.com/en-us/power-automate/desktop-flows/how-to/run-power-automate-elevated-rights"
      },
      {
        "date": "2022-12-06T11:48:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/91834-exam-pl-500-topic-2-question-10-discussion/",
    "body": "You need to implement security to resolve the invoice data issue.<br>Which three actions should you perform? Each correct answer present part of the solution.<br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClear the Create and Delete permissions. Set the Read permission and Write permission values to Organization.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Finance role, select Custom Entities and navigate to the table.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn Microsoft Power Platform admin center, navigate to the Users section.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn Microsoft Power Platform admin center, navigate to the Security roles section.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClear the Create and Delete permissions. Set the Read permission and Write permission values to Business unit.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Finance role select Core Records, and then navigate to the table."
    ],
    "answer": "BDE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BDE",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "ABD",
        "count": 4,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-12-16T06:52:00.000Z",
        "voteCount": 7,
        "content": "I would chose ABD.  The case description notes that  \"Finance role should be able to edit all Invoice data\", which means they should have organization access to Read and Write"
      },
      {
        "date": "2024-05-22T03:01:00.000Z",
        "voteCount": 1,
        "content": "I vote for B, D, and E"
      },
      {
        "date": "2024-04-23T05:52:00.000Z",
        "voteCount": 1,
        "content": "BDE correct"
      },
      {
        "date": "2024-03-27T04:48:00.000Z",
        "voteCount": 1,
        "content": "I would chose ABD"
      },
      {
        "date": "2024-02-08T07:43:00.000Z",
        "voteCount": 1,
        "content": "chatgpt: AD"
      },
      {
        "date": "2024-01-25T00:39:00.000Z",
        "voteCount": 2,
        "content": "A. Clear the Create and Delete permissions. Set the Read permission and Write permission values to Organization.\nB. Select the Finance role, select Custom Entities and navigate to the table.\nD. In Microsoft Power Platform admin center, navigate to the Security roles section."
      },
      {
        "date": "2023-11-02T21:21:00.000Z",
        "voteCount": 1,
        "content": "BDE is correct"
      },
      {
        "date": "2023-10-12T20:20:00.000Z",
        "voteCount": 1,
        "content": "BDE for me"
      },
      {
        "date": "2023-04-01T12:30:00.000Z",
        "voteCount": 3,
        "content": "B. D. E. Custom entity of Invoices: Finance business unit role have permissions to read and write. all others are cleared."
      },
      {
        "date": "2023-04-01T12:44:00.000Z",
        "voteCount": 1,
        "content": "only finace roles can read and write. other users have can't read the invoices."
      },
      {
        "date": "2023-02-24T20:42:00.000Z",
        "voteCount": 1,
        "content": "Difference Between tables in Core Records and tables in Custom Entities ? Please Explain"
      },
      {
        "date": "2023-02-26T04:13:00.000Z",
        "voteCount": 3,
        "content": "This helped me a lot. \nhttps://www.youtube.com/watch?v=N1WDaLhRyuY\n(6:22 - core records)"
      },
      {
        "date": "2023-02-26T04:30:00.000Z",
        "voteCount": 2,
        "content": "I'm guessing the Invoice data table is not a custom entity, so I'll go with F.\n(DFE)"
      },
      {
        "date": "2023-03-23T03:01:00.000Z",
        "voteCount": 1,
        "content": "@stv Invoice data table is not created by Dataverse database by default, so the invoice data table would not appear in core records. Core records contain those tables which are commonly used across different2 scenarios such as Accounts, Contacts etc\n\nI would go with the default answer BDE"
      },
      {
        "date": "2023-01-20T23:21:00.000Z",
        "voteCount": 3,
        "content": "ABD since finance have to see all invoice data scope should be organization"
      },
      {
        "date": "2023-02-27T12:02:00.000Z",
        "voteCount": 4,
        "content": "only Finance can see and edit the invoices, but the remaining employees should not =&gt; cannot set Write permission for the whole org."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/90404-exam-pl-500-topic-2-question-11-discussion/",
    "body": "You need to configure the flow for processing invoices that arrive in the AP mailbox.<br>Which three elements should you use? Each correct answer presents pat of the solution.<br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAI model\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDocument type\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLocation",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tForm type",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPages\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tForm"
    ],
    "answer": "ABE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "ABE",
        "count": 14,
        "isMostVoted": true
      },
      {
        "answer": "ADE",
        "count": 3,
        "isMostVoted": false
      },
      {
        "answer": "ABF",
        "count": 3,
        "isMostVoted": false
      },
      {
        "answer": "ADF",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-12-16T07:01:00.000Z",
        "voteCount": 14,
        "content": "When you add a Predict action to cloud flow, you can configure the Model, Document type, Document, and Pages.  Location is not a property."
      },
      {
        "date": "2023-10-10T20:08:00.000Z",
        "voteCount": 1,
        "content": "agreed"
      },
      {
        "date": "2023-04-01T16:12:00.000Z",
        "voteCount": 1,
        "content": "agreed."
      },
      {
        "date": "2022-12-20T07:07:00.000Z",
        "voteCount": 1,
        "content": "I agree"
      },
      {
        "date": "2023-04-13T19:13:00.000Z",
        "voteCount": 7,
        "content": "I think. A,D,F"
      },
      {
        "date": "2024-10-05T00:03:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/ai-builder/form-processing-model-in-flow"
      },
      {
        "date": "2024-05-21T21:19:00.000Z",
        "voteCount": 2,
        "content": "When you use the \"Extract information from documents\" action to use your custom document processing model the options are:\n- AI model\n- Form type\n- Form\n- Pages (Optional)\n\nSo, for me the answer is ADF"
      },
      {
        "date": "2024-04-24T14:51:00.000Z",
        "voteCount": 1,
        "content": "I checked in documentation and the correct answer should be : ABE"
      },
      {
        "date": "2024-02-08T08:00:00.000Z",
        "voteCount": 1,
        "content": "AI, Formtype and Pages i think would be correct one"
      },
      {
        "date": "2024-02-08T07:49:00.000Z",
        "voteCount": 1,
        "content": "chatgpt: Document type , Formtype and Pages \nIs it correct ?"
      },
      {
        "date": "2024-01-25T00:40:00.000Z",
        "voteCount": 2,
        "content": "A. AI model\nB. Document type\nE. Pages"
      },
      {
        "date": "2024-01-17T04:59:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/ai-builder/form-processing-model-in-flow"
      },
      {
        "date": "2023-11-04T22:47:00.000Z",
        "voteCount": 1,
        "content": "AI Model, Document Type and Form \nhttps://learn.microsoft.com/en-us/ai-builder/form-processing-model-in-flow\nPages are not required."
      },
      {
        "date": "2023-11-04T22:53:00.000Z",
        "voteCount": 2,
        "content": "Correction: - AI Model, Form Type and Form\nhttps://learn.microsoft.com/en-us/ai-builder/form-processing-model-in-flow\nIn activity screen shot its Form Type and in parameter details on the page above its document type"
      },
      {
        "date": "2023-08-23T01:37:00.000Z",
        "voteCount": 3,
        "content": "AI model, Form type and Form are required parameters. https://learn.microsoft.com/en-us/ai-builder/form-processing-model-in-flow"
      },
      {
        "date": "2023-11-04T22:48:00.000Z",
        "voteCount": 1,
        "content": "AI Model, document type and form"
      },
      {
        "date": "2023-11-04T22:53:00.000Z",
        "voteCount": 1,
        "content": "AI Model, Form type and form\nhttps://learn.microsoft.com/en-us/ai-builder/form-processing-model-in-flow\nIn activity screen shot its Form Type and in parameter details on the page above its document type"
      },
      {
        "date": "2023-05-04T08:48:00.000Z",
        "voteCount": 5,
        "content": "I would answer AI Model, Form type and form since the question is to process the invoice using form processesing model. https://learn.microsoft.com/en-us/ai-builder/form-processing-model-in-flow"
      },
      {
        "date": "2023-04-28T02:57:00.000Z",
        "voteCount": 1,
        "content": "Why location and pages?"
      },
      {
        "date": "2023-04-06T09:19:00.000Z",
        "voteCount": 1,
        "content": "All good"
      },
      {
        "date": "2022-12-07T06:01:00.000Z",
        "voteCount": 2,
        "content": "Not sure if this question is complete. Do not recognize the 'location' answer."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/90408-exam-pl-500-topic-2-question-12-discussion/",
    "body": "You need to identify the cause for the SMSApp data entry issue.<br>What is the root cause?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe default policy group is set to Blocked.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe scope of the DLP policy was changed to exclude the development environment.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe DLP policy that contains the desktop flow connector was deleted.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe desktop flow was not shared with the finance clerk.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Power Automate Management connector is assigned to the Business category."
    ],
    "answer": "E",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-20T01:00:00.000Z",
        "voteCount": 1,
        "content": "A. The default policy group is set to Blocked"
      },
      {
        "date": "2024-01-25T00:42:00.000Z",
        "voteCount": 1,
        "content": "A. The default policy group is set to Blocked."
      },
      {
        "date": "2023-12-20T00:49:00.000Z",
        "voteCount": 1,
        "content": "The keyword is a new desktop flow. When you create a new one, it will use the default blocked connector group."
      },
      {
        "date": "2023-06-12T16:37:00.000Z",
        "voteCount": 4,
        "content": "A - https://learn.microsoft.com/en-us/power-automate/prevent-data-loss\nPolicy is suspended if the default group is set to Blocked and the desktop flows are running in the target environments."
      },
      {
        "date": "2023-10-10T20:22:00.000Z",
        "voteCount": 1,
        "content": "agreed. if default state for connectors  is set to blocked  for the target env, then desktop flow will be suspended"
      },
      {
        "date": "2023-07-26T11:19:00.000Z",
        "voteCount": 1,
        "content": "default group places new connectors when they are introduced to the Power Platform into a default group of business, non-business or blocked. the PAD connector will be in the non-business category by default because it has been around for a while, therefore the only answer that makes sense is that the connector was moved into the business category. it's a pretty confusing question if you ask me."
      },
      {
        "date": "2023-06-07T09:56:00.000Z",
        "voteCount": 1,
        "content": "Enforcement of DLP policies will be available for managed environments only. =&gt; since \"an administrator runs a new desktop flow in the development environment -&gt; caused suspended state.\nAnswer is D?"
      },
      {
        "date": "2023-06-02T02:21:00.000Z",
        "voteCount": 1,
        "content": "E\n\nhttps://powerusers.microsoft.com/t5/General-Power-Automate/Your-flow-was-updated-but-it-is-currently-suspended-since-it/m-p/253464#M24569"
      },
      {
        "date": "2023-04-01T16:07:00.000Z",
        "voteCount": 3,
        "content": "Default dlp policy set to blocked will block the  connector"
      },
      {
        "date": "2023-05-13T04:28:00.000Z",
        "voteCount": 3,
        "content": "So the answer is A?"
      },
      {
        "date": "2022-12-07T06:13:00.000Z",
        "voteCount": 2,
        "content": "A suspended state can mean it hasn't been used for more than 28 days ór can have something to do with DLP policies on a connector (in this case E)."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/86005-exam-pl-500-topic-2-question-13-discussion/",
    "body": "HOTSPOT -<br>You need to configure the solution.<br>What should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br><img src=\"https://img.examtopics.com/pl-500/image7.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image8.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-20T03:14:00.000Z",
        "voteCount": 15,
        "content": "I believe the first one should be desktop flows. \n\nMobile task flows are just for phones and tablets, and are a type of cloud flow. The case study specifies the app is on each user's work station, and there is no API, so a cloud flow would have no way to directly connect to it."
      },
      {
        "date": "2022-12-07T06:17:00.000Z",
        "voteCount": 4,
        "content": "\"An administrator runs a new desktop flow in the development environment to automate data entry into SMSApp. \""
      },
      {
        "date": "2022-12-20T07:42:00.000Z",
        "voteCount": 10,
        "content": "I choose 3, 4, 4"
      },
      {
        "date": "2023-02-24T20:52:00.000Z",
        "voteCount": 1,
        "content": "Last one why 4 ?"
      },
      {
        "date": "2024-01-25T00:43:00.000Z",
        "voteCount": 2,
        "content": "Desktop flow\nWhen a new email arrives in a shared mailbox\nBusiness process flows"
      },
      {
        "date": "2023-10-10T20:25:00.000Z",
        "voteCount": 2,
        "content": "3,4,4for me"
      },
      {
        "date": "2023-06-12T16:58:00.000Z",
        "voteCount": 4,
        "content": "Desktop Flow\nWhen a new email arrives to a shared mailbox\nInstant Flow - It is stated that \"The flow must use a manual trigger\"."
      },
      {
        "date": "2023-02-07T06:52:00.000Z",
        "voteCount": 7,
        "content": "3,4,2\n\nFirst one needs to be a desktop flow because there is no API. \n\nSecond one specifies it's a shared mailbox in a few places. \n\nThird one specifies \"You must create an unmanaged solution to update purchase order details in SMSApp. The flow must use a manual trigger.\" a manual trigger is a instant flow. Business process flows, and business rules apply to power apps model driven apps, which is out of scope for this exam and not mentioned in the case study."
      },
      {
        "date": "2022-11-18T03:55:00.000Z",
        "voteCount": 1,
        "content": "2,3 and 1 actually."
      },
      {
        "date": "2022-11-18T03:54:00.000Z",
        "voteCount": 1,
        "content": "3,3 and 1"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104442-exam-pl-500-topic-2-question-14-discussion/",
    "body": "HOTSPOT<br> -<br><br>You are developing a cloud flow.<br><br>You write expressions for the following JSON object. (Line numbers are included for reference only.)<br><br><img src=\"https://img.examtopics.com/pl-500/image125.png\"><br><br>The flow parses JSON data by using the following schema:<br><br><img src=\"https://img.examtopics.com/pl-500/image126.png\"><br><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image127.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image128.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-29T23:48:00.000Z",
        "voteCount": 12,
        "content": "i thik only 4th one is True. \nthe 3rd one is incorrect -  cannot be evaluated because array index '2' is outside bounds (0, 1) of array"
      },
      {
        "date": "2023-04-28T04:09:00.000Z",
        "voteCount": 1,
        "content": "I agree. I've tested on power automate and it returned me an error"
      },
      {
        "date": "2023-07-19T01:18:00.000Z",
        "voteCount": 9,
        "content": "Be careful and check how the expressions are written and test them in Power Automate. \n\nNO - It throws an error because is missing the question mark between body(Parse_JSON) and ['customerName']. It would work if written correctly even though there isn't customerName.\nNO - It outputs \": 10091\"\nNO - Position 2 doesn't exist, only 0 and 1.\nYES - It works even if you omit the last question mark between customerPhones and position."
      },
      {
        "date": "2023-07-21T00:32:00.000Z",
        "voteCount": 1,
        "content": "Correction on the second answer:\nThe output of the concat is an error if using body('Parse_JSON').customerName as written in the question. The error specifies that customerName doesn't exist.\n\nAs a curiosity, if using body('Parse_JSON')?['customerName'] it doesn't throw any error and the output is \": 10091\".\n\nAnswer is still NO, but I find interesting the two different outputs."
      },
      {
        "date": "2023-07-26T11:39:00.000Z",
        "voteCount": 2,
        "content": "Cegebe is 100% correct on all of these. it won't throw the error if you include the '?' because that tells power automate to ignore the property if it doesn't exist, so the flow will execute successfully."
      },
      {
        "date": "2024-05-21T21:55:00.000Z",
        "voteCount": 4,
        "content": "With this I learnt some things:\n- You can call properties using dot notation \"body('Parse_JSON').customerNumber\"\n- The \"?\" is not mandatory to be present when calling a property. For example: \"body('Parse_JSON')?['customerName']\" also can be \"body('Parse_JSON')['customerName']\". The difference is that the \"?\" indicates Power Automate to ignore the error if the property does not exist in the object.\n- You can also use \"?\" before calling an item from an array, so for example if the third expression would have had \"customerPhones?[2]\", it would have not failed\n- You can use \"?\" with dot notation.\n\nSo, from all of that the answer is:\n- No: The expression throws an error because the \"customerName\" property is not present.\n- No: The expression throws an error because \"customerName\" property is not present.\n- No: The expression throws an error because the index is out of the array.\n- Yes"
      },
      {
        "date": "2024-04-19T00:35:00.000Z",
        "voteCount": 1,
        "content": "No\nNo\nNo\nYes"
      },
      {
        "date": "2024-01-25T00:45:00.000Z",
        "voteCount": 2,
        "content": "Yes\nNo\nNo\nYes"
      },
      {
        "date": "2023-06-14T03:47:00.000Z",
        "voteCount": 1,
        "content": "YES, NO, NO, YES"
      },
      {
        "date": "2023-04-28T12:19:00.000Z",
        "voteCount": 4,
        "content": "I created an instant flow with a variable with the Json, then the Parse JSON and a compose. The result was (True, : 10091, False, 114456129), which means ( Yes, No, No, Yes)"
      },
      {
        "date": "2023-04-04T15:07:00.000Z",
        "voteCount": 3,
        "content": "yes.  correct. customerName are empty or null\nno.   returns :10091\nno. customerPhones[2] array index out of bound\nyes correct"
      },
      {
        "date": "2023-04-11T20:26:00.000Z",
        "voteCount": 1,
        "content": "The first case. - there is no customerName in the expressions"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/103572-exam-pl-500-topic-2-question-15-discussion/",
    "body": "You have a desktop flow that interacts with a desktop-based application. You plan to enter data into each field by using the Send keys action.<br><br>You test the flow. The Send keys action runs successfully but the input fields are empty.<br><br>You need to add a step before the Send keys action to resolve the issue.<br><br>Which two steps can you use? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Wait for window action.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Wait for mouse action.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Focus window action.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the window state.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the key state."
    ],
    "answer": "AC",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AC",
        "count": 10,
        "isMostVoted": true
      },
      {
        "answer": "BC",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-03-22T03:47:00.000Z",
        "voteCount": 10,
        "content": "I would say AC.\nhttps://github.com/MicrosoftDocs/power-automate-docs/blob/main/articles/desktop-flows/how-to/automate-applications-keyboard-shortcuts.md"
      },
      {
        "date": "2024-06-17T14:40:00.000Z",
        "voteCount": 1,
        "content": "hihihih"
      },
      {
        "date": "2024-05-20T01:01:00.000Z",
        "voteCount": 1,
        "content": "A and C"
      },
      {
        "date": "2024-04-19T00:36:00.000Z",
        "voteCount": 1,
        "content": "A, C is correct"
      },
      {
        "date": "2024-02-08T08:08:00.000Z",
        "voteCount": 1,
        "content": "chatgpt: CE"
      },
      {
        "date": "2024-01-25T00:46:00.000Z",
        "voteCount": 2,
        "content": "A. Use the Wait for window action.\nC. Use the Focus window action."
      },
      {
        "date": "2023-12-29T12:22:00.000Z",
        "voteCount": 1,
        "content": "chatgpt: AC is correct"
      },
      {
        "date": "2023-12-05T05:19:00.000Z",
        "voteCount": 1,
        "content": "A,C is correct."
      },
      {
        "date": "2023-10-10T20:46:00.000Z",
        "voteCount": 1,
        "content": "I think AC too"
      },
      {
        "date": "2023-08-28T23:01:00.000Z",
        "voteCount": 1,
        "content": "B as \"Mouse Pointer\" property has an Option called \"Wait cursor\". \nC i agree with others."
      },
      {
        "date": "2023-05-02T21:13:00.000Z",
        "voteCount": 2,
        "content": "Agreed with others that the answer should be AC"
      },
      {
        "date": "2023-04-28T04:14:00.000Z",
        "voteCount": 2,
        "content": "I think it's A - to check the window is opened and C: To send the keys to the correct window"
      },
      {
        "date": "2023-04-21T12:17:00.000Z",
        "voteCount": 2,
        "content": "A - wait for the window element to be verified\nC - focus the application for keystrokes to be sent"
      },
      {
        "date": "2023-03-30T16:23:00.000Z",
        "voteCount": 1,
        "content": "This honestly cannot be the correct answer...."
      },
      {
        "date": "2023-03-30T00:05:00.000Z",
        "voteCount": 2,
        "content": "I think same. A and C"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104156-exam-pl-500-topic-2-question-16-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create the following flow:<br><br><img src=\"https://img.examtopics.com/pl-500/image129.png\"><br><br>Use the drop-down menus to select the answer choice that answers each question based on the information presented in the graphic.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image130.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image131.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-05-31T12:16:00.000Z",
        "voteCount": 9,
        "content": "I replicated the flow in the desktop flow\nBreakpoint - line 4\nedge window launched in step 2"
      },
      {
        "date": "2024-01-24T23:42:00.000Z",
        "voteCount": 3,
        "content": "4\nthe Edge window launched in step 2"
      },
      {
        "date": "2023-12-05T05:33:00.000Z",
        "voteCount": 2,
        "content": "breakpoint: line 4 and 9\nEdge window launched in step 2"
      },
      {
        "date": "2023-03-30T00:00:00.000Z",
        "voteCount": 2,
        "content": "beakpoint -  4\nSendKeystroke -  the edge window launched in step 2"
      },
      {
        "date": "2023-03-28T22:49:00.000Z",
        "voteCount": 1,
        "content": "I tried it and it was 4 and 1"
      },
      {
        "date": "2023-03-27T19:25:00.000Z",
        "voteCount": 2,
        "content": "Yes. I think its 4 and 2"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104157-exam-pl-500-topic-2-question-17-discussion/",
    "body": "HOTSPOT<br> -<br><br>You develop automation solutions for a company.<br><br>You need to implement actions to meet the company’s requirements.<br><br>What should you do? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image132.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image133.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-27T19:28:00.000Z",
        "voteCount": 14,
        "content": "1. Move to top\n2. Change the priority"
      },
      {
        "date": "2023-04-04T15:29:00.000Z",
        "voteCount": 2,
        "content": "agreed"
      },
      {
        "date": "2024-02-22T22:23:00.000Z",
        "voteCount": 1,
        "content": "1. Move to top\n2. Change the priority\n\nhttps://learn.microsoft.com/en-us/power-automate/desktop-flows/monitor-desktop-flow-queues"
      },
      {
        "date": "2024-01-24T23:32:00.000Z",
        "voteCount": 2,
        "content": "Move to the top\nChange the priority"
      },
      {
        "date": "2023-03-30T00:03:00.000Z",
        "voteCount": 1,
        "content": "1. Move to Top\n2. create a scheduled trigger"
      },
      {
        "date": "2023-06-02T02:43:00.000Z",
        "voteCount": 3,
        "content": "even with scheduled trigger if there is a high priority flow in queue it will run first."
      },
      {
        "date": "2023-06-02T02:43:00.000Z",
        "voteCount": 2,
        "content": "so change the priority"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104444-exam-pl-500-topic-2-question-18-discussion/",
    "body": "HOTSPOT<br> -<br><br>You are developing automation solutions for a company.<br><br>You need to select the appropriate error handling action for the following scenarios.<br><br>Which actions should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image134.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image135.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-30T00:19:00.000Z",
        "voteCount": 15,
        "content": "1 --&gt; Handle the error with in the action only.\n2 --&gt; Handle the error within the on block error only.\n3 --&gt; Configure run after"
      },
      {
        "date": "2024-04-18T04:26:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2024-01-25T00:12:00.000Z",
        "voteCount": 2,
        "content": "Handle the error within the action only.\nHandle the error within the On block error only.\nConfigure run after"
      },
      {
        "date": "2023-05-19T05:24:00.000Z",
        "voteCount": 4,
        "content": "I think it is a tricky question. Indeed you need only one action to launch the excel, but it is not the only way, you can also do it as a block and add just that one action in the block. So as it is possible, for the first scenario I would say the last option. So:\n1. 4-on Block error or within the action\n2. 3-on Block only\n3. 2-Configure run after"
      },
      {
        "date": "2024-05-21T22:08:00.000Z",
        "voteCount": 1,
        "content": "It is a valid thinking, but you also don't know how it would affect the other actions in the flow, handling them as a grouped with the Launch Excel action, so, as we don't have the whole context of the flow, the best way to approach it is to handle the exception at action-level."
      },
      {
        "date": "2023-05-31T12:48:00.000Z",
        "voteCount": 2,
        "content": "I agree with your comment related to the first answer"
      },
      {
        "date": "2023-05-02T21:26:00.000Z",
        "voteCount": 2,
        "content": "Answer offered by Anuvind is correct.\n1. Error can't be handled in the Launch Excel action\n2. Error can be handled in the Populate text field on web page action\n3. Configure run after is the most logical choice"
      },
      {
        "date": "2023-04-01T21:07:00.000Z",
        "voteCount": 1,
        "content": "1. handle error with action error, as it always fails, so at least one action contains produce bad error and should be debugged with action error.\n2. handle error with on block error. occasion error may be due to error in connectivity or website down or unresponsive\n3. configure run after to update varible the failed action"
      },
      {
        "date": "2023-04-01T21:11:00.000Z",
        "voteCount": 1,
        "content": "cloud flow use configure run after https://learn.microsoft.com/en-us/training/modules/error-handling/2-configure-run-after"
      },
      {
        "date": "2023-04-04T15:50:00.000Z",
        "voteCount": 4,
        "content": "my bad.\n1. handle with action only. only one action is necessary to launch excel with blank workbook.\n2. handle the error with on block error. at least two actions: launch chrome, and populate input.\n3. configure run after. available only on cloud flow."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104313-exam-pl-500-topic-2-question-19-discussion/",
    "body": "HOTSPOT<br> -<br><br>You create a solution that includes a Power Automate cloud flow and desktop flow.<br><br>You observe the following issues with the solution:<br><br>•\tA single Power Automate cloud flow action has a long run time.<br>•\tThe Power Automate desktop flow encounters an error.<br><br>You need to debug the solution.<br><br>Which debug features should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image136.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image137.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-18T04:27:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2024-01-25T00:48:00.000Z",
        "voteCount": 2,
        "content": "Timeout\nGet last error"
      },
      {
        "date": "2023-12-05T05:54:00.000Z",
        "voteCount": 1,
        "content": "Correct."
      },
      {
        "date": "2023-06-20T08:19:00.000Z",
        "voteCount": 1,
        "content": "Yes, correct."
      },
      {
        "date": "2023-03-28T22:54:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/129069-exam-pl-500-topic-2-question-20-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background -<br><br>City Power and Light is one of the biggest energy companies in North America. They extract, produce and transport oil. The company has more than 50 offices and 100 oil extraction facilities throughout the United States, Canada, and Mexico. They use railways, trucks, and pipelines to move oil and gas from their facilities.<br><br>The company provides the following services:<br><br>•\tProduce oil from oil sands safely, responsibly, and reliably.<br>•\tRefine crude oil into high-quality products.<br>•\tDevelop and manage wind power facilities.<br>•\tTransport oil to different countries/regions.<br><br>City Power and Light uses various Microsoft software products to manage its daily actives and run its machine-critical applications.<br><br><br>Requirements -<br><br><br>ManagePipelineMaintenanceTasks -<br>A user named Admin1 creates a cloud flow named ManagePipelineMaintenanceTasks. Admin1 applies a data loss prevention (DLP) policy to the flow. Admin1 shares the flow with a user named PipelineManager1 as co-owner. You must determine the actions that PipelineManager1 can perform.<br><br><br>MaintenanceScheduler -<br>You create a cloud flow that uses a desktop flow. The desktop flow connects to third-party services to fetch information. You must not permit the desktop flow to run for more than 20 minutes.<br><br>You must configure sharing for MaintenanceScheduler to meet the following requirements:<br><br>•\tUser1 must be able to work with you to modify the desktop flow.<br>•\tUser2 must be able to access and review the run history for the cloud flow.<br>•\tYou must grant User3 permissions to run but not modify the desktop flow.<br><br><br>ERPDataOperations flow -<br>City Power and light uses an enterprise resource planning (ERP) system. The ERP system does not have an API.<br><br>Each day the company receives an email that contains an attachment. The attachment lists orders from the company’s rail transportation partners. You must create an automation solution that reads the contents of the email and writes records to the ERP system. The solution must pass credential from a cloud flow to a desktop flow.<br><br><br>RailStatusUpdater -<br>City Power and Light actively monitors all products in transit. You must create a flow named RailStatusUpdater that manages communications with railways that transport the company’s products. RailStatusUpdater includes five desktop flow actions.<br><br>You must run the desktop flows in attended mode during testing. You must run the desktop flows in unattended mode after you deploy the solution. You must minimize administrative efforts.<br><br><br>Packaging -<br>All flow automations must be created in a solution. All required components to support the flows must be included in the solution.<br><br><br>Issues -<br><br><br>ProductionMonitor flow -<br>You create a cloud flow named ProductionMonitor which uses the Manually trigger a flow trigger. You plan to trigger ProductionMonitor from a cloud flow named ProdManager.<br><br>You add a Run a Child flow action in ProdManager to trigger ProductionMonitor. When you attempt to save ProdManager the following error message displays:<br>Request to XRM API failed with error: 'Message:Flow client error returned with status code \"Bad request\" and details \"(\"error\":<br>{\"code\":ChildFlowUnsupportedForinvokerConnections\", \"message\": The workflow with id 8d3bcde7-7e98-eb11-b1ac-000d3a32d53f\", named FlowA cannot be used as a child workflow because child workflows only support embedded connections. \"}}\"Code\" 0x80060467 InnerError.'<br><br><br>CapacityPlanning flow -<br>Developers within the company use cloud flows to access data from an on-premises capacity planning system.<br><br>You observe significant increases to the volume of traffic that the on-premises data gateway processes each day. You must minimize gateway failures.<br><br><br>DataCollector flow -<br>You have a desktop flow that interacts with a web form. The flow must write data to several fields on the form.<br><br>You are testing the flow. The flow fails when attempting to write data to any field on the web form.<br><br><br>RailStatusUpdater flow -<br>The RailStatusUpdater flow occasionally fails due to machine connection errors. You can usually get the desktop flow to complete by resubmitting the cloud flow run. You must automate the retry process to ensure that you do not need to manually resubmit the cloud flow when machine connection errors occur.<br><br><br>You need to resolve the issue reported with the RailStatusUpdater flow.<br><br>What are two possible ways to achieve the goal? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCall a separate child cloud flow to perform the desktop flow a second time.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a duplicate action for the desktop flow to run after the first desktop flow.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPut the desktop flow action into a Do until loop. Run until the desktop flow is successful.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a duplicate action for the desktop flow and configure the duplicate action to run if the first desktop flow action fails."
    ],
    "answer": "CD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-08T07:45:00.000Z",
        "voteCount": 1,
        "content": "How does the do until loop knows if the action was successful?"
      },
      {
        "date": "2024-02-08T11:54:00.000Z",
        "voteCount": 1,
        "content": "chatgpt: DC"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/129070-exam-pl-500-topic-2-question-21-discussion/",
    "body": "DRAG DROP<br> -<br><br>You are setting up a data loss prevention (DLP) policy for an environment. The default policy group is set to Non-business.<br><br>You must configure the following apps in the policy:<br><br>•\tAppA will be used for tracking business-sensitive data.<br>•\tAppB will be deployed in six months and must be automatically added to the published policy.<br>•\tAppC uses a custom connector. The connector uses personal data for testing. When testing is complete, the connector will connect to business-sensitive data.<br><br>You need to select the appropriate policy for each app.<br><br>Which policy should you use for each app? To answer, drag the appropriate policies to the correct apps. Each app may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image155.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image156.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-21T22:21:00.000Z",
        "voteCount": 1,
        "content": "I think that for AppC  it should not be \"Blocked\" because in that case the application could not be tested, as the custom connector is blocked. So, for me it should be \"Default group\" (When testing is completed, they must change the custom connector to \"Business\", because it would handle business sensitive information)"
      },
      {
        "date": "2024-04-19T00:38:00.000Z",
        "voteCount": 1,
        "content": "Business Data\nDefault group\nBlocked"
      },
      {
        "date": "2024-03-17T00:48:00.000Z",
        "voteCount": 1,
        "content": "Business data \nDefault group\nBlockes"
      },
      {
        "date": "2024-02-15T15:42:00.000Z",
        "voteCount": 2,
        "content": "AppC should be 'Move to business'"
      },
      {
        "date": "2024-01-25T00:50:00.000Z",
        "voteCount": 2,
        "content": "Business data\nDefault group\nBlocked"
      },
      {
        "date": "2023-12-20T02:12:00.000Z",
        "voteCount": 2,
        "content": "I am not sure about AppC"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/132113-exam-pl-500-topic-2-question-22-discussion/",
    "body": "DRAG DROP<br> -<br><br>You are designing a desktop automation solution.<br><br>You must ensure that the automation includes error handling. The solution requires the following logic:<br><br>•\tIf an action fails in the automation, the flow must be redirected to a different flow.<br>•\tIf a group of actions often fails, a specific procedure must occur.<br><br>You need to select the error handling methods to use for each requirement.<br><br>Which error handling method or configuration should you select? To answer, drag the appropriate error handling method or configuration to the correct requirements. Each error handling method or configuration may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image157.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image158.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-18T04:36:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2024-01-25T00:51:00.000Z",
        "voteCount": 4,
        "content": "Run a subflow.\nImplement block-level handling."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/129071-exam-pl-500-topic-2-question-23-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br><br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br><br>You are developing a solution for a medical practice. The solution must use an artificial intelligence (AI) model to evaluate medical X-ray images and detect broken bones.<br><br>You need to create the AI model for the solution.<br><br>Solution: Use Visual Studio to create the model.<br><br>Does the solution meet the goal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-01-25T00:51:00.000Z",
        "voteCount": 1,
        "content": "Answer: B. No"
      },
      {
        "date": "2023-12-20T02:14:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/129150-exam-pl-500-topic-2-question-24-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background -<br><br>Woodgrove Bank is a large, member-owned bank in the United States Woodgrove Bank provides financial products with low customer fees and direct customer service.<br><br>Woodgrove Bank has 177 branches across the United States with 5.000 branch staff and supervisors serving over 750,000 members. The primary languages used by most members include English and Spanish when interacting with customer service representatives. The Woodgrove Bank headquarters is in California and has 450 office workers. The office workers include financial advisors, customer service representatives, finance clerks, and IT personnel.<br><br>Current environment. Bank applications<br><br>•\tAn application named Banker Desktop. The branch employees use this desktop app to review business transactions and to perform core banking updates.<br>•\tAn application named Member Management System. This application is a custom customer relationship management (CRM) that integrates with other systems by using an API interface.<br>•\tAn application named Fraud Finder. This application is a mission-critical, fraud management application that runs on the employees' desktops. The bank has experienced challenges integrating the application with other systems and is expensive to support.<br>•\tSharePoint Online provides an employee intranet as well as a member document management system that includes polices, contracts, statements, and financial planning documents.<br>•\tMicrosoft Excel is used to perform calculations and run macros. Branch employees may have multiple Microsoft Excel workbooks open on their desktop simultaneously.<br><br>Current environment. Bank devices<br><br>•\tAll supervisors are provided with a mobile device that can be used to access company email and respond to approval requests.<br>•\tAll branch employees and supervisors are provided with a Windows workstation.<br><br>Requirements. New member enrollment<br><br>Woodgrove Bank requires new members to sign up online to start the onboarding process. The bank requires some manual steps to be performed during the onboarding process.<br><br>First step:<br>•\tMembers complete an online Woodgrove Bank document and email the PDF attachment to the bank’s shared mailbox for processing.<br>Second step:<br>•\tMembers are asked to provide secondary identification to their local branch, such as a utility bill, to validate their physical address.<br>•\tBranch staff scan the secondary identification in English or Spanish using optical character recognition (OCR) technology.<br>Third step:<br>•\tA branch supervisor approves the members’ application from their mobile device.<br>•\tOnly supervisors are authorized to complete application approvals.<br>Fourth step:<br>•\tData that is received from applications must be validated to ensure it adheres to the bank's naming standards.<br>The bank has the following requirements for the members’ data:<br>•\tNew members must be enrolled by using the document automation solution.<br>•\tMember data is subject to regulatory requirements and should not be used for non-business purposes.<br>•\tA desktop workflow is required to retrieve member information from the Member Management System on-demand or by using a cloud flow.<br><br><br>Requirements. Bank fees -<br><br>The process for calculating bank fees include:<br>•\tusing a shared Excel fee workbook with an embedded macro, and<br>•\tan attended desktop flow that is required to automate the fee workbook process. The flow should open an Excel workbook and calculate the members' fees based on the number of products.<br><br><br>Requirements. Fraud detection -<br><br>The bank has the following requirements to minimize fraud:<br>•\tBranch employees must use the Fraud Finder application during onboarding to validate a member’s identity with other third-party systems.<br>•\tBranch employees must be able to search for a member in the Fraud Finder application by using a member's full name or physical address.<br>•\tIf fraudulent activity is identified, a notification with member details must be sent to the internal fraud investigation team.<br><br><br>Requirements. Technical -<br><br>The bank has the following technical requirements:<br><br><br>Flows -<br>•\tThe Fraud Finder application uses a custom connector with Power Automate to run fraud checks.<br>•\tThe application approval process triggers a cloud flow, then starts an attended desktop flow on the branch employee s workstation and completes the approval.<br>•\tThe banker desktop flow runs using the default priority<br>•\tAn IT administrator is the co-owner of the banker desktop flow.<br>•\tThe IT department will be installing the required OCR language packs.<br>•\tThe Extract text with OCR action is used to import the members' secondary identification<br><br><br>Member Management System -<br>•\tA secure Azure function requires a subscription key to retrieve members’ information.<br>•\tProduction flows must connect to the Member Management System with a custom connector. The connector uses the Azure function to perform programmatic retrievals, creates, and updates.<br>•\tThe host URL has been added to the custom connector as a new pattern.<br>•\tA tenant-level Microsoft Power Platform data loss prevention (DLP) policy has been created to manage the production environment.<br>•\tA developer creates a desktop flow to automate data entry into a test instance of the Member Management System.<br>•\tA developer creates an on-demand attended desktop flow to connect to a data validation site and retrieve the most current information for a member.<br><br><br>Banker desktop application -<br>•\tA banker desktop flow is required to update the core banking system with other systems.<br>•\tWhen a transaction is complete, the branch employee submits the request by using a submit button.<br>•\tAfter submitting the request, an instant cloud flow calls an unattended desktop flow to complete the core banking update.<br>•\tThe banker desktop flow must be prioritized for all future transactions.<br><br><br>Deployment &amp; testing -<br>•\tDevelopment data must be confined to the development environment until the data is ready for user acceptance testing (UAT).<br>•\tThe production environment in SharePoint Online must connect to the development instance of the Member Management System.<br>•\tDevelopers must be able to deploy software every two weeks during a scheduled maintenance window.<br>•\tThe banker desktop flow must continue to run during any planned maintenance.<br>•\tThe fraud custom connector requires a policy operation named EscalateForFraud with a parameter that uses the members' full name in the request.<br><br><br>Scalability -<br>•\tThe bank requires a machine group to distribute the automation workload and to optimize productivity.<br>•\tThe IT administrator needs to silently register 20 new machines to Power Automate and then add them to the machine group.<br><br><br>Security -<br>•\tThe IT administrator uses a service principal account for machine connection.<br>•\tThe IT administrator has the Desktop Flow Machine Owner role.<br><br><br>Issues -<br><br>A branch staff member reports the document automation solution is not processing new members’ data and emails are not being sent for approvals.<br><br>An IT administrator reports that the banker desktop flow has become unresponsive from data that is queued in another flow.<br><br><br>Code -<br><br>A Power Automate developer created the following script for the Member Management System desktop flow:<br><br><img src=\"https://img.examtopics.com/pl-500/image148.png\"><br><br>You need to resolve the document processing issue.<br><br>Which two components should you verify? Each correct answer presents part of the solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe document processor flow is turned on.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe email importer flow is set to include attachments.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe document automation validator flow includes business logic.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe shared mailbox is set in the email importer flow.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BD",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-04-18T04:42:00.000Z",
        "voteCount": 3,
        "content": "Appear in PL-500 Exam! Took the exam on 13.April.2024"
      },
      {
        "date": "2024-03-26T06:49:00.000Z",
        "voteCount": 1,
        "content": "chatgpt &amp; gemini Google:  B,D"
      },
      {
        "date": "2024-02-08T13:53:00.000Z",
        "voteCount": 1,
        "content": "chatgpt: AB"
      },
      {
        "date": "2023-12-21T01:34:00.000Z",
        "voteCount": 1,
        "content": "Correct for me"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/132114-exam-pl-500-topic-2-question-25-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background -<br><br>Woodgrove Bank is a large, member-owned bank in the United States Woodgrove Bank provides financial products with low customer fees and direct customer service.<br><br>Woodgrove Bank has 177 branches across the United States with 5.000 branch staff and supervisors serving over 750,000 members. The primary languages used by most members include English and Spanish when interacting with customer service representatives. The Woodgrove Bank headquarters is in California and has 450 office workers. The office workers include financial advisors, customer service representatives, finance clerks, and IT personnel.<br><br>Current environment. Bank applications<br><br>•\tAn application named Banker Desktop. The branch employees use this desktop app to review business transactions and to perform core banking updates.<br>•\tAn application named Member Management System. This application is a custom customer relationship management (CRM) that integrates with other systems by using an API interface.<br>•\tAn application named Fraud Finder. This application is a mission-critical, fraud management application that runs on the employees' desktops. The bank has experienced challenges integrating the application with other systems and is expensive to support.<br>•\tSharePoint Online provides an employee intranet as well as a member document management system that includes polices, contracts, statements, and financial planning documents.<br>•\tMicrosoft Excel is used to perform calculations and run macros. Branch employees may have multiple Microsoft Excel workbooks open on their desktop simultaneously.<br><br>Current environment. Bank devices<br><br>•\tAll supervisors are provided with a mobile device that can be used to access company email and respond to approval requests.<br>•\tAll branch employees and supervisors are provided with a Windows workstation.<br><br>Requirements. New member enrollment<br><br>Woodgrove Bank requires new members to sign up online to start the onboarding process. The bank requires some manual steps to be performed during the onboarding process.<br><br>First step:<br>•\tMembers complete an online Woodgrove Bank document and email the PDF attachment to the bank’s shared mailbox for processing.<br>Second step:<br>•\tMembers are asked to provide secondary identification to their local branch, such as a utility bill, to validate their physical address.<br>•\tBranch staff scan the secondary identification in English or Spanish using optical character recognition (OCR) technology.<br>Third step:<br>•\tA branch supervisor approves the members’ application from their mobile device.<br>•\tOnly supervisors are authorized to complete application approvals.<br>Fourth step:<br>•\tData that is received from applications must be validated to ensure it adheres to the bank's naming standards.<br>The bank has the following requirements for the members’ data:<br>•\tNew members must be enrolled by using the document automation solution.<br>•\tMember data is subject to regulatory requirements and should not be used for non-business purposes.<br>•\tA desktop workflow is required to retrieve member information from the Member Management System on-demand or by using a cloud flow.<br><br><br>Requirements. Bank fees -<br><br>The process for calculating bank fees include:<br>•\tusing a shared Excel fee workbook with an embedded macro, and<br>•\tan attended desktop flow that is required to automate the fee workbook process. The flow should open an Excel workbook and calculate the members' fees based on the number of products.<br><br><br>Requirements. Fraud detection -<br><br>The bank has the following requirements to minimize fraud:<br>•\tBranch employees must use the Fraud Finder application during onboarding to validate a member’s identity with other third-party systems.<br>•\tBranch employees must be able to search for a member in the Fraud Finder application by using a member's full name or physical address.<br>•\tIf fraudulent activity is identified, a notification with member details must be sent to the internal fraud investigation team.<br><br><br>Requirements. Technical -<br><br>The bank has the following technical requirements:<br><br><br>Flows -<br>•\tThe Fraud Finder application uses a custom connector with Power Automate to run fraud checks.<br>•\tThe application approval process triggers a cloud flow, then starts an attended desktop flow on the branch employee s workstation and completes the approval.<br>•\tThe banker desktop flow runs using the default priority<br>•\tAn IT administrator is the co-owner of the banker desktop flow.<br>•\tThe IT department will be installing the required OCR language packs.<br>•\tThe Extract text with OCR action is used to import the members' secondary identification<br><br><br>Member Management System -<br>•\tA secure Azure function requires a subscription key to retrieve members’ information.<br>•\tProduction flows must connect to the Member Management System with a custom connector. The connector uses the Azure function to perform programmatic retrievals, creates, and updates.<br>•\tThe host URL has been added to the custom connector as a new pattern.<br>•\tA tenant-level Microsoft Power Platform data loss prevention (DLP) policy has been created to manage the production environment.<br>•\tA developer creates a desktop flow to automate data entry into a test instance of the Member Management System.<br>•\tA developer creates an on-demand attended desktop flow to connect to a data validation site and retrieve the most current information for a member.<br><br><br>Banker desktop application -<br>•\tA banker desktop flow is required to update the core banking system with other systems.<br>•\tWhen a transaction is complete, the branch employee submits the request by using a submit button.<br>•\tAfter submitting the request, an instant cloud flow calls an unattended desktop flow to complete the core banking update.<br>•\tThe banker desktop flow must be prioritized for all future transactions.<br><br><br>Deployment &amp; testing -<br>•\tDevelopment data must be confined to the development environment until the data is ready for user acceptance testing (UAT).<br>•\tThe production environment in SharePoint Online must connect to the development instance of the Member Management System.<br>•\tDevelopers must be able to deploy software every two weeks during a scheduled maintenance window.<br>•\tThe banker desktop flow must continue to run during any planned maintenance.<br>•\tThe fraud custom connector requires a policy operation named EscalateForFraud with a parameter that uses the members' full name in the request.<br><br><br>Scalability -<br>•\tThe bank requires a machine group to distribute the automation workload and to optimize productivity.<br>•\tThe IT administrator needs to silently register 20 new machines to Power Automate and then add them to the machine group.<br><br><br>Security -<br>•\tThe IT administrator uses a service principal account for machine connection.<br>•\tThe IT administrator has the Desktop Flow Machine Owner role.<br><br><br>Issues -<br><br>A branch staff member reports the document automation solution is not processing new members’ data and emails are not being sent for approvals.<br><br>An IT administrator reports that the banker desktop flow has become unresponsive from data that is queued in another flow.<br><br><br>Code -<br><br>A Power Automate developer created the following script for the Member Management System desktop flow:<br><br><img src=\"https://img.examtopics.com/pl-500/image148.png\"><br><br>You need to create the custom connector that will be used to retrieve member information.<br><br>Which authentication option should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAPI key",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo authentication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOAuth 2.0\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBasic",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWindows"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-20T01:04:00.000Z",
        "voteCount": 1,
        "content": "C - OAuth 2.0"
      },
      {
        "date": "2024-04-18T04:42:00.000Z",
        "voteCount": 1,
        "content": "Appear in PL-500 Exam! Took the exam on 13.April.2024"
      },
      {
        "date": "2024-02-29T09:04:00.000Z",
        "voteCount": 1,
        "content": "A -&gt; A secure Azure function requires a subscription key to retrieve members’ information"
      },
      {
        "date": "2024-02-29T06:46:00.000Z",
        "voteCount": 2,
        "content": "c obviously"
      },
      {
        "date": "2024-01-25T00:53:00.000Z",
        "voteCount": 2,
        "content": "C. OAuth 2.0"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/127194-exam-pl-500-topic-2-question-26-discussion/",
    "body": "DRAG DROP<br> -<br><br><br>Case study<br> -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study<br> -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background<br> -<br><br>Woodgrove Bank is a large, member-owned bank in the United States Woodgrove Bank provides financial products with low customer fees and direct customer service.<br><br>Woodgrove Bank has 177 branches across the United States with 5.000 branch staff and supervisors serving over 750,000 members. The primary languages used by most members include English and Spanish when interacting with customer service representatives. The Woodgrove Bank headquarters is in California and has 450 office workers. The office workers include financial advisors, customer service representatives, finance clerks, and IT personnel.<br><br>Current environment. Bank applications<br><br>•\tAn application named Banker Desktop. The branch employees use this desktop app to review business transactions and to perform core banking updates.<br>•\tAn application named Member Management System. This application is a custom customer relationship management (CRM) that integrates with other systems by using an API interface.<br>•\tAn application named Fraud Finder. This application is a mission-critical, fraud management application that runs on the employees' desktops. The bank has experienced challenges integrating the application with other systems and is expensive to support.<br>•\tSharePoint Online provides an employee intranet as well as a member document management system that includes polices, contracts, statements, and financial planning documents.<br>•\tMicrosoft Excel is used to perform calculations and run macros. Branch employees may have multiple Microsoft Excel workbooks open on their desktop simultaneously.<br><br>Current environment. Bank devices<br><br>•\tAll supervisors are provided with a mobile device that can be used to access company email and respond to approval requests.<br>•\tAll branch employees and supervisors are provided with a Windows workstation.<br><br>Requirements. New member enrollment<br><br>Woodgrove Bank requires new members to sign up online to start the onboarding process. The bank requires some manual steps to be performed during the onboarding process.<br><br>First step:<br>•\tMembers complete an online Woodgrove Bank document and email the PDF attachment to the bank’s shared mailbox for processing.<br>Second step:<br>•\tMembers are asked to provide secondary identification to their local branch, such as a utility bill, to validate their physical address.<br>•\tBranch staff scan the secondary identification in English or Spanish using optical character recognition (OCR) technology.<br>Third step:<br>•\tA branch supervisor approves the members’ application from their mobile device.<br>•\tOnly supervisors are authorized to complete application approvals.<br>Fourth step:<br>•\tData that is received from applications must be validated to ensure it adheres to the bank's naming standards.<br>The bank has the following requirements for the members’ data:<br>•\tNew members must be enrolled by using the document automation solution.<br>•\tMember data is subject to regulatory requirements and should not be used for non-business purposes.<br>•\tA desktop workflow is required to retrieve member information from the Member Management System on-demand or by using a cloud flow.<br><br><br>Requirements. Bank fees<br> -<br><br>The process for calculating bank fees include:<br>•\tusing a shared Excel fee workbook with an embedded macro, and<br>•\tan attended desktop flow that is required to automate the fee workbook process. The flow should open an Excel workbook and calculate the members' fees based on the number of products.<br><br><br>Requirements. Fraud detection<br> -<br><br>The bank has the following requirements to minimize fraud:<br>•\tBranch employees must use the Fraud Finder application during onboarding to validate a member’s identity with other third-party systems.<br>•\tBranch employees must be able to search for a member in the Fraud Finder application by using a member's full name or physical address.<br>•\tIf fraudulent activity is identified, a notification with member details must be sent to the internal fraud investigation team.<br><br><br>Requirements. Technical<br> -<br><br>The bank has the following technical requirements:<br><br><br>Flows<br> -<br>•\tThe Fraud Finder application uses a custom connector with Power Automate to run fraud checks.<br>•\tThe application approval process triggers a cloud flow, then starts an attended desktop flow on the branch employee s workstation and completes the approval.<br>•\tThe banker desktop flow runs using the default priority<br>•\tAn IT administrator is the co-owner of the banker desktop flow.<br>•\tThe IT department will be installing the required OCR language packs.<br>•\tThe Extract text with OCR action is used to import the members' secondary identification<br><br><br>Member Management System<br> -<br>•\tA secure Azure function requires a subscription key to retrieve members’ information.<br>•\tProduction flows must connect to the Member Management System with a custom connector. The connector uses the Azure function to perform programmatic retrievals, creates, and updates.<br>•\tThe host URL has been added to the custom connector as a new pattern.<br>•\tA tenant-level Microsoft Power Platform data loss prevention (DLP) policy has been created to manage the production environment.<br>•\tA developer creates a desktop flow to automate data entry into a test instance of the Member Management System.<br>•\tA developer creates an on-demand attended desktop flow to connect to a data validation site and retrieve the most current information for a member.<br><br><br>Banker desktop application<br> -<br>•\tA banker desktop flow is required to update the core banking system with other systems.<br>•\tWhen a transaction is complete, the branch employee submits the request by using a submit button.<br>•\tAfter submitting the request, an instant cloud flow calls an unattended desktop flow to complete the core banking update.<br>•\tThe banker desktop flow must be prioritized for all future transactions.<br><br><br>Deployment &amp; testing<br> -<br>•\tDevelopment data must be confined to the development environment until the data is ready for user acceptance testing (UAT).<br>•\tThe production environment in SharePoint Online must connect to the development instance of the Member Management System.<br>•\tDevelopers must be able to deploy software every two weeks during a scheduled maintenance window.<br>•\tThe banker desktop flow must continue to run during any planned maintenance.<br>•\tThe fraud custom connector requires a policy operation named EscalateForFraud with a parameter that uses the members' full name in the request.<br><br><br>Scalability<br> -<br>•\tThe bank requires a machine group to distribute the automation workload and to optimize<br> productivity.<br>•\tThe IT administrator needs to silently register 20 new machines to Power Automate and then add them to the machine group.<br><br><br>Security<br> -<br>•\tThe IT administrator uses a service principal account for machine connection.<br>•\tThe IT administrator has the Desktop Flow Machine Owner role.<br><br><br>Issues<br> -<br><br>A branch staff member reports the document automation solution is not processing new members’ data and emails are not being sent for approvals.<br><br>An IT administrator reports that the banker desktop flow has become unresponsive from data that is queued in another flow.<br><br><br>Code<br> -<br><br>A Power Automate developer created the following script for the Member Management System desktop flow:<br><br><img src=\"https://img.examtopics.com/pl-500/image148.png\"><br><br>You need to create the desktop flow to calculate a member’s fees.<br><br>Which four steps should you perform in sequence? To answer, move the appropriate steps from the list of steps to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/pl-500/image159.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image160.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-18T04:43:00.000Z",
        "voteCount": 2,
        "content": "Appear in PL-500 Exam! Took the exam on 13.April.2024"
      },
      {
        "date": "2024-02-08T14:01:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2023-11-25T10:38:00.000Z",
        "voteCount": 3,
        "content": "Correct \nhttps://learn.microsoft.com/en-us/power-automate/desktop-flows/how-to/run-macros-excel"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/132115-exam-pl-500-topic-2-question-27-discussion/",
    "body": "A company uses activity logging to measure performance for invoice processing.<br><br>Users report that the data analytics department takes too long to manually analyze data. The company requires an automatic process to speed up activity log analysis and provide insights.<br><br>You need to select the Microsoft Power Platform feature to meet the company requirement.<br><br>Which feature should you select?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower Automate for cloud",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProcess mining\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTask mining",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower Automate for desktop"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-20T01:04:00.000Z",
        "voteCount": 1,
        "content": "B - Correct"
      },
      {
        "date": "2024-04-18T04:43:00.000Z",
        "voteCount": 1,
        "content": "Appear in PL-500 Exam! Took the exam on 13.April.2024"
      },
      {
        "date": "2024-02-09T07:55:00.000Z",
        "voteCount": 2,
        "content": "Process mining is a method of using event logs to help visualize how processes are performed, and where the bottlenecks or inefficiencies are. This feature can help the company analyze their activity logs more efficiently and provide valuable insights to improve their invoice processing performance"
      },
      {
        "date": "2024-01-25T00:54:00.000Z",
        "voteCount": 2,
        "content": "B. Process mining"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/132116-exam-pl-500-topic-2-question-28-discussion/",
    "body": "HOTSPOT<br> -<br><br><br>Case study<br> -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study<br> -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background<br> -<br><br>Woodgrove Bank is a large, member-owned bank in the United States Woodgrove Bank provides financial products with low customer fees and direct customer service.<br><br>Woodgrove Bank has 177 branches across the United States with 5.000 branch staff and supervisors serving over 750,000 members. The primary languages used by most members include English and Spanish when interacting with customer service representatives. The Woodgrove Bank headquarters is in California and has 450 office workers. The office workers include financial advisors, customer service representatives, finance clerks, and IT personnel.<br><br>Current environment. Bank applications<br><br>•\tAn application named Banker Desktop. The branch employees use this desktop app to review business transactions and to perform core banking updates.<br>•\tAn application named Member Management System. This application is a custom customer relationship management (CRM) that integrates with other systems by using an API interface.<br>•\tAn application named Fraud Finder. This application is a mission-critical, fraud management application that runs on the employees' desktops. The bank has experienced challenges integrating the application with other systems and is expensive to support.<br>•\tSharePoint Online provides an employee intranet as well as a member document management system that includes polices, contracts, statements, and financial planning documents.<br>•\tMicrosoft Excel is used to perform calculations and run macros. Branch employees may have multiple Microsoft Excel workbooks open on their desktop simultaneously.<br><br>Current environment. Bank devices<br><br>•\tAll supervisors are provided with a mobile device that can be used to access company email and respond to approval requests.<br>•\tAll branch employees and supervisors are provided with a Windows workstation.<br><br>Requirements. New member enrollment<br><br>Woodgrove Bank requires new members to sign up online to start the onboarding process. The bank requires some manual steps to be performed during the onboarding process.<br><br>First step:<br>•\tMembers complete an online Woodgrove Bank document and email the PDF attachment to the bank’s shared mailbox for processing.<br>Second step:<br>•\tMembers are asked to provide secondary identification to their local branch, such as a utility bill, to validate their physical address.<br>•\tBranch staff scan the secondary identification in English or Spanish using optical character recognition (OCR) technology.<br>Third step:<br>•\tA branch supervisor approves the members’ application from their mobile device.<br>•\tOnly supervisors are authorized to complete application approvals.<br>Fourth step:<br>•\tData that is received from applications must be validated to ensure it adheres to the bank's naming standards.<br>The bank has the following requirements for the members’ data:<br>•\tNew members must be enrolled by using the document automation solution.<br>•\tMember data is subject to regulatory requirements and should not be used for non-business purposes.<br>•\tA desktop workflow is required to retrieve member information from the Member Management System on-demand or by using a cloud flow.<br><br><br>Requirements. Bank fees<br> -<br><br>The process for calculating bank fees include:<br>•\tusing a shared Excel fee workbook with an embedded macro, and<br>•\tan attended desktop flow that is required to automate the fee workbook process. The flow should open an Excel workbook and calculate the members' fees based on the number of products.<br><br><br>Requirements. Fraud detection<br> -<br><br>The bank has the following requirements to minimize fraud:<br>•\tBranch employees must use the Fraud Finder application during onboarding to validate a member’s identity with other third-party systems.<br>•\tBranch employees must be able to search for a member in the Fraud Finder application by using a member's full name or physical address.<br>•\tIf fraudulent activity is identified, a notification with member details must be sent to the internal fraud investigation team.<br><br><br>Requirements. Technical<br> -<br><br>The bank has the following technical requirements:<br><br><br>Flows<br> -<br>•\tThe Fraud Finder application uses a custom connector with Power Automate to run fraud checks.<br>•\tThe application approval process triggers a cloud flow, then starts an attended desktop flow on the branch employee s workstation and completes the approval.<br>•\tThe banker desktop flow runs using the default priority<br>•\tAn IT administrator is the co-owner of the banker desktop flow.<br>•\tThe IT department will be installing the required OCR language packs.<br>•\tThe Extract text with OCR action is used to import the members' secondary identification<br><br><br>Member Management System<br> -<br>•\tA secure Azure function requires a subscription key to retrieve members’ information.<br>•\tProduction flows must connect to the Member Management System with a custom connector. The connector uses the Azure function to perform programmatic retrievals, creates, and updates.<br>•\tThe host URL has been added to the custom connector as a new pattern.<br>•\tA tenant-level Microsoft Power Platform data loss prevention (DLP) policy has been created to manage the production environment.<br>•\tA developer creates a desktop flow to automate data entry into a test instance of the Member Management System.<br>•\tA developer creates an on-demand attended desktop flow to connect to a data validation site and retrieve the most current information for a member.<br><br><br>Banker desktop application<br> -<br>•\tA banker desktop flow is required to update the core banking system with other systems.<br>•\tWhen a transaction is complete, the branch employee submits the request by using a submit button.<br>•\tAfter submitting the request, an instant cloud flow calls an unattended desktop flow to complete the core banking update.<br>•\tThe banker desktop flow must be prioritized for all future transactions.<br><br><br>Deployment &amp; testing<br> -<br>•\tDevelopment data must be confined to the development environment until the data is ready for user acceptance testing (UAT).<br>•\tThe production environment in SharePoint Online must connect to the development instance of the Member Management System.<br>•\tDevelopers must be able to deploy software every two weeks during a scheduled maintenance window.<br>•\tThe banker desktop flow must continue to run during any planned maintenance.<br>•\tThe fraud custom connector requires a policy operation named EscalateForFraud with a parameter that uses the members' full name in the request.<br><br><br>Scalability<br> -<br>•\tThe bank requires a machine group to distribute the automation workload and to optimize<br> productivity.<br>•\tThe IT administrator needs to silently register 20 new machines to Power Automate and then add them to the machine group.<br><br><br>Security<br> -<br>•\tThe IT administrator uses a service principal account for machine connection.<br>•\tThe IT administrator has the Desktop Flow Machine Owner role.<br><br><br>Issues<br> -<br><br>A branch staff member reports the document automation solution is not processing new members’ data and emails are not being sent for approvals.<br><br>An IT administrator reports that the banker desktop flow has become unresponsive from data that is queued in another flow.<br><br><br>Code<br> -<br><br>A Power Automate developer created the following script for the Member Management System desktop flow:<br><br><img src=\"https://img.examtopics.com/pl-500/image148.png\"><br><br>You need to implement the scripting action for the Member Management System flow.<br><br>What should you use? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image161.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image162.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-21T19:35:00.000Z",
        "voteCount": 2,
        "content": "The variable produced is \"Result\". Check the default name when you use the \"Run JavaScript function on webpage\" action in PAD. Therefore, the answer is:\nRun JavaScript function on webpage\nAddress\nResult"
      },
      {
        "date": "2024-04-18T04:49:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer."
      },
      {
        "date": "2024-01-25T00:56:00.000Z",
        "voteCount": 1,
        "content": "Run JavaScript Function on webpage\nAddress\nJavascriptOutput"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/127537-exam-pl-500-topic-2-question-29-discussion/",
    "body": "DRAG DROP<br> -<br><br><br>Case study<br> -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study<br> -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background<br> -<br><br>Woodgrove Bank is a large, member-owned bank in the United States Woodgrove Bank provides financial products with low customer fees and direct customer service.<br><br>Woodgrove Bank has 177 branches across the United States with 5.000 branch staff and supervisors serving over 750,000 members. The primary languages used by most members include English and Spanish when interacting with customer service representatives. The Woodgrove Bank headquarters is in California and has 450 office workers. The office workers include financial advisors, customer service representatives, finance clerks, and IT personnel.<br><br>Current environment. Bank applications<br><br>•\tAn application named Banker Desktop. The branch employees use this desktop app to review business transactions and to perform core banking updates.<br>•\tAn application named Member Management System. This application is a custom customer relationship management (CRM) that integrates with other systems by using an API interface.<br>•\tAn application named Fraud Finder. This application is a mission-critical, fraud management application that runs on the employees' desktops. The bank has experienced challenges integrating the application with other systems and is expensive to support.<br>•\tSharePoint Online provides an employee intranet as well as a member document management system that includes polices, contracts, statements, and financial planning documents.<br>•\tMicrosoft Excel is used to perform calculations and run macros. Branch employees may have multiple Microsoft Excel workbooks open on their desktop simultaneously.<br><br>Current environment. Bank devices<br><br>•\tAll supervisors are provided with a mobile device that can be used to access company email and respond to approval requests.<br>•\tAll branch employees and supervisors are provided with a Windows workstation.<br><br>Requirements. New member enrollment<br><br>Woodgrove Bank requires new members to sign up online to start the onboarding process. The bank requires some manual steps to be performed during the onboarding process.<br><br>First step:<br>•\tMembers complete an online Woodgrove Bank document and email the PDF attachment to the bank’s shared mailbox for processing.<br>Second step:<br>•\tMembers are asked to provide secondary identification to their local branch, such as a utility bill, to validate their physical address.<br>•\tBranch staff scan the secondary identification in English or Spanish using optical character recognition (OCR) technology.<br>Third step:<br>•\tA branch supervisor approves the members’ application from their mobile device.<br>•\tOnly supervisors are authorized to complete application approvals.<br>Fourth step:<br>•\tData that is received from applications must be validated to ensure it adheres to the bank's naming standards.<br>The bank has the following requirements for the members’ data:<br>•\tNew members must be enrolled by using the document automation solution.<br>•\tMember data is subject to regulatory requirements and should not be used for non-business purposes.<br>•\tA desktop workflow is required to retrieve member information from the Member Management System on-demand or by using a cloud flow.<br><br><br>Requirements. Bank fees<br> -<br><br>The process for calculating bank fees include:<br>•\tusing a shared Excel fee workbook with an embedded macro, and<br>•\tan attended desktop flow that is required to automate the fee workbook process. The flow should open an Excel workbook and calculate the members' fees based on the number of products.<br><br><br>Requirements. Fraud detection<br> -<br><br>The bank has the following requirements to minimize fraud:<br>•\tBranch employees must use the Fraud Finder application during onboarding to validate a member’s identity with other third-party systems.<br>•\tBranch employees must be able to search for a member in the Fraud Finder application by using a member's full name or physical address.<br>•\tIf fraudulent activity is identified, a notification with member details must be sent to the internal fraud investigation team.<br><br><br>Requirements. Technical<br> -<br><br>The bank has the following technical requirements:<br><br><br>Flows<br> -<br>•\tThe Fraud Finder application uses a custom connector with Power Automate to run fraud checks.<br>•\tThe application approval process triggers a cloud flow, then starts an attended desktop flow on the branch employee s workstation and completes the approval.<br>•\tThe banker desktop flow runs using the default priority<br>•\tAn IT administrator is the co-owner of the banker desktop flow.<br>•\tThe IT department will be installing the required OCR language packs.<br>•\tThe Extract text with OCR action is used to import the members' secondary identification<br><br><br>Member Management System<br> -<br>•\tA secure Azure function requires a subscription key to retrieve members’ information.<br>•\tProduction flows must connect to the Member Management System with a custom connector. The connector uses the Azure function to perform programmatic retrievals, creates, and updates.<br>•\tThe host URL has been added to the custom connector as a new pattern.<br>•\tA tenant-level Microsoft Power Platform data loss prevention (DLP) policy has been created to manage the production environment.<br>•\tA developer creates a desktop flow to automate data entry into a test instance of the Member Management System.<br>•\tA developer creates an on-demand attended desktop flow to connect to a data validation site and retrieve the most current information for a member.<br><br><br>Banker desktop application<br> -<br>•\tA banker desktop flow is required to update the core banking system with other systems.<br>•\tWhen a transaction is complete, the branch employee submits the request by using a submit button.<br>•\tAfter submitting the request, an instant cloud flow calls an unattended desktop flow to complete the core banking update.<br>•\tThe banker desktop flow must be prioritized for all future transactions.<br><br><br>Deployment &amp; testing<br> -<br>•\tDevelopment data must be confined to the development environment until the data is ready for user acceptance testing (UAT).<br>•\tThe production environment in SharePoint Online must connect to the development instance of the Member Management System.<br>•\tDevelopers must be able to deploy software every two weeks during a scheduled maintenance window.<br>•\tThe banker desktop flow must continue to run during any planned maintenance.<br>•\tThe fraud custom connector requires a policy operation named EscalateForFraud with a parameter that uses the members' full name in the request.<br><br><br>Scalability<br> -<br>•\tThe bank requires a machine group to distribute the automation workload and to optimize<br> productivity.<br>•\tThe IT administrator needs to silently register 20 new machines to Power Automate and then add them to the machine group.<br><br><br>Security<br> -<br>•\tThe IT administrator uses a service principal account for machine connection.<br>•\tThe IT administrator has the Desktop Flow Machine Owner role.<br><br><br>Issues<br> -<br><br>A branch staff member reports the document automation solution is not processing new members’ data and emails are not being sent for approvals.<br><br>An IT administrator reports that the banker desktop flow has become unresponsive from data that is queued in another flow.<br><br><br>Code<br> -<br><br>A Power Automate developer created the following script for the Member Management System desktop flow:<br><br><img src=\"https://img.examtopics.com/pl-500/image148.png\"><br><br>You need to add a policy to the Fraud custom connector.<br><br>Which five actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/pl-500/image163.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image164.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-07T12:16:00.000Z",
        "voteCount": 1,
        "content": "I had this case study on my test 6/6/24, but NOT this question!"
      },
      {
        "date": "2024-04-18T04:50:00.000Z",
        "voteCount": 1,
        "content": "Appear in PL-500 Exam! Took the exam on 13.April.2024"
      },
      {
        "date": "2023-11-30T07:08:00.000Z",
        "voteCount": 4,
        "content": "This is correct, when setting policy details, you must select a template(mandatory) then the operation (if applicable) then the parameter template(mandatory). Having this knowledge, you should be able to infer the correct steps."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/129151-exam-pl-500-topic-2-question-30-discussion/",
    "body": "You are developing a Power Automate desktop flow to process new employee documentation. The flow has a variable for confidential bank account numbers.<br><br>Users are able to view bank account numbers while the flow is tested.<br><br>You need to ensure the bank account numbers are not visible in the flow.<br><br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTurn on Secure Inputs in a cloud flow.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMark the variable as sensitive.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange the external name.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMark variables produced as disabled."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-07T12:17:00.000Z",
        "voteCount": 1,
        "content": "This was on my test - 6/6/2023."
      },
      {
        "date": "2024-01-25T00:56:00.000Z",
        "voteCount": 1,
        "content": "B. Mark the variable as sensitive."
      },
      {
        "date": "2023-12-29T11:54:00.000Z",
        "voteCount": 1,
        "content": "chatgpt: B"
      },
      {
        "date": "2023-12-21T01:45:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/136823-exam-pl-500-topic-2-question-31-discussion/",
    "body": "DRAG DROP<br> -<br><br>A company is using SAP in a data center. The SAP environment uses the default configuration.<br><br>The company plans to automate the creation of vendors in SAP after data is approved in a SharePoint list.<br><br>You need to recommend a solution for the automation.<br><br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br>NOTE: More than one order of answer choices is correct. You will receive credit for any of the correct orders you select.<br><br><img src=\"https://img.examtopics.com/pl-500/image165.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image166.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-28T02:27:00.000Z",
        "voteCount": 5,
        "content": "If using the SAP ERP connector, a pre-req is a the on-premises data gateway - https://learn.microsoft.com/en-us/connectors/saperp/\n\nTherefore I 'd suggest the answer is - \n\n1. Configure an on-premises data gateway\n2. Configure an SAP ERP connection\n3. Create an automated cloud flow\n4. Add a Call SAP function (v2) action\n\nAdditionally, you can't record steps in a Cloud flow so I'm ruling that out. Recordings occur in Desktop flows only."
      },
      {
        "date": "2024-05-10T07:36:00.000Z",
        "voteCount": 3,
        "content": "1. Configure an on-premises data gateway\n2. Configure an SAP ERP connection\n3. Create an automated cloud flow\n4. Add a Call SAP function (v2) action"
      },
      {
        "date": "2024-04-18T05:03:00.000Z",
        "voteCount": 2,
        "content": "I think\nB. Create an automated cloud flow\nD. Configure an SAP ERP connection\nC. Add a Call SAP function (v2) action\nG. Record steps in SAP"
      },
      {
        "date": "2024-04-18T04:53:00.000Z",
        "voteCount": 2,
        "content": "Appear in PL-500 Exam! Took the exam on 13.April.2024"
      },
      {
        "date": "2024-03-21T05:01:00.000Z",
        "voteCount": 1,
        "content": "D, B, C, G"
      },
      {
        "date": "2024-03-21T05:06:00.000Z",
        "voteCount": 1,
        "content": "Sorry, i think B,C,D,G"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140695-exam-pl-500-topic-2-question-32-discussion/",
    "body": "DRAG DROP<br> -<br><br>You design an attended Power Automate desktop flow that updates orders in an order enterprise resource planning (ERP) system.<br><br>A warehouse supervisor enters the order status and fulfilment date when an order is fulfilled.<br><br>The flow must be installed on a desktop computer in the warehouse and triggered by using a shortcut.<br><br>You need to configure the flow to deploy and run.<br><br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/pl-500/image185.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image186.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-15T04:45:00.000Z",
        "voteCount": 2,
        "content": "correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/138951-exam-pl-500-topic-2-question-33-discussion/",
    "body": "DRAG DROP<br> -<br><br>You are setting up a data loss prevention (DLP) policy for an environment. The default policy group is set to Non-business.<br><br>You must configure the following connectors in the policy:<br><br>•\tConnectorA will be used for tracking business-sensitive data.<br>•\tConnectorB will be deployed in six months and must be automatically added to the published policy.<br>•\tConnectorC uses a custom connector. The connector uses personal data for testing. When testing is complete, the connector will connect to business-sensitive data.<br><br>You need to select the appropriate policy for each connector.<br><br>Which policy should you use for each connector? To answer, drag the appropriate policies to the correct connectors. Each policy may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image187.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image188.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-18T05:08:00.000Z",
        "voteCount": 1,
        "content": "A. Business\nB. Default\nC. Blocked (?) Since it's personal data"
      },
      {
        "date": "2024-04-17T02:43:00.000Z",
        "voteCount": 1,
        "content": "A. Business\nB. Default\nC. At first it will go to Default Group but later we will want ot have it in Business group, then, What is the answer?"
      },
      {
        "date": "2024-04-28T02:50:00.000Z",
        "voteCount": 1,
        "content": "I'm tempted to say C is Default, which is suitable for personal data. The policy would need changing though once testing is over."
      },
      {
        "date": "2024-05-21T22:33:00.000Z",
        "voteCount": 1,
        "content": "Correct. The answer is \"Default\" as the question is talking about the present."
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/138952-exam-pl-500-topic-2-question-34-discussion/",
    "body": "You are implementing a Power Automate cloud flow that submits invoice information using a custom connector action.<br><br>You observe that the custom connector action sometimes results in an error. You want the system to send you an email to alert you when the custom connector action throws an error.<br><br>You need to make sure the send email action is triggered only when the custom connector action fails<br><br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a terminate action and set the status to Cancelled.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a terminate action, set the status to Failed, and set an error code.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet he Configure run after action to has timed out.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Configure run after action to has failed.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Configure run after action to is skipped."
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-20T01:11:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2024-04-18T05:24:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2024-04-17T02:48:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/138954-exam-pl-500-topic-2-question-35-discussion/",
    "body": "A list of accounts pending payment is generated from SAP as a Microsoft Excel file on a local machine.<br><br>Data must be converted into JSON format for a bulk upload to a customer relationship management (CRM) system.<br><br>You need to recommend a solution.<br><br>Which solution should you recommend?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun Excel macro action.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet selected cell range from Excel worksheet action.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun VBScript action.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun script action.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRead from Excel worksheet action.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "E",
    "answerDescription": "",
    "votes": [
      {
        "answer": "E",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-20T01:12:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      },
      {
        "date": "2024-04-28T03:25:00.000Z",
        "voteCount": 3,
        "content": "This article makes me think it could be D. Run script action - \n\nhttps://learn.microsoft.com/en-us/office/dev/scripts/develop/use-json"
      },
      {
        "date": "2024-04-17T02:53:00.000Z",
        "voteCount": 2,
        "content": "I would recommend option A. Run Excel macro action.\n\nExcel macros can be used to automate repetitive tasks and complex workflows in Excel. In this case, you could create a macro that reads the data from the Excel file, converts it into JSON format, and then saves it. This JSON file can then be used for the bulk upload to the CRM system"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/138956-exam-pl-500-topic-2-question-36-discussion/",
    "body": "You are developing a Power Automate desktop flow to process thousands of product data sheets. The data sheets reside in an older desktop application. Each data sheet is the same format and contains a product image and description field.<br><br>You need to extract the product image and description from each product sheet and add those elements to a table in Microsoft Dataverse.<br><br>Which two Power Automate Desktop automation capabilities should you use? Each correct answer presents complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange the focus to a text field in a window.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWait for window content to appear or clear from a window.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGet UI element details in a window.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCapture an image.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExtract text by using optical character recognition (OCR)."
    ],
    "answer": "DE",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-18T05:34:00.000Z",
        "voteCount": 1,
        "content": "D and E\nSince the description field is in an image. Need OCR to extract"
      },
      {
        "date": "2024-04-17T02:59:00.000Z",
        "voteCount": 1,
        "content": "B and C\nor\nC and D\n\nI am not sure, can anyone explain?"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/139159-exam-pl-500-topic-2-question-37-discussion/",
    "body": "DRAG DROP<br> -<br><br>You need to create several desktop flow processes on the same application.<br><br>Each process uses different sign-in data.<br><br>You need to create and use a standalone sign-in process.<br><br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br><br><img src=\"https://img.examtopics.com/pl-500/image189.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image190.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-15T04:53:00.000Z",
        "voteCount": 1,
        "content": "correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/139163-exam-pl-500-topic-2-question-38-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background -<br><br>First Up Consultants is a professional services organization headquartered in Europe, with offices in North America. The company supports small- to medium-sized and enterprise organizations with a range of information technology, project management, change management, and finance management consultancy needs. The organization employs 500 full-time consultants and engages with over 1,000 external contractors to support the delivery of its various projects.<br><br><br>Current environment -<br><br>The company has been using Microsoft Power Platform for several years and currently has the following implemented:<br><br>•\tA model-driven app named Project Planning Application that is used by the project management office (PMO) team within the company to plan, schedule and collate information for each client project. The application supports the following functionality areas: o\tStorage for project-level information, such as start date, end date and client data. o\tA series of inputs to capture detailed information for statements of work as part of a standard document format. This information is manually entered by the PMO team. o\tInformation regarding internal and external consultants is stored within a custom table called Resources. o\tInformation within the Resources table regarding full-time consultants is typically populated manually by the PMO team. For external consultants, the company regularly attends industry events and collates business cards for potential new employees or external contractors. Information regarding these individuals is then manually entered into the application. The PMO team then asks suitable candidates to complete an application form in Microsoft Word standard format and upload it via a secure URL. Again, the PMO team then manually enters the data into Project Planning Application.<br>•\tA canvas app named Time Entry Application is used by the employees and external contractors to capture the time worked on projects. The application has been configured with the following defined controls: o\tdpStartDate: A date picker control to indicate the start date of the time entry. o\tdpEndDate: A date picker control to indicate the end date of the time entry. o\tinptDescription: A control used to indicate the type of activity and project worked on.<br>•\tA mobile app stores the current user's email address as part of a variable called varUserName.<br><br>The company uses Microsoft SharePoint on premises to store all sensitive documents. Company policy mandates that all client-related documents are stored within this environment only.<br><br>The company uses SAP as its back-end accounting system. The company maintains separate SAP systems in each legal jurisdiction where it is based. The system is relied upon for the following critical business processes:<br>•\tExternal contractors working on a project send their invoices to a dedicated mailbox that is monitored by the company's accounting team. The accounting team must then manually process these invoices into SAP at the end of each month. Due to the number of external contractors, hundreds of invoices must be processes monthly.<br>•\tBasic API access for the SAP system is provided via a mixture of native application APIs and a middleware Simple Object Access Protocol (SOAP) API hosted on premises. The middleware API supports the ability to post time entries against the relevant projects in any SAP system by specifying the system and client ID as a query parameter in the URL. The middleware API was developed several years ago, and the source code is no longer available. Data is returned in XML format, which can then be analyzed further.<br>•\tWhen a project enters the closure phase, members of the PMO team need to navigate to SAP, enter some details, and then capture information from a PDF that is generated and opened on the screen, such as the final settlement amount. This information is then manually entered into Project Planning Application.<br><br>The company maintains a separate system containing detailed profile information regarding internal employees. The PMO team currently manually enters information from this system into the Resources table. Developers in the company have created a modern REST API for this system, which is actively maintained. The system contains highly sensitive personal information (PI) regarding each employee.<br><br>The company has several on-premises Windows environments that it has identified as suitable for usage because they exist within the same physical network as SAP and the middleware API. These environments must be patched regularly, and all activities targeting these environments must be automated.<br><br><br>Project Planning Application -<br><br>•\tRather than manually populating the statement of work information, users should place it in a SharePoint folder for this information to be extracted and mapped to the correct inputs.<br>•\tA new automation is required to integrate with the profile information system. Because the company plans to consume this data in several ways, a streamlined mechanism for working with the API is required to improve reusability.<br>•\tAn automation is required to handle the project closure steps in SAP and to store the relevant information from SAP into the app.<br>•\tOnce a new candidate uploads a completed application form, information from the form should be copied automatically into Project Planning Application.<br><br><br>Time Entry Application -<br><br>•\tTime Entry Application needs to be extended to integrate alongside SAP, ensuring postings for time entries are processed successfully. When a time entry is submitted, the entry should be posted automatically to SAP.<br>•\tTime entries must always be submitted with relevant text that indicates the type of activity and project worked on.<br>•\tThe automation should be able to detect and handle any errors that occur when posting individual time entries.<br><br><br>Invoice Processing -<br><br>•\tInvoices sent to the account’s mailbox must be processed automatically and created as invoices within SAP.<br><br><br>General -<br><br>•\tDevelopment efforts should be avoided or mitigated when there is native functionality already available.<br>•\tReusability of components is desired to assist citizen developers in creating any solutions in future.<br>•\tAll automation activities should run without disruption during an outage or a patching cycle.<br>•\tUse of username and password credentials should be avoided.<br>•\tAutomations should not rely on human intervention to execute.<br>•\tUse of public cloud file services should be restricted.<br>•\tWhere possible, JSON should be the preferred format when transferring data.<br><br><br>Issues -<br><br>•\tUsers within the PMO team report that it takes many hours to put the data from each business card into the system.<br>•\tYou create the automation to process the time entries, called Submit Time Entry, and add it to the application. Users report issues with the formula used to connect to the automation.<br>•\tDuring a monthly patch cycle, IT support team members cannot identify the correct steps to patch the machine without disrupting any automation.<br>•\tWhile performing an audit of the new solution during the test phase, the company's information security team identifies that users can freely save confidential documents to OneDrive for Business.<br>•\tWhen creating the automation for the project closure process, you discover that some of the required information needs to be exported via the SAP GUI and extracted from a comma-separated value (CSV) file.<br>•\tWhen building the automation for the profile information system, you identify that all requests into the API will fail unless the following HTTP header value is specified: o\tAccept: application/json<br><br><br>You need to determine the formula to use for the time entry posting automation.<br><br>Which formula should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t‘Submit Time Entry’.Run(dpStartDate.InputTextPlaceholder, dpEndDate.InputTextPlaceholder, inptDescription.Text)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t‘Submit Time Entry’.Run(dpStartDate.SelectedDate, dpEndDate.SelectedDate, inptDescription.Text)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t‘Submit Time Entry’.Run(dpStartDate.InputTextPlaceholder, dpEndDate.InputTextPlaceholder, varUserName)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t‘Submit Time Entry’.Run(dpStartDate.SelectedDate, dpEndDate.SelectedDate, varUserName)"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-05-15T05:02:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2024-04-19T03:03:00.000Z",
        "voteCount": 2,
        "content": "Appear in PL-500 Exam! Took the exam on 13.April.2024"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140697-exam-pl-500-topic-2-question-39-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background -<br><br>First Up Consultants is a professional services organization headquartered in Europe, with offices in North America. The company supports small- to medium-sized and enterprise organizations with a range of information technology, project management, change management, and finance management consultancy needs. The organization employs 500 full-time consultants and engages with over 1,000 external contractors to support the delivery of its various projects.<br><br><br>Current environment -<br><br>The company has been using Microsoft Power Platform for several years and currently has the following implemented:<br><br>•\tA model-driven app named Project Planning Application that is used by the project management office (PMO) team within the company to plan, schedule and collate information for each client project. The application supports the following functionality areas: o\tStorage for project-level information, such as start date, end date and client data. o\tA series of inputs to capture detailed information for statements of work as part of a standard document format. This information is manually entered by the PMO team. o\tInformation regarding internal and external consultants is stored within a custom table called Resources. o\tInformation within the Resources table regarding full-time consultants is typically populated manually by the PMO team. For external consultants, the company regularly attends industry events and collates business cards for potential new employees or external contractors. Information regarding these individuals is then manually entered into the application. The PMO team then asks suitable candidates to complete an application form in Microsoft Word standard format and upload it via a secure URL. Again, the PMO team then manually enters the data into Project Planning Application.<br>•\tA canvas app named Time Entry Application is used by the employees and external contractors to capture the time worked on projects. The application has been configured with the following defined controls: o\tdpStartDate: A date picker control to indicate the start date of the time entry. o\tdpEndDate: A date picker control to indicate the end date of the time entry. o\tinptDescription: A control used to indicate the type of activity and project worked on.<br>•\tA mobile app stores the current user's email address as part of a variable called varUserName.<br><br>The company uses Microsoft SharePoint on premises to store all sensitive documents. Company policy mandates that all client-related documents are stored within this environment only.<br><br>The company uses SAP as its back-end accounting system. The company maintains separate SAP systems in each legal jurisdiction where it is based. The system is relied upon for the following critical business processes:<br>•\tExternal contractors working on a project send their invoices to a dedicated mailbox that is monitored by the company's accounting team. The accounting team must then manually process these invoices into SAP at the end of each month. Due to the number of external contractors, hundreds of invoices must be processes monthly.<br>•\tBasic API access for the SAP system is provided via a mixture of native application APIs and a middleware Simple Object Access Protocol (SOAP) API hosted on premises. The middleware API supports the ability to post time entries against the relevant projects in any SAP system by specifying the system and client ID as a query parameter in the URL. The middleware API was developed several years ago, and the source code is no longer available. Data is returned in XML format, which can then be analyzed further.<br>•\tWhen a project enters the closure phase, members of the PMO team need to navigate to SAP, enter some details, and then capture information from a PDF that is generated and opened on the screen, such as the final settlement amount. This information is then manually entered into Project Planning Application.<br><br>The company maintains a separate system containing detailed profile information regarding internal employees. The PMO team currently manually enters information from this system into the Resources table. Developers in the company have created a modern REST API for this system, which is actively maintained. The system contains highly sensitive personal information (PI) regarding each employee.<br><br>The company has several on-premises Windows environments that it has identified as suitable for usage because they exist within the same physical network as SAP and the middleware API. These environments must be patched regularly, and all activities targeting these environments must be automated.<br><br><br>Project Planning Application -<br><br>•\tRather than manually populating the statement of work information, users should place it in a SharePoint folder for this information to be extracted and mapped to the correct inputs.<br>•\tA new automation is required to integrate with the profile information system. Because the company plans to consume this data in several ways, a streamlined mechanism for working with the API is required to improve reusability.<br>•\tAn automation is required to handle the project closure steps in SAP and to store the relevant information from SAP into the app.<br>•\tOnce a new candidate uploads a completed application form, information from the form should be copied automatically into Project Planning Application.<br><br><br>Time Entry Application -<br><br>•\tTime Entry Application needs to be extended to integrate alongside SAP, ensuring postings for time entries are processed successfully. When a time entry is submitted, the entry should be posted automatically to SAP.<br>•\tTime entries must always be submitted with relevant text that indicates the type of activity and project worked on.<br>•\tThe automation should be able to detect and handle any errors that occur when posting individual time entries.<br><br><br>Invoice Processing -<br><br>•\tInvoices sent to the account’s mailbox must be processed automatically and created as invoices within SAP.<br><br><br>General -<br><br>•\tDevelopment efforts should be avoided or mitigated when there is native functionality already available.<br>•\tReusability of components is desired to assist citizen developers in creating any solutions in future.<br>•\tAll automation activities should run without disruption during an outage or a patching cycle.<br>•\tUse of username and password credentials should be avoided.<br>•\tAutomations should not rely on human intervention to execute.<br>•\tUse of public cloud file services should be restricted.<br>•\tWhere possible, JSON should be the preferred format when transferring data.<br><br><br>Issues -<br><br>•\tUsers within the PMO team report that it takes many hours to put the data from each business card into the system.<br>•\tYou create the automation to process the time entries, called Submit Time Entry, and add it to the application. Users report issues with the formula used to connect to the automation.<br>•\tDuring a monthly patch cycle, IT support team members cannot identify the correct steps to patch the machine without disrupting any automation.<br>•\tWhile performing an audit of the new solution during the test phase, the company's information security team identifies that users can freely save confidential documents to OneDrive for Business.<br>•\tWhen creating the automation for the project closure process, you discover that some of the required information needs to be exported via the SAP GUI and extracted from a comma-separated value (CSV) file.<br>•\tWhen building the automation for the profile information system, you identify that all requests into the API will fail unless the following HTTP header value is specified: o\tAccept: application/json<br><br><br>You need to resolve the issue with the profile information system automation.<br><br>What should you do?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet HTTP host URL.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet query string parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDefine a policy.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDefine a data loss prevention policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate custom code."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-25T04:11:00.000Z",
        "voteCount": 2,
        "content": "I think C"
      },
      {
        "date": "2024-05-15T05:03:00.000Z",
        "voteCount": 1,
        "content": "correct"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140698-exam-pl-500-topic-2-question-40-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background -<br><br>First Up Consultants is a professional services organization headquartered in Europe, with offices in North America. The company supports small- to medium-sized and enterprise organizations with a range of information technology, project management, change management, and finance management consultancy needs. The organization employs 500 full-time consultants and engages with over 1,000 external contractors to support the delivery of its various projects.<br><br><br>Current environment -<br><br>The company has been using Microsoft Power Platform for several years and currently has the following implemented:<br><br>•\tA model-driven app named Project Planning Application that is used by the project management office (PMO) team within the company to plan, schedule and collate information for each client project. The application supports the following functionality areas: o\tStorage for project-level information, such as start date, end date and client data. o\tA series of inputs to capture detailed information for statements of work as part of a standard document format. This information is manually entered by the PMO team. o\tInformation regarding internal and external consultants is stored within a custom table called Resources. o\tInformation within the Resources table regarding full-time consultants is typically populated manually by the PMO team. For external consultants, the company regularly attends industry events and collates business cards for potential new employees or external contractors. Information regarding these individuals is then manually entered into the application. The PMO team then asks suitable candidates to complete an application form in Microsoft Word standard format and upload it via a secure URL. Again, the PMO team then manually enters the data into Project Planning Application.<br>•\tA canvas app named Time Entry Application is used by the employees and external contractors to capture the time worked on projects. The application has been configured with the following defined controls: o\tdpStartDate: A date picker control to indicate the start date of the time entry. o\tdpEndDate: A date picker control to indicate the end date of the time entry. o\tinptDescription: A control used to indicate the type of activity and project worked on.<br>•\tA mobile app stores the current user's email address as part of a variable called varUserName.<br><br>The company uses Microsoft SharePoint on premises to store all sensitive documents. Company policy mandates that all client-related documents are stored within this environment only.<br><br>The company uses SAP as its back-end accounting system. The company maintains separate SAP systems in each legal jurisdiction where it is based. The system is relied upon for the following critical business processes:<br>•\tExternal contractors working on a project send their invoices to a dedicated mailbox that is monitored by the company's accounting team. The accounting team must then manually process these invoices into SAP at the end of each month. Due to the number of external contractors, hundreds of invoices must be processes monthly.<br>•\tBasic API access for the SAP system is provided via a mixture of native application APIs and a middleware Simple Object Access Protocol (SOAP) API hosted on premises. The middleware API supports the ability to post time entries against the relevant projects in any SAP system by specifying the system and client ID as a query parameter in the URL. The middleware API was developed several years ago, and the source code is no longer available. Data is returned in XML format, which can then be analyzed further.<br>•\tWhen a project enters the closure phase, members of the PMO team need to navigate to SAP, enter some details, and then capture information from a PDF that is generated and opened on the screen, such as the final settlement amount. This information is then manually entered into Project Planning Application.<br><br>The company maintains a separate system containing detailed profile information regarding internal employees. The PMO team currently manually enters information from this system into the Resources table. Developers in the company have created a modern REST API for this system, which is actively maintained. The system contains highly sensitive personal information (PI) regarding each employee.<br><br>The company has several on-premises Windows environments that it has identified as suitable for usage because they exist within the same physical network as SAP and the middleware API. These environments must be patched regularly, and all activities targeting these environments must be automated.<br><br><br>Project Planning Application -<br><br>•\tRather than manually populating the statement of work information, users should place it in a SharePoint folder for this information to be extracted and mapped to the correct inputs.<br>•\tA new automation is required to integrate with the profile information system. Because the company plans to consume this data in several ways, a streamlined mechanism for working with the API is required to improve reusability.<br>•\tAn automation is required to handle the project closure steps in SAP and to store the relevant information from SAP into the app.<br>•\tOnce a new candidate uploads a completed application form, information from the form should be copied automatically into Project Planning Application.<br><br><br>Time Entry Application -<br><br>•\tTime Entry Application needs to be extended to integrate alongside SAP, ensuring postings for time entries are processed successfully. When a time entry is submitted, the entry should be posted automatically to SAP.<br>•\tTime entries must always be submitted with relevant text that indicates the type of activity and project worked on.<br>•\tThe automation should be able to detect and handle any errors that occur when posting individual time entries.<br><br><br>Invoice Processing -<br><br>•\tInvoices sent to the account’s mailbox must be processed automatically and created as invoices within SAP.<br><br><br>General -<br><br>•\tDevelopment efforts should be avoided or mitigated when there is native functionality already available.<br>•\tReusability of components is desired to assist citizen developers in creating any solutions in future.<br>•\tAll automation activities should run without disruption during an outage or a patching cycle.<br>•\tUse of username and password credentials should be avoided.<br>•\tAutomations should not rely on human intervention to execute.<br>•\tUse of public cloud file services should be restricted.<br>•\tWhere possible, JSON should be the preferred format when transferring data.<br><br><br>Issues -<br><br>•\tUsers within the PMO team report that it takes many hours to put the data from each business card into the system.<br>•\tYou create the automation to process the time entries, called Submit Time Entry, and add it to the application. Users report issues with the formula used to connect to the automation.<br>•\tDuring a monthly patch cycle, IT support team members cannot identify the correct steps to patch the machine without disrupting any automation.<br>•\tWhile performing an audit of the new solution during the test phase, the company's information security team identifies that users can freely save confidential documents to OneDrive for Business.<br>•\tWhen creating the automation for the project closure process, you discover that some of the required information needs to be exported via the SAP GUI and extracted from a comma-separated value (CSV) file.<br>•\tWhen building the automation for the profile information system, you identify that all requests into the API will fail unless the following HTTP header value is specified: o\tAccept: application/json<br><br><br>You need to identify the components required to deploy the automation for Project Planning Application.<br><br>Which three components should you identify? Each correct answer presents part of the solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tApplication ID\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClient secret\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUsername",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTenant ID\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPassword"
    ],
    "answer": "ACE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "ABD",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-09-17T00:39:00.000Z",
        "voteCount": 1,
        "content": "A. Application ID\nThis is the unique identifier for the application registered in Azure AD.\n\nB. Client secret\nThis is a secret string that the application uses to prove its identity when requesting a token.\n\nD. Tenant ID\nThis is the unique identifier of the Azure AD tenant where the application is registered."
      },
      {
        "date": "2024-07-17T05:39:00.000Z",
        "voteCount": 1,
        "content": "answer should be: Application ID, Client Secret, Tenant ID."
      },
      {
        "date": "2024-05-15T05:06:00.000Z",
        "voteCount": 3,
        "content": "A, B, D"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  },
  {
    "topic": 2,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140699-exam-pl-500-topic-2-question-41-discussion/",
    "body": "DRAG DROP<br> -<br><br><br>Case study<br> -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study<br> -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>Background<br> -<br><br>First Up Consultants is a professional services organization headquartered in Europe, with offices in North America. The company supports small- to medium-sized and enterprise organizations with a range of information technology, project management, change management, and finance management consultancy needs. The organization employs 500 full-time consultants and engages with over 1,000 external contractors to support the delivery of its various projects.<br><br><br>Current environment<br> -<br><br>The company has been using Microsoft Power Platform for several years and currently has the following implemented:<br><br>•\tA model-driven app named Project Planning Application that is used by the project management office (PMO) team within the company to plan, schedule and collate information for each client project. The application supports the following functionality areas:<br> o\tStorage for project-level information, such as start date, end date and client data.<br> o\tA series of inputs to capture detailed information for statements of work as part of a standard document format. This information is manually entered by the PMO team.<br> o\tInformation regarding internal and external consultants is stored within a custom table called Resources.<br> o\tInformation within the Resources table regarding full-time consultants is typically populated manually by the PMO team. For external consultants, the company regularly attends industry events and collates business cards for potential new employees or external contractors. Information regarding these individuals is then manually entered into the application. The PMO team then asks suitable candidates to complete an application form in Microsoft Word standard format and upload it via a secure URL. Again, the PMO team then manually enters the data into Project Planning Application.<br>•\tA canvas app named Time Entry Application is used by the employees and external contractors to capture the time worked on projects. The application has been configured with the following defined controls:<br> o\tdpStartDate: A date picker control to indicate the start date of the time entry.<br> o\tdpEndDate: A date picker control to indicate the end date of the time entry.<br> o\tinptDescription: A control used to indicate the type of activity and project worked on.<br>•\tA mobile app stores the current user's email address as part of a variable called varUserName.<br><br>The company uses Microsoft SharePoint on premises to store all sensitive documents. Company policy mandates that all client-related documents are stored within this environment only.<br><br>The company uses SAP as its back-end accounting system. The company maintains separate SAP systems in each legal jurisdiction where it is based. The system is relied upon for the following critical business processes:<br>•\tExternal contractors working on a project send their invoices to a dedicated mailbox that is monitored by the company's accounting team. The accounting team must then manually process these invoices into SAP at the end of each month. Due to the number of external contractors, hundreds of invoices must be processes monthly.<br>•\tBasic API access for the SAP system is provided via a mixture of native application APIs and a middleware Simple Object Access Protocol (SOAP) API hosted on premises. The middleware API supports the ability to post time entries against the relevant projects in any SAP system by specifying the system and client ID as a query parameter in the URL. The middleware API was developed several years ago, and the source code is no longer available. Data is returned in XML format, which can then be analyzed further.<br>•\tWhen a project enters the closure phase, members of the PMO team need to navigate to SAP, enter some details, and then capture information from a PDF that is generated and opened on the screen, such as the final settlement amount. This information is then manually entered into Project Planning Application.<br><br>The company maintains a separate system containing detailed profile information regarding internal employees. The PMO team currently manually enters information from this system into the Resources table. Developers in the company have created a modern REST API for this system, which is actively maintained. The system contains highly sensitive personal information (PI) regarding each employee.<br><br>The company has several on-premises Windows environments that it has identified as suitable for usage because they exist within the same physical network as SAP and the middleware API. These environments must be patched regularly, and all activities targeting these environments must be automated.<br><br><br>Project Planning Application<br> -<br><br>•\tRather than manually populating the statement of work information, users should place it in a SharePoint folder for this information to be extracted and mapped to the correct inputs.<br>•\tA new automation is required to integrate with the profile information system. Because the company plans to consume this data in several ways, a streamlined mechanism for working with the API is required to improve reusability.<br>•\tAn automation is required to handle the project closure steps in SAP and to store the relevant information from SAP into the app.<br>•\tOnce a new candidate uploads a completed application form, information from the form should be copied automatically into Project Planning Application.<br><br><br>Time Entry Application<br> -<br><br>•\tTime Entry Application needs to be extended to integrate alongside SAP, ensuring postings for time entries are processed successfully. When a time entry is submitted, the entry should be posted automatically to SAP.<br>•\tTime entries must always be submitted with relevant text that indicates the type of activity and project worked on.<br>•\tThe automation should be able to detect and handle any errors that occur when posting individual time entries.<br><br><br>Invoice Processing<br> -<br><br>•\tInvoices sent to the account’s mailbox must be processed automatically and created as invoices within SAP.<br><br><br>General<br> -<br><br>•\tDevelopment efforts should be avoided or mitigated when there is native functionality already available.<br>•\tReusability of components is desired to assist citizen developers in creating any solutions in future.<br>•\tAll automation activities should run without disruption during an outage or a patching cycle.<br>•\tUse of username and password credentials should be avoided.<br>•\tAutomations should not rely on human intervention to execute.<br>•\tUse of public cloud file services should be restricted.<br>•\tWhere possible, JSON should be the preferred format when transferring data.<br><br><br>Issues<br> -<br><br>•\tUsers within the PMO team report that it takes many hours to put the data from each business card into the system.<br>•\tYou create the automation to process the time entries, called Submit Time Entry, and add it to the application. Users report issues with the formula used to connect to the automation.<br>•\tDuring a monthly patch cycle, IT support team members cannot identify the correct steps to patch the machine without disrupting any automation.<br>•\tWhile performing an audit of the new solution during the test phase, the company's information security team identifies that users can freely save confidential documents to OneDrive for Business.<br>•\tWhen creating the automation for the project closure process, you discover that some of the required information needs to be exported via the SAP GUI and extracted from a comma-separated value (CSV) file.<br>•\tWhen building the automation for the profile information system, you identify that all requests into the API will fail unless the following HTTP header value is specified:<br> o\tAccept: application/json<br><br><br>You need to determine the correct group for each connector used in the automations.<br><br>Which groups should you use? To answer, move the appropriate connector to the correct group. You may use each group once, more than once, or not at all.<br><br>You may need to move the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/pl-500/image191.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/pl-500/image192.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-08-22T02:04:00.000Z",
        "voteCount": 1,
        "content": "I would say all 3 are business. 1 and 2 are business for sure. Profile information is needed (so it cannot be blocked) and contains sensitive data (so cannot be non-business)"
      },
      {
        "date": "2024-05-15T05:09:00.000Z",
        "voteCount": 1,
        "content": "Business\nBusiness\nNon-Business"
      }
    ],
    "examNameCode": "pl-500",
    "topicNumber": "2"
  }
]