[
  {
    "topic": 27,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/68450-exam-pl-400-topic-27-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to analyze and identify the issues that solution checker identifies.<br>What is the missing or bad code? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04332/0013000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04332/0013000002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Modify code at line CS102 to select only required columns<br>Reduce the number of columns that are retrieved.<br>Scenario: Error Message: il-specify-column<br><br>Symptoms -<br>Retrieving all columns can cause:<br>✑ Performance issues due to the amount of data being retrieved<br>✑ Unintended plug-in/process execution<br><br>Guidance -<br>For optimal performance, you should only select the minimum amount of data needed by your application when querying Microsoft Dataverse data.<br><br>ColumnSet Parameter -<br>When you use the IOrganizationService.Retrieve method set the columnSet parameter to a ColumnSet instance with specified columns. When you use<br>QueryExpression set the ColumnSet property with the required attributes.<br>Box 2: Add the following code at line CS203: request.KeepAlive =false;<br>Scenario: Error message: Il-turn-off-keepalive<br><br>Symptoms -<br>If a plug-in makes external web requests and is trying to use KeepAlive on a closed connection, the plug-in will ultimately fail to execute the web request. If the plug-in is registered:<br>Synchronously, users may experience:<br>✑ Unresponsive model-driven apps<br>✑ Slow client interactions<br>✑ The browser stops responding<br>Asynchronously, plug-in executions may take an extended period of time before failing.<br><br>Guidance -<br>In HTTP 1.1, all connections are considered persistent (KeepAlive is true) unless declared otherwise. Due to the fact that plug-ins run in isolation, the Sandbox service translates into them being short-lived executions that generally would not benefit from KeepAlive. To avoid problems with connecting to external services we recommend disabling KeepAlive within plug-ins. This is done by setting KeepAlive to false.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/developer/data-platform/best-practices/business-logic/set-keepalive-false-interacting-external-hosts-plugin https://docs.microsoft.com/en-us/powerapps/developer/data-platform/best-practices/work-with-metadata/retrieve-specific-columns-entity-via-query-apis",
    "votes": [],
    "comments": [
      {
        "date": "2021-12-22T22:24:00.000Z",
        "voteCount": 21,
        "content": "First answer should be Modify code to select only specify columns."
      },
      {
        "date": "2022-03-14T13:52:00.000Z",
        "voteCount": 4,
        "content": "Agree: Codeset1 -&gt; first choice, Codeset2 -&gt; first choice!"
      },
      {
        "date": "2022-01-15T15:07:00.000Z",
        "voteCount": 1,
        "content": "\"request.KeepAlive = false\" cannot be right if the error is il-turn-off-keepalive, it has to be true for the error to prompt you to turn it off"
      },
      {
        "date": "2022-02-03T01:49:00.000Z",
        "voteCount": 7,
        "content": "Question is to identify the issue and suggest an action ... if the error suggests to turn-off-keepalive it must have been set to true originally which must be set to false now to remove that error\nSo, for code set 2- Add request.KeepAlive = false; \n  code set 1  -  Modify to select only required columns"
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "27"
  }
]