[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/75712-exam-mb-260-topic-1-question-1-discussion/",
    "body": "You are a Customer Data Platform Specialist. You need to create relationships to connect entities so that they can be further used in defining segments and measures by the marketing team.<br>Which three relationship types are available in audience insights? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNon-editable system relationships, created by the system as part of the data unification process\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNon-editable system relationships, which are created automatically from ingesting data sources",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEditable inherited relationships, created by the system as part of the data unification process",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEditable custom relationships, created and configured by users\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNon-editable inherited relationships, which are created automatically from ingesting data sources\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "ADE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "ADE",
        "count": 10,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-08-30T16:32:00.000Z",
        "voteCount": 2,
        "content": "ADE correct"
      },
      {
        "date": "2023-06-22T03:09:00.000Z",
        "voteCount": 2,
        "content": "ADE correct"
      },
      {
        "date": "2022-09-11T10:29:00.000Z",
        "voteCount": 2,
        "content": "A, D, E is correct"
      },
      {
        "date": "2022-08-30T07:43:00.000Z",
        "voteCount": 4,
        "content": "correct"
      },
      {
        "date": "2022-05-17T02:59:00.000Z",
        "voteCount": 4,
        "content": "A, D, E is correct"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/76855-exam-mb-260-topic-1-question-2-discussion/",
    "body": "You are a Customer Data Platform Specialist. Your company operates mainly in the business-to-business (B2B) space.<br>The chief marketing officer (CMO) asks you to implement audience insights and ensure that it can handle the company's B2B scenarios and data.<br>Which statement is correct when considering audience insights for business accounts versus individual consumers?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe out-of-the-box product recommendation prediction model is available for business accounts.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData ingestion features are different for business accounts and individual customers.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSome enrichment types are available only for individual customer scenarios, while others are exclusively available for business accounts.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBusiness accounts and individual consumers share the same audience insights environment."
    ],
    "answer": "C",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/dynamics365/customer-insights/audience-insights/work-with-business-accounts",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-06-22T03:12:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2022-06-15T21:21:00.000Z",
        "voteCount": 2,
        "content": "correct"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/91217-exam-mb-260-topic-1-question-5-discussion/",
    "body": "DRAG DROP -<br>You are a Customer Data Platform Specialist. You are in the process of implementing audience insights as the Customer Data Platform (CDP) solution for your company.<br>Your manager asks you to give a short presentation for new users who will be using audience insights and explain some of the benefits that audience insights will offer them.<br>Which user group will take which benefit from audience insights? To answer, drag the appropriate user group to the correct benefit. Each user group may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04191/0000500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04191/0000600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/dynamics365/customer-insights/audience-insights/overview",
    "votes": [],
    "comments": [
      {
        "date": "2022-12-12T07:33:00.000Z",
        "voteCount": 1,
        "content": "The analyst can only manage 1st party enrichments (incl. brand affinity and interests). The admin can manage all enrichments. https://learn.microsoft.com/en-us/dynamics365/customer-insights/permissions"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/134319-exam-mb-260-topic-1-question-6-discussion/",
    "body": "Some members from the IT department want to learn more about using Microsoft Azure Synapse Analytics to analyze Microsoft Dynamics 365 Customer Insights data.<br><br>The IT department needs to understand the key considerations when analyzing Dynamics 365 Customer Insights data using Azure Synapse Analytics.<br><br>Which three key points should the IT department consider? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData sources based on a Common Data Model folder are supported when configuring an export to Azure Synapse Analytics.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdministrator role access in Dynamics 365 Customer Insights is required to set up the connection between Dynamics 365 Customer Insights and Azure Synapse Analytics.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tScheduled refreshes prevent the update of any existing configured Azure Synapse connection.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData can be exported to Azure Synapse Analytics on demand, or every time there is a scheduled refresh.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDynamics 365 Customer Insights data can be ingested and used in Azure Synapse."
    ],
    "answer": "BDE",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-02-21T13:01:00.000Z",
        "voteCount": 2,
        "content": "Correct  \nhttps://learn.microsoft.com/en-us/dynamics365/customer-insights/data/export-azure-synapse-analytics"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121845-exam-mb-260-topic-1-question-8-discussion/",
    "body": "You work for a company that sells pet accessories. Your company sends personalized emails based on the customer’s country and level of interest in cats and dogs.<br><br>You configure a Microsoft interests enrichment that has “dogs” and “cats” as selected interests. Your company's marketing team needs to know how to create a segment of customers in different countries who are more interested in dogs than cats.<br><br>You need to recommend the measure that the marketing team should use to build the segment.<br><br>Which output from the interests enrichment should you recommend?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInterest affinity score",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInterest share of voice score",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInterest share of voice country demographic segment",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInterest affinity level"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-12-11T02:31:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/dynamics365/customer-insights/data/enrichment-microsoft#how-we-determine-affinities-and-sov\n\nAffinity is a comparative across demographic segments. You can use this information to identify demographic segments that have the highest affinity for a given brand or interest, compared to other segments.\n\nShare of voice is a comparative across your selected brands or interests. You can use this information to identify which brand or interest has the highest share-of-voice for a given demographic segment, compared to other brands or interests you selected."
      },
      {
        "date": "2023-09-29T09:55:00.000Z",
        "voteCount": 2,
        "content": "C: https://learn.microsoft.com/en-us/dynamics365/customer-insights/data/enrichment-microsoft#supported-countriesregions"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/121847-exam-mb-260-topic-1-question-9-discussion/",
    "body": "Online orders are ingested into Microsoft Dynamics 365 Customer Insights through real-time data ingestion. Departments like customer service can see the orders directly in the Dynamics 365 Customer Insights timeline when it is added to the contact from in Dynamics 365. A service representative notices an error with the total order amount that is measured in Dynamics 365 Customer Insights. While today’s online orders are visible in the timeline, the amount fails to update.<br><br>The representative needs you to explain why this is happening.<br><br>What reason should you provide?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReal-time ingested data has been ignored through a filter when defining the measurement",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReal-time ingested data only has limited information and may include attributes like order value",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReal-time ingested data first needs to be refreshed before the measures are updated",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReal-time ingested activities show up in the timeline but are excluded from measure calculations"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-09-29T10:01:00.000Z",
        "voteCount": 2,
        "content": "D - Because real-time operations take place after the data unification has happened, they only apply to the unified customer profiles. Consequently, real-time profile changes don't update measures, segment membership, or enrichments.\n https://learn.microsoft.com/en-us/dynamics365/customer-insights/data/real-time-data-ingestion"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142208-exam-mb-260-topic-1-question-11-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>General Overview -<br><br>Contoso Mobile Dog Spa operates a fleet of mobile grooming vans to provide dog grooming services. They operate in the cities (and surrounding metropolitan areas) of Atlanta, Chicago, New York City, Houston, and Seattle.<br><br>These grooming services are offered as packages at multiple price points, such as \"basic bath\" for $50 and \"premium bath with nail trim\" for $75.<br><br>Contoso also sells branded merchandise (hats, shirts, etc.) and dog accessories (toys, leashes, collars, etc.) through its own eCommerce website.<br><br>Customer Service and Marketing Overview. Customer Service<br><br>Contoso maintains a single contact center from which its customer service agents book appointments and handle customer complaints for each geographic market Contoso serves.<br><br>Customer service agents use Microsoft Dynamics 365 Customer Service to document inbound customer booking inquiries and complaints that are received via phone call, text message and web chat.<br><br>Customer service agents schedule grooming appointments using a third-party, web-based scheduling application.<br><br>Customer Service and Marketing Overview. Marketing<br><br>The marketing team manages an informational website and is responsible for running campaigns through web advertising platforms and social media channels. The marketing team also produces a weekly email newsletter that contains educational content relevant to dog owners as well as promotions for Contoso’s services and products.<br><br>Contoso uses a third-party marketing automation platform to send email and SMS messages to customers. These communications currently include:<br><br>1. All unique email addresses from the booking system, ecommerce system and Dynamics 365 Customer Service receive the weekly email newsletter described above. The same customer will receive multiple emails if the customer is associated with different email addresses in different systems.<br>2. Customers receive SMS reminders the day before a scheduled grooming appointment.<br>3. Each customer who purchases grooming services is sent an email with a link to a satisfaction survey on the first Tuesday following the grooming appointment. The survey link is the same for all customers, and the survey requires customers to enter their names, phone numbers and (optionally) email addresses as part of the submission.<br><br>Customer Service and Marketing Overview. Challenges<br><br>Currently, the customer service team does not have any way to relate survey responses back to individual customer records in Microsoft Dynamics 365 Customer Service.<br><br>The marketing team cannot access customer feedback data collected by the customer service team. Both the customer service team and marketing team cannot access any data from the ecommerce system.<br><br><br>Business Objectives -<br><br>Contoso business leadership identifies three major objectives to address by the end of the current fiscal year:<br><br>1. Improve customer retention - Current customer attrition rates exceed 40 percent each month.<br>2. Maximize customer value for services - The leadership team believes customer service agents should be upselling more customers on premium grooming packages. The leadership team is also considering partnering with other organizations to offer related services like dog training and dog walking to its existing customers.<br>3. Maximize customer value for merchandise and accessory sales - Fewer than five percent of grooming customers have ever made a purchase from the ecommerce site. The leadership team believes there are significant opportunities for new revenue by increasing ecommerce sales.<br><br><br>Project Overview. Overview -<br><br>The customer service and marketing leaders believes a Microsoft Customer Data Platform will help achieve Contoso’s business objectives.<br><br>The information technology (IT) team starts a pilot implementation of Microsoft Dynamics 365 Customer Insights.<br><br><br>Project Overview. Pilot Project -<br><br>The pilot implementation will use the following sources of data from Contoso's operational systems:<br><br>• Bookings - Customer demographic data and completed grooming appointments<br>• Web purchases - Customer demographic data and ecommerce purchases totals summarized by customer, type (branded merchandise or accessories) and date<br>• Survey responses - Respondent demographic data and response data<br>• Customer interactions - Customer demographic data, interaction history (phone calls, emails, web chat), customer feedback, and inquiries<br><br>There is no common customer key across the different data sources, and none of the customer tables store customer keys from the other sources. Every table in a specific data source can be associated back to a customer record from the same data source using the corresponding customer's primary key.<br><br>When managing system refreshes, Contoso requires data refreshes to begin within one hour of the scheduled arrival time for flat-file sources.<br><br>No Microsoft Azure storage services have been provisioned in support of the project, but the Customer Data Platform specialist may request the provisioning of any Azure services necessary to achieve the stated business objectives.<br><br>The goal of the pilot project is to demonstrate that Microsoft Dynamics 365 Customer Insights will provide marketing and customer service users with relevant data and insights. These data and insights will allow users to reduce churn, increase services revenue, and increase eCommerce spend.<br><br><br>Data Sources. Bookings -<br><br>This data source consists of two Parquet files that are uploaded to a secure file transport protocol (SFTP) site at noon (12 PM) and midnight (12 AM) every day.<br><br>1. Customers.parquet - customer id (primary key), name, customer physical address, city, state, postal code, phone number, residence type (“house”, “apartment”, etc.), email address<br>2. Appointments.parquet - appointment id (primary key), customer id, dog name, dog breed, appointment datetime, appointment price, grooming package name (“basic bath”, “premium bath”, etc.)<br><br><br>Data Sources. Web Purchases -<br><br>This data source consists of two CSV files that are programmatically uploaded to a SFTP site at midnight every day.<br><br>1. WebCustomers.csv - customer id (primary key), name, customer address, city, state, postal code, phone number, email address<br>2. TransactionTotals.csv - transaction id (primary key), customer id, merchandise total price, accessories total price, transaction datetime<br><br><br>Data Sources. Survey Responses -<br><br>This data source consists of two JSON files that are programmatically uploaded to a Microsoft SharePoint folder container at 6 PM every Friday.<br><br>1. Respondents.json - customer id (primary key), name, phone number, email address<br>2. Responses.json - response id (primary key), customer id, satisfaction score (1-5), comments, response date<br><br>Note: The satisfaction survey asks for a single satisfaction score on a scale of 1 to 5, with 1 meaning extremely dissatisfied and 5 meaning extremely satisfied. Respondents may optionally include comments.<br><br>Data Sources. Customer Interactions<br><br>This data source consists of a connection to data from the Contoso Dynamics 365 Customer Service application through a Microsoft Dataverse managed data lake. The relevant tables are all system tables.<br><br>1. Contacts - all system attributes are available<br>2. Activities - all system attributes are available<br>3. Cases (Incidents) - all system attributes are available<br><br>Note: Customer inquiries and feedback are stored as case (incident) records in the customer service application. Inquiries are tracked using the standard “question” case type value, and feedback are tracked using the standard “problem” case type value.<br><br><br>The IT manager at Contoso wants to extend Microsoft Dynamics 365 Customer Insights using Microsoft Power Platform.<br><br>Based on the data available in the pilot implementation, you need to provide the requirement that can be satisfied using out-of-the-box Power Platform capabilities.<br><br>What should you recommend?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse a canvas app to show mobile groomers a list of survey score responses and dates.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse a canvas app to show interests from the out-of-the-box Microsoft enrichment source.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse Microsoft Power Automate to post a Microsoft Teams message when the number of members in a segment falls below a certain threshold.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse Microsoft Power Automate to post a Microsoft Teams message when average daily revenue for collar purchases exceeds $500."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-09T03:06:00.000Z",
        "voteCount": 1,
        "content": "correct"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/138290-exam-mb-260-topic-1-question-12-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>General Overview -<br><br>Contoso Mobile Dog Spa operates a fleet of mobile grooming vans to provide dog grooming services. They operate in the cities (and surrounding metropolitan areas) of Atlanta, Chicago, New York City, Houston, and Seattle.<br><br>These grooming services are offered as packages at multiple price points, such as \"basic bath\" for $50 and \"premium bath with nail trim\" for $75.<br><br>Contoso also sells branded merchandise (hats, shirts, etc.) and dog accessories (toys, leashes, collars, etc.) through its own eCommerce website.<br><br>Customer Service and Marketing Overview. Customer Service<br><br>Contoso maintains a single contact center from which its customer service agents book appointments and handle customer complaints for each geographic market Contoso serves.<br><br>Customer service agents use Microsoft Dynamics 365 Customer Service to document inbound customer booking inquiries and complaints that are received via phone call, text message and web chat.<br><br>Customer service agents schedule grooming appointments using a third-party, web-based scheduling application.<br><br>Customer Service and Marketing Overview. Marketing<br><br>The marketing team manages an informational website and is responsible for running campaigns through web advertising platforms and social media channels. The marketing team also produces a weekly email newsletter that contains educational content relevant to dog owners as well as promotions for Contoso’s services and products.<br><br>Contoso uses a third-party marketing automation platform to send email and SMS messages to customers. These communications currently include:<br><br>1. All unique email addresses from the booking system, ecommerce system and Dynamics 365 Customer Service receive the weekly email newsletter described above. The same customer will receive multiple emails if the customer is associated with different email addresses in different systems.<br>2. Customers receive SMS reminders the day before a scheduled grooming appointment.<br>3. Each customer who purchases grooming services is sent an email with a link to a satisfaction survey on the first Tuesday following the grooming appointment. The survey link is the same for all customers, and the survey requires customers to enter their names, phone numbers and (optionally) email addresses as part of the submission.<br><br>Customer Service and Marketing Overview. Challenges<br><br>Currently, the customer service team does not have any way to relate survey responses back to individual customer records in Microsoft Dynamics 365 Customer Service.<br><br>The marketing team cannot access customer feedback data collected by the customer service team. Both the customer service team and marketing team cannot access any data from the ecommerce system.<br><br><br>Business Objectives -<br><br>Contoso business leadership identifies three major objectives to address by the end of the current fiscal year:<br><br>1. Improve customer retention - Current customer attrition rates exceed 40 percent each month.<br>2. Maximize customer value for services - The leadership team believes customer service agents should be upselling more customers on premium grooming packages. The leadership team is also considering partnering with other organizations to offer related services like dog training and dog walking to its existing customers.<br>3. Maximize customer value for merchandise and accessory sales - Fewer than five percent of grooming customers have ever made a purchase from the ecommerce site. The leadership team believes there are significant opportunities for new revenue by increasing ecommerce sales.<br><br><br>Project Overview. Overview -<br><br>The customer service and marketing leaders believes a Microsoft Customer Data Platform will help achieve Contoso’s business objectives.<br><br>The information technology (IT) team starts a pilot implementation of Microsoft Dynamics 365 Customer Insights.<br><br><br>Project Overview. Pilot Project -<br><br>The pilot implementation will use the following sources of data from Contoso's operational systems:<br><br>• Bookings - Customer demographic data and completed grooming appointments<br>• Web purchases - Customer demographic data and ecommerce purchases totals summarized by customer, type (branded merchandise or accessories) and date<br>• Survey responses - Respondent demographic data and response data<br>• Customer interactions - Customer demographic data, interaction history (phone calls, emails, web chat), customer feedback, and inquiries<br><br>There is no common customer key across the different data sources, and none of the customer tables store customer keys from the other sources. Every table in a specific data source can be associated back to a customer record from the same data source using the corresponding customer's primary key.<br><br>When managing system refreshes, Contoso requires data refreshes to begin within one hour of the scheduled arrival time for flat-file sources.<br><br>No Microsoft Azure storage services have been provisioned in support of the project, but the Customer Data Platform specialist may request the provisioning of any Azure services necessary to achieve the stated business objectives.<br><br>The goal of the pilot project is to demonstrate that Microsoft Dynamics 365 Customer Insights will provide marketing and customer service users with relevant data and insights. These data and insights will allow users to reduce churn, increase services revenue, and increase eCommerce spend.<br><br><br>Data Sources. Bookings -<br><br>This data source consists of two Parquet files that are uploaded to a secure file transport protocol (SFTP) site at noon (12 PM) and midnight (12 AM) every day.<br><br>1. Customers.parquet - customer id (primary key), name, customer physical address, city, state, postal code, phone number, residence type (“house”, “apartment”, etc.), email address<br>2. Appointments.parquet - appointment id (primary key), customer id, dog name, dog breed, appointment datetime, appointment price, grooming package name (“basic bath”, “premium bath”, etc.)<br><br><br>Data Sources. Web Purchases -<br><br>This data source consists of two CSV files that are programmatically uploaded to a SFTP site at midnight every day.<br><br>1. WebCustomers.csv - customer id (primary key), name, customer address, city, state, postal code, phone number, email address<br>2. TransactionTotals.csv - transaction id (primary key), customer id, merchandise total price, accessories total price, transaction datetime<br><br><br>Data Sources. Survey Responses -<br><br>This data source consists of two JSON files that are programmatically uploaded to a Microsoft SharePoint folder container at 6 PM every Friday.<br><br>1. Respondents.json - customer id (primary key), name, phone number, email address<br>2. Responses.json - response id (primary key), customer id, satisfaction score (1-5), comments, response date<br><br>Note: The satisfaction survey asks for a single satisfaction score on a scale of 1 to 5, with 1 meaning extremely dissatisfied and 5 meaning extremely satisfied. Respondents may optionally include comments.<br><br>Data Sources. Customer Interactions<br><br>This data source consists of a connection to data from the Contoso Dynamics 365 Customer Service application through a Microsoft Dataverse managed data lake. The relevant tables are all system tables.<br><br>1. Contacts - all system attributes are available<br>2. Activities - all system attributes are available<br>3. Cases (Incidents) - all system attributes are available<br><br>Note: Customer inquiries and feedback are stored as case (incident) records in the customer service application. Inquiries are tracked using the standard “question” case type value, and feedback are tracked using the standard “problem” case type value.<br><br><br>The IT manager at Contoso wants to develop an internal administration website that will connect to the Microsoft Dynamics 365 Customer Insights REST API. The manager asks you about several possible use cases.<br><br>You need to explain which actions are possible using the capabilities of the REST API.<br><br>Which three actions can the API perform? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdate a customer's predicted churn score.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdate a customer's residence type.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDefine a new measure for total accessory spend.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete an existing data source.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a new data source to be ingested."
    ],
    "answer": "BCD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BCD",
        "count": 3,
        "isMostVoted": true
      },
      {
        "answer": "BCE",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-05-14T05:52:00.000Z",
        "voteCount": 3,
        "content": "BCD is the correct answer\nhttps://learn.microsoft.com/en-us/training/modules/configure-third-party-connections/6-customer-insights"
      },
      {
        "date": "2024-04-10T00:32:00.000Z",
        "voteCount": 1,
        "content": "You can’t just ”update” the churn score"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142209-exam-mb-260-topic-1-question-13-discussion/",
    "body": "Case study -<br><br>This is a case study. Case studies are not timed separately. You can use as much exam time as you would like to complete each case. However, there may be additional case studies and sections on this exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br><br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br><br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. When you are ready to answer a question, click the Question button to return to the question.<br><br><br>General Overview -<br><br>AdventureWorks Cycles is a bicycle retailer with a few locations in the Midwest USA region. The AdventureWorks Cycles business model supports both in-store purchases, as well as online orders. In addition to offering a wide variety of bicycles, the company sells clothing, performance nutrition supplements, and bicycle parts. The company also offers bicycle fitting and repair services.<br><br>The customer base varies from professional cyclists, individual leisure riders to families. The business recently experienced unprecedented growth of over 2000 percent, bringing the total number of customers to 10,000. The company decided to invest in Microsoft Dynamics 365 Customer Insights and Dynamics 365 Sales mobile app to unify customer data and improve sales.<br><br>Data Sources. ADVCUSTOMERS Common Data Model Folder<br><br>AdventureWorks uses Microsoft Azure Data Factory pipelines to export demographic data from its customer loyalty, ecommerce and cycling club membership management systems to a Common Data Model (CDM) folder named ADVCUSTOMERS that is stored in a Microsoft Azure Data Lake Gen 2 container named ADVDEMO9345 in the West USA region.<br><br>The following list describes the entities in this CDM folder:<br>•\tLoyaltyMember - contains customer profile information associated with in-store purchases. o\tIt includes the following attributes: srcid (primary key), firstname, lastname, fullname, addressstreet, city, postalcode, state, homephone, emailaddress, datecreated, timestamp<br>•\tEcommerceCustomer - contains customer profile information from online purchases. o\tIt includes the following attributes: ecid (primary key), firstname, last name, fullname, emailaddress, homephone, streetaddress, city, postalcode, state, datecreated, timestamp<br>•\tClubMember - contains profile information for cycling club members. o\tIt includes the following attributes: ccic (primary key) fullname, emailaddress, streetaddress1, city, postal_code, state, datecreated, timestamp<br>•\tSurveyResponse - contains customer satisfaction scores on a scale from 1-10 (1 being extremely dissatisfied and 10 being extremely satisfied). o\tIt includes the following attributes: svid (primary key), emailaddress, responsedate, score.<br><br>Data Sources. WEBSTATS Common Data Model Folder<br><br>AdventureWorks’ website page views for authenticated ecommerce customers and cycling club members are stored in a CDM folder named WEBSTATS that is stored in an Azure Data Lake Gen 2 container named WEBDATA119 in the Central US region.<br><br>This folder contains an entity named PageViews that includes the following fields: emailaddress, pageurl. visitdate, productcategory.<br><br>Data Sources. Additional Information<br><br>AdventureWorks uses Dynamics 365 Sales as its sales CRM application, and its data is stored in Microsoft Dataverse.<br><br>Cycling club event logistics and member attendance are managed in an Azure SQL database. Attendance is tracked in a single table named EventAttendee that includes the following fields: emailaddress, eventdate, eventaddress, eventcity, eventstate, eventpostalcode, lastupdated (timestamp).<br><br>The ClubMember entity contains records of existing customers, as well as individuals who have not made a purchase from AdventureWorks. There are approximately 500,000 records in this entity, and there are approximately 5 million records in the EventAttendee table.<br><br><br>Current Configuration -<br><br>AdventureWorks currently has a single Dynamics 365 Customer Insights environment. This environment is named ADWProd, and it is configured as a B-to-C production environment in the West USA region.<br><br>The following data sources have been configured:<br>1. To ingest the LoyaltyMember, EcommerceCustomer and ClubMember entities described in the Data Sources section of this case study.<br>2. For Dynamics 365 Sales contact records using a Dataverse managed data lake connector.<br>3. For the EventAttendee table using a Power Query connection.<br><br>Profile unification has been configured to perform map, match and merge for non-primary key attributes with identical semantic types from the LoyaltyMember, EcommerceCustomer and ClubMember entities. Creation dates and timestamps were intentionally left unmapped. Some additional attributes were accidentally excluded from the merge process. These attributes are listed in the Pain Points section of this case study.<br><br>The search and filter index has been configured to include FullName, City, State and PhoneNumber as search fields. The State field is enabled tor filtering based on frequency and will show up to 10 options.<br><br>All members of the AdventureWorks marketing team have been granted access to the ADWProd environment.<br><br><br>Pain Points -<br><br>The AdventureWorks leadership team has identified several issues that need to be addressed to support current growth and ensure customer satisfaction.<br><br>1. Attributes for first name and postal code were included in the mapping process, but they were accidentally excluded from the merge process.<br>2. Multiple copies of printed catalogs are being sent to members of the same household resulting in wasted printing and mailing costs.<br>3. A segment export to Dynamics 365 Sales has been configured, but the sales team reports the associated marketing lists has zero members.<br>4. Ingesting the EventAttendee table takes significantly longer than ingesting any other data source, and it causes significant delays for completion of scheduled refreshes.<br><br><br>Goals and Objectives -<br><br>1. The marketing team wants to start hosting invitation-only webinars to promote upcoming product launches. Invitations for these webinars should be restricted to customers who have responded favorably to a customer satisfaction survey.<br>2. The marketing team wants to email coupons to customers based on the types of products they view on the AdventureWorks website.<br>3. The IT operations team wants to minimize the amount of time required to complete a scheduled refresh.<br><br><br>Detailed Requirements -<br><br>1. Only one copy of a catalog should be sent per household. AdventureWorks defines a household as all customers who share the same last name, street address, city and state.<br>2. Sales users are expected to call customers who are included in the loyalty system but do not have a populated email address in the loyalty system.<br>3. All marketing emails must include the customer's first name in the subject field, if it is available in the source data.<br>4. Marketing team members must be able to search for customer profiles in Microsoft Dynamics 365 Customer Insights by full name, email address, phone number, city, state, and postal code.<br>5. All members of the marketing team who can access a production Dynamics 365 Customer Insights environment should also have access to its corresponding testing environment.<br>6. Data exports and scheduled refreshes are not allowed in test environments.<br><br><br>You want to address the IT operations team’s goal.<br><br>What is the first step you should take?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure incremental refresh for the ClubMember entity.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecreate EventAttendee as a partitioned table.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a primary key to the PageViews entity.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a primary key to the EventAttendee table\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-09T03:20:00.000Z",
        "voteCount": 1,
        "content": "Before recreating as a partitioned table, you need to create a primary key"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140687-exam-mb-260-topic-1-question-14-discussion/",
    "body": "You consult for an organization that is implementing Dynamics 365 Customer Insights for the first time.<br><br>You are creating training materials for the organization and need to create a glossary of terms.<br><br>Which definition should you add to the glossary?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTables - a configurable structure that forms the basis of the forms that compose the user interface of Dynamics 365 Customer Insights.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExports - a feature that allows ingestion of data from a wide variety of data sources external to the application.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActivities - a feature that enables a user to define actions or events performed by customers or business contacts in ingested data.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPredictions - a feature that predicts possible relationships between different tables you have ingested."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-15T03:57:00.000Z",
        "voteCount": 3,
        "content": "I think the answer should be C, but not 100% sure"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/137244-exam-mb-260-topic-1-question-15-discussion/",
    "body": "The marketing team uses Dynamics 365 Customer Insights – Data, and has started using Dynamics 365 Customer Insights – Journeys.<br><br>The team asked you how they can use the Customer Insights – Data to further personalize marketing operations.<br><br>You need to advise the marketing team.<br><br>Which three things do you tell the team? Each correct answer presents a complete solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tJourney triggers can be created directly within Customer Insights – Data tables to trigger the start of a marketing journey.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou can directly engage every customer, regardless of whether the customer's data is a contact in Dynamics 365 Customer Insights – Journeys or a profile in Customer Insights - Data.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMeasures from Customer Insights – Data can directly be added onto a contact form in a model-driven app without the card add-in.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDynamic content can be configured based on measures such as loyalty status or any other measure you have captured in the unified customer profile.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAny segment from Customer Insights – Data can be selected to start a segment-based journey without adding the segment as part of the export connection.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "BDE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BDE",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-15T03:56:00.000Z",
        "voteCount": 3,
        "content": "BDE is the correct answer"
      },
      {
        "date": "2024-04-11T00:51:00.000Z",
        "voteCount": 2,
        "content": "BDE should be correct"
      },
      {
        "date": "2024-03-26T01:07:00.000Z",
        "voteCount": 1,
        "content": "why is A correct? how on earth can you create triggers in insights data?! is BDE"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/140688-exam-mb-260-topic-1-question-16-discussion/",
    "body": "You consult for an organization that is implementing Dynamics 365 Customer Insights - data for the first time.<br><br>You are creating training materials for the organization and need to create a glossary of terms.<br><br>Which definition should you add to the glossary?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExports – a feature that allows ingestion of data from a wide variety of data sources external to the application.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTables – a configurable structure that forms the basis of the forms that compose the user interface of Dynamics 365 Customer Insights – Data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRelationships – a feature that enables a user to define connections between tables and generate a diagram of your data connections.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSegments – a configurable model for identifying vertical industry alignment of organizations and individuals within ingested data."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-05-15T04:00:00.000Z",
        "voteCount": 2,
        "content": "that's right, C is the correct answer"
      }
    ],
    "examNameCode": "mb-260",
    "topicNumber": "1"
  }
]