[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37212-exam-az-302-topic-6-question-1-discussion/",
    "body": "Note: This question is a part of a series of questions that presents the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some questions sets might have more than one correct solution, while others not have a correct solution.<br>After you answer a question in this section, you will Not be able to return to it. As a result, these questions will not appear in the review screen.<br>You use ASP.NET Core MVC with ADO.NET to develop an application. You implement database sharding for the application by using Azure SQL Database. You establish communication links between the shard databases.<br>You need to implement a strategy that allows a group of operations that are performed on multiple Azure databases to be rolled back on all databases if any of the operations fail.<br>Solution:<br>✑ Create stored procedures in each Azure SQL database instance to perform operations for each respective database.<br>✑ Invoke a named transaction in each stored procedure.<br>✑ Establish a new transaction scope in a using block. Within the block, establish connections to each Azure SQL Databases instance and run the stored procedure.<br>✑ If no exception occurs, commit the scoped transaction.<br>Does the solution meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-04-14T21:25:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/azure-sql/database/elastic-transactions-overview"
      },
      {
        "date": "2020-11-17T21:18:00.000Z",
        "voteCount": 1,
        "content": "If exception, should rollback."
      }
    ],
    "examNameCode": "az-302",
    "topicNumber": "6"
  }
]