[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32818-exam-mb-600-topic-7-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to recommend a solution for integrating luggage information.<br>What should you recommend? To answer, drag the appropriate types to the correct entities. Each type must be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03385/0004100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03385/0004100002.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-27T19:39:00.000Z",
        "voteCount": 8,
        "content": "Passenger normally should be the OOB Contact entity. Why a custom entity?"
      },
      {
        "date": "2020-09-26T04:28:00.000Z",
        "voteCount": 5,
        "content": "I did a fair amount of research on this answer and I believe this answer is correct, however, there are quite a number of restrictions in this use case especially when it comes to Roll Up and Calculated operations which cannot be done on virtual entities. You can, however, create a Lookup from the Contact(passenger) to the VE record, so I guess this solution would work."
      },
      {
        "date": "2022-10-15T19:10:00.000Z",
        "voteCount": 1,
        "content": "Due to the wording of \"integrating\" luggage information and that there is a separate custom app for tracking passenger luggage, then Luggage entity needs to be Virtual entity.\n\nSince an agent needs \"to add the total on the passenger record\", then Passenger entity needs to be a custom entity (based on the choices provided)."
      },
      {
        "date": "2021-03-23T23:29:00.000Z",
        "voteCount": 1,
        "content": "To me, both could be a custom entity as virtual entities would take place only when there is a need to source the data from an external system. Can anyone please help to justify the \"Virtual Entity\" answer?"
      },
      {
        "date": "2021-03-05T23:00:00.000Z",
        "voteCount": 1,
        "content": "\"The company has a custom app for managing and tracking passenger luggage. The app uses Common Data Service\"\n\n- the custom entity for luggage already exists within the CDS environment so why would it be virtual entity?"
      },
      {
        "date": "2021-04-04T23:51:00.000Z",
        "voteCount": 1,
        "content": "Yes it would be. Do you think any table created in CDS by another App will automatically be available to D365 ? Why should it be - that will break the very tenet of Domain/Data Isolation/Separation !!"
      },
      {
        "date": "2021-06-03T23:51:00.000Z",
        "voteCount": 2,
        "content": "I believe it depends on the environment you use for the application"
      },
      {
        "date": "2021-01-12T15:53:00.000Z",
        "voteCount": 2,
        "content": "There was question in exam that is related to this sentence:\n\"The security role for agents must contain the privileges in the default Customer Service Representative security role\". The question was to arrange the steps of creating a security role for agents in proper order."
      },
      {
        "date": "2020-10-03T09:01:00.000Z",
        "voteCount": 3,
        "content": "Maybe is correct. \"Agents need to view which pieces of luggage match to each passenger, and then need to add the total on the passenger record.\" That's answer, why both are nor Virtual Entities. Remember they have a custom app to manager passengers and luggages."
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32820-exam-mb-600-topic-7-question-2-discussion/",
    "body": "You need to recommend a solution that provides a seamless customer experience.<br>What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBusiness Process Flows",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower Automate",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tworkflows",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ttask flows"
    ],
    "answer": "A",
    "answerDescription": "Architect a solution",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-26T04:31:00.000Z",
        "voteCount": 7,
        "content": "Yip, this answer seems to be correct because of the following statement in the requirements, \"Agents need a visual indicator in the interface to determine the reservation step to provide a seamless customer experience.\""
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "7"
  }
]