[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/135730-exam-sc-200-topic-7-question-1-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Azure subscription that contains a user named User1 and a Microsoft Sentinel workspace named WS1.<br><br>You deploy Advanced Security Information Model (ASIM) authentication parsers to WS1.<br><br>You need to use the parsers to query the authentication events generated by User1 during the last 24 hours. The solution must maximize the performance of the query.<br><br>How should you complete the query? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image254.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image255.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-01T02:38:00.000Z",
        "voteCount": 16,
        "content": "Wrong.\nCorrect is: imAuthentication (targetusername_has = 'johndoe', starttime = ago(1d), endtime=now())\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/normalization-schema-authentication"
      },
      {
        "date": "2024-03-29T22:58:00.000Z",
        "voteCount": 6,
        "content": "Query provided in Microsoft Learn.\nimAuthentication (targetusername_has = 'johndoe', starttime = ago(1d), endtime=now())\nhttps://learn.microsoft.com/en-us/azure/sentinel/normalization-schema-authentication"
      },
      {
        "date": "2024-07-25T15:19:00.000Z",
        "voteCount": 1,
        "content": "imAuthentication\ntargetusername_has"
      },
      {
        "date": "2024-06-15T06:30:00.000Z",
        "voteCount": 1,
        "content": "answer from ghagpt is ASimAuthentication | targetusername_has = 'user1', starttime = ago(1d), endtime=now()\nso the given answer is correct"
      },
      {
        "date": "2024-03-11T04:10:00.000Z",
        "voteCount": 1,
        "content": "Correct\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/normalization-schema-authentication"
      },
      {
        "date": "2024-05-17T04:30:00.000Z",
        "voteCount": 3,
        "content": "should be imAuthentication &amp; targetusername_has"
      },
      {
        "date": "2024-03-28T00:52:00.000Z",
        "voteCount": 7,
        "content": "According to the link it should be imAuthentication: \" imAuthentication (targetusername_has = 'johndoe', starttime = ago(1d), endtime=now())\""
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 11,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/65203-exam-sc-200-topic-7-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to recommend remediation actions for the Azure Defender alerts for Fabrikam.<br>What should you recommend for each threat? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04261/0005100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04261/0005200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/key-vault/general/security-features https://docs.microsoft.com/en-us/azure/key-vault/general/secure-your-key-vault",
    "votes": [],
    "comments": [
      {
        "date": "2022-01-22T06:16:00.000Z",
        "voteCount": 17,
        "content": "The answer is correct. If the key vault is there, there would be a policy too. We need to modify that policy. For external threats, we just need to update the \"Network\" section in the Key Vault configuration. So you don't have to go to NSG or Azure firewall for this."
      },
      {
        "date": "2022-06-29T11:08:00.000Z",
        "voteCount": 4,
        "content": "I agree with the explanation from swgu, correct answers."
      },
      {
        "date": "2021-11-24T04:44:00.000Z",
        "voteCount": 8,
        "content": "For this question the Internal Threat the options are the following from other sources:\n\n- Add resource locks to the key vault\n- Modify the access policy settings for the key vault \n- Modify the RBAC (Role Based Access Control) settings for the key vault\n\nthe last one is the correct answer"
      },
      {
        "date": "2024-03-01T07:29:00.000Z",
        "voteCount": 2,
        "content": "Answers seem correct but under the technical requirements, it refers to Contoco and not Fabrikam.  Just pointing this out."
      },
      {
        "date": "2023-10-29T10:04:00.000Z",
        "voteCount": 1,
        "content": "Correct option"
      },
      {
        "date": "2023-10-23T05:47:00.000Z",
        "voteCount": 1,
        "content": "I think correct based on https://techcommunity.microsoft.com/t5/microsoft-defender-for-cloud/automation-for-responding-to-microsoft-defender-for-key-vault/ba-p/3539417"
      },
      {
        "date": "2021-10-31T08:15:00.000Z",
        "voteCount": 8,
        "content": "Can anybody here confirm if the question/answer is correct? The question says \"You need to recommend remediation actions for the Azure Defender alerts for Fabrikam.\", but the Technical Requirements says \"Develop a procedure to remediate Azure Defender for Key Vault alerts for Contoso in case of external and internal threats. \""
      },
      {
        "date": "2021-12-20T01:28:00.000Z",
        "voteCount": 1,
        "content": "I've got the same question"
      },
      {
        "date": "2021-11-24T04:36:00.000Z",
        "voteCount": 3,
        "content": "I'm not sure if anyone has gotten this far specially for those with no contributor role."
      },
      {
        "date": "2023-09-06T08:54:00.000Z",
        "voteCount": 2,
        "content": "total pages are 47 currently. this question is on page 44. without contributor access, you cannot access 2nd half, so this question will not be showing for users who have no contributor access."
      },
      {
        "date": "2022-06-29T11:13:00.000Z",
        "voteCount": 5,
        "content": "Under Planned Changes: \"Contoso plans to integrate the security operations of both companies and manage all security operations centrally.\" So the same procedures and recommend remediation actions for Contoso should be also considered for Fabrikam. It is a tricky question, but hey it is a scenario based question and all context should be considered."
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/135731-exam-sc-200-topic-7-question-2-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have an Azure subscription that contains a user named User1 and a Microsoft Sentinel workspace named WS1.<br><br>You need to ensure that User1 can enable User and Entity Behavior Analytics (UEBA) for WS1. The solution must follow the principle of least privilege.<br><br>Which roles should you assign to User1? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image256.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image257.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-03-11T04:13:00.000Z",
        "voteCount": 6,
        "content": "Correct\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/enable-entity-behavior-analytics#prerequisites"
      },
      {
        "date": "2024-06-23T10:24:00.000Z",
        "voteCount": 2,
        "content": "Same as question 82 - Topic 3"
      },
      {
        "date": "2024-04-01T02:39:00.000Z",
        "voteCount": 4,
        "content": "Correct"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 11,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63392-exam-sc-200-topic-7-question-2-discussion/",
    "body": "You need to recommend a solution to meet the technical requirements for the Azure virtual machines.<br>What should you include in the recommendation?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tjust-in-time (JIT) access",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Defender\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Firewall",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Application Gateway"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 8,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-09-30T19:38:00.000Z",
        "voteCount": 19,
        "content": "Correct - Azure Defender"
      },
      {
        "date": "2024-02-25T14:48:00.000Z",
        "voteCount": 3,
        "content": "Note: Azure defender is now call Microsoft Defender for Cloud"
      },
      {
        "date": "2022-03-14T05:20:00.000Z",
        "voteCount": 5,
        "content": "\"Defender for Cloud helps you limit exposure to brute force attacks.\""
      },
      {
        "date": "2023-10-29T10:04:00.000Z",
        "voteCount": 1,
        "content": "Correct option"
      },
      {
        "date": "2022-12-23T00:37:00.000Z",
        "voteCount": 3,
        "content": "To meet the technical requirement of receiving alerts if an Azure virtual machine is under brute force attack, you could recommend including Azure Defender in the solution."
      },
      {
        "date": "2022-06-29T11:20:00.000Z",
        "voteCount": 3,
        "content": "Correct answer. I first went to just-in-time, but this is for hardening the network against brute force, while Defender for Cloud (Azure Defender) is to harden the virual machine itself against brute force attacks. \"^Defender for Cloud^ helps you limit exposure to ^brute force attacks^. By reducing access to virtual machine ports, using the just-in-time VM access, you can ^harden your network^ by preventing unnecessary access.\" Ref: https://docs.microsoft.com/en-us/azure/defender-for-cloud/defender-for-cloud-introduction#defend-your-azure-native-resources"
      },
      {
        "date": "2021-12-22T16:27:00.000Z",
        "voteCount": 3,
        "content": "B. Azure Defender\nCorrect answer"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/139692-exam-sc-200-topic-7-question-3-discussion/",
    "body": "DRAG DROP<br> -<br><br>You have a Microsoft Sentinel workspace named SW1.<br><br>In SW1, you enable User and Entity Behavior Analytics (UEBA).<br><br>You need to use KQL to perform the following tasks:<br><br>\u2022\tView the entity data that has fields for each type of entity.<br>\u2022\tAssess the quality of rules by analyzing how well a rule performs.<br><br>Which table should you use in KQL for each task? To answer, drag the appropriate tables to the correct tasks. Each table may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image284.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image285.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-27T06:15:00.000Z",
        "voteCount": 11,
        "content": "This question was in the exam 27/04/2024.\n\nBehaviorAnalytics and Anomalies."
      },
      {
        "date": "2024-08-21T00:02:00.000Z",
        "voteCount": 1,
        "content": "Correct Answers:\nView entity data: BehaviorAnalytics\nAssess rule quality: Anomalies"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/139587-exam-sc-200-topic-7-question-4-discussion/",
    "body": "Your on-premises network contains an Active Directory Domain Services (AD DS) forest.<br><br>You have a Microsoft Entra tenant that uses Microsoft Defender for Identity. The AD DS forest syncs with the tenant.<br><br>You need to create a hunting query that will identify LDAP simple binds to the AD DS domain controllers.<br><br>Which table should you query?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAADServicePrincipalRiskEvents",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAADDomainServicesAccountLogon",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSigninLogs",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIdentityLogonEvents\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 16,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-04-25T09:52:00.000Z",
        "voteCount": 11,
        "content": "Here is a sample query from Microsoft Learn documentation:\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/reference/queries/identitylogonevents"
      },
      {
        "date": "2024-05-30T06:02:00.000Z",
        "voteCount": 1,
        "content": "Agreed."
      },
      {
        "date": "2024-10-03T22:52:00.000Z",
        "voteCount": 1,
        "content": "IdentityLogonEvents table\n- Table that holds info about authentication activities made through your on-premises Active Directory\n\nhttps://learn.microsoft.com/en-us/azure/azure-monitor/reference/tables/identitylogonevents"
      },
      {
        "date": "2024-06-12T07:20:00.000Z",
        "voteCount": 1,
        "content": "https://techcommunity.microsoft.com/t5/security-compliance-and-identity/enhancing-microsoft-defender-for-identity-data-using-microsoft/ba-p/2178286"
      },
      {
        "date": "2024-05-26T03:06:00.000Z",
        "voteCount": 2,
        "content": ", the correct table to query for identifying LDAP simple binds to the AD DS domain controllers is AADDomainServicesAccountLogon.\\"
      },
      {
        "date": "2024-07-12T00:57:00.000Z",
        "voteCount": 1,
        "content": "No, this is for Entra ID Domain Services"
      },
      {
        "date": "2024-04-25T09:59:00.000Z",
        "voteCount": 3,
        "content": "IdentityLogonEvents"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/139747-exam-sc-200-topic-7-question-5-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft 365 subscription.<br><br>You need to identify all the security principals that submitted requests to change or delete groups.<br><br>How should you complete the KQL query? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image286.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image287.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-07-28T15:29:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2024-04-29T12:53:00.000Z",
        "voteCount": 3,
        "content": "First I think it's POST req, but then i see \"identify submitted requests\" and now I know answer is GET."
      },
      {
        "date": "2024-05-13T13:28:00.000Z",
        "voteCount": 4,
        "content": "The original answer is correct but this explanation is false\nRequestMethod DIFFERS FROM \"GET\" meaning it will return requests that are not simple get, but can be POST, PUT, UPDATE, DELETE..."
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/139590-exam-sc-200-topic-7-question-6-discussion/",
    "body": "You have a Microsoft 365 subscription that uses Microsoft Defender for Endpoint Plan 2 and contains a macOS device named Device1.<br><br>You need to investigate a Defender for Endpoint agent alert on Device1. The solution must meet the following requirements:<br><br>\u2022\tIdentify all the active network connections on Device1.<br>\u2022\tIdentify all the running processes on Device1.<br>\u2022\tRetrieve the login history of Device1.<br>\u2022\tMinimize administrative effort.<br><br>What should you do first from the Microsoft Defender portal?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Devices, click Collect investigation package for Device1.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Advanced features in Endpoints, enable Live Response unsigned script execution.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Devices, initiate a live response session on Device1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Advanced features in Endpoints, disable Authenticated telemetry."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 12,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 6,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-04-30T01:21:00.000Z",
        "voteCount": 8,
        "content": "Answer A: The investigation package collected by defender includes all the required information and is considerable less admin effort than running a live response session and collecting this information interactively.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/respond-machine-alerts?view=o365-worldwide#collect-investigation-package-from-devices"
      },
      {
        "date": "2024-07-25T15:47:00.000Z",
        "voteCount": 1,
        "content": "A\nhttps://learn.microsoft.com/en-us/defender-endpoint/respond-machine-alerts?view=o365-worldwide#collect-investigation-package-from-devices"
      },
      {
        "date": "2024-06-16T03:56:00.000Z",
        "voteCount": 2,
        "content": "checked chat-gpt and the answer is C Here's why:\n\nInitiating a live response session allows you to interact with Device1 in real-time. You can run commands to check active network connections, running processes, and retrieve the login history.\nMinimize administrative effort: Live response sessions provide direct access and control, which minimizes the need for additional configurations or complex procedures.\nThe other options either involve additional steps that are not immediately necessary (like collecting an investigation package, which can be more comprehensive but less direct for immediate queries) or configurations that don't directly address the investigative tasks at hand.\nBy starting a live response session, you can quickly gather the necessary information directly from Device1, fulfilling the investigation requirements effectively."
      },
      {
        "date": "2024-05-18T08:47:00.000Z",
        "voteCount": 2,
        "content": "Minimize Administrative Effort:\nLive response sessions allow you to interact directly with the device, minimizing administrative overhead."
      },
      {
        "date": "2024-10-10T22:46:00.000Z",
        "voteCount": 1,
        "content": "I would argue that collecting the Investigation package requires less effort because all you have to do is download the package, and look for the info you need in the Network Connections folder, Processes folder, and Users and groups folder.\nWhereas for a live session, you will have to establish a session and execute several commands to retrieve the information you need"
      },
      {
        "date": "2024-04-26T11:48:00.000Z",
        "voteCount": 2,
        "content": "By initiating a live response session, you can achieve your investigation goals while minimizing administrative effort. Remember that live response provides real-time access to the device, allowing you to perform tasks directly on Device"
      },
      {
        "date": "2024-04-25T11:41:00.000Z",
        "voteCount": 4,
        "content": "A is correct.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/respond-machine-alerts?view=o365-worldwide#collect-investigation-package-from-devices"
      },
      {
        "date": "2024-04-25T10:07:00.000Z",
        "voteCount": 2,
        "content": "live response session"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/139645-exam-sc-200-topic-7-question-7-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft Sentinel workspace.<br><br>You plan to visualize data from Microsoft SharePoint Online and OneDrive sites.<br><br>You need to create a KQL query for the visual. The solution must meet the following requirements:<br><br>\u2022\tSelect all workloads as a single operation.<br>\u2022\tInclude two parameters named Operations and Users.<br>\u2022\tIn the results, exclude empty values for the site URLs.<br><br>How should you complete the query? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image288.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image289.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-26T03:06:00.000Z",
        "voteCount": 14,
        "content": "Second option should be where SiteUrl !=\""
      },
      {
        "date": "2024-08-21T00:47:00.000Z",
        "voteCount": 2,
        "content": "OfficeActivity\n| where Operation in ((Operations))\n| where OfficeWorkload in ('OneDrive', 'SharePoint')\n| where SiteUrl != \" \"\n| summarize Number = count() by Site_Url, UserId, Operation, TimeGenerated\n\nFirst Dropdown: where Operation in ((Operations))\nSecond Dropdown: where SiteUrl != \" \""
      },
      {
        "date": "2024-05-06T00:11:00.000Z",
        "voteCount": 2,
        "content": "The project statement gums up the sumarize"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142629-exam-sc-200-topic-7-question-8-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft Sentinel workspace that contains a custom workbook.<br><br>You need to query for a summary of security events. The solution must meet the following requirements:<br><br>\u2022\tIdentify the number of security events ingested during the past week.<br>\u2022\tDisplay the count of events by day in a chart.<br><br>How should you complete the query? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image305.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image306.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-08-21T00:53:00.000Z",
        "voteCount": 2,
        "content": "SecurityEvent\n| summarize count() by bin(TimeGenerated, 1d)\n| render timechart"
      },
      {
        "date": "2024-07-28T15:34:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      },
      {
        "date": "2024-06-16T18:06:00.000Z",
        "voteCount": 2,
        "content": "SecurityEvent\n| where TimeGenerated &gt;= ago(7d)  // Filter events from the past 7 days\n| summarize EventCount = count() by bin(TimeGenerated, 1d)  // Count events per day\n| render timechart"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/142582-exam-sc-200-topic-7-question-9-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft Sentinel workspace that contains a custom workbook named Workbook1.<br><br>You need to create a visual in Workbook1 that will display the logon count for accounts that have logon event IDs of 4624 and 4634.<br><br>How should you complete the query? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image307.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image308.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-06-15T04:59:00.000Z",
        "voteCount": 3,
        "content": "answer from GPT4\nlet Logons = SecurityEvent\n| where EventID == 4624\n| summarize LogonCount = count() by AccountName;\nlet Logoffs = SecurityEvent\n| where EventID == 4634\n| summarize LogoffCount = count() by AccountName;\nLogons\n| join kind=inner (Logoffs)\n    on AccountName\n| project AccountName, LogonCount, LogoffCount\n| render barchart"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/141667-exam-sc-200-topic-7-question-10-discussion/",
    "body": "You have 500 on-premises Windows 11 devices that use Microsoft Defender for Endpoint.<br>You enable Network device discovery.<br><br>You need to create a hunting query that will identify discovered network devices and return the identity of the onboarded device that discovered each network device.<br><br>Which built-in function should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSeenBy()\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeviceFromIP()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tnext()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcurrent_cluster_endpoint()"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-16T18:43:00.000Z",
        "voteCount": 2,
        "content": "Seenby function - https://learn.microsoft.com/en-us/defender-endpoint/device-discovery"
      },
      {
        "date": "2024-05-31T06:29:00.000Z",
        "voteCount": 2,
        "content": "Correct.\nBy invoking the SeenBy function, in your advanced hunting query, you can get detail on which onboarded device a discovered device was seen by. This information can help determine the network location of each discovered device and subsequently, help to identify it in the network.\n\nhttps://learn.microsoft.com/en-us/defender-endpoint/device-discovery"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/141947-exam-sc-200-topic-7-question-11-discussion/",
    "body": "You have an Azure subscription that contains a resource group named RG1. RG1 contains a Microsoft Sentinel workspace. The subscription is linked to a Microsoft Entra tenant that contains a user named User1.<br><br>You need to ensure that User1 can deploy and customize Microsoft Sentinel workbook templates. The solution must follow the principle of least privilege.<br><br>Which role should you assign to User1 for RG1?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMicrosoft Sentinel Contributor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWorkbook Contributor\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMicrosoft Sentinel Automation Contributor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tContributor"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 5,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-06-07T01:26:00.000Z",
        "voteCount": 5,
        "content": "correct answer"
      },
      {
        "date": "2024-09-16T05:05:00.000Z",
        "voteCount": 3,
        "content": "Answer: B. Workbook Contributor\n\nExplanation:\nWorkbook Contributor role grants the required permissions to deploy and customize workbook templates in Microsoft Sentinel.\nIt provides the ability to create and modify workbooks without granting broader permissions that are not needed for this task.\nThe other roles provide broader access or different functionalities that are not necessary for just working with workbook templates:\n\nA. Microsoft Sentinel Contributor grants broader permissions across Microsoft Sentinel but is not required solely for workbook templates.\nC. Microsoft Sentinel Automation Contributor is focused on automating tasks and is unrelated to workbooks.\nD. Contributor grants full access to manage all resources in the resource group, which is more access than needed.\nTherefore, Workbook Contributor is the best choice for this scenario."
      },
      {
        "date": "2024-10-10T23:44:00.000Z",
        "voteCount": 2,
        "content": "Agreed\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/built-in-roles/monitor#workbook-contributor"
      },
      {
        "date": "2024-07-30T13:16:00.000Z",
        "voteCount": 4,
        "content": "To create and delete a Microsoft Sentinel workbook, the user needs either the Microsoft Sentinel Contributor role or a lesser Microsoft Sentinel role, together with the Workbook Contributor Azure Monitor role."
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/141909-exam-sc-200-topic-7-question-12-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft 365 subscription that uses Microsoft Defender XDR.<br><br>You need to create a custom detection rule that will identify devices that had more than five antivirus detections within the last 24 hours.<br><br>How should you complete the query? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/sc-200/image309.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/sc-200/image310.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2024-08-21T02:51:00.000Z",
        "voteCount": 1,
        "content": "ReportId x2"
      },
      {
        "date": "2024-06-13T07:28:00.000Z",
        "voteCount": 3,
        "content": "correct, see script: https://learn.microsoft.com/en-us/defender-xdr/custom-detection-rules"
      },
      {
        "date": "2024-06-04T23:58:00.000Z",
        "voteCount": 2,
        "content": "DeviceEvents\n| where ingestion_time() &gt; ago(1d)\n| where ActionType == \"AntivirusDetection\"\n| summarize (Timestamp, ReportId)=arg_max(Timestamp, ReportId), count() by DeviceId\n| where count_ &gt; 5"
      }
    ],
    "examNameCode": "sc-200",
    "topicNumber": "7"
  }
]