[
  {
    "topic": 15,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14121-exam-az-301-topic-15-question-1-discussion/",
    "body": "HOTSPOT -<br>You are evaluating the components of the migration to Azure that require you to provision an Azure Storage account.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02744/0014100009.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02744/0014200001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-18T16:46:00.000Z",
        "voteCount": 28,
        "content": "My answer is No No No\nNo, you do not need a Storage account to migrate SQL, all can be done with a replication\nNo, The app service plan comes with a storage\nNo, db metrics does not require it"
      },
      {
        "date": "2020-05-11T03:31:00.000Z",
        "voteCount": 19,
        "content": "Correct Answers are \nNo\nNo\nYes\n\nYou can use the Database Migration service to carry out an online migration. Here you don’t need to have a storage account.\nYou can migrate the web site content as it, and you don’t need a separate storage account for this.\nYes, for enabling diagnostic setting which stores the database metrics, you can choose the data store as a storage account."
      },
      {
        "date": "2020-07-05T23:43:00.000Z",
        "voteCount": 1,
        "content": "Static website hosting in Azure Storage | Microsoft Docs"
      },
      {
        "date": "2020-08-11T05:26:00.000Z",
        "voteCount": 1,
        "content": "Stream metrics and resource logs to Azure Storage. Use Azure storage to archive vast amounts of diagnostic telemetry for a fraction of the cost of the previous two streaming options."
      },
      {
        "date": "2021-03-28T14:30:00.000Z",
        "voteCount": 1,
        "content": "\"Web site content must be easily updated from a single point\", it clearly indicated it's using storage account for static web contents. So,  No, Yes, Yes"
      },
      {
        "date": "2021-04-01T02:28:00.000Z",
        "voteCount": 1,
        "content": "Sorry! it is No Yes No.  https://docs.microsoft.com/en-us/azure/azure-sql/database/metrics-diagnostic-telemetry-logging-streaming-export-configure?tabs=azure-portal \nData streamed to a Log Analytics workspace can be consumed by SQL Analytics. SQL Analytics is a cloud only monitoring solution that provides intelligent monitoring of your databases that includes performance reports, alerts, and mitigation recommendations. So should be log analytics workspace instead of storage account"
      },
      {
        "date": "2021-08-26T01:02:00.000Z",
        "voteCount": 1,
        "content": "How do we know that it's a static website? We don't know anything about it. Are they referring to the files of WebApp1? In that case it's an app, not a static website (thus no Storage Account). Or is it something else, which is not related to WebApp1? In that case we have no idea whether it's static or not, whether we need multiple instances or not, whether it must be HA or not. And even if it would be static, we could use App Service Static Web Apps (which does not require a Storage Account).\n\nSo I'd vote for NNN"
      },
      {
        "date": "2020-09-19T22:18:00.000Z",
        "voteCount": 1,
        "content": "Ref: Stream metrics and resource logs to Azure Storage. Use Azure storage to archive vast amounts of diagnostic telemetry for a fraction of the cost of the previous two streaming options.\nhttps://docs.microsoft.com/en-us/azure/azure-sql/database/monitor-tune-overview \n\nAns: Yes, NO, Yes (Given answers are correct)"
      },
      {
        "date": "2020-09-10T22:26:00.000Z",
        "voteCount": 3,
        "content": "no, no , yes"
      },
      {
        "date": "2020-09-18T17:44:00.000Z",
        "voteCount": 1,
        "content": "given answer is correct"
      },
      {
        "date": "2020-08-31T20:31:00.000Z",
        "voteCount": 3,
        "content": "Answer is No No Yes. You need storage for migration only when using BACPAC file , not with DMS. \nAzure Database Migration Service is a fully managed service designed to enable seamless migrations from multiple database sources to Azure data platforms with minimal downtime (online migrations). DMS integrates some of the functionality of our existing tools and services. It provides customers with a comprehensive, highly available solution. The service uses the Data Migration Assistant to generate assessment reports that provide recommendations to guide you through the changes required prior to performing a migration. It's up to you to perform any remediation required. When you're ready to begin the migration process, Azure Database Migration Service performs all of the required steps. You can fire and forget your migration projects with peace of mind, knowing that the process takes advantage of best practices as determined by Microsoft.\n https://docs.microsoft.com/en-us/azure/dms/dms-overview"
      },
      {
        "date": "2020-08-22T23:08:00.000Z",
        "voteCount": 1,
        "content": "make a note of&nbsp;Standard Performance tier, Azure Storage Account, that allows DMS service to upload the database backup files to and use for migrating databases. Make sure to create the Azure Storage Account in the same region as the Azure Database Migration Service instance is created.\n\nFrom &lt;https://docs.microsoft.com/en-us/azure/dms/tutorial-sql-server-managed-instance-online&gt; \n\nMake sure to create a general-purpose v2 Standard storage account . Static websites aren't available in any other type of storage account.\n\nFrom &lt;https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-static-website&gt; \n\nYou can store metrics and resource logs in Azure Storage by using the built-in&nbsp;Archive to a storage account&nbsp;option in the Azure portal. You can also enable Storage by using diagnostics settings via PowerShell cmdlets, the Azure CLI, or the Azure Monitor REST API.\n\nFrom &lt;https://docs.microsoft.com/en-us/azure/azure-sql/database/metrics-diagnostic-telemetry-logging-streaming-export-configure?tabs=azure-portal&gt; \n\n\nSo the answer is YYY"
      },
      {
        "date": "2020-08-22T23:13:00.000Z",
        "voteCount": 1,
        "content": "I think the tricky point is in all statements it says \"You MUST provision....\"\n\nWebsite content storage is optional.\n\nHence the given answer (YNY) seems correct..."
      },
      {
        "date": "2020-08-27T05:13:00.000Z",
        "voteCount": 4,
        "content": "For Online DB Migration with DMS we need Storage Account, so it is yes\nWeb Site Content, Not sure but for static Web Sites it is recommended to have Storage account\nFor DB Metrics since requirement is seven years then we must have Storage account\nI would go for YYY in the exam"
      },
      {
        "date": "2020-08-31T13:59:00.000Z",
        "voteCount": 3,
        "content": "Please ignore my previous comment. After seeing other questions and going through the requirements again. I will go for N,N,N :)"
      },
      {
        "date": "2020-08-11T07:03:00.000Z",
        "voteCount": 6,
        "content": "SQL Server DB migration, storage account required?\n\n&gt; No. The requirement says that database downtime must be minimized while migration is taking place, which I would solve by using \"Data Migration Assistant\". \n\nWeb site content, storage account required?\n\n&gt; No. I don't see any need for this when using an App Service (PaaS requirement). \n\nDatabase metric monitoring, storage account required?\n\n&gt; I'd say No as well, although I am not sure. We would enable the recording of the DB metrics via \"Diagnostic Settings\". There we can choose between \"Send to Log Analytics\", \"Archive to a storage account\" and \"Stream to an event hub\". Streaming to an event hub doesn't make sense in this scenario as we don't want to do any stream based analysis on top of the metrics. I think its important to keep the metrics for some time for later analysis and both Log Analytics and a storage account would allow for this. So in this scenario I would select Log Analytics and therefor we don't need a storage account."
      },
      {
        "date": "2020-08-11T05:27:00.000Z",
        "voteCount": 3,
        "content": "No, No, Yes\n\nStream metrics and resource logs to Azure Storage. Use Azure storage to archive vast amounts of diagnostic telemetry for a fraction of the cost of the previous two streaming options."
      },
      {
        "date": "2020-08-10T01:21:00.000Z",
        "voteCount": 2,
        "content": "On my exam I will go for No, No and No. Makes most sense to me."
      },
      {
        "date": "2020-08-05T14:17:00.000Z",
        "voteCount": 1,
        "content": "Yes\nNo\nNo"
      },
      {
        "date": "2020-07-28T21:41:00.000Z",
        "voteCount": 1,
        "content": "wrong answer.  \n\nyou only need this\nYes, for enabling diagnostic setting which stores the database metrics, you can choose the data store as a storage account."
      },
      {
        "date": "2020-07-24T03:12:00.000Z",
        "voteCount": 2,
        "content": "my answer: no, no, no\nLog anlytics requests workspace but no storage account"
      },
      {
        "date": "2020-07-19T12:08:00.000Z",
        "voteCount": 6,
        "content": "No\nNo \nYes\n\nDatabase migration service doesn't need a storage account for the migration\nhttps://docs.microsoft.com/en-us/azure/dms/dms-overview"
      },
      {
        "date": "2020-07-17T22:22:00.000Z",
        "voteCount": 4,
        "content": "Actually,  I correct what I said earlier, If it said NO downtime, then you would need to use Azure Database Migration for online migration, which requires a storage account. However, as it says minimize downtime, you can use SQL Transactional replication, which doesn't require a storage account. So storage account is not a must. \n\nhttps://www.sqlshack.com/sql-server-database-migration-to-azure-sql-database-using-sql-server-transactional-replication/"
      },
      {
        "date": "2020-07-17T22:07:00.000Z",
        "voteCount": 5,
        "content": "Requirement Box1: YES\nminimize downtime, so needs to be an online migration.\n\nFor online migrations from SQL Server to SQL Managed Instance using Azure Database Migration Service, you must provide the full database backup and subsequent log backups in the SMB network share that the service can use to migrate your databases.\n\nWhen configuring the migration, you need to select the Azure Storage Account that DMS can upload the backup files from the SMB network share to and use for database migration. We recommend selecting the Storage Account in the same region as the DMS service for optimal file upload performance.\n\nRequirement Box2: NO\nWeb site content must be easily updated from a single point -&gt; Azure App Services\nUnpredictable workloads -&gt; The Standard plan includes auto-scale which can automatically adjust the number of virtual machine instances running to match your traffic needs.&nbsp;\n\nRequirement Box3: NO\nyou can stream SQL diagnostic telemetry to the following destinations:\n\nLog Analytics and SQL Analytics\nEvent Hubs\nAzure Storage"
      },
      {
        "date": "2020-09-28T01:54:00.000Z",
        "voteCount": 1,
        "content": "I agree, although it's a bit hard to read the docs. Only MI explicitly says that you need a Storage account. With SQL DB it only says to open port 445 and allow Storage endpoint, but doesn't explicitly say you need a Storage account.\nhttps://docs.microsoft.com/en-us/azure/dms/tutorial-sql-server-managed-instance-online#prerequisites\nhttps://docs.microsoft.com/en-us/azure/dms/tutorial-sql-server-azure-sql-online#prerequisites"
      },
      {
        "date": "2020-07-02T07:15:00.000Z",
        "voteCount": 4,
        "content": "looks like we would need storage account if we use online mode for db migration, since nothing is mentioned whether it would be offline/online i would assume online in that case we would defintely need an storage account for migration.\ncheck the important section marked in blue in prerequisites section\nhttps://docs.microsoft.com/en-us/azure/dms/tutorial-sql-server-managed-instance-online"
      },
      {
        "date": "2020-06-29T00:05:00.000Z",
        "voteCount": 6,
        "content": "its B1 - NO B2 - NO B3 - YES"
      }
    ],
    "examNameCode": "az-301",
    "topicNumber": "15"
  },
  {
    "topic": 15,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/10314-exam-az-301-topic-15-question-2-discussion/",
    "body": "You need to recommend a strategy for migrating the database content of WebApp1 to Azure.<br>What should you include in the recommendation?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse Azure Site Recovery to replicate the SQL servers to Azure",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse SQL Server transactional replication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCopy the VHD that contains the Azure SQL database files to Azure Blob storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCopy the BACPAC file that contains the Azure SQL database files to Azure Blob storage"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-12-13T15:06:00.000Z",
        "voteCount": 46,
        "content": "It should be \"B. Use SQL Server transactional replication\"\nQuestion said: \nTo avoid disrupting customer access, database downtime must be minimized when databases are migrated."
      },
      {
        "date": "2020-09-20T04:19:00.000Z",
        "voteCount": 6,
        "content": "B is ok"
      },
      {
        "date": "2020-06-01T12:29:00.000Z",
        "voteCount": 17,
        "content": "https://docs.microsoft.com/en-us/azure/azure-sql/database/migrate-to-database-from-sql-server\nThis doc supports \"B. Use SQL Server transactional replication\""
      },
      {
        "date": "2021-03-06T01:23:00.000Z",
        "voteCount": 2,
        "content": "Correct answer should be B :- https://docs.microsoft.com/en-us/azure/azure-sql/database/migrate-to-database-from-sql-server .................as long as we agreed to use Azure Sql DB and with minimum down time migration it will lead to use SQL server transactional replication"
      },
      {
        "date": "2021-01-02T19:18:00.000Z",
        "voteCount": 3,
        "content": "B is  correct."
      },
      {
        "date": "2020-12-12T06:23:00.000Z",
        "voteCount": 4,
        "content": "In the Exam 12/11/2020. B is correct"
      },
      {
        "date": "2020-09-19T11:34:00.000Z",
        "voteCount": 3,
        "content": "Someone can help here? by default is transactional rep, in examtopics AZ-304 is VHD and whizlabs says BACPAC. any clue?"
      },
      {
        "date": "2020-09-21T07:16:00.000Z",
        "voteCount": 1,
        "content": "Exactly my point kindly help someone"
      },
      {
        "date": "2020-09-22T09:39:00.000Z",
        "voteCount": 1,
        "content": "I would go with B i think."
      },
      {
        "date": "2020-08-04T03:59:00.000Z",
        "voteCount": 5,
        "content": "From https://datamigration.microsoft.com/scenario/sql-to-azuresqldb?step=1.\n\"The following data migration options are discussed:\n•\tAzure Database Migration Service (DMS)\n•\tData Migration Assistant (DMA)\n•\tTransactional replication\n•\tBulk load\"\n\nFrom these, only transactional replication appears in the answers.\nOn top, C and D are incorrect because they talk about migrating to BLOB! which is incorrect. Technically, I believe that it would be possible to replicate using Site Recovery but the requirements tell us to use PaaS as much as possible."
      },
      {
        "date": "2020-06-29T09:25:00.000Z",
        "voteCount": 5,
        "content": "B: backpac of course works but step2 can be repeated multiple times thus leading to longer downtime. Microsoft states to use Transactional for the best minimal downtime. \nIt is worth mentioning explicitly that the amount of downtime required to create, upload, and import a bacpac of a large database may be prohibitively large in the context of an actual production application migration. In those cases, the migration approach using transactional replication, which significantly reduces the necessary downtime at the cost of added complexity, may be a feasible solution."
      },
      {
        "date": "2020-04-15T12:40:00.000Z",
        "voteCount": 1,
        "content": "considering the point minimized downtime, I would simply user ASR to replicate SQL VM to Azure. this can instantly switch on prem SQL onto Cloud with very little downtime.  My bet will be on A"
      },
      {
        "date": "2020-05-06T22:35:00.000Z",
        "voteCount": 3,
        "content": "ASR is used only for Disaster Recovery and Business Contiuity and not for Database migration .Also it is a very expensive option ."
      },
      {
        "date": "2020-06-19T16:40:00.000Z",
        "voteCount": 2,
        "content": "ASR is used in both DR and migration. And the question doesn't ask for minimized cost."
      },
      {
        "date": "2020-04-11T05:28:00.000Z",
        "voteCount": 6,
        "content": "I recommend \"D. Copy the BACPAC file that contains the Azure SQL database files to Azure Blob storage\", but not \"B. Use SQL Server transaction replication\", because real-time is not required, just minimized."
      },
      {
        "date": "2020-05-12T22:35:00.000Z",
        "voteCount": 3,
        "content": "Minimized means the fastest way possible, so answer is either A or B"
      },
      {
        "date": "2020-07-31T08:14:00.000Z",
        "voteCount": 2,
        "content": "If your client said minimal downtime and found out you chose an option that took the service down when other options offered zero downtime, you can expect an unhappy client. Zero downtime is the minimal downtime possible here."
      }
    ],
    "examNameCode": "az-301",
    "topicNumber": "15"
  },
  {
    "topic": 15,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14299-exam-az-301-topic-15-question-3-discussion/",
    "body": "You need to recommend a strategy for the web tier of WebApp1. The solution must minimize costs.<br>What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the Scale Up settings for a web app",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a runbook that resizes virtual machines automatically to a smaller size outside of business hours",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy a virtual machine scale set that scales out on a 75 percent CPU threshold",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the Scale Out settings for a web app"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-24T04:50:00.000Z",
        "voteCount": 13,
        "content": "A. Configure the Scale Up settings for a web app\n\n&gt; Would interrupt the service\n\nB. Create a runbook that resizes virtual machines automatically to a smaller size outside of business hours\n\n&gt; We are going to use Azure App Service (PaaS) so no need for this. Ruled out!\n\nC. Deploy a virtual machine scale set that scales out on a 75 percent CPU threshold\n\n&gt; Ruled out for the same reason as B. \n\nD. Configure the Scale Out settings for a web app\n\n&gt; Only option left\n\nConclusion: \n\n&gt; D. is the correct answer"
      },
      {
        "date": "2020-09-20T02:41:00.000Z",
        "voteCount": 2,
        "content": "Agree B and C and out due to PaaS requirement. A will not work as it brings in complexity and interruption. It is D"
      },
      {
        "date": "2020-02-16T23:40:00.000Z",
        "voteCount": 13,
        "content": "D. Configure the Scale Out settings for a web app  - Correct Answer as , Scale create multiple copies of single web Instanced and does not required any additional configuration."
      },
      {
        "date": "2020-06-23T04:39:00.000Z",
        "voteCount": 1,
        "content": "However, it runs on VM now and IT plans to migrate web tier to Azure. It does not say PaaS or IaaS."
      },
      {
        "date": "2020-09-05T03:36:00.000Z",
        "voteCount": 6,
        "content": "\"Whenever possible, solutions must be deployed to Azure by using platform as a service (PaaS).\""
      },
      {
        "date": "2020-09-20T04:22:00.000Z",
        "voteCount": 3,
        "content": "D is ok"
      },
      {
        "date": "2021-01-02T19:30:00.000Z",
        "voteCount": 2,
        "content": "D: Scale out is correct answer."
      },
      {
        "date": "2020-07-24T00:59:00.000Z",
        "voteCount": 1,
        "content": "why not scale up instead of scale out"
      },
      {
        "date": "2020-07-30T10:01:00.000Z",
        "voteCount": 2,
        "content": "Scale up changes the tier of the VM and may lead to interrupted service. The correct way to approach this kind of situations is to add more nodes to the pool -&gt; scale out."
      },
      {
        "date": "2020-04-15T12:42:00.000Z",
        "voteCount": 3,
        "content": "D should be good here."
      },
      {
        "date": "2020-04-16T20:23:00.000Z",
        "voteCount": 4,
        "content": "It says it currently runs on IIS (Hyper-V). How do we know if it will work on a WebApp?"
      },
      {
        "date": "2020-06-15T01:28:00.000Z",
        "voteCount": 6,
        "content": "Whenever possible, solutions must be deployed to Azure by using platform as a service (PaaS)."
      },
      {
        "date": "2021-03-08T03:50:00.000Z",
        "voteCount": 1,
        "content": "\"Fabrikam plans to migrate the production and test instances of WebApp1 to Azure and to use the S1 plan.\""
      },
      {
        "date": "2020-03-10T03:00:00.000Z",
        "voteCount": 1,
        "content": "A:  Web site content must be easily updated from a single point.\nD: need more configuration (LB Or Application Gateway)"
      }
    ],
    "examNameCode": "az-301",
    "topicNumber": "15"
  }
]