[
  {
    "topic": 20,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/70496-exam-mb-330-topic-20-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to configure the system to meet the metric requirement for sales representatives.<br>How should you configure the system? To answer, drag the appropriate entities to the correct requirements. Each entity may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04068/0019700002.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04068/0019800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-01-24T02:32:00.000Z",
        "voteCount": 8,
        "content": "When a quote is created, a prospect is connected. No Opportunity is required or created automatically. And leads are created if a potential customer is identified, but the company is not yet a customer. Opportunities are potential sales to existing customers.  Taking that in consideration, the answers should be b-prospect,d-customer,a-lead.\nAnyone?"
      },
      {
        "date": "2022-05-22T04:26:00.000Z",
        "voteCount": 7,
        "content": "Prospect, Customer, Lead"
      },
      {
        "date": "2022-11-07T04:28:00.000Z",
        "voteCount": 3,
        "content": "Answer correct"
      },
      {
        "date": "2024-02-06T02:30:00.000Z",
        "voteCount": 1,
        "content": "Accidently upvoted this. Answer is not correct.\nShould be prospect, customer, lead"
      },
      {
        "date": "2022-03-26T02:42:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct"
      },
      {
        "date": "2022-03-15T13:52:00.000Z",
        "voteCount": 1,
        "content": "lead is created by marketing and handed over to sales and if leads meets the qualifications then its converted to opportunity. Opportunity is converted to customer when the quote is confirmed.\nso the answer is the right"
      },
      {
        "date": "2023-10-11T12:06:00.000Z",
        "voteCount": 1,
        "content": "Opportunities are typically not thought of as \"companies\" or parties. The lead is the actual company / party. An opportunity might be associated with a company, but they're usually not the same thing.\n\nOf course, your experience may differ."
      },
      {
        "date": "2022-03-02T08:30:00.000Z",
        "voteCount": 4,
        "content": "So Prospect / Customer / Lead ?"
      }
    ],
    "examNameCode": "mb-330",
    "topicNumber": "20"
  },
  {
    "topic": 20,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/76430-exam-mb-330-topic-20-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to configure the system to support regional sales requirements.<br>Which group assignments should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04068/0019900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04068/0020000001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://www.dynamics-tips.com/sales-and-marketing/how-to-calculate-and-process-sales-commissions",
    "votes": [],
    "comments": [
      {
        "date": "2022-06-09T08:09:00.000Z",
        "voteCount": 1,
        "content": "It should be commission group for both customer &amp; item (Q1 &amp; Q3). On the customer record, there is a field called Commission group. On the released product record, there is also a field called Commission group. Customer group and Item group are already fields used for other purposes on these forms. Since the question is asking about the specific object/form, it should be commission group for these two.\n\nSales group for sales reps is correct."
      },
      {
        "date": "2022-10-11T03:44:00.000Z",
        "voteCount": 4,
        "content": "For Q1 and Q2, the groups are called Commission Customer group and Commission Item group. They are assigned to Commission group field on Customers and Items records. It is a bit misleading, but the answers are correct."
      },
      {
        "date": "2023-10-11T12:24:00.000Z",
        "voteCount": 1,
        "content": "I think we all agree how poorly worded this is.\n\nFirst, D365 uses \"customer group\" and \"item group\" in different ways based on the context. They have distinct meanings outside of commissions, but within commissions, they are also used with a unique meanings. \n\nHowever, within commissions, they use multiple terms for each. Regarding customers, they variously call it the \"commission customer group\" and the \"customer group;\" similarly with items, it is called the \"commission group\" \"item group\" or the \"commission item group.\"\n\nExamples:\n\n1. Commission item group: see the menu item. Commission group: see the field on the released product. Item group: see the tooltip within the commission calculation form on the item code.\n2. Commission customer group: see the menu item. Commission group: see the field on the customer.\n\n...\n\nIn conclusion, I don't think anyone can make an airtight case."
      },
      {
        "date": "2022-05-30T06:11:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/dynamics365/supply-chain/sales-marketing/tasks/set-up-sales-commission-rules.\nhence 'commission group' for the third question"
      }
    ],
    "examNameCode": "mb-330",
    "topicNumber": "20"
  }
]