[
  {
    "topic": 3,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7604-exam-ms-500-topic-3-question-1-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 subscription that uses an Azure Active Directory (Azure AD) tenant named contoso.com.<br>OneDrive stores files that are shared with external users. The files are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0023200001.png\" class=\"in-exam-image\"><br>You create a data loss prevention (DLP) policy that applies to the content stored in OneDrive accounts. The policy contains the following three rules:<br>Rule1:<br>✑ Conditions: Label1, Detect content that's shared with people outside my organization<br>✑ Actions: Restrict access to the content for external users<br>✑ User notifications: Notify the user who last modified the content<br>✑ User overrides: On<br>✑ Priority: 0<br>Rule2:<br>✑ Conditions: Label1 or Label2<br>✑ Actions: Restrict access to the content<br>✑ Priority: 1<br>Rule3:<br>✑ Conditions: Label2, Detect content that's shared with people outside my organization<br>✑ Actions: Restrict access to the content for external users<br>✑ User notifications: Notify the user who last modified the content<br>✑ User overrides: On<br>✑ Priority: 2<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0023300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0023300002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "When content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the rules are processed in priority order and the most restrictive action is enforced. In this scenario rule 2 is the most restrictive.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-14T03:25:00.000Z",
        "voteCount": 54,
        "content": "Answer: \nNo - No - No\nAll of them will match Rule2 because it is the most restrictive.\n\nWhen content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the rules are processed in priority order and the most restrictive action is enforced. For example, if content matches all of the following rules, Rule 3 is enforced because it's the highest priority, most restrictive rule:\n\n    Rule 1: only notifies users\n\n    Rule 2: notifies users, restricts access, and allows user overrides\n\n    Rule 3: notifies users, restricts access, and does not allow user overrides\n\n    Rule 4: only notifies users\n\n    Rule 5: restricts access\n\n    Rule 6: notifies users, restricts access, and does not allow user overrides\n\n\nSource: https://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide"
      },
      {
        "date": "2021-05-12T08:59:00.000Z",
        "voteCount": 3,
        "content": "the users in contoso.com can access to the file because they are internal, no ?"
      },
      {
        "date": "2021-07-03T19:23:00.000Z",
        "voteCount": 4,
        "content": "Did you not read jack's comment? - \"If content matches multiple rules, the rules are processed in priority order and the most restrictive action is enforced\". File2 has both label1 and label2 applied. Rule2 condition applies to label1 or label2 and the action is restrict access to the content. It doesn't care about if the user is internal or external."
      },
      {
        "date": "2021-11-18T16:03:00.000Z",
        "voteCount": 2,
        "content": "jack987 provides a great explanation but the source needs to be updated to the one given below:\n\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/dlp-policy-reference?view=o365-worldwide#the-priority-by-which-rules-are-processed\n\nHopefully Microsoft don't change the article again..."
      },
      {
        "date": "2020-04-30T18:04:00.000Z",
        "voteCount": 19,
        "content": "Should be NO-NO-NO. As per the URL, https://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide#the-priority-by-which-rules-are-processed, \"When content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the rules are processed in priority order and the most restrictive action is enforced.\"\n\nSo all three rules are evaluated and Rule 2 is the most restrictive and that applies."
      },
      {
        "date": "2022-10-15T15:21:00.000Z",
        "voteCount": 3,
        "content": "Valid on exam October 14, 2022"
      },
      {
        "date": "2022-09-22T05:38:00.000Z",
        "voteCount": 2,
        "content": "Valid on exam 9/21/2022"
      },
      {
        "date": "2021-12-01T05:37:00.000Z",
        "voteCount": 2,
        "content": "No - No - No\nAll of them will match Rule2 because it is the most restrictive."
      },
      {
        "date": "2021-11-21T08:07:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/microsoft-365/compliance/dlp-policy-reference?view=o365-worldwide\nAll three rules are evaluated and Rule 2 is the most restrictive and that applies. So answers are corrrect. No access to users (internal or external doesn't matter).\n\nExplanation#\nA policy contains one or more rules. Rules are executed sequentially, starting with the highest-priority rule in each policy.\n\nThe priority by which rules are processed\nEach rule is assigned a priority in the order in which it's created. That means, the rule created first has first priority, the rule created second has second priority, and so on.\n\nWhen content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the first rule evaluated that has the most restrictive action is enforced."
      },
      {
        "date": "2021-09-10T00:22:00.000Z",
        "voteCount": 1,
        "content": "just for information the link has changed \nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/dlp-policy-reference"
      },
      {
        "date": "2021-03-01T06:05:00.000Z",
        "voteCount": 2,
        "content": "@smoo is right..\nYES, = user can override and rule is on highest priority\nNO, 2nd rule causing this\nNO, Third rule causing this."
      },
      {
        "date": "2021-03-09T14:12:00.000Z",
        "voteCount": 2,
        "content": "yeah, but once it pass that override matches with the rule 2, so external user won't ever access to file1. \nI will expect similar questions for DLP, hope they will much clear than here. It hasn't sense the thirth policy and nobody will access to Label2 files."
      },
      {
        "date": "2021-02-18T14:57:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/microsoft-365/compliance/sensitivity-labels?view=o365-worldwide a doc can have both a retention lanel and sensitivy label. Given Doc 2 has both labels (and this is possible as DLP can use retention or senstivity labels) then both policy 1 and 2 apply to Doc 2. Then most restrictive setting applies ie Policy 2. Block all access"
      },
      {
        "date": "2021-02-11T21:31:00.000Z",
        "voteCount": 2,
        "content": "I agree with the answer (Yes-No-No). One small thing is that each file can only have one sensitivity label. It is not possible for File2 has both Labe1 and Label2 applied."
      },
      {
        "date": "2021-02-08T16:33:00.000Z",
        "voteCount": 2,
        "content": "THere are two parts to this Question : One is Rules and Other is Priority. If multiple rules are there with same priority then most restrictive should apply. However if the priorities are different then 0 highest priority will be applied. It appears the priority will take a more importance here 1st. So the answer seems to be correct. If someone can test that will be great."
      },
      {
        "date": "2021-01-23T13:35:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide\nWhen content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the rules are processed in priority order and the most restrictive action is enforced. For example, if content matches all of the following rules, Rule 3 is enforced because it's the highest priority, most restrictive rule:\n\nRule 1: only notifies users\n\nRule 2: notifies users, restricts access, and allows user overrides\n\nRule 3: notifies users, restricts access, and does not allow user overrides\n\nRule 4: only notifies users\n\nRule 5: restricts access\n\nRule 6: notifies users, restricts access, and does not allow user overrides"
      },
      {
        "date": "2021-01-14T06:43:00.000Z",
        "voteCount": 3,
        "content": "Answer is no no no. In black and white from MS Docs \"When content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the rules are processed in priority order and the most restrictive action is enforced.\" \n\nThis states regardless of priority if a label matches multiple rules the most restriction is enforced."
      },
      {
        "date": "2020-10-06T16:53:00.000Z",
        "voteCount": 1,
        "content": "Yes-No-Yes\nLabel one has override On\nLabel one condition is only for external users so label two applies for internal users\nLabel two blocks access for everyone"
      },
      {
        "date": "2020-12-07T07:53:00.000Z",
        "voteCount": 5,
        "content": "But rule 1 applies to both Labels and has Piroty 1, which means it is king of the hill. Renders the other rules applying to the labels useless.\n\nRule 2:\n-Conditions: Label1 or Label2\n-Actions: Restrict access to the content\n-Priority: 1\n\nAll Files are covered by label 1 and 2 therefore ain't nobody getting their paws on the files.\n\nNo, No, No.\n\nx"
      },
      {
        "date": "2021-03-09T14:07:00.000Z",
        "voteCount": 1,
        "content": "I'm with you too"
      },
      {
        "date": "2020-09-24T13:24:00.000Z",
        "voteCount": 5,
        "content": "I'm convinced that all 3 options are NO as they match the most restrictive rule despite the priority order.     \n\n\"When content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the rules are processed in priority order and the most restrictive action is enforced.\"\n \nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide"
      },
      {
        "date": "2020-06-27T15:16:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct. If Microsoft 365 docs talk about it. The use can justify and send, share or modify the content. See here: https://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide"
      },
      {
        "date": "2020-09-17T09:39:00.000Z",
        "voteCount": 3,
        "content": "Rule 2 in the question is the most restrictive which is in turn enforced for this scenario and it also doesn’t allow user override. Therefore, the answer would be NO-NO-NO."
      },
      {
        "date": "2020-06-26T03:55:00.000Z",
        "voteCount": 3,
        "content": "all No's unless there is a typo in the question."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81550-exam-ms-500-topic-3-question-2-discussion/",
    "body": "You have a Microsoft 365 subscription for a company named Contoso, Ltd. All data is in Microsoft 365.<br>Contoso works with a partner company named Litware, Inc. Litware has a Microsoft 365 subscription. Microsoft OneDrive has the default settings.<br>You need to allow users at Contoso to share files from Microsoft OneDrive to specific users at Litware.<br>Which two actions should you perform from the OneDrive admin center? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the permission level for OneDrive External sharing to be more restrictive.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Device access settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the permission level for OneDrive External sharing to be less restrictive.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange the permissions for OneDrive External sharing to the least permissive level.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Sync settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the Links settings.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AF",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AF",
        "count": 15,
        "isMostVoted": true
      },
      {
        "answer": "CF",
        "count": 5,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-27T05:49:00.000Z",
        "voteCount": 9,
        "content": "A and F:\nWhy A: Under External sharing, specify your sharing level for SharePoint and OneDrive. The default level for both is \"Anyone.\"\nfound this at https://learn.microsoft.com/en-us/sharepoint/turn-external-sharing-on-or-off"
      },
      {
        "date": "2022-09-10T07:00:00.000Z",
        "voteCount": 8,
        "content": "I dont agree with A and E answer. Requirement is: \"allow users at Contoso to share files from Microsoft OneDrive to specific users at Litware.\" So: in SP admin center we need to C) set \"external sharing\" options for OneDrive to more permissive and then F) edit \"file and folders\" to \"specific people\". Thoughts?"
      },
      {
        "date": "2022-09-13T03:25:00.000Z",
        "voteCount": 4,
        "content": "I'd also go with C and F"
      },
      {
        "date": "2022-09-20T03:53:00.000Z",
        "voteCount": 2,
        "content": "A agree, see this article. C and F:\nhttps://support.microsoft.com/en-us/office/external-or-guest-sharing-in-onedrive-sharepoint-and-lists-7aa070b8-d094-4921-9dd9-86392f2a79e7"
      },
      {
        "date": "2023-06-27T20:04:00.000Z",
        "voteCount": 1,
        "content": "A. Configure the permission level for OneDrive External sharing to be more restrictive.=&gt;BECAUSE THE DEFAULT SETTINGS FOR ONE DRIVE AND SHAREPOINT EXTERNAL SHARING IS anyone so is the most permissive option we need to make is more restrictive to get to Guest users \nF. Modify the Links settings."
      },
      {
        "date": "2023-06-24T18:13:00.000Z",
        "voteCount": 2,
        "content": "The correct answers are C. Configure the permission level for OneDrive External sharing to be less restrictive and F. Modify the Links settings.\n\nTo allow users at Contoso to share files from Microsoft OneDrive to specific users at Litware, you need to configure the permission level for OneDrive External sharing to be less restrictive. This will allow users at Contoso to share files with users at Litware who are not in their organization.\n\nYou also need to modify the Links settings to allow users at Contoso to create links to shared files that can be accessed by users at Litware."
      },
      {
        "date": "2023-06-24T18:13:00.000Z",
        "voteCount": 1,
        "content": "he other options are incorrect.\n\nOption A, Configure the permission level for OneDrive External sharing to be more restrictive, is incorrect because this would prevent users at Contoso from sharing files with users at Litware.\nOption B, Modify the Device access settings, is incorrect because this setting is used to control which devices can access OneDrive. It does not affect the sharing of files with external users.\nOption D, Change the permissions for OneDrive External sharing to the least permissive level, is incorrect because this would prevent users at Contoso from sharing files with any external users.\nOption E, Modify the Sync settings, is incorrect because this setting is used to control how files are synced between OneDrive and your devices. It does not affect the sharing of files with external users.\nTherefore, the correct answers are C and F."
      },
      {
        "date": "2023-04-10T03:33:00.000Z",
        "voteCount": 1,
        "content": "In summary, by configuring the permission level for OneDrive External sharing to be less restrictive and modifying the Links settings, users at Contoso can securely share files with specific users at Litware from Microsoft OneDrive.\n\nCorrect answers should be: C &amp; F"
      },
      {
        "date": "2023-04-06T14:15:00.000Z",
        "voteCount": 1,
        "content": "I guess more restrictive ( least permissive on sharepoint document) allow only the member of the organization to access, to be able to add external it has to be less restrictive, I assume thats  not the requirements, so A is not part of the solution here."
      },
      {
        "date": "2023-01-28T16:20:00.000Z",
        "voteCount": 2,
        "content": "A,F - More restrictive, since they want to restrict access to specific users you must use additional settings which increase restrictions."
      },
      {
        "date": "2022-12-19T11:07:00.000Z",
        "voteCount": 1,
        "content": "I would go with C and F"
      },
      {
        "date": "2022-11-01T02:43:00.000Z",
        "voteCount": 5,
        "content": "Agree with A and F"
      },
      {
        "date": "2022-09-30T11:32:00.000Z",
        "voteCount": 2,
        "content": "Same, need to modify the link settings"
      },
      {
        "date": "2022-09-29T14:48:00.000Z",
        "voteCount": 2,
        "content": "No need to explain myself. I've the same things to say as other who voted the same options."
      },
      {
        "date": "2022-09-29T07:42:00.000Z",
        "voteCount": 2,
        "content": "A. Configure the permission level for OneDrive External sharing to be more restrictive.\nF. Modify the Links settings."
      },
      {
        "date": "2022-09-27T05:49:00.000Z",
        "voteCount": 4,
        "content": "A and F, default policy is allow all connections."
      },
      {
        "date": "2022-09-23T04:25:00.000Z",
        "voteCount": 2,
        "content": "I would say A and F.\nDefault settings is everyoney:\nhttps://learn.microsoft.com/en-us/sharepoint/turn-external-sharing-on-or-off#change-the-organization-level-external-sharing-setting"
      },
      {
        "date": "2022-09-21T04:27:00.000Z",
        "voteCount": 2,
        "content": "C,F. The requirement is to make sharing less restrictive."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47114-exam-ms-500-topic-3-question-3-discussion/",
    "body": "You have a Microsoft 365 subscription.<br>Some users access Microsoft SharePoint Online from unmanaged devices.<br>You need to prevent the users from downloading, printing, and syncing files.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-SPOTenant cmdlet and specify the -ConditionalAccessPolicy parameter.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the SharePoint admin center, configure the secure control settings.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Azure portal, create an Azure Active Directory (Azure AD) Identity Protection sign-in risk policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Azure portal, create an Azure AD Identity Protection user risk policy."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 7,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-05-27T08:28:00.000Z",
        "voteCount": 1,
        "content": "This command would work too:\nSet-SPOTenant -ODFBrowserEnabled $false"
      },
      {
        "date": "2023-05-27T08:24:00.000Z",
        "voteCount": 1,
        "content": "I think this is A, specifically, the command being:\nSet-SPOTenant -ConditionalAccessPolicy 'Strict'"
      },
      {
        "date": "2023-04-19T15:18:00.000Z",
        "voteCount": 2,
        "content": "Correct answer A.\n\nIn summary, using the Set-SPOTenant cmdlet with the -ConditionalAccessPolicy parameter allows you to configure a policy that controls access to SharePoint Online based on various conditions, including device status and compliance."
      },
      {
        "date": "2023-04-03T23:44:00.000Z",
        "voteCount": 1,
        "content": "Selected Answer: B\n\nSign in to the Microsoft 365 admin center with your admin credentials.\nIn the left navigation pane, click on \"Admin centers\" and then click on \"SharePoint\".\nIn the SharePoint admin center, click on \"Policies\" in the left navigation pane.\nClick on \"Device access\" in the Policies section.\nCheck the box next to \"Block access to Office applications from browsers on devices that don't meet the compliance policy\" to prevent users from accessing SharePoint from unmanaged devices.\nCheck the box next to \"Block download\" to prevent users from downloading files from SharePoint.\nCheck the box next to \"Block printing\" to prevent users from printing files from SharePoint.\nCheck the box next to \"Block syncing\" to prevent users from syncing files from SharePoint."
      },
      {
        "date": "2023-04-03T23:47:00.000Z",
        "voteCount": 1,
        "content": "My bad \nAnswer is A =&gt; secure control settings not Policies"
      },
      {
        "date": "2022-12-22T08:26:00.000Z",
        "voteCount": 1,
        "content": "Check the link below. It shows how you can use the Set-SPOTenant cmdlet to prevent editing and allow preview files only. It seems its limited to office files, witch is not stated in the question. With the options available, i think A is the best option."
      },
      {
        "date": "2022-12-22T08:26:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-US/sharepoint/control-access-from-unmanaged-devices#block-or-limit-access-to-specific-sharepoint-site-collections-or-onedrive-accounts:~:text=Advanced%20configurations.-,Advanced%20configurations,-The%20following%20parameters"
      },
      {
        "date": "2022-11-24T10:24:00.000Z",
        "voteCount": 3,
        "content": "I would like B, from the SharePoint admin center &gt; policies &gt; Access control &gt; Unmanaged devices option is there,"
      },
      {
        "date": "2022-12-11T22:02:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-US/sharepoint/control-access-from-unmanaged-devices#block-or-limit-access-to-specific-sharepoint-site-collections-or-onedrive-accounts"
      },
      {
        "date": "2023-02-08T08:25:00.000Z",
        "voteCount": 2,
        "content": "Except that answer B states \"secure control settings\", not \"Access Control\"... answer A is the PowerShell version of your answer"
      },
      {
        "date": "2022-10-02T10:02:00.000Z",
        "voteCount": 3,
        "content": "I still think its Conditional Access, the key beeing \"You need to prevent the users from downloading, printing, and syncing files.\" No where does it says to block their access and as far as I can tell in \"unmanaged device\" in sharpoint you only have 3 options\nAllow full acces\nAllow limited, web-only access\nBlock access\n\nSo I sould still go with A"
      },
      {
        "date": "2022-08-23T10:47:00.000Z",
        "voteCount": 3,
        "content": "At first I was also for A as Conditional Access looked as a proper selection, but then I opened Sharepoint Admin center -&gt; Policies -&gt; Access Control and the first option is Unmanaged devices\nRestrict access from devices that aren't compliant or joined to a domain."
      },
      {
        "date": "2022-07-31T00:12:00.000Z",
        "voteCount": 3,
        "content": "B. From the SharePoint admin center, configure the secure control settings."
      },
      {
        "date": "2022-07-31T00:14:00.000Z",
        "voteCount": 1,
        "content": "as for the above it says secure control settings. It need to be as access control settings. Hence the correct answer is A"
      },
      {
        "date": "2021-12-01T05:39:00.000Z",
        "voteCount": 2,
        "content": "A is correct!"
      },
      {
        "date": "2021-11-21T11:31:00.000Z",
        "voteCount": 1,
        "content": "As a SharePoint or global admin in Microsoft 365, you can block or limit access to SharePoint and OneDrive content from unmanaged devices using - Access control page of the SharePoint admin center.\n\nNote-\nIf you want to expand control of unmanaged devices beyond SharePoint, you can Create an Azure Active Directory conditional access policy for all apps and services in your organization instead.\n\nSince question asks only for Sharepoint setting with with SPO Admin center access control setting is good enough."
      },
      {
        "date": "2021-03-14T15:39:00.000Z",
        "voteCount": 2,
        "content": "I would select A, because in SPO admin center is really called \"access controls\" which was correctly named in another similar question.\nhttps://www.examtopics.com/discussions/microsoft/view/9396-exam-ms-500-topic-3-question-27-discussion/\n\nBtw, seems this is something that you can already configure directly with Conditional Access.We will see how they spell it."
      },
      {
        "date": "2021-03-25T12:11:00.000Z",
        "voteCount": 2,
        "content": "The question you saw with a similar answer was calling  AssignmentCollection which is not a option for this command\n\nSo this answer is correct IMO"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46741-exam-ms-500-topic-3-question-4-discussion/",
    "body": "HOTSPOT -<br>You have the Microsoft Azure Information Protection conditions shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0023600001.png\" class=\"in-exam-image\"><br>You have the Azure Information Protection labels shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0023600002.png\" class=\"in-exam-image\"><br>You have the Azure Information Protection policies shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0023600003.png\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0023700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0023700002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-12T09:48:00.000Z",
        "voteCount": 28,
        "content": "correct - https://docs.microsoft.com/en-us/azure/information-protection/configure-policy-delete-reorder. \"If you configure conditions for your labels that might apply to more than one label, you must order the labels from least sensitive to most sensitive. This ordering ensures that the most sensitive label is applied when the conditions are evaluated.\"\nso:\n1)Label 1 and Label 2 are triggered but Label 2 is the last in the policies so most sensitive so applied in priority, it wons over Label 1 so NO\n2)same, Label 2 wons so YES\n3)Label 2 is based on Condition 2 which is case sensitive so NO"
      },
      {
        "date": "2022-01-03T23:14:00.000Z",
        "voteCount": 1,
        "content": "Hi,\n1. I agree with you label 2 applies but i see no difference between label1 and label2 (would say yes for label1 AND label2)"
      },
      {
        "date": "2022-01-03T23:15:00.000Z",
        "voteCount": 1,
        "content": "miss read, forget"
      },
      {
        "date": "2021-06-13T10:50:00.000Z",
        "voteCount": 1,
        "content": "This is correct. Here is the supporting article. \nhttps://docs.microsoft.com/en-us/azure/information-protection/configure-policy-delete-reorder"
      },
      {
        "date": "2021-03-15T13:45:00.000Z",
        "voteCount": 2,
        "content": "Agree. NO, YES, NO."
      },
      {
        "date": "2021-03-15T16:39:00.000Z",
        "voteCount": 3,
        "content": "Do you care to explain the “Priority” you mentioned? The question has no mention of priority so I curious why you mentioned it."
      },
      {
        "date": "2021-03-21T03:50:00.000Z",
        "voteCount": 3,
        "content": "That's the purpose of the third table. There the priority order is listed."
      },
      {
        "date": "2021-12-01T05:57:00.000Z",
        "voteCount": 1,
        "content": "N, Y, N is correct!"
      },
      {
        "date": "2021-11-21T12:14:00.000Z",
        "voteCount": 2,
        "content": "Correct answers. N,Y,N\nLabels are ordered in increasing sensitivity so that users see the least sensitive label first and the most sensitive label last. Here Policy1 is LS and Policy2 is MS. So when both labels apply then MS label wins.\n\nhttps://docs.microsoft.com/en-us/azure/information-protection/configure-policy-delete-reorder. \n\"If you configure conditions for your labels that might apply to more than one label, you must order the labels from least sensitive to most sensitive. This ordering ensures that the most sensitive label is applied when the conditions are evaluated.\"\nso:\n1)Label 1 and Label 2 are triggered but Label 2 is the last in the policies so most sensitive so applied in priority, it wons over Label 1 so NO\n2)same, Label 2 wons so YES\n3)Label 2 is based on Condition 2 which is case sensitive so NO"
      },
      {
        "date": "2021-05-26T04:13:00.000Z",
        "voteCount": 1,
        "content": "If you configure conditions for your labels that might apply to more than one label, you must order the labels from least sensitive to most sensitive. This ordering ensures that the most sensitive label is applied when the conditions are evaluated."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47229-exam-ms-500-topic-3-question-5-discussion/",
    "body": "HOTSPOT -<br>Your company has a Microsoft 365 subscription, a Microsoft Azure subscription, and an Azure Active Directory (Azure AD) tenant named contoso.com.<br>The company has the offices shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0023800001.png\" class=\"in-exam-image\"><br>The tenant contains the users shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0023800002.png\" class=\"in-exam-image\"><br>You create the Microsoft Cloud App Security policy shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04320/0023900001.jpg\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0024000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0024000002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-21T12:26:00.000Z",
        "voteCount": 22,
        "content": "1st answer is wrong.. Rest two answers are right.\nRight answers are - N, Y, N\n\nThe IPs should be all the public IP addresses of your internal network, your branch offices, and your Wi-Fi roaming addresses.\nRef# https://docs.microsoft.com/en-us/cloud-app-security/ip-tags\n\n10.10.0.0/24 is private IP space, people in the montreal access to system by 190.15.1.0/24 IP address space. So for CAS setting you must add its public IP address (If you add its private address it won't work)."
      },
      {
        "date": "2021-12-29T17:05:00.000Z",
        "voteCount": 4,
        "content": "Based on this article https://docs.microsoft.com/en-us/defender-cloud-apps/policies-threat-protection - the published answer should be correct - Y, Y, N. You can define internal IP address ranges"
      },
      {
        "date": "2022-03-03T02:31:00.000Z",
        "voteCount": 3,
        "content": "I have looked at my production logs, I did find IPs with the tag \"INTERNAL NETWORK IP\" (my search was based on \"raw IP starts with 10.\") but I was not able to relate those IPs with my infrastructure IPs, and only some apps were reporting them (Teams and Office).\nI'm not sure how these Internal IPs work since you can not tell what was the external IP used. I would still go with the NYN suggested by the other people"
      },
      {
        "date": "2021-07-22T07:54:00.000Z",
        "voteCount": 5,
        "content": "N-Y-N  only if you have an internal server you could use the internal ip ranges"
      },
      {
        "date": "2022-08-11T00:03:00.000Z",
        "voteCount": 2,
        "content": "I am not sure we every one argues about no#1 from internal vs. external IP address are allowed. From my perspective, we should determine is downloading 40 files in 30 seconds  considered 1 action in 30 seconds or 40 actions in 30 seconds? It is NO, because, as I believe, it is considered 1 action in 30 seconds that is why the policy won't trigger alerts. \n\nThe second question might shed some lights. The case is the user downloads 1 file per second. The question was very specific to tell us that \"file per second\" is considered one action like \"40 files in 30 seconds\"; they are both one action."
      },
      {
        "date": "2022-05-19T23:31:00.000Z",
        "voteCount": 2,
        "content": "It all comes down to wich IP address the Cloud Security App ploicy is detecting, when they say \"RAW IP\" What IP is this? Public or Internal?"
      },
      {
        "date": "2022-03-20T17:47:00.000Z",
        "voteCount": 1,
        "content": "Here's my problem; why give the internal IP's of the different offices and the NAT address, if what matters is the NAT IP? And what does \"Raw IP Address\" mean? I have found shockingly little information about raw IP addresses. But here's what I found.\n\nFrom MS (https://docs.microsoft.com/en-us/defender-cloud-apps/activity-filters-queries#:~:text=Raw%20IP%20address%20-%20Enables%20you%20to%20search,example%2C%20all%20activities%20from%20administrative%20IP%20address%20range.) \n\"Raw IP address - Enables you to search for activities that were performed on or by raw IP addresses...\""
      },
      {
        "date": "2022-03-20T17:47:00.000Z",
        "voteCount": 2,
        "content": "And from (https://www.restaurantnorman.com/what-is-a-raw-ip-packet/) \nThe Raw IP interface lets a client program send and receive arbitrary IP packets on any IP protocol except TCP and UDP. Only clients in the obey list can use the Raw IP interface.\n\nThe headers of IP , TCP or UDP protocols are automatically created by the O.S, using information provided by the application (IP address, port numbers, and protocol family).\n\nSo, this leaves me to think that the internal IP of the users in the different locations are encapsulated in the NAT IP. Then the CAS policy strips all that away and gets the internal IP. \n\nIf this is the case the answer is Y/N/N. Which is what I'm going with.\n\n*shrug*"
      },
      {
        "date": "2022-03-07T05:05:00.000Z",
        "voteCount": 1,
        "content": "The 2nd one might also be N, as it mentions 'an alert', where for 2 minutes 2 would actually be created; I guess the question's wording is deliberately vague, as in many other cases."
      },
      {
        "date": "2021-12-01T05:59:00.000Z",
        "voteCount": 3,
        "content": "N, Y, N is correct!"
      },
      {
        "date": "2021-06-26T14:35:00.000Z",
        "voteCount": 3,
        "content": "I was a bit suspect about the first response being yes, but based on this it appears that you CAN use internal IP ranges in these policies:\nhttps://docs.microsoft.com/en-us/cloud-app-security/ip-tags"
      },
      {
        "date": "2021-03-15T13:53:00.000Z",
        "voteCount": 1,
        "content": "I would say is correct as both first matches with defined IP ranges in the activity scope. The third as isn't included won't raise any alert."
      },
      {
        "date": "2021-03-21T11:15:00.000Z",
        "voteCount": 7,
        "content": "I dont get it :( 10.10.0.0/24 is private IP space, people in the montreal access to system by 190.15.1.0/24 IP address space. How MCAS is gonna notice that?"
      },
      {
        "date": "2021-04-13T01:15:00.000Z",
        "voteCount": 2,
        "content": "You can conntect MCAS to your Firwall/Proxy or use Defender for Endpoint. So they should also know your private IP"
      },
      {
        "date": "2021-05-22T21:53:00.000Z",
        "voteCount": 10,
        "content": "You assume too many things .."
      },
      {
        "date": "2021-11-21T12:26:00.000Z",
        "voteCount": 1,
        "content": "Yes dont just assume. Please read the doc... its N for 1st one."
      },
      {
        "date": "2021-06-26T06:28:00.000Z",
        "voteCount": 2,
        "content": "I think cicekadam is correct. Correct answer must be N-Y-N."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46742-exam-ms-500-topic-3-question-6-discussion/",
    "body": "A user stores the following files in Microsoft OneDrive:<br>✑ File.docx<br>✑ ImportantFile.docx<br>✑ File_Important.docx<br>You create a Microsoft Cloud App Security file policy Policy1 that has the filter shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04320/0024100004.png\" class=\"in-exam-image\"><br>To which files does Policy1 apply?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile_Important.docx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile.docx, ImportantFile.docx, and File_Important.docx",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile.docx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImportantFile.docx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile.docx and File_Important.docx only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "E",
    "answerDescription": "",
    "votes": [
      {
        "answer": "E",
        "count": 17,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 9,
        "isMostVoted": false
      },
      {
        "answer": "C",
        "count": 9,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-05-04T08:11:00.000Z",
        "voteCount": 29,
        "content": "Based on the  article I would go with E"
      },
      {
        "date": "2021-06-13T10:59:00.000Z",
        "voteCount": 4,
        "content": "Agree. Supporting excerpt: \n\"When using the file policy filters, Contains will search only for full words – separated by comas, dots, spaces or underscores to search.\""
      },
      {
        "date": "2022-03-03T03:12:00.000Z",
        "voteCount": 6,
        "content": "Just tested, it caches all.\nThe article might have been rewritten to explain the quotation marks usage:\n \"Spaces between words function like OR. For example, if you search for malware virus it will find all files with either malware or virus in the name, so it will find both malware-virus.exe and virus.exe.\"\n+ \"If you want to search for a string, enclose the words in quotation marks. This functions like AND. For example, if you search for \"malware\" \"virus\", it will find virus_malware_file.exe but it will not find malwarevirusfile.exe and it will not find malware.exe. However, it will search for the exact string. If you search for \"malware virus\", it will not find \"virus\" or \"virus_malware\".\""
      },
      {
        "date": "2021-07-15T08:47:00.000Z",
        "voteCount": 5,
        "content": "Here is another link with slightly different wording. And again suggests E is the correct answer.\nhttps://docs.microsoft.com/en-us/cloud-app-security/data-protection-policies\n\"When using the policy filters, Contains searches only for full words – separated by comas, dots, spaces, or underscores. For example if you search for malware or virus, it finds virus_malware_file.exe but it does not find malwarevirusfile.exe\""
      },
      {
        "date": "2022-03-19T16:03:00.000Z",
        "voteCount": 1,
        "content": "\"separated by commas, DOTS,\" etc. File.(\"dot\")docx"
      },
      {
        "date": "2022-03-09T00:52:00.000Z",
        "voteCount": 4,
        "content": "there are 2 MS docos - one says underscores and the other doesn't. This is very confusing - Microsoft need to lift their game."
      },
      {
        "date": "2021-04-22T12:54:00.000Z",
        "voteCount": 19,
        "content": "I just tested and the right answer is C"
      },
      {
        "date": "2021-06-09T09:09:00.000Z",
        "voteCount": 4,
        "content": "I have to agree with you PHARDY. Tested this as well in my tenant and C was the answer for me."
      },
      {
        "date": "2022-09-25T10:36:00.000Z",
        "voteCount": 2,
        "content": "Agree with PHARDY. Docs are wrong about the \"_\" being a word separator. It will find File.doc, but NOT File_Something.doc."
      },
      {
        "date": "2023-05-24T08:21:00.000Z",
        "voteCount": 1,
        "content": "C is the correct"
      },
      {
        "date": "2023-05-22T05:00:00.000Z",
        "voteCount": 2,
        "content": "Based on the article I would go with E"
      },
      {
        "date": "2023-04-21T08:55:00.000Z",
        "voteCount": 1,
        "content": "When using a file directive, it will only search for whole words, the correct answer is C."
      },
      {
        "date": "2023-04-04T00:05:00.000Z",
        "voteCount": 1,
        "content": "Selected Answer : B\nThe documentation is talking about when giving multiple words =&gt; it will seek for these same words even when it's dot, underscore ... separed."
      },
      {
        "date": "2023-03-08T23:14:00.000Z",
        "voteCount": 1,
        "content": "B is correct\n\" Note\n\nWhen using the file policy filters, Contains will search only for full words – separated by commas, dots, hyphens or spaces to search.\n\n    Spaces or hyphens between words function like OR. For example, if you search for malware virus it will find all files with either malware or virus in the name, so it will find both malware-virus.exe and virus.exe.\n    If you want to search for a string, enclose the words in quotation marks. This functions like AND. For example, if you search for \"malware\" \"virus\", it will find virus_malware_file.exe but it will not find malwarevirusfile.exe and it will not find malware.exe. However, it will search for the exact string. If you search for \"malware virus\", it will not find \"virus\" or \"virus_malware\".\n\nEquals will search only for the complete string. For example, if you search for malware.exe it will find malware.exe but not malware.exe.txt.\"\n\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/file-filters?source=recommendations"
      },
      {
        "date": "2023-03-08T16:57:00.000Z",
        "voteCount": 1,
        "content": "When using the file policy filters, Contains will search only for full words – separated by commas, dots, hyphens or spaces to search.\n\n    Spaces or hyphens between words function like OR. For example, if you search for malware virus it will find all files with either malware or virus in the name, so it will find both malware-virus.exe and virus.exe.\n    If you want to search for a string, enclose the words in quotation marks. This functions like AND. For example, if you search for \"malware\" \"virus\", it will find virus_malware_file.exe but it will not find malwarevirusfile.exe and it will not find malware.exe. However, it will search for the exact string. If you search for \"malware virus\", it will not find \"virus\" or \"virus_malware\"."
      },
      {
        "date": "2023-02-23T23:19:00.000Z",
        "voteCount": 1,
        "content": "it's very confusing even with microsoft KB. Test Result is C.   This questing looks like \"English\" Test :) .. I hate this kind of questions."
      },
      {
        "date": "2023-01-27T12:30:00.000Z",
        "voteCount": 1,
        "content": "I bought a compliance E5 license today and managed to do some testing with the proper policy. \nAccording to article I would say E. \nbut my test shows that underscore is not working. comma, space, dot and hyphen all work as described in article. so I am at a loss hopefully I don't get this question on the exam. but B is for sure wrong."
      },
      {
        "date": "2023-01-27T12:30:00.000Z",
        "voteCount": 1,
        "content": "C is my answer not B -.-"
      },
      {
        "date": "2023-01-26T12:54:00.000Z",
        "voteCount": 1,
        "content": "according to the referenced article I would go B. but have done some testing. with a file policy I get zero matches. but with a session control it takes all files. made like this: \nhttps://www.youtube.com/watch?v=nGg2XyQWJ4o&amp;t=115s&amp;ab_channel=Microsoft365\n\nso very confused but would say answer is correct"
      },
      {
        "date": "2023-01-26T12:55:00.000Z",
        "voteCount": 1,
        "content": "meant E according to referenced article"
      },
      {
        "date": "2023-01-18T09:06:00.000Z",
        "voteCount": 1,
        "content": "filter=contains so it will only return full words"
      },
      {
        "date": "2023-01-17T04:23:00.000Z",
        "voteCount": 1,
        "content": "as per the article's Note:\nWhen using the policy filters, Contains searches only for full words – separated by commas, dots, spaces, or underscores. For example if you search for malware or virus, it finds virus_malware_file.exe but it does not find malwarevirusfile.exe. If you search for malware.exe, then you find ALL files with either malware or exe in their filename, whereas if you search for \"malware.exe\" (with the quotation marks) you find only files that contain exactly \"malware.exe\". Equals searches only for the complete string, for example if you search for malware.exe it finds malware.exe but not malware.exe.txt.\nI would go for E"
      },
      {
        "date": "2023-01-11T02:53:00.000Z",
        "voteCount": 1,
        "content": "It is."
      },
      {
        "date": "2023-01-05T08:10:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is B"
      },
      {
        "date": "2023-02-21T01:45:00.000Z",
        "voteCount": 1,
        "content": "When using the policy filters, Contains searches only for full words – separated by commas, dots, spaces, or underscores. For example if you search for malware or virus, it finds virus_malware_file.exe but it does not find malwarevirusfile.exe. If you search for malware.exe, then you find ALL files with either malware or exe in their filename, whereas if you search for \"malware.exe\" (with the quotation marks) you find only files that contain exactly \"malware.exe\".\n\nhttps://learn.microsoft.com/en-us/defender-cloud-apps/data-protection-policies"
      },
      {
        "date": "2022-12-10T01:21:00.000Z",
        "voteCount": 3,
        "content": "When using the file policy filters, Contains will search only for full words – separated by commas, dots, or spaces to search.\n\nSpaces between words function like OR. For example, if you search for malware virus it will find all files with either malware or virus in the name, so it will find both malware-virus.exe and virus.exe.\nIf you want to search for a string, enclose the words in quotation marks. This functions like AND. For example, if you search for \"malware\" \"virus\", it will find virus_malware_file.exe but it will not find malwarevirusfile.exe and it will not find malware.exe. However, it will search for the exact string. If you search for \"malware virus\", it will not find \"virus\" or \"virus_malware\".\nEquals will search only for the complete string. For example, if you search for malware.exe it will find malware.exe but not malware.exe.txt."
      },
      {
        "date": "2022-12-01T03:52:00.000Z",
        "voteCount": 2,
        "content": "I just tested it, waited for more than 48 hours to make sure and the and the outcome was File.docx, that was the only file that matched the policy\nanswer is C"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/49491-exam-ms-500-topic-3-question-7-discussion/",
    "body": "SIMULATION -<br>You need to create an Azure Information Protection label to meet the following requirements:<br>✑ Content must expire after 21 days.<br>✑ Offline access must be allowed for 21 days only.<br>✑ Documents must be protected by using a cloud key.<br>✑ Authenticated users must be able to view content only.<br>To complete this task, sign in to the Microsoft 365 admin center.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. If you haven't already done so, open a new browser window and sign in to the Azure portal. Then navigate to the Azure Information Protection pane.<br>For example, in the search box for resources, services, and docs: Start typing Information and select Azure Information Protection.<br>2. From the Classifications &gt; Labels menu option: On the Azure Information Protection - Labels pane, select the label you want to change.<br>✑ On the Label pane, locate Set permissions for documents and emails containing this label, and select Protect.<br>3. Select Protection.<br>4. On the Protection pane, select Azure (cloud key).<br>5. Select Set permissions to define new protection settings in this portal.<br>6. If you selected Set permissions for Azure (cloud key), this option lets you select users and usage rights.<br>To specify the users that you want to be able to open protected documents and emails, select Add permissions. Then on the Add permissions pane, select the first set of users and groups who will have rights to use the content that will be protected by the selected label:<br>Choose Select from the list where you can then add all users from your organization by selecting Add &lt;organization name&gt; - All members. This setting<br><img src=\"/assets/media/exam-media/04320/0024200006.png\" class=\"in-exam-image\"> excludes guest accounts. Or, you can select Add any authenticated users, or browse the directory.<br>When you choose all members or browse the directory, the users or groups must have an email address. In a production environment, users and groups nearly always have an email address, but in a simple testing environment, you might need to add email addresses to user accounts or groups.<br>✑ Change the File Content Expiration setting to 21 days.<br>✑ Change the Allow offline access setting to 21 days.<br>When you have finished configuring the permissions and settings, click OK.<br>This grouping of settings creates a custom template for the Azure Rights Management service. These templates can be used with applications and services that integrate with Azure Rights Management.<br>7. Click OK to close the Protection pane and see your choice of User defined or your chosen template display for the Protection option in the Label pane.<br>8. On the Label pane, click Save.<br>9. On the Azure Information Protection pane, use the PROTECTION column to confirm that your label now displays the protection setting that you want:<br>✑ A check mark if you have configured protection.<br>✑ An x mark to denote cancellation if you have configured a label to remove protection.<br>✑ A blank field when protection is not set.<br>When you clicked Save, your changes are automatically available to users and services. There's no longer a separate publish option.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/information-protection/configure-policy-protection",
    "votes": [],
    "comments": [
      {
        "date": "2021-10-11T03:22:00.000Z",
        "voteCount": 10,
        "content": "Now in https://complance.microsoft.com/informationprotection\nCreate a label, \nGive name, display name and description\nScope to files &amp; emails\nEncrypt files and emails\nEncryption: Assign permissions now"
      },
      {
        "date": "2022-04-03T00:09:00.000Z",
        "voteCount": 3,
        "content": "I'm afraid at the step: Encrypt files and emails the following is missing:\n- User access to content expires: 21\n- Allow offline access: 21\nAssign permission: AuthenticatedUsers"
      },
      {
        "date": "2022-05-13T06:16:00.000Z",
        "voteCount": 3,
        "content": "I see \"User access to content expires\".  Set \"A number of days after label is applied\".  Set \"Allow offline Access for a number of days\"."
      },
      {
        "date": "2022-08-17T08:10:00.000Z",
        "voteCount": 2,
        "content": "Azure Information Protection labeling and policy management in the Azure Portal, as well as the Azure Protection Classic Client, reached end-of-life on April 1, 2021."
      },
      {
        "date": "2021-08-07T19:15:00.000Z",
        "voteCount": 1,
        "content": "Go to the URL and create a new label with settings as required : https://compliance.microsoft.com/informationprotection?viewid=sensitivitylabels"
      },
      {
        "date": "2021-04-21T00:03:00.000Z",
        "voteCount": 1,
        "content": "Agree with asquate, If you go to the location in the Azure portal it links you off to the Compliance center, where this task should be done"
      },
      {
        "date": "2021-04-08T17:14:00.000Z",
        "voteCount": 3,
        "content": "Labels should be created from Compliance Center, not Azure AIP portal anymore."
      },
      {
        "date": "2021-04-21T01:07:00.000Z",
        "voteCount": 1,
        "content": "you are correct, Azure AIP stopped being supported on 1 April 2021"
      },
      {
        "date": "2021-04-21T12:45:00.000Z",
        "voteCount": 2,
        "content": "yes I cannot change anything from Azure portal, it is read only now,  should be created from Compliance Center"
      },
      {
        "date": "2021-04-07T05:38:00.000Z",
        "voteCount": 2,
        "content": "This works, all the given information is correct."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83681-exam-ms-500-topic-3-question-8-discussion/",
    "body": "You have a Microsoft 365 subscription.<br>You have a Microsoft SharePoint Online site named Site1.<br>You have a Data Subject Request (DSR) case named Case1 that searches Site1.<br>You create a new sensitive information type.<br>You need to ensure that Case1 returns all the documents that contain the new sensitive information type.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft 365 Compliance center, create a new Search by ID List.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Site1, modify the search dictionary.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft 365 Compliance center, create a new Content search.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Site1, initiate a re-indexing of Site1."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-05-20T09:44:00.000Z",
        "voteCount": 2,
        "content": "C - In case anyone, went down the wrong path like me, this is a new Sensitive Information type and not a Sensitivity Label. There is no re-indexing involved."
      },
      {
        "date": "2023-04-10T04:05:00.000Z",
        "voteCount": 2,
        "content": "Option C (From the Microsoft 365 Compliance center, create a new Content search) is the correct answer, as it allows you to search for content across SharePoint Online sites, Exchange Online mailboxes, and OneDrive for Business accounts. By creating a new Content search and including the new sensitive information type in the search criteria, you can ensure that all documents that contain the sensitive information type are returned in the search results."
      },
      {
        "date": "2023-04-01T17:15:00.000Z",
        "voteCount": 1,
        "content": "Iría por C, creando una nueva búsqueda puedo especificar el tipo de contenido a buscar."
      },
      {
        "date": "2023-03-21T07:44:00.000Z",
        "voteCount": 1,
        "content": "I vote for C"
      },
      {
        "date": "2023-03-12T05:12:00.000Z",
        "voteCount": 1,
        "content": "It's C, https://learn.microsoft.com/en-us/compliance/regulatory/gdpr-dsr-office365#using-the-content-search-ediscovery-tool-to-respond-to-dsrs"
      },
      {
        "date": "2023-03-05T11:46:00.000Z",
        "voteCount": 1,
        "content": "The answer should probably be C because a search based on the new sensitive information type is needed, but was not performed yet."
      },
      {
        "date": "2022-09-26T06:20:00.000Z",
        "voteCount": 4,
        "content": "Here's a useful reference link:\nhttps://learn.microsoft.com/en-us/sharepoint/crawl-site-content"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/28444-exam-ms-500-topic-3-question-9-discussion/",
    "body": "SIMULATION -<br>You need to ensure that a user named Allan Deyoung can perform searches and place holds on mailboxes, SharePoint Online sites, and OneDrive for Business locations. The solution must use the principle of least privilege.<br>To complete this task, sign in to the Microsoft 365 admin center.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. After signing in to the Microsoft 365 admin center, navigate to the Security &amp; Compliance Center.<br>2. In the left pane of the security and compliance center, select Permissions, and then select the checkbox next to eDiscovery Manager.<br>3. On the eDiscovery Manager flyout page, do one of the following based on the eDiscovery permissions that you want to assign.<br>To make a user an eDiscovery Manager: Next to eDiscovery Manager, select Edit. In the Choose eDiscovery Manager section, select the Choose eDiscovery Manager hyperlink, and then select + Add. Select the user (or users) you want to add as an eDiscovery manager, and then select Add. When you're finished adding users, select Done. Then, on the Editing Choose eDiscovery Manager flyout page, select Save to save the changes to the eDiscovery Manager membership.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/assign-ediscovery-permissions?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-04T03:19:00.000Z",
        "voteCount": 1,
        "content": "Agree with e-discovery manage. Just to make it more complicated now you can set this permissions also in Microsoft 365 --&gt; Permissions --&gt; E-mail &amp; Collaboration --&gt; Roles"
      },
      {
        "date": "2022-02-03T06:17:00.000Z",
        "voteCount": 4,
        "content": "Compliance &gt; Permissions &gt; Roles &gt; e-discovery manager - Description - searches and place holds on mailboxes, SharePoint Online sites, and OneDrive for Business locations"
      },
      {
        "date": "2022-01-11T18:46:00.000Z",
        "voteCount": 2,
        "content": "e-Discover Manager is the correct and least-privileged option to do what is asked, as they have all the same capabilities as an Admin, but only within the cases they themselves create.\nSource:\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/assign-ediscovery-permissions?view=o365-worldwide#rbac-roles-related-to-ediscovery"
      },
      {
        "date": "2021-05-26T05:43:00.000Z",
        "voteCount": 1,
        "content": "Out of both, the least priveleged - E-discovery manager\nCompliance-Permissions-Compliance center roles- Edit eDiscovery Manager- Select Member"
      },
      {
        "date": "2021-03-14T15:54:00.000Z",
        "voteCount": 2,
        "content": "If needs to follow PoLP, eDiscovery Manager is the right answer. \nCompliance Administrator is practically full-admin in the old and new SCC."
      },
      {
        "date": "2021-01-27T20:27:00.000Z",
        "voteCount": 1,
        "content": "The answer is E-Discovery manager as it can only view and edit all cases to which it has access?"
      },
      {
        "date": "2021-01-27T20:33:00.000Z",
        "voteCount": 1,
        "content": "Scratch that, The compliance administrator is the right answer. It has the capability to search and place a mailbox on hold only."
      },
      {
        "date": "2020-11-02T03:37:00.000Z",
        "voteCount": 3,
        "content": "Members can perform searches and place holds on mailboxes, SharePoint Online sites, and OneDrive for Business locations. Members can also create and manage eDiscovery cases, add and remove members to a case, create and edit Content Searches associated with a case, and access case data in Advanced eDiscovery.\n\nhttps://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/permissions-in-the-security-and-compliance-center?view=o365-worldwide\n\nAnswer is correct: eDiscovery Manger"
      },
      {
        "date": "2020-08-13T03:27:00.000Z",
        "voteCount": 1,
        "content": "Surely Compliance Administrator follows principal of least privilege\nCompliance Administrator can Search and place Holds"
      },
      {
        "date": "2020-09-26T20:03:00.000Z",
        "voteCount": 1,
        "content": "The e-discovery manager role only shows in the Office 365 protection.microsoft portal and not in the newer MS365 compliance/security portals.\nTherefore I would choose Compliance Administrator also.\nAccording to the link below.\nAn eDiscovery Administrator is a member of the eDiscovery Manager role group...\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/assign-ediscovery-permissions?view=o365-worldwide"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46513-exam-ms-500-topic-3-question-10-discussion/",
    "body": "SIMULATION -<br>You need to prevent any email messages that contain data covered by the U.K. Data Protection Act from being sent to recipients outside of your organization, unless the messages are sent to an external domain named adatum.com.<br>To complete this task, sign in to the Microsoft 365 admin center.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. After signing into the Microsoft 365 admin center, navigate to Compliance Management in the Exchange Admin center.<br>2. Click on ג€Data Loss Preventionג€ option.<br>3. To add a new custom DLP policy, Click on (+) plus button to get the context menu<br>4. Click on ג€New Custom DLP policyג€ option, a new window appears where you have to enter policy name, description, state and mode of the requirement details.<br>Click on save button to create policy and continueג€¦<br>5. You will be back to the ג€Data Loss Preventionג€ screen with newly added policy information.<br>6. Double click on the added row to open the policy details, click on rules option in left part of the screen as depicted<br>7. Click on (+) plus button to add a new rule. Select the ג€Block messages with sensitive informationג€ rule.<br>8. On the following screen, we can add condition, action, exceptions, rule activation and deactivation dates<br><img src=\"/assets/media/exam-media/04320/0024600001.jpg\" class=\"in-exam-image\"><br>9. Click on ג€Select Sensitive information Typesג€ to specify the sensitive information details.<br><img src=\"/assets/media/exam-media/04320/0024700001.png\" class=\"in-exam-image\"><br>10. Click on (+) plus button and add the following Sensitive information Types:<br>✑ U.K. National Insurance Number (NINO<br>✑ U.S. / U.K. Passport Number<br>✑ SWIFT Code<br>11. Click on Ok<br>12. Add an exception for recipients in the adatum.com domain<br>13. Add recipients for incident reports and click ok<br>14. Click save<br>15. Click save<br>Reference:<br>https://events.collab365.community/configure-data-loss-prevention-policies-in-exchange-online-in-office-365/",
    "votes": [],
    "comments": [
      {
        "date": "2021-07-25T06:34:00.000Z",
        "voteCount": 32,
        "content": "Compliance Center --&gt; Create Policy --&gt; Privacy Category --&gt; U.K. Data Protection Act --&gt; Select Exchange Location only --&gt; Create or Customize Advanced DLP Rules --&gt; Edit (on both Low and High volumes) --&gt; Add Exception --&gt; \"Except if recipient domain is\"  --&gt; Add Adatum.com domain to domain exception field and click \"Add\" once complete.  --&gt; Actions --&gt; Restrict Access or Encrypt the content in M365 locations --&gt; Block users from accessing shared SharePoint, OneDrive, and Teams Content in Microsoft 365 locations  (this includes EXO) --&gt; Block only people outside of your organization. --&gt; Save."
      },
      {
        "date": "2022-03-20T19:12:00.000Z",
        "voteCount": 18,
        "content": "This was a sucky question to figure out with all the changes.\n\nGo to:\nM365 Compliance Center &gt; Data Loss Prevention &gt; Create Policy &gt; {Change \"All Countries and Regions to United Kingsom} &gt; Choose the Privacy category &gt; Select \"U.K. Data Protection Act\" &gt; Next &gt; Give it a name is you want &gt; Next &gt; Deselect everything EXCEPT Exchange &gt; Next &gt; SELECT \"Create or customize advanced DLP rules\" &gt; EDIT \"Low volume of content detected U.K. Data Protection Act 2\" &gt; Scroll down to the \"Exceptions\" heading &gt; Click \"Add exception\" &gt; SELECT \"Except if recipient domain is\" &gt; enter \"Adatum.com\" &gt; click the \"Add\" button &gt; click the \"Save\" button. \n\nRepeat for the \"High volume of content detected U.K. Data Protection Act 2\" rule."
      },
      {
        "date": "2021-06-02T22:18:00.000Z",
        "voteCount": 2,
        "content": "Classic Exchange Admin center --&gt; Compliance Management --&gt;press + Button --&gt;New DLP Policy From Template--&gt;choose template \"U.K. Data protect Act\" --&gt;save --&gt; Edit policy --&gt;Rules--&gt;select each rule and add exception using add exception option and go to \"domain is\"  and specify Domain name there"
      },
      {
        "date": "2021-05-24T14:09:00.000Z",
        "voteCount": 2,
        "content": "You cannot use the Compliance Console as you cannot specify specific domains to be excluded.\nThis must be done through Exchange Admin still."
      },
      {
        "date": "2021-07-25T06:05:00.000Z",
        "voteCount": 2,
        "content": "Not true, just tested this in the Compliance Center and you indeed can specify domains to exclude in the rule."
      },
      {
        "date": "2021-04-27T22:54:00.000Z",
        "voteCount": 2,
        "content": "Testing I found out you could use Template \"UK Data Protection Act\" and manually edit policy settings to exclude."
      },
      {
        "date": "2021-03-31T08:04:00.000Z",
        "voteCount": 3,
        "content": "DLP on the new console complice:\nCompliance &gt; Policies &gt; DLP &gt; Create Policy &gt; Custom &gt; etc."
      },
      {
        "date": "2021-03-11T11:06:00.000Z",
        "voteCount": 4,
        "content": "not correct, use new dlp on the new console compliance"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/22017-exam-ms-500-topic-3-question-11-discussion/",
    "body": "SIMULATION -<br>You need to ensure that a user named Allan Deyoung receives incident reports when email messages that contain data covered by the U.K. Data Protection Act are sent outside of your organization.<br>To complete this task, sign in to the Microsoft 365 admin center.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. In the Security &amp; Compliance Center &gt; left navigation &gt; Data loss prevention &gt; Policy &gt; + Create a policy.<br>2. Choose the U.K. Data Protection Act template &gt; Next.<br>3. Name the policy &gt; Next.<br>4. Choose All locations in Office 365 &gt; Next.<br>5. At the first Policy Settings step just accept the defaults,<br>6. After clicking Next, you'll be presented with an additional Policy Settings page<br>Deselect the Show policy tips to users and send them an email notification option.<br>Select the Detect when content that's being shared contains option, and configure the number instances to be 10.<br>Select the Send incident reports in email option.<br>Select the Choose what to include in the report and who receives it link to add Allan Deyoung as a recipient.<br>7. &gt; Next<br>8. Select the option to turn on the policy right away &gt; Next.<br>9. Click Create to finish creating the policy.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/create-test-tune-dlp-policy?view=o365-worldwide https://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide https://docs.microsoft.com/en-us/microsoft-365/compliance/what-the-dlp-policy-templates-include?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-19T20:54:00.000Z",
        "voteCount": 12,
        "content": "I think number of instances also should be 1 instead of 10 as if the number of incidents is less than 10, the user will not receive the incident report"
      },
      {
        "date": "2021-01-27T20:40:00.000Z",
        "voteCount": 2,
        "content": "validpoint"
      },
      {
        "date": "2020-06-03T09:44:00.000Z",
        "voteCount": 9,
        "content": "Why in step 4 'All locations', while the question mentions 'email' only?"
      },
      {
        "date": "2020-06-05T17:05:00.000Z",
        "voteCount": 1,
        "content": "Very good point!"
      },
      {
        "date": "2021-02-05T09:35:00.000Z",
        "voteCount": 8,
        "content": "Correct, it should not be 'All locations', that should be changed to 'Let me choose specific locations', Next, then untick everything except for 'Exchange Email', as the question relates to email"
      },
      {
        "date": "2021-02-09T07:09:00.000Z",
        "voteCount": 1,
        "content": "And what about MS Teams. Can you not send content to external users via Teams??"
      },
      {
        "date": "2021-07-03T21:24:00.000Z",
        "voteCount": 2,
        "content": "\"when email messages that contain data ....\" -&gt; Is Teams the same as email? NO."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43420-exam-ms-500-topic-3-question-12-discussion/",
    "body": "SIMULATION -<br>You need to ensure that a global administrator is notified when a document that contains U.S. Health Insurance Portability and Accountability Act (HIPAA) data is identified in your Microsoft 365 tenant.<br>To complete this task, sign in to the Microsoft Office 365 admin center.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. In the Security &amp; Compliance Center &gt; left navigation &gt; Data loss prevention &gt; Policy &gt; + Create a policy.<br>2. Choose the U.S. Health Insurance Portability and Accountability Act (HIPAA) template &gt; Next.<br>3. Name the policy &gt; Next.<br>4. Choose All locations in Office 365 &gt; Next.<br>5. At the first Policy Settings step just accept the defaults,<br>6. After clicking Next, you'll be presented with an additional Policy Settings page<br>✑ Deselect the Show policy tips to users and send them an email notification option.<br>✑ Select the Detect when content that's being shared contains option, and decrease the number of instances to 1.<br>✑ Select the Send incident reports in email option.<br>7. &gt; Next<br>8. Select the option to turn on the policy right away &gt; Next.<br>9. Click Create to finish creating the policy.<br>References:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/create-test-tune-dlp-policy?view=o365-worldwide https://docs.microsoft.com/en-us/microsoft-365/compliance/data-loss-prevention-policies?view=o365-worldwide https://docs.microsoft.com/en-us/microsoft-365/compliance/what-the-dlp-policy-templates-include?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2022-05-27T14:43:00.000Z",
        "voteCount": 1,
        "content": "just wonder if this can be done from DLP.  it will not be sent but just \"identify\" (locate) the documents with HIPAA in M365.  not sure where do go to accomplish this."
      },
      {
        "date": "2021-09-15T16:42:00.000Z",
        "voteCount": 3,
        "content": "It doesn't matter if \"send incident reports in email\" is greyed out.  The option for \"Send alerts if any of the DLP rules match\" is still there and checked, so Global Admins will be alerted in email.  The simulation doesn't require an incident report, only notification."
      },
      {
        "date": "2021-09-06T14:09:00.000Z",
        "voteCount": 1,
        "content": "On step 5 I had to change to \"Create or Customize advanced DLP rules\" to do the fine grained options, moving forward with the defaults showed the option \"Send incident reports in email\" greyout.\n\nI was still able to activate the \"send alerts if any of the DLP rules match\" but that's not the same thing, although I do not known the difference."
      },
      {
        "date": "2021-04-14T06:14:00.000Z",
        "voteCount": 4,
        "content": "You do not have to select global administrators by default email are send to them."
      },
      {
        "date": "2021-01-27T20:57:00.000Z",
        "voteCount": 2,
        "content": "The steps are correct but when you get to the part to deselect, you need to select instead and make sure you uncheck the all the box that selects all users, owners and select the add tab to include the global administrator account only."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47116-exam-ms-500-topic-3-question-13-discussion/",
    "body": "DRAG DROP -<br>You have a Microsoft 365 subscription.<br>You need to include a custom sensitive information type in Data Subject Request (DSR) cases.<br>Which four actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04320/0025000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0025100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/customize-a-built-in-sensitive-information-type?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-14T16:06:00.000Z",
        "voteCount": 9,
        "content": "Note this is really a new custom infotype creation, so forget  \"Data Subject Request (DSR) cases.\"\nIt's Ok to me. It connects to SCC by PWSH, download XML file, modifies and upload."
      },
      {
        "date": "2022-10-15T15:22:00.000Z",
        "voteCount": 2,
        "content": "Valid on exam October 14, 2022"
      },
      {
        "date": "2022-09-30T10:12:00.000Z",
        "voteCount": 1,
        "content": "Shouldnt it be JSON and NOT XML?"
      },
      {
        "date": "2022-10-12T13:43:00.000Z",
        "voteCount": 1,
        "content": "It is XML per the provided article.\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/customize-a-built-in-sensitive-information-type?view=o365-worldwide"
      },
      {
        "date": "2022-07-26T20:06:00.000Z",
        "voteCount": 4,
        "content": "similar question appeared on my exam july 27,2022."
      },
      {
        "date": "2021-12-01T06:07:00.000Z",
        "voteCount": 4,
        "content": "2, 4, 5, 6 in the correct order."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14240-exam-ms-500-topic-3-question-14-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have a Microsoft 365 tenant. You create a label named CompanyConfidential in Microsoft Azure Information Protection.<br>You add CompanyConfidential to a global policy.<br>A user protects an email message by using CompanyConfidential and sends the label to several external recipients. The external recipients report that they cannot open the email message.<br>You need to ensure that the external recipients can open protected email messages sent to them.<br>You create a new label in the global policy and instruct the user to resend the email message.<br>Does that meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-01-10T02:06:00.000Z",
        "voteCount": 14,
        "content": "I Don't see how this fixes it, no where does it state the settings on this 'new label' so how do we know it would work, also no where does it state that we tell the user about this new label so if they simply resend the email why would this new label that no one knows anything about just be assumed to fix the issue?"
      },
      {
        "date": "2021-03-09T13:32:00.000Z",
        "voteCount": 3,
        "content": "This will never fix external access while they aren't added in the label permissions as authorized (viewer,reviewer,coauthor,owner or custom permissions). This is missing in the statement so simply creating another label and publising in the GP you do nothing. \n\nAlternative, could be creating another label with UDP (user defined permissions) where if you label an email it can only apply \"DO NOT FORWARD\" protected template, allowing the recipients to view and reply, but not copy, print or forward. (with UDP you will be prompted for users/role only with Word,Excel, Powerpoint)"
      },
      {
        "date": "2022-01-24T15:43:00.000Z",
        "voteCount": 6,
        "content": "I agree. The answer should also include the following steps:\n1. Turn on your computer\n2. Sign in to Office portal with admin credentials\n3. Create a distribution list containing all your organization users\n2. Open OWA\n3. Draft and send a new email to the all users distribution list informing them of the labeling changes\n4. Pay your phone bill so you can call users who have any trouble"
      },
      {
        "date": "2021-08-11T03:49:00.000Z",
        "voteCount": 12,
        "content": "This is a more conceptual question and answer like many confusing MS questions on the exams. If you overthink this one the answer will be No, because it is so vague. If you conceptually think about it, it is Yes because that is, roughly, how you would do it (with many steps inbetween).\n\nSo answer is A, yes."
      },
      {
        "date": "2023-05-20T09:57:00.000Z",
        "voteCount": 1,
        "content": "It's a shame Microsoft exam questions have to be this freaking confusing. I really believe there are very knowledgable Microsoft folks that take these exams and fail them not because they don't understand the content, but that the exam questions are so hard to understand. This coming from someone that has sat 20+ Microsoft exams."
      },
      {
        "date": "2023-01-04T07:18:00.000Z",
        "voteCount": 1,
        "content": "The questions is ambiguous. Simply creating a new label doesn't solve the issue, external or specific users must be included in the label's Encryption permissions settings or Custom permissions must be used."
      },
      {
        "date": "2021-12-01T06:07:00.000Z",
        "voteCount": 2,
        "content": "A si correct!"
      },
      {
        "date": "2020-05-29T21:28:00.000Z",
        "voteCount": 2,
        "content": "This is correct"
      },
      {
        "date": "2020-03-06T04:30:00.000Z",
        "voteCount": 8,
        "content": "This is correct as you configure protection settings in the label"
      },
      {
        "date": "2020-02-15T22:21:00.000Z",
        "voteCount": 2,
        "content": "The answer is confusing. Even new label is created with recipients only then the sender have to reapply the label.  The statement say create new label and resend the mail how does change the protection on the label which is already in place?"
      },
      {
        "date": "2020-02-27T15:11:00.000Z",
        "voteCount": 2,
        "content": "Typically ambiguous and open ended answers by MS SMEs eh? I don't think that this would be the route I would choose, IRL.  I would be even more conscious of the access and lean towards accepted domain exceptions."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83188-exam-ms-500-topic-3-question-15-discussion/",
    "body": "HOTSPOT -<br>Your network contains an on-premises Active Directory domain named contoso.com. The domain contains the groups shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0025200001.png\" class=\"in-exam-image\"><br>The domain is synced to a Microsoft Azure Active Directory (Azure AD) tenant that contains the groups shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0025300001.png\" class=\"in-exam-image\"><br>You create a sensitivity label named Label1.<br>You need to publish Label1.<br>To which groups can you publish Label1? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0025400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0025500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "The groups must be mail-enabled.<br>Labels can be published to any specific user or email-enabled security group, distribution group, or Microsoft 365 group (which can have dynamic membership) in<br>Azure AD.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/sensitivity-labels?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2023-05-24T06:51:00.000Z",
        "voteCount": 2,
        "content": "etait a l'examen le 18/05/2023"
      },
      {
        "date": "2022-12-29T11:50:00.000Z",
        "voteCount": 2,
        "content": "security groups isn't for mail....\n1- Group4 only..\n2- ok"
      },
      {
        "date": "2022-10-15T15:22:00.000Z",
        "voteCount": 1,
        "content": "Valid on exam October 14, 2022"
      },
      {
        "date": "2022-09-27T12:15:00.000Z",
        "voteCount": 2,
        "content": "Correct Answers! 2 and 2"
      },
      {
        "date": "2022-09-23T11:53:00.000Z",
        "voteCount": 1,
        "content": "Choose which users and groups see the labels. Labels can be published to any specific user or email-enabled security group, distribution group, or Microsoft 365 group (which can have dynamic membership) in Azure AD."
      },
      {
        "date": "2022-09-22T06:11:00.000Z",
        "voteCount": 2,
        "content": "Valid on exam 9/21/2022"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47233-exam-ms-500-topic-3-question-16-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 subscription.<br>You identify the following data loss prevention (DLP) requirements:<br>✑ Send notifications to users if they attempt to send attachments that contain an EU Social Security Number (SSN) or Equivalent ID.<br>✑ Prevent any email messages that contain credit card numbers from being sent outside your organization.<br>✑ Block the external sharing of Microsoft OneDrive content that contains EU passport numbers.<br>✑ Send administrators email alerts if any rule matches occur.<br>What is the minimum number of DLP policies and rules you must create to meet the requirements? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0025700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0025800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-15T14:17:00.000Z",
        "voteCount": 34,
        "content": "POLICY1 with Exchange selected as location.\nRule (A) with:\n- EU social security - NOTIFY the user who sent - Notify Admin.\nRule (B) with:\n- Credit card numbers - BLOCK - Notify Admin.\n\nPOLICY2 with OneDrive selected as location.\nRule (C) with:\n- EU passport numbers - BLOCK - Notify Admin.\n\nCredits to @itmp in:\nhttps://www.examtopics.com/discussions/microsoft/view/12036-exam-ms-500-topic-3-question-3-discussion/"
      },
      {
        "date": "2021-06-13T11:22:00.000Z",
        "voteCount": 5,
        "content": "Created these polies &amp; rules in lab. This is correct, 2 policies, 3 rules as described."
      },
      {
        "date": "2021-03-17T02:46:00.000Z",
        "voteCount": 7,
        "content": "Correct, answer is 2 policies and 3 rules"
      },
      {
        "date": "2021-03-20T09:37:00.000Z",
        "voteCount": 3,
        "content": "How about teams?"
      },
      {
        "date": "2021-11-22T06:39:00.000Z",
        "voteCount": 1,
        "content": "What about Teams? It's not mentioned in the question."
      },
      {
        "date": "2022-01-11T19:06:00.000Z",
        "voteCount": 2,
        "content": "You can send attachments with Teams, so Teams should be included."
      },
      {
        "date": "2021-10-26T10:45:00.000Z",
        "voteCount": 6,
        "content": "Policies are made up of one or more rules.  Common protection requirements should be grouped in the same policy.  Because different requirements must be met, a separate policy should be defined for each, Block, Notify users, Prevent.  No separate rule or policy is needed for admin notification.  I'll go with 3 and 3"
      },
      {
        "date": "2023-02-09T15:33:00.000Z",
        "voteCount": 1,
        "content": "3 policies and 3 rules is correct. You can't ignore Teams as this is location what you select when creating policy. Hypothetical user would be very upset if user would get notification when sending credit card details in Teams chat as attachment inside organization. According to requirement warning should only come if Social security number is attached in Teams chat or Exchange email. Conditions target 3 set of locations (1. Exchange + Teams 2. Exchange Only 3. One Drive)"
      },
      {
        "date": "2023-02-03T15:19:00.000Z",
        "voteCount": 1,
        "content": "DLP can be apply to the following locations: Exchange email, SharePoint sites, OneDrive Accounts, Teams chat and channel messages, Devices, Microsoft Defender for Cloud App, On-premises repositories and Power BI (preview) in one policy. \nI will say, 1 policy and 3 rules. Tested this in my lab."
      },
      {
        "date": "2022-09-22T06:12:00.000Z",
        "voteCount": 3,
        "content": "Valid on exam 9/21/2022"
      },
      {
        "date": "2022-04-09T18:17:00.000Z",
        "voteCount": 4,
        "content": "I just created a custom policy with three rules included to meet all the requirements. So, maybe the 3 policy thing in this question is a relic. But you can do it in one policy now."
      },
      {
        "date": "2022-05-31T09:31:00.000Z",
        "voteCount": 3,
        "content": "You need 2 policies, one for Exchange and one for OneDrive"
      },
      {
        "date": "2021-12-01T06:09:00.000Z",
        "voteCount": 1,
        "content": "1st: 2\n2nd: 3"
      },
      {
        "date": "2021-07-22T10:16:00.000Z",
        "voteCount": 3,
        "content": "if you do it with excange is 2 policies and 3 rules but with compliance are 3  and 3"
      },
      {
        "date": "2021-04-05T22:54:00.000Z",
        "voteCount": 4,
        "content": "Correct answer is 2 policies and 3 rules | First policy will have 2 rules | second policy will have 1 rule."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/59592-exam-ms-500-topic-3-question-17-discussion/",
    "body": "You have a Microsoft 365 subscription.<br>Some users access Microsoft SharePoint Online from unmanaged devices.<br>You create a conditional access policy in Azure Active Directory.<br>You need to prevent the users from downloading, printing, and syncing files.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Azure portal, create an Azure Active Directory (Azure AD) Identity Protection user risk policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Azure portal, create an Azure Active Directory (Azure AD) conditional access policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the SharePoint admin center, configure the Access control settings.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Azure portal, create an Azure Active Directory (Azure AD) Identity Protection sign-in risk policy."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-12-01T06:11:00.000Z",
        "voteCount": 3,
        "content": "C is correct!"
      },
      {
        "date": "2021-10-26T11:02:00.000Z",
        "voteCount": 3,
        "content": "The answer is below and C is correct: \nhttps://docs.microsoft.com/en-US/sharepoint/control-access-from-unmanaged-devices#block-or-limit-access-to-specific-sharepoint-site-collections-or-onedrive-accounts"
      },
      {
        "date": "2021-08-11T04:08:00.000Z",
        "voteCount": 3,
        "content": "C is correct, but question is slightly confusing. Question says you create a CA policy in Azure. One of the answers is that you create a CA policy in Azure?\n\nConditional Access is a AAD P1 license requirement; you cannot assume you have that (\"a M365 subscription\", not all M365 have CA), so C has to be the answer as that will always work for this specific purpose."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47236-exam-ms-500-topic-3-question-18-discussion/",
    "body": "You have a Microsoft 365 tenant.<br>You have a database that stores customer details. Each customer has a unique 13-digit identifier that consists of a fixed pattern of numbers and letters.<br>You need to implement a data loss prevention (DLP) solution that meets the following requirements:<br>✑ Email messages that contain a single customer identifier can be sent outside your company.<br>✑ Email messages that contain two or more customer identifiers must be approved by the company's data privacy team.<br>Which two components should you include in the solution? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta sensitive information type\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta sensitivity label",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta retention label",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta DLP policy\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta mail flow rule"
    ],
    "answer": "AD",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/sensitive-information-type-entity-definitions?view=o365-worldwide",
    "votes": [
      {
        "answer": "AD",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-03-15T14:46:00.000Z",
        "voteCount": 8,
        "content": "You need to create sensitivity infotype for sure but M365 DLP not yet support message approval. Instead you need to use mail flow rule. \nhttps://docs.microsoft.com/es-es/exchange/security-and-compliance/mail-flow-rules/common-message-approval-scenarios#example-4-forward-messages-that-match-one-of-several-criteria\nAdditional interesting discussion:\nhttps://www.reddit.com/r/Office365/comments/f1ux42/create_approval_workflow_with_office_365_dlp/"
      },
      {
        "date": "2021-12-01T06:12:00.000Z",
        "voteCount": 1,
        "content": "I'll go with A &amp; D."
      },
      {
        "date": "2021-11-21T14:04:00.000Z",
        "voteCount": 1,
        "content": "This solution should be D,A,E\nyou need first a DLP (( you can add an Action to forward for approval to specific approvers within the DLP Policy )), after that create new sensitive info type and at last an exchange transport rule (( Mail flow rule. Used to create rule to block messages outside org. if min count of Sensitive info matches 2 ))\nBut since question stands only for which 'TWO' the answer is supposed to be correct... A &amp; D."
      },
      {
        "date": "2021-06-21T02:28:00.000Z",
        "voteCount": 3,
        "content": "Firstly, the question is, it asked to create DLP policy.\nSecond, it didn't mention as approvers, it says approved identifiers by data Privacy team. \"two or more customer identifiers must be approved by the companyג€™s data privacy team\"\n\nSo answer is A&amp;D Only."
      },
      {
        "date": "2021-06-16T06:20:00.000Z",
        "voteCount": 2,
        "content": "This is correct as you can add an Action to forward for approval to specific approvers within the DLP Policy"
      },
      {
        "date": "2021-09-06T14:24:00.000Z",
        "voteCount": 2,
        "content": "This option is available if you restrict the locations to apply the policy to Exchange (at least)"
      },
      {
        "date": "2021-06-04T21:53:00.000Z",
        "voteCount": 3,
        "content": "Answer should be A &amp; E.\n\nA - Sensitivity Info. Used to create the sensitivity info type - 13 digit identifiers.\nE - Mail flow rule. Used to create rule to block messages outside org. if min count of Sensitive info matches 2."
      },
      {
        "date": "2021-06-04T22:01:00.000Z",
        "voteCount": 2,
        "content": "Correction: Even the same rule can be created via the DLP policy as well. So, D is also right."
      },
      {
        "date": "2021-04-07T04:54:00.000Z",
        "voteCount": 1,
        "content": "IMO this solution should be D,A,E\nyou need first a DLP, after that a sensitive type and at last an exchange transport rule\nBut since question stands only for which 'TWO' the answer is supposed to be correct..."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47093-exam-ms-500-topic-3-question-19-discussion/",
    "body": "You create a data loss prevention (DLP) policy as shown in the following exhibit:<br><img src=\"/assets/media/exam-media/04320/0026100001.png\" class=\"in-exam-image\"><br>What is the effect of the policy when a user attempts to send an email message that contains sensitive information?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe user receives a notification and can send the email message\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe user receives a notification and cannot send the email message",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe email message is sent without a notification",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe email message is blocked silently"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-10-01T07:43:00.000Z",
        "voteCount": 1,
        "content": "Folks you overlooked the ask here. The check box is allow or restrict users from RECIEVING the email message. The question is asking about SENDING. So the answer is B. This is C&amp;P from the DLP policy wizard . \"By default, users are blocked from sending Teams chats and channel messages that contain the type of content you're protecting. But you can choose who is blocked from receiving emails or accessing files shared from SharePoint, OneDrive, and Teams\"."
      },
      {
        "date": "2022-09-25T18:03:00.000Z",
        "voteCount": 1,
        "content": "So what's the correct answer then? I'm confused if its A or B"
      },
      {
        "date": "2022-03-07T05:37:00.000Z",
        "voteCount": 2,
        "content": "Audit only policy"
      },
      {
        "date": "2021-12-01T06:13:00.000Z",
        "voteCount": 2,
        "content": "A is correct!"
      },
      {
        "date": "2021-03-14T12:54:00.000Z",
        "voteCount": 3,
        "content": "A for sure!"
      },
      {
        "date": "2021-04-21T05:32:00.000Z",
        "voteCount": 6,
        "content": "Hi Kiketxu, I tried to test this and I found this when you select protection actions and then Next yu will see  \"Customize access and override settings\nBy default, users are blocked from sending email and Teams chats and channel messages that contain the type of content you're protecting. But you can choose who has access to shared SharePoint and OneDrive files. You can also decide if you want to let people override the policy's restrictions.\""
      },
      {
        "date": "2021-05-16T18:55:00.000Z",
        "voteCount": 2,
        "content": "Going by ellik's comments, the answer should be B) User receives notification and cannot send e-mail (Assuming the default options)"
      },
      {
        "date": "2021-05-24T00:11:00.000Z",
        "voteCount": 1,
        "content": "Default setting is to block, do we just presume that is the case?"
      },
      {
        "date": "2021-06-24T18:36:00.000Z",
        "voteCount": 13,
        "content": "The bottom checkbox for restricting access is not ticked, so it will not be blocked"
      },
      {
        "date": "2021-11-21T14:09:00.000Z",
        "voteCount": 1,
        "content": "I second to this. We are not blocking it, so answer is right."
      },
      {
        "date": "2021-06-24T12:40:00.000Z",
        "voteCount": 1,
        "content": "\"Also, if you want to actually block or restrict access to content that is in violation of policy, you need to configure an action on the rule to do so.\"\nNot all templates have a block access action defined in their rules . And the box to restrict content isn't checked. So wouldn't it be safe to assume that the user CAN send the mail? \nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/create-test-tune-dlp-policy?view=o365-worldwide#where-to-start-with-data-loss-prevention"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47095-exam-ms-500-topic-3-question-20-discussion/",
    "body": "You have a Microsoft 365 subscription.<br>You need to create data loss prevention (DLP) queries in Microsoft SharePoint Online to find sensitive data stored in sites.<br>Which type of site collection should you create first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecords Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\teDiscovery Center\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnterprise Search Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDocument Center"
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://support.office.com/en-us/article/overview-of-data-loss-prevention-in-sharepoint-server-2016-80f907bb-b944-448d-b83d-8fec4abcc24c",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-04-08T16:53:00.000Z",
        "voteCount": 5,
        "content": "This has not been the case for years now - only valid for SP 2016, not SPO."
      },
      {
        "date": "2021-12-01T06:14:00.000Z",
        "voteCount": 2,
        "content": "B perhaps old question"
      },
      {
        "date": "2021-03-14T12:57:00.000Z",
        "voteCount": 3,
        "content": "Seems out of date question. Currently it should run from Compliance Center to get full features as eDiscovery in the old portal is in retiring process.\nhttps://docs.microsoft.com/en-gb/microsoft-365/compliance/ediscovery?view=o365-worldwide\n\nhttps://docs.microsoft.com/en-gb/microsoft-365/compliance/legacy-ediscovery-retirement?view=o365-worldwide"
      },
      {
        "date": "2021-03-14T12:58:00.000Z",
        "voteCount": 2,
        "content": "https://www.examtopics.com/discussions/microsoft/view/11872-exam-ms-500-topic-3-question-6-discussion/"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46733-exam-ms-500-topic-3-question-21-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 subscription that contains a Microsoft SharePoint Online site named Site1. Site1 contains the folders shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0026200001.png\" class=\"in-exam-image\"><br>At 09:00, you create a Microsoft Cloud App Security policy named Policy1 as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04320/0026300001.jpg\" class=\"in-exam-image\"><br>After you create Policy1, you upload files to Site1 as shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0026400001.png\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0026400002.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0026500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/cloud-app-security/data-protection-policies",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-13T18:27:00.000Z",
        "voteCount": 76,
        "content": "The conditions of the policy is that an alert will be created for any of the files in Folder 1 of Microsoft Sharepoint. However, the alert limit is set at 5. After the 5th alert, there will be no more alerts. \n\nFrom this rationale, File 1 triggers an alert since it is already in the Sharepoint Folder 1. File  3 does not trigger an alert because it is in Folder 2 (not applicable to the policy). File 9 does not trigger an alert because it would be the 6th alert and the alert threshold is 5."
      },
      {
        "date": "2021-03-14T14:24:00.000Z",
        "voteCount": 3,
        "content": "Bit confused as the statment does not clarifies it's a file policy. \nPerfectly explained @Sugar123, thanks."
      },
      {
        "date": "2021-03-15T00:10:00.000Z",
        "voteCount": 1,
        "content": "Thanks Sugar123 !"
      },
      {
        "date": "2021-08-14T15:47:00.000Z",
        "voteCount": 3,
        "content": "It's only me, or is \"File 9\" the 5th file being uploaded to \"Folder 1\"? (and 2 files for \"Folder 2\") \nmeaning that it will be triggered an alert."
      },
      {
        "date": "2022-02-11T23:54:00.000Z",
        "voteCount": 1,
        "content": "Made the same mistake by not putting the first table on the counter!\nThere are already Files/Folder existing on the SharePoint than the ruleset is been created, and after this additional files are placed into the folder!\nEverything has to start with File1 not File3."
      },
      {
        "date": "2021-03-12T08:28:00.000Z",
        "voteCount": 8,
        "content": "I do not understand the logic here."
      },
      {
        "date": "2023-01-29T19:02:00.000Z",
        "voteCount": 3,
        "content": "Valid on28/01/23"
      },
      {
        "date": "2022-10-15T15:23:00.000Z",
        "voteCount": 1,
        "content": "Valid on exam October 14, 2022"
      },
      {
        "date": "2022-09-22T06:22:00.000Z",
        "voteCount": 1,
        "content": "Valid on Exam 9/21/2022"
      },
      {
        "date": "2022-04-09T13:44:00.000Z",
        "voteCount": 3,
        "content": "I tell ya, I was all set to argue on this one. I thought the policy would not scan files already created. Which is why, I suspect, the question has the time at which the policy as created. To throw me (at least) off. But it will scan everything at the location.\n\nSo I agree with the given answers. Y/N/N"
      },
      {
        "date": "2021-12-01T05:21:00.000Z",
        "voteCount": 1,
        "content": "Y, N, N\n\nFile 1 triggers an alert since it is already in the Sharepoint Folder 1. File 3 does not trigger an alert because it is in Folder 2 (not applicable to the policy). File 9 does not trigger an alert because it would be the 6th alert and the alert threshold is 5."
      },
      {
        "date": "2021-11-18T11:06:00.000Z",
        "voteCount": 1,
        "content": "These questions are so tricky... But the limit of 5 is the reason file9 does not trigger an alarm"
      },
      {
        "date": "2022-02-24T08:30:00.000Z",
        "voteCount": 1,
        "content": "Tricky...aka dumb"
      },
      {
        "date": "2021-11-17T21:31:00.000Z",
        "voteCount": 7,
        "content": "I'm interpreting this scenario as follows:\n\nFile 1 triggers the alert since it was in Folder 1 already\nFile 3 does not trigger the alert since it is in Folder 2 and policy is not applied to Folder 2\nFile 9 does not trigger alert because the limit was 5 times already...see explanation below\n\nFile 1 was already in Folder 1 prior to or at 09:00 (doesn't specify)\nFile 4 was the 2nd file in Folder 1 at 09:10\nFile 6 was the 3rd file in Folder 1 at 09:20\nFile 7 was the 4th file in Folder 1 at 09:25\nFile 8 was the 5th file in Folder 1 at 09:30 --&gt; Daily alert limit of 5 was met\nFile 9 was the 6th file in Folder 1 at 09:33"
      },
      {
        "date": "2021-11-15T10:12:00.000Z",
        "voteCount": 1,
        "content": "Can someone explain or show documentation why File 1 would trigger an alert if it was uploaded prior to the Policy being created...Will be testing this but In my opinion the answers would be No,No,Yes"
      },
      {
        "date": "2022-08-02T06:41:00.000Z",
        "voteCount": 1,
        "content": "You're right. \n\"After you set an activity detection policy, it starts to generate alerts - alerts are only generated on activities that occur after you create the policy.\"\nSource - https://docs.microsoft.com/en-us/defender-cloud-apps/user-activity-policies"
      },
      {
        "date": "2021-11-15T10:18:00.000Z",
        "voteCount": 3,
        "content": "Nevermind.... from the documentation (https://docs.microsoft.com/en-us/cloud-app-security/data-protection-policies)\n\n\"These policies detect and remediate any violations for at-rest information or when new content is created. Policies can be monitored using real-time alerts or using console-generated reports.\"\n\nSo the answer would be correct : Yes,No,No"
      },
      {
        "date": "2021-03-25T22:45:00.000Z",
        "voteCount": 2,
        "content": "1  &amp; 9 shall create alerts"
      },
      {
        "date": "2021-03-13T00:33:00.000Z",
        "voteCount": 5,
        "content": "confusing"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/11440-exam-ms-500-topic-3-question-22-discussion/",
    "body": "You have a Microsoft 365 subscription that includes a user named User1.<br>You have a conditional access policy that applies to Microsoft Exchange Online. The conditional access policy is configured to use Conditional Access App<br>Control.<br>You need to create a Microsoft Cloud App Security policy that blocks User1 from printing from Exchange Online.<br>Which type of Cloud App Security policy should you create?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan app permission policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan activity policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta Cloud Discovery anomaly detection policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta session policy\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 6,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-11-21T16:58:00.000Z",
        "voteCount": 20,
        "content": "The answer is D: Session Policy\n\nEnforce read-only mode for external users in real time\nPrevent company data from being exfiltrated by external users, by blocking print and copy/paste activities in real-time, utilizing Cloud App Security's session controls.\n\nhttps://docs.microsoft.com/en-us/cloud-app-security/policies-information-protection#enforce-read-only-mode-for-external-users-in-real-time:~:text=.-,Enforce%20read%2Donly%20mode%20for%20external%20users%20in%20real%20time,Prevent%20company%20data%20from%20being%20exfiltrated%20by%20external%20users%2C%20by%20blocking%20print%20and%20copy%2Fpaste%20activities%20in%20real%2Dtime%2C%20utilizing%20Cloud%20App%20Security's%20session%20controls.,-Prerequisites"
      },
      {
        "date": "2020-12-11T05:34:00.000Z",
        "voteCount": 12,
        "content": "I tried to test this in Cloud App Security and to be honest as a novice in CAS I was struggling. My results were inconclusive, so I sent Microsft an Email and they replied confirming the given answer is correct.\n\nThis is completed by creating a Session Control Policy in CAS. Then 'Use Custom Policy' in Conditional Access and select the policy you created in Cloud App Security from the list.\n\nx"
      },
      {
        "date": "2022-11-29T12:38:00.000Z",
        "voteCount": 1,
        "content": "This question is outdated. Microsoft Cloud App was replaced with Microsoft Defender for Cloud Apps. Please remove."
      },
      {
        "date": "2022-09-22T16:15:00.000Z",
        "voteCount": 1,
        "content": "Session policy"
      },
      {
        "date": "2022-09-17T04:08:00.000Z",
        "voteCount": 1,
        "content": "Session Policy for sure."
      },
      {
        "date": "2022-02-23T14:47:00.000Z",
        "voteCount": 2,
        "content": "Session policy"
      },
      {
        "date": "2022-01-11T16:29:00.000Z",
        "voteCount": 1,
        "content": "D is indeed the answer.\n\nVia Microsoft Docs, there are only two different policies, Access and Session.\nAccess policies will block the ability to use the app at all.\nSession policies can restrict specific activities when setting the type to \"Activity\"\nSource:\nhttps://docs.microsoft.com/en-us/defender-cloud-apps/session-policy-aad#block-activities"
      },
      {
        "date": "2021-12-01T04:49:00.000Z",
        "voteCount": 2,
        "content": "D is correct!"
      },
      {
        "date": "2021-11-21T14:37:00.000Z",
        "voteCount": 1,
        "content": "Correct ans. Session policy \n\nWith the access and session policies, you can:\nPrevent data exfiltration: You can block the download, cut, copy, and print of sensitive documents on, for example, unmanaged devices.\n\nhttps://docs.microsoft.com/en-us/cloud-app-security/proxy-intro-aad#how-it-works:~:text=With%20the%20access%20and%20session%20policies%2C,documents%20on%2C%20for%20example%2C%20unmanaged%20devices.\n\nSession control applies to browser-based apps.\nTo block access from mobile and desktop apps, create an Access policy\n\nWhile Activity Policies are for generating alerts and using Governance action to Suspend users etc. Based on x activity or repeat activities suspend user/confirm user compromised etc."
      },
      {
        "date": "2021-07-30T07:01:00.000Z",
        "voteCount": 2,
        "content": "The correct answer is a Session Policy.\n\nYou set up a Session policy. Session control type of Block. Put in the filter for the activity of printing and then use the action to block.\n\nActivity Policies are for generating alerts and using Governance action to Suspend users etc. Based on x activity or repeat activities suspend user/confirm user compromised etc."
      },
      {
        "date": "2021-05-03T23:30:00.000Z",
        "voteCount": 3,
        "content": "I have tested this in lab, it is D- Session Policy"
      },
      {
        "date": "2020-11-21T17:04:00.000Z",
        "voteCount": 4,
        "content": "With the access and session policies, you can:\n\nPrevent data exfiltration: You can block the download, cut, copy, and print of sensitive documents on, for example, unmanaged devices.\n\nhttps://docs.microsoft.com/en-us/cloud-app-security/proxy-intro-aad#how-it-works:~:text=With%20the%20access%20and%20session%20policies%2C,documents%20on%2C%20for%20example%2C%20unmanaged%20devices."
      },
      {
        "date": "2021-03-07T15:51:00.000Z",
        "voteCount": 1,
        "content": "Thanks for the research and highlinting dude! ;)"
      },
      {
        "date": "2021-04-21T06:14:00.000Z",
        "voteCount": 1,
        "content": "Session control applies to browser-based apps.\nTo block access from mobile and desktop apps, create an Access policy"
      },
      {
        "date": "2020-11-15T08:56:00.000Z",
        "voteCount": 1,
        "content": "Why not \"Activity policy\", we can define there an \"Activity type\" filter?\nhttps://docs.microsoft.com/en-us/cloud-app-security/user-activity-policies"
      },
      {
        "date": "2020-11-18T01:10:00.000Z",
        "voteCount": 1,
        "content": "I also think it's B, an activity policy. You cannot select the option to deny printing is a session policy (I can't find it there). So, I would choose answer B."
      },
      {
        "date": "2021-01-28T02:28:00.000Z",
        "voteCount": 1,
        "content": "What is the correct answer?"
      },
      {
        "date": "2021-04-21T06:14:00.000Z",
        "voteCount": 1,
        "content": "Session control applies to browser-based apps.\nTo block access from mobile and desktop apps, create an Access policy"
      },
      {
        "date": "2020-01-05T09:06:00.000Z",
        "voteCount": 4,
        "content": "reference: https://docs.microsoft.com/en-us/cloud-app-security/session-policy-aad"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/46864-exam-ms-500-topic-3-question-23-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 E5 subscription.<br>From Microsoft Azure Active Directory (Azure AD), you create a security group named Group1. You add 10 users to Group1.<br>You need to apply app enforced restrictions to the members of Group1 when they connect to Microsoft Exchange Online from non-compliant devices, regardless of their location.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0026700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0026800001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/app-based-conditional-access",
    "votes": [],
    "comments": [
      {
        "date": "2021-07-30T08:20:00.000Z",
        "voteCount": 20,
        "content": "Correct answer for 1 is Users and Groups, Cloud Apps, Session.\n\nYou then configure a new OwaMailboxPolicy and then set the ConditionalAccessPolicy setting with either ReadOnly or the ReadOnly and blocking attachments. You can then assign the policy to individual mailboxes.\n\nDocumentation: https://techcommunity.microsoft.com/t5/outlook-blog/conditional-access-in-outlook-on-the-web-for-exchange-online/ba-p/267069"
      },
      {
        "date": "2021-10-24T10:36:00.000Z",
        "voteCount": 3,
        "content": "Correct 100%"
      },
      {
        "date": "2022-12-12T06:23:00.000Z",
        "voteCount": 2,
        "content": "That's not correct for 1. You configure it in Conditions and there under \"Filter for devices\". Here you can setup the \"non compliance devices\" filter."
      },
      {
        "date": "2021-03-14T13:21:00.000Z",
        "voteCount": 10,
        "content": "I would say both are correct. Look at this article:\nhttps://techcommunity.microsoft.com/t5/outlook-blog/conditional-access-in-outlook-on-the-web-for-exchange-online/ba-p/267069\n\nAlso you can find there the old thread discussion:\nhttps://www.examtopics.com/discussions/microsoft/view/6139-exam-ms-500-topic-3-question-8-discussion/"
      },
      {
        "date": "2021-04-21T06:48:00.000Z",
        "voteCount": 1,
        "content": "yes , the cmdlet is Set-OwaMailboxPolicy. That cmdlet contains the parameter ConditionalAccessPolicy."
      },
      {
        "date": "2022-05-10T01:24:00.000Z",
        "voteCount": 1,
        "content": "in the link you provides ,it states it should be session settings not conditions"
      },
      {
        "date": "2023-04-16T01:41:00.000Z",
        "voteCount": 1,
        "content": "answer is correct:\nconditions =&gt; filter for devices =&gt; query =&gt; is compliant"
      },
      {
        "date": "2023-04-02T09:29:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct, looks like you have to configure this from both the graphical Azure AD site as well as from PowerShell.\n\n1. New-OwaMailboxPolicy -Name PolicyName\n2. Set-OwaMailboxPolicy -Name PolicyName  -ConditionalAccessPolicy [ReadOnly | ReadOnlyPlusAttachmentsBlocked]\n\nReferences:\n - https://learn.microsoft.com/en-us/powershell/module/exchange/set-owamailboxpolicy?source=recommendations&amp;view=exchange-ps\n - https://techcommunity.microsoft.com/t5/outlook-blog/conditional-access-in-outlook-on-the-web-for-exchange-online/ba-p/267069#:~:text=Steps%20to%20Configuring%20Conditional%20Access%20%2F%20Limited%20Access,your%20existing%20one%20Set-OwaMailboxPolicy%20-Identity%20Default%20-ConditionalAccessPolicy%20ReadOnly"
      },
      {
        "date": "2022-07-26T20:03:00.000Z",
        "voteCount": 4,
        "content": "answer mentioned here is correct, passed on exam july 27,2022"
      },
      {
        "date": "2022-02-23T15:13:00.000Z",
        "voteCount": 4,
        "content": "You don't need to set anything under conditions since the location is \"all locations\".  Need to set \"App based restrictions\" under session.  Set \"Require device to be compliant\" under \"Grant\".\nAsshole question."
      },
      {
        "date": "2022-02-23T15:22:00.000Z",
        "voteCount": 3,
        "content": "I'm wrong...and right.   You need to \"Filter for Devices\" under conditions and set is compliant to false.  So both contains and session are required."
      },
      {
        "date": "2022-02-23T15:23:00.000Z",
        "voteCount": 3,
        "content": "Conditions and Session"
      },
      {
        "date": "2022-02-20T15:32:00.000Z",
        "voteCount": 3,
        "content": "For the first question I think it should be (Session and condition) since ( Session = app enforced restriction ) &lt;&lt; which is one of the requirement in the question also (Condition = To filter the non-compliant devices) correct me if am wrong"
      },
      {
        "date": "2022-01-11T16:36:00.000Z",
        "voteCount": 1,
        "content": "Given answers are correct, as itbrpl pointed out.\n\nYou need to restrict activity via a conditional access policy for Group1 (Users &amp; Groups) when using Exchange Online (Cloud Apps) dependent on their location (Condition)."
      },
      {
        "date": "2021-12-27T07:42:00.000Z",
        "voteCount": 3,
        "content": "Look... based on the scenario.. you need to block a group, for a given app and in any location... so it means Users and Groups (Group1), Cloud Apps (Exchange Online) and Condition (Location).. you don't need to set anything under Session..."
      },
      {
        "date": "2021-12-01T05:16:00.000Z",
        "voteCount": 3,
        "content": "Users and Groups, Cloud Apps, Session\nSet-OwaMailboxPolicy"
      },
      {
        "date": "2021-11-29T18:08:00.000Z",
        "voteCount": 4,
        "content": "Microsoft 365 Security Administration: MS-500 Exam Guide\nPeter Rising\nPage 66 to Page 69\n\nFrom the Azure portal, create a conditional access policy and configure:\n- Users and groups, Cloud apps, and Conditions settings (Correct)\nUsers and Groups to target -&gt; Group 1\nCloud Apps to select -&gt; Exchange Online\nConditions to target -&gt; Non-compliant devices"
      },
      {
        "date": "2021-11-21T14:51:00.000Z",
        "voteCount": 1,
        "content": "First one should be Users and Groups, Cloud Apps, Session (You don't need to specify any conditions. It also says you need to enforce App Enforced Restrictions which is an option you can select in Session.)\n\nSecond one is correct. (the cmdlet is Set-OwaMailboxPolicy. That cmdlet contains the parameter ConditionalAccessPolicy.) ((Use the Set-OwaMailboxPolicy cmdlet to configure existing Outlook on the web mailbox policies.))\n\nhttps://techcommunity.microsoft.com/t5/outlook-blog/conditional-access-in-outlook-on-the-web-for-exchange-online/ba-p/267069"
      },
      {
        "date": "2021-08-14T15:16:00.000Z",
        "voteCount": 2,
        "content": "This question made me wonder, how in CA I can enforce the app enforced restrictions *ONLY* to non compliant devices?\nCan you help me on this?"
      },
      {
        "date": "2021-06-16T03:24:00.000Z",
        "voteCount": 6,
        "content": "This is not possible with the given answers, not anymore atleast since targeting of non-compliant devices has moved to Conditions (Now in Preview)\nUsers and Groups to target -&gt; Group 1\nCloud Apps to select -&gt; Exchange Online\nConditions to target -&gt; Non-compliant devices\nSession to apply -&gt; app-enforced restrictions"
      },
      {
        "date": "2021-05-29T05:18:00.000Z",
        "voteCount": 4,
        "content": "First one should be Users and Groups, Cloud Apps, Session\n\nSecond one is correct.\n\nhttps://techcommunity.microsoft.com/t5/outlook-blog/conditional-access-in-outlook-on-the-web-for-exchange-online/ba-p/267069"
      },
      {
        "date": "2021-05-05T22:22:00.000Z",
        "voteCount": 4,
        "content": "Answer A is wrong. You don't need to specify any conditions. It also says you need to enforce App Enforced Restrictions which is an option you can select in Session.\n\nCorrect answer is Users and Groups, Cloud Apps, Session"
      },
      {
        "date": "2021-05-03T23:32:00.000Z",
        "voteCount": 5,
        "content": "Actually, this should be - Users and groups - Cloud Apps - Conditions - Session\nbut there is no such answer"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43421-exam-ms-500-topic-3-question-24-discussion/",
    "body": "SIMULATION -<br>You discover that Microsoft SharePoint content is shared with users from multiple domains.<br>You need to allow sharing invitations to be sent only to users in an email domain named contoso.com.<br>To complete this task, sign in to the Microsoft 365 portal.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "You need to configure the Sharing options in the SharePoint admin center.<br>1. Go to the SharePoint admin Center.<br>2. Navigate to Policies &gt; Sharing.<br>3. In the External Sharing section, click on More external sharing settings.<br>4. Tick the Limit external sharing by domain checkbox.<br>5. Click the Add domains button.<br>6. Select the Allow only specific domains option and type in the domain contoso.com.<br>7. Click Save to save the changes.",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-13T00:27:00.000Z",
        "voteCount": 2,
        "content": "correct"
      },
      {
        "date": "2021-01-27T20:57:00.000Z",
        "voteCount": 1,
        "content": "The steps are accurate."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/10684-exam-ms-500-topic-3-question-25-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have a Microsoft 365 tenant. You create a label named CompanyConfidential in Microsoft Azure Information Protection. You add CompanyConfidential to a global policy.<br>A user protects an email message by using CompanyConfidential and sends the label to several external recipients. The external recipients report that they cannot open the email message.<br>You need to ensure that the external recipients can open protected email messages sent to them.<br>You modify the encryption settings of the label.<br>Does that meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2019-12-19T10:19:00.000Z",
        "voteCount": 13,
        "content": "needs to resend email in order to apply changes in the label."
      },
      {
        "date": "2021-08-12T21:08:00.000Z",
        "voteCount": 7,
        "content": "The answer is incorrect. Tested and verified. Just change encryption settings ( Add users or Domain ) also change permissions."
      },
      {
        "date": "2023-04-15T02:27:00.000Z",
        "voteCount": 1,
        "content": "I would go with option A, because if you edit admin created labels the encryption settings get overwritted to already sent emails: \nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/encryption-sensitivity-labels?view=o365-worldwide#what-happens-to-existing-encryption-when-a-labels-applied"
      },
      {
        "date": "2023-03-06T07:41:00.000Z",
        "voteCount": 1,
        "content": "Many comments point to the documentation:\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/encryption-sensitivity-labels?view=o365-worldwide\n\nWhen the Assign Permissions Now is chosen instead of Let the User Decide, then the Encryption box clearly includes Assign Permissions to choose allowed domains or, in this case, All Authenticated Users everyone can open it."
      },
      {
        "date": "2022-08-13T09:58:00.000Z",
        "voteCount": 1,
        "content": "Answer is: No\n\nExternal users can open emails labeled with encryption and content expiration. The issue is caused by the external sharing settings or assigned permissions of the Label."
      },
      {
        "date": "2022-05-14T02:47:00.000Z",
        "voteCount": 1,
        "content": "Need to resend"
      },
      {
        "date": "2022-02-25T10:52:00.000Z",
        "voteCount": 1,
        "content": "Need to resend"
      },
      {
        "date": "2022-01-24T13:37:00.000Z",
        "voteCount": 5,
        "content": "\"You need to ensure that the external recipients can open protected email messages sent to them.\"\n\nWhere does the above quote refer to any messages that were previously sent? The question's verbiage is pretty clear that we are looking to resolve the condition preventing decryption for future messages, and we are not particularly concerned with rectifying past results. Therefore, \"Yes\", this will meet the goal."
      },
      {
        "date": "2021-12-01T05:17:00.000Z",
        "voteCount": 1,
        "content": "B is correct!"
      },
      {
        "date": "2021-09-16T01:58:00.000Z",
        "voteCount": 5,
        "content": "\"Example 3: Add external users to an existing label that encrypts content\nThe new users that you add will be able open documents and emails that have already been protected with this label. The permissions that you grant these users can be different from the permissions that the existing users have.\"\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/encryption-sensitivity-labels?view=o365-worldwide\nSo, I would like to say \"Yes\""
      },
      {
        "date": "2021-09-20T00:36:00.000Z",
        "voteCount": 1,
        "content": "Don't you need to change the groups to whom the label is available to include everyone/external user ? In which case the answer is no."
      },
      {
        "date": "2021-09-15T19:32:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct\nCheck\nhttps://techcommunity.microsoft.com/t5/security-compliance-and-identity/secure-external-collaboration-using-sensitivity-labels/ba-p/1680498\nfor the entie method of sending sensitivity labelled doc to ext domain."
      },
      {
        "date": "2021-05-05T22:27:00.000Z",
        "voteCount": 4,
        "content": "This is incorrect. You DO go to Encryption settings to modify permissions for users/groups to access the files with the label applied. You can add external users here."
      },
      {
        "date": "2021-03-09T13:37:00.000Z",
        "voteCount": 5,
        "content": "Modify encryption isn't enough to resolve this escenario. You need to add external users into the \"encryption\" settings within the label, but then, you need to relabel the document or message and send it again. \nThis answer is correct to me."
      },
      {
        "date": "2021-03-14T13:29:00.000Z",
        "voteCount": 4,
        "content": "I believe it don't need to relabel, just opening the file and saving again it will take the new published permissions. Mandatory send it back as they are externals."
      },
      {
        "date": "2020-11-18T11:11:00.000Z",
        "voteCount": 3,
        "content": "\"In addition to reauthentication, the encryption settings and user group membership is reevaluated. This means that users could experience different access results for the same document or email if there are changes in the encryption settings or group membership from when they last accessed the content.\"\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/encryption-sensitivity-labels?view=o365-worldwide\n\nSo changes in setting will affect the encryption but because the email is already sent the old policy will stay with it until the default use license validity period for a tenant is 30 days. So the missing word to make this a good answer is \"Instruct the user to resend the message\""
      },
      {
        "date": "2020-09-19T23:35:00.000Z",
        "voteCount": 1,
        "content": "I was thinking if we remove the encryption then users can able to view it without any restrictions..whats the deal here and why they said no"
      },
      {
        "date": "2020-09-23T20:33:00.000Z",
        "voteCount": 1,
        "content": "I think you also need to change the permission, chaging only the encryption settings is not enough."
      },
      {
        "date": "2020-11-18T11:04:00.000Z",
        "voteCount": 4,
        "content": "permissions is part of the Encryption Setting. Ref try creating a sensitivity label in M365 Security &amp; Compliance"
      },
      {
        "date": "2020-11-09T21:54:00.000Z",
        "voteCount": 2,
        "content": "I think the scenario is that the label is for confidential internal information, thus the name. Removing the encryption defeats the purpose especially, having the label name as CompanyConfidential and then sending it out to external recipients."
      },
      {
        "date": "2020-06-23T23:58:00.000Z",
        "voteCount": 2,
        "content": "I think this is actually the correct answer\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/encryption-sensitivity-labels?view=o365-worldwide"
      },
      {
        "date": "2020-09-07T10:04:00.000Z",
        "voteCount": 3,
        "content": "if you remove the encryption then is not protected anymore.\nyou have to ensure that thre recipients can open PROTECTED email messages"
      },
      {
        "date": "2021-05-04T00:02:00.000Z",
        "voteCount": 1,
        "content": "SUBZERO, there are no words about removing, it says \"changing\"\nyou can add external users in encryption settings"
      },
      {
        "date": "2020-06-23T23:52:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/microsoft-365/compliance/encryption-sensitivity-labels?view=o365-worldwide"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/10685-exam-ms-500-topic-3-question-26-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have a Microsoft 365 tenant. You create a label named CompanyConfidential in Microsoft Azure Information Protection. You add CompanyConfidential to a global policy.<br>A user protects an email message by using CompanyConfidential and sends the label to several external recipients. The external recipients report that they cannot open the email message.<br>You need to ensure that the external recipients can open protected email messages sent to them.<br>You modify the content expiration settings of the label.<br>Does that meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-01-17T07:15:00.000Z",
        "voteCount": 8,
        "content": "Modifying the expiration won't allow the external users to view the message, regardless of whether the email is resent or not."
      },
      {
        "date": "2020-05-18T01:41:00.000Z",
        "voteCount": 8,
        "content": "No. content expiration doesn't change who has access to the item. Need to change the groups to whom the label is available"
      },
      {
        "date": "2022-08-13T09:58:00.000Z",
        "voteCount": 1,
        "content": "Answer is: No\n\nExternal users can open emails labeled with encryption and content expiration. The issue is caused by the external sharing settings or assigned permissions of the Label."
      },
      {
        "date": "2021-12-01T05:17:00.000Z",
        "voteCount": 1,
        "content": "B is correct!"
      },
      {
        "date": "2021-11-21T14:56:00.000Z",
        "voteCount": 1,
        "content": "Correct ans. \nNo. \nModifying the expiration won't allow the external users to view the message, regardless of whether the email is resent or not.\nContent expiration doesn't change who has access to the item. Need to change the groups to whom the label is available"
      },
      {
        "date": "2021-03-09T13:39:00.000Z",
        "voteCount": 1,
        "content": "B for sure."
      },
      {
        "date": "2020-09-19T23:43:00.000Z",
        "voteCount": 1,
        "content": "I am not understanding, why content expiration won't allow external users to view messages.If  we extend the expiry date until that date they can access the content right.Whats wrong tin this."
      },
      {
        "date": "2020-11-09T21:59:00.000Z",
        "voteCount": 2,
        "content": "Ìt doesn't allow them because the name itself gives the idea that the encryption applies to employees only. External recipients, from the start, have no access to the document or not part of the allowed users. Thus, modifying retention doesn't do anything related to external user access."
      },
      {
        "date": "2020-11-09T22:01:00.000Z",
        "voteCount": 2,
        "content": "I also think that the question is poorly written. I think it should say that email protected with the label was sent to external users instead of label was sent to external users."
      },
      {
        "date": "2019-12-19T10:20:00.000Z",
        "voteCount": 3,
        "content": "needs to resend email in order to apply changes in the label."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82178-exam-ms-500-topic-3-question-27-discussion/",
    "body": "You have a Microsoft 365 alert named Alert2 as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04320/0027100001.jpg\" class=\"in-exam-image\"><br>You need to manage the status of Alert2.<br>To which status can you change Alert2?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActive or Investigating only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDismissed only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe status cannot be changed.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInvestigating only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInvestigating, Active, or Dismissed\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "E",
    "answerDescription": "",
    "votes": [
      {
        "answer": "E",
        "count": 11,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 5,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-11-09T02:27:00.000Z",
        "voteCount": 5,
        "content": "Answer is C.  Once the alert has been marked as Resolved, it cannot be changed."
      },
      {
        "date": "2022-12-12T06:14:00.000Z",
        "voteCount": 9,
        "content": "That is not true, because I just went to the compliance center and clicked on some alert with the status resolved and then I clicked on \"edit comment\" and from there I can change the status to all the other three options. Just go and check for yourself. So the answer is E."
      },
      {
        "date": "2023-06-07T05:50:00.000Z",
        "voteCount": 1,
        "content": "That's true."
      },
      {
        "date": "2023-11-12T16:54:00.000Z",
        "voteCount": 1,
        "content": "in exam SC-400 nov 9th"
      },
      {
        "date": "2023-03-06T08:11:00.000Z",
        "voteCount": 1,
        "content": "The documentation no longer says Resolved alerts can no longer have their status changed. They now allow it, even though changes may have been prevented in the past."
      },
      {
        "date": "2023-02-11T04:10:00.000Z",
        "voteCount": 1,
        "content": "Despite status showing resolved it still can be changed. Select alert &gt; Under Alert status &gt; Actions &gt; select \"Edit comments\" &gt; choose new status: Active, Investigating, Dismissed or Resolved. Alert status will change. Tested from https://compliance.microsoft.com/ admin portal."
      },
      {
        "date": "2023-01-17T02:46:00.000Z",
        "voteCount": 1,
        "content": "E is correct"
      },
      {
        "date": "2023-01-11T07:10:00.000Z",
        "voteCount": 1,
        "content": "E tested"
      },
      {
        "date": "2023-01-04T07:55:00.000Z",
        "voteCount": 2,
        "content": "Tested E"
      },
      {
        "date": "2022-12-29T14:17:00.000Z",
        "voteCount": 1,
        "content": "Tested, deff E"
      },
      {
        "date": "2022-12-06T02:19:00.000Z",
        "voteCount": 4,
        "content": "E is correct, i tested it in my tenant."
      },
      {
        "date": "2022-11-25T09:15:00.000Z",
        "voteCount": 1,
        "content": "This is correct. Tested it in my tenant."
      },
      {
        "date": "2022-09-15T08:05:00.000Z",
        "voteCount": 2,
        "content": "After you investigate the alert, choose Manage alert to change the status (Active, Investigating, Dismissed, or Resolved). You can also add comments and assign the alert to someone in your organization.\n\nAnswer is correct !"
      },
      {
        "date": "2022-11-01T18:54:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct. https://learn.microsoft.com/en-us/microsoft-365/compliance/dlp-configure-view-alerts-policies?view=o365-worldwide#:~:text=After%20you%20investigate%20the%20alert%2C"
      },
      {
        "date": "2022-09-14T10:59:00.000Z",
        "voteCount": 4,
        "content": "I will go for B. Dismissed only"
      },
      {
        "date": "2022-10-09T12:20:00.000Z",
        "voteCount": 1,
        "content": "I would also go with B."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82418-exam-ms-500-topic-3-question-28-discussion/",
    "body": "You have a Microsoft 365 subscription that contains 100 users and a Microsoft 365 group named Group1.<br>All users have Windows 10 devices and use Microsoft SharePoint Online and Exchange Online.<br>A sensitivity label named Label1 is published as the default label for Group1.<br>You add two sublabels named Sublabel1 and Sublabel2 to Label1.<br>You need to ensure that the settings in Sublabel1 are applied by default to Group1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange the order of Sublabel1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the policy of Label1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDuplicate all the settings from Sublabel1 to Label1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the policy of Label1 and publish Sublabel1.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 3,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-04-22T17:08:00.000Z",
        "voteCount": 1,
        "content": "B is correct and I am 100% sure.\nModifying the the current Label Policy of label 1, adding the sublabel together with the parent label.\nSave it.\nLess task as you do not have to delete the policy.\n\nD can be done with more tasks, \ndeleting policy\npublishing sublabel adding the parent label."
      },
      {
        "date": "2023-03-13T14:32:00.000Z",
        "voteCount": 2,
        "content": "B. Modify the policy of Label1.\n\nTo ensure that the settings in Sublabel1 are applied by default to Group1, you need to modify the policy of Label1. As Label1 is the default label for Group1, any changes made to the policy of Label1 will be applied by default to Group1. Therefore, modifying the policy of Label1 to include the settings in Sublabel1 will ensure that these settings are applied by default to Group1.\n\nOption A, changing the order of Sublabel1, will not have any effect on which settings are applied by default to Group1.\n\nOption C, duplicating all the settings from Sublabel1 to Label1, is unnecessary and will not ensure that the settings in Sublabel1 are applied by default to Group1.\n\nOption D, deleting the policy of Label1 and publishing Sublabel1, will remove Label1 as the default label for Group1, and it will not ensure that the settings in Sublabel1 are applied by default to Group1."
      },
      {
        "date": "2022-11-01T19:03:00.000Z",
        "voteCount": 1,
        "content": "D is the correct one. Parent label will not be applied with sublabels configured.\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/sensitivity-labels?view=o365-worldwide#:~:text=the%20parent%20label.-,Don%27t%20choose,-a%20parent%20label"
      },
      {
        "date": "2022-10-02T01:45:00.000Z",
        "voteCount": 2,
        "content": "From the link: \"Don't choose a parent label as the default label, or configure a parent label to be automatically applied (or recommended). If you do, the parent label can't be applied.\"\nTherefore, we need to publish the sublabel."
      },
      {
        "date": "2022-10-20T20:12:00.000Z",
        "voteCount": 1,
        "content": "also, you can't publish the sublabel without its parent label. So deleting the existing label policy will be of no use. Edit the existing policy, add sub-label and apply that sub-label as default would be a solution."
      },
      {
        "date": "2022-10-20T20:11:00.000Z",
        "voteCount": 4,
        "content": "Answer is correct. You modify the existing label policy for your parent label, add sub-label to the policy and then in the wizard you select sub-label to be the default label for the applied scope."
      },
      {
        "date": "2022-09-28T10:42:00.000Z",
        "voteCount": 2,
        "content": "Maybe....\nA. Change the order of Sublabel1."
      },
      {
        "date": "2022-09-16T06:28:00.000Z",
        "voteCount": 1,
        "content": "correct"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82311-exam-ms-500-topic-3-question-29-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 subscription.<br>You are creating a retention policy named Retention1 as shown in the following exhibit. (Click the Exhibit tab.)<br><img src=\"/assets/media/exam-media/04320/0027300001.jpg\" class=\"in-exam-image\"><br>You apply Retention1 to SharePoint sites and OneDrive accounts.<br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0027400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0027500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Retained -<br>Files are retained for two years and then deleted.  The two-year timer resets every time the file is modified.  Therefore, if a file is modified every 6 months, it will never be deleted.<br>Box 2: The user can recover the file until the Recycle Bin retention period expires<br>The user deleted the file so it will be removed to the Recycle Bin.  The user can recover the file until the Recycle Bin retention period expires.  After that time, only an administrator can recover the file and only until the file is permanently deleted after two-years from the last modification date.",
    "votes": [],
    "comments": [
      {
        "date": "2023-05-31T15:33:00.000Z",
        "voteCount": 1,
        "content": "The answers are both correct."
      },
      {
        "date": "2022-11-14T01:40:00.000Z",
        "voteCount": 3,
        "content": "Answer is probably correct as the user has no access to preservation library / second stage recycle bin:\nhttps://learn.microsoft.com/en-us/training/modules/manage-data-retention-microsoft-365/3-explain-retention-sharepoint-online-onedrive-for-business"
      },
      {
        "date": "2022-10-15T08:56:00.000Z",
        "voteCount": 1,
        "content": "Asnwer is correct!"
      },
      {
        "date": "2022-09-15T08:06:00.000Z",
        "voteCount": 2,
        "content": "Correct!"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81841-exam-ms-500-topic-3-question-30-discussion/",
    "body": "DRAG DROP -<br>You have a Microsoft 365 subscription that contains 20 data loss prevention (DLP) policies.<br>You need to identify the following:<br>✑ Rules that are applied without triggering a policy alert<br>✑ The top 10 files that have matched DLP policies<br>✑ Alerts that are miscategorized<br>Which report should you use for each requirement? To answer, drag the appropriate reports to the correct requirements. Each report may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04320/0027600004.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0027700001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/view-the-dlp-reports?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-20T18:01:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/microsoft-365/compliance/view-the-dlp-reports?view=o365-worldwide"
      },
      {
        "date": "2023-03-11T18:24:00.000Z",
        "voteCount": 3,
        "content": "can confirm this question is on exam 3/11/2023"
      },
      {
        "date": "2023-03-08T08:57:00.000Z",
        "voteCount": 3,
        "content": "Chat GPT:\nRules that are applied without triggering a policy alert\tDLP rule usage\nThe top 10 files that have matched DLP policies\tDLP policy matches\nAlerts that are miscategorized\tDLP false positives\nExplanation:\n\nDLP rule usage report(Incident report) shows the rules that are applied without triggering a policy alert. This report can help you identify the rules that are not generating alerts and make necessary changes to your DLP policies.\nDLP policy matches report shows the top 10 files that have matched DLP policies. This report can help you understand which files are being impacted the most by DLP policies and take necessary actions to secure them.\nDLP false positives report shows alerts that are miscategorized. This report can help you identify the alerts that are not relevant or accurate and fine-tune your DLP policies to reduce false positives."
      },
      {
        "date": "2022-09-28T01:21:00.000Z",
        "voteCount": 4,
        "content": "maybe .............\n\nRules that are applied without triggering a policy alert\nIncident reports\n\nThe top 10 files that have matched DLP policies\nDLP policy matches\n\nFalse positive and override\nAlerts that are miscategorized"
      },
      {
        "date": "2022-10-23T14:20:00.000Z",
        "voteCount": 1,
        "content": "I agree with this.  Definition of DLP Incidents: The incidents report is better for identifying specific pieces of content that are problematic for your DLP policies.  This to me seems to coincidence with issues of the policies not triggering.\nMy vote would be Incident Reports, DLP policy matches, False Positives and Overrides"
      },
      {
        "date": "2022-09-12T09:26:00.000Z",
        "voteCount": 1,
        "content": "Correct for me!"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/86911-exam-ms-500-topic-3-question-31-discussion/",
    "body": "You have a Microsoft 365 E5 subscription.<br>You create a sensitivity label named Label1 and publish Label1 to all users and groups.<br>You have the following files on a computer:<br>✑ File1.doc<br>✑ File2.docx<br>✑ File3.xlsx<br>✑ File4.txt<br>You need to identify which files can have Label1 applied.<br>Which files should you identify?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile1.doc, File2.docx, File3xlsx, and File4.txt\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile2.docx and File3.xlsx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile2.docx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile1.doc, File2.docx, and File3.xlsx only"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 5,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-05-29T10:31:00.000Z",
        "voteCount": 1,
        "content": "Only sensitivity without protection can NOT be applied to .txt files.\nBut...:\nOther file types support classification when they are also protected. For these file types, see the Supported file types for classification and protection section.\nSo: If the General sensitivity label applies classification and does not apply protection: You could apply the General label to a file named sales.pdf but you could not apply this label to a file named sales.txt.\nhttps://learn.microsoft.com/en-us/azure/information-protection/rms-client/clientv2-admin-guide-file-types#supported-file-types-for-classification-and-protection"
      },
      {
        "date": "2023-05-16T08:46:00.000Z",
        "voteCount": 1,
        "content": "TXT is included"
      },
      {
        "date": "2023-03-29T07:02:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/information-protection/rms-client/clientv2-admin-guide-file-types\nExamples:\n\nIf the General sensitivity label applies classification and does not apply protection: You could apply the General label to a file named sales.pdf but you could not apply this label to a file named sales.txt."
      },
      {
        "date": "2023-04-30T00:39:00.000Z",
        "voteCount": 1,
        "content": "the answer is A. \nall files types including txt"
      },
      {
        "date": "2023-03-13T14:40:00.000Z",
        "voteCount": 2,
        "content": "In Microsoft 365, sensitivity labels can be applied to the following file types:\n\n    Word documents: .docx, .docm, .dotx, .dotm, .doc, .dot\n    Excel workbooks: .xlsx, .xlsm, .xlsb, .xltx, .xltm, .xls, .xlt\n    PowerPoint presentations: .pptx, .pptm, .potx, .potm, .ppsx, .ppsm, .ppt, .pot, .pps\n    PDF documents: .pdf\n    Text files: .txt"
      },
      {
        "date": "2023-04-30T00:39:00.000Z",
        "voteCount": 1,
        "content": "the answer is A. \nall files types including txt"
      },
      {
        "date": "2023-03-06T09:41:00.000Z",
        "voteCount": 4,
        "content": "Use of Azure Information Protection Client is still supported and documented. The .txt file types is supported for classification and protection.\n\nDocumentation:\nhttps://learn.microsoft.com/en-us/azure/information-protection/rms-client/clientv2-admin-guide-file-types"
      },
      {
        "date": "2023-04-30T00:39:00.000Z",
        "voteCount": 1,
        "content": "the answer is A. \nall files types including txt"
      },
      {
        "date": "2022-11-25T09:18:00.000Z",
        "voteCount": 2,
        "content": "This is correct. I think you used to be able to apply AIP labels to items as I have in the past and they become protected files such as for File.txt becoming File.ptxt. However in the new unified client in Word I cannot apply a label to .txt file if I open it in Word. The other 3 are fine. Answer is correct."
      },
      {
        "date": "2023-02-19T21:16:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/ko-kr/azure/information-protection/rms-client/clientv2-admin-guide-file-types"
      },
      {
        "date": "2022-11-14T01:54:00.000Z",
        "voteCount": 3,
        "content": "Maybe A is correct.\nIt is indeed possible to apply a label to a txt file, when the label policy has custom access settings or encryption settings. Then the txt file is converted into a *.ptxt file with encrypted/protected content, which can only be opened by the respective recipient.\nNot sure what MS wants to hear from us with that question..."
      },
      {
        "date": "2022-11-03T01:02:00.000Z",
        "voteCount": 3,
        "content": "Not shure about that.\nI can set a label to a txt document with the Azure Information Protection client on my Client."
      },
      {
        "date": "2022-11-09T02:44:00.000Z",
        "voteCount": 3,
        "content": "AIP was deprecated last year"
      },
      {
        "date": "2022-11-14T01:59:00.000Z",
        "voteCount": 1,
        "content": "The UL Client is currently in maintenance mode and they want to integrate functionality now more into the native apps:\nhttps://techcommunity.microsoft.com/t5/security-compliance-and-identity/announcing-aip-unified-labeling-client-maintenance-mode-and/ba-p/3043613"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82220-exam-ms-500-topic-3-question-32-discussion/",
    "body": "You have a Microsoft SharePoint Online site named Site1 that contains the files shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0027800001.jpg\" class=\"in-exam-image\"><br>You have a data loss prevention (DLP) policy named DLP1 that has the advanced DLP rules shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0027800002.jpg\" class=\"in-exam-image\"><br>You apply DLP1 to Site1.<br>Which policy tips will appear for File2?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTip2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTip3 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTip1 only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTip1 and Tip2 only"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 21,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 6,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-30T11:28:00.000Z",
        "voteCount": 14,
        "content": "It's possible for content to match several rules in a DLP policy, but only the policy tip from the most restrictive, highest-priority rule will be shown. For example, a policy tip from a rule that blocks access to content will be shown over a policy tip from a rule that simply sends a notification. This prevents people from seeing a cascade of policy tips.\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/use-notifications-and-policy-tips?view=o365-worldwide"
      },
      {
        "date": "2023-03-22T00:56:00.000Z",
        "voteCount": 2,
        "content": "Given explanation is correct"
      },
      {
        "date": "2023-03-13T14:45:00.000Z",
        "voteCount": 1,
        "content": "'if match, stop processing: No' on Rule 1. Ans is correct."
      },
      {
        "date": "2023-02-11T05:42:00.000Z",
        "voteCount": 3,
        "content": "Tried to replicate the exact same scenario:\nWhen selecting settings for rule 2 getting this error: \"Stop processing additional DLP policies and rules if this rule matches, is only supported for Exchange location.\" Can't even be tested since in the question conditions we have SharePoint DLP policy.\nMS exam question melting my brains. They either go into small details or just look at concept level. I would love to have opportunity after exam to go through questions with MS exam reps and let them demonstrate their answers are correct."
      },
      {
        "date": "2023-02-03T16:24:00.000Z",
        "voteCount": 1,
        "content": "D for me. \nWhen content is evaluated against rules, the rules are processed in priority order. If content matches multiple rules, the first rule evaluated that has the most restrictive action is enforced. For example, if content matches all of the following rules, Rule 3 is enforced because it's the highest priority, most restrictive rule:\n\nRule 1: only notifies users\nRule 2: notifies users, restricts access, and allows user overrides\nRule 3: notifies users, restricts access, and doesn't allow user overrides\nRule 4: restricts access\n\nIn this case, Tip1 and Tip have similar restriction but Tip2 says 'yes' to stop processing if match. \n\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/dlp-policy-reference?view=o365-worldwide#hosted-service-workloads"
      },
      {
        "date": "2023-01-29T19:02:00.000Z",
        "voteCount": 2,
        "content": "Valid on 28/01/23"
      },
      {
        "date": "2023-01-18T04:24:00.000Z",
        "voteCount": 4,
        "content": "C, because highest rank only. Article states that: \"Only the policy tip from the highest priority, most restrictive rule will be shown. For example, a policy tip from a rule that blocks access to content will be shown over a policy tip from a rule that simply sends a notification. This prevents people from seeing a cascade of policy tips.\""
      },
      {
        "date": "2023-01-09T10:28:00.000Z",
        "voteCount": 1,
        "content": "We are talking about policy tips being shown, not about which rule is being applied. Only rule would be applied, but as 2 rules match (well 3, but we stopped processing after the second one) and both have a tip associated with them, both tips would be shown."
      },
      {
        "date": "2022-11-09T05:10:00.000Z",
        "voteCount": 2,
        "content": "Answer is C Tip1 only\nThe Priority parameter specifies a priority value for the policy that determines the order of policy processing. A lower integer value indicates a higher priority, the value 0 is the highest priority, and policies can't have the same priority value"
      },
      {
        "date": "2022-11-17T08:41:00.000Z",
        "voteCount": 1,
        "content": "Does this mean TIP1 is the only option that would ever show up?  Seems like the others would never be selected.  Does the \"If match, stop processing\" change the result at all?"
      },
      {
        "date": "2022-10-31T08:58:00.000Z",
        "voteCount": 3,
        "content": "It's possible for content to match several rules in a DLP policy, but only the policy tip from the most restrictive, highest-priority rule will be shown. For example, a policy tip from a rule that blocks access to content will be shown over a policy tip from a rule that simply sends a notification. This prevents people from seeing a cascade of policy tips."
      },
      {
        "date": "2022-10-22T04:35:00.000Z",
        "voteCount": 1,
        "content": "D\n1 &amp; 2"
      },
      {
        "date": "2022-09-14T22:48:00.000Z",
        "voteCount": 1,
        "content": "Correct for me"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82231-exam-ms-500-topic-3-question-33-discussion/",
    "body": "You have a Microsoft 365 E5 subscription.<br>You create a data loss prevention (DLP) policy and select Use Notifications to inform your users and help educate them on the proper use of sensitive info.<br>Which apps will show the policy tip?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutlook on the web, Outlook Win32, and Outlook for iOS and Android",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutlook Win32 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutlook for iOS and Android only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutlook Win32 and Outlook for iOS and Android only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutlook on the web and Outlook Win32 only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutlook on the web only"
    ],
    "answer": "E",
    "answerDescription": "",
    "votes": [
      {
        "answer": "E",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-04-01T21:58:00.000Z",
        "voteCount": 1,
        "content": "¡Es correcto!\n\nSolamente Outlook en la Web y Outlook Win 32 reciben las sugerencias de directivas DLP.\n\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/dlp-policy-tips-reference?view=o365-worldwide"
      },
      {
        "date": "2023-01-18T04:32:00.000Z",
        "voteCount": 2,
        "content": "E is Correct. Here's a new link for the article https://learn.microsoft.com/en-us/microsoft-365/compliance/dlp-policy-tips-reference?view=o365-worldwide"
      },
      {
        "date": "2022-09-15T00:10:00.000Z",
        "voteCount": 3,
        "content": "Given Ans is correct"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82551-exam-ms-500-topic-3-question-34-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 subscription that uses a default domain name of litwareinc.com.<br>You configure the Sharing settings in Microsoft OneDrive as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04320/0028300001.jpg\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0028400001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0028400002.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/sharepoint/turn-external-sharing-on-or-off",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-21T10:56:00.000Z",
        "voteCount": 5,
        "content": "Answer should be 1, 1, both cannot excess because its a new user"
      },
      {
        "date": "2023-04-30T00:57:00.000Z",
        "voteCount": 2,
        "content": "i disagree. it doesnt expressly say that user1 is a new user, thus he is an existing user. only user2 is a new user."
      },
      {
        "date": "2023-06-02T03:12:00.000Z",
        "voteCount": 1,
        "content": "AB\n\nhttps://docs.microsoft.com/en-us/sharepoint/turn-external-sharing-on-or-off"
      },
      {
        "date": "2022-12-15T02:21:00.000Z",
        "voteCount": 4,
        "content": "I think the given answer is correct:\n\nWhat other users are saying about: \n\"Allow sharing only with guests who are already in your directory. These guests may exist in your directory because they previously accepted sharing invitations or because they were manually added, such as through Azure B2B collaboration. (To see the guests in your organization, go to the Guests page in the Microsoft 365 admin center).\"\n\nIs correct, however, if you add the user as a guest user in the tenant and than create the link. The user will already be member of the tenant. If you first create the link, than add the user to your tenant, the user will not be able to access the link. I imagine they compare the link date with the user account creation date."
      },
      {
        "date": "2022-12-07T15:19:00.000Z",
        "voteCount": 1,
        "content": "The second box should be the third one.\n\nhttps://learn.microsoft.com/en-us/sharepoint/turn-external-sharing-on-or-off#which-option-to-select\nIn the description of Existing guests, it says\n\"Allow sharing only with guests who are already in your directory. These guests may exist in your directory because they previously accepted sharing invitations or because they were manually added, such as through Azure B2B collaboration. (To see the guests in your organization, go to the Guests page in the Microsoft 365 admin center).\""
      },
      {
        "date": "2022-11-23T13:19:00.000Z",
        "voteCount": 1,
        "content": "Given answer is wrong. I just tested it and a newly made guest user in my tenant with the allowed domain still could not be sent the onedrive doc."
      },
      {
        "date": "2022-11-25T09:26:00.000Z",
        "voteCount": 3,
        "content": "to elaborate it says EXISTING USERS ONLY in the onedrive setting. A new user even in the whitelisted tenant won't be allowed."
      },
      {
        "date": "2022-09-17T09:51:00.000Z",
        "voteCount": 2,
        "content": "The given answer is correct."
      },
      {
        "date": "2022-11-30T00:33:00.000Z",
        "voteCount": 2,
        "content": "I also think that given answer is correct. User2 is newly invited to the tenant, so after accepting the invitation, the user is an \"existing\" external account and thus link can be created for the user. However User2 must be invited upfront by a User Administrator or Global Admin. The OneDrive setting shown in the exhibit prevents the owner of the onedrive to invite users automatically by just creating a share link to a file or folder."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/87158-exam-ms-500-topic-3-question-35-discussion/",
    "body": "You have a Microsoft 365 subscription that contains the users shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0028500001.png\" class=\"in-exam-image\"><br>You need to prevent users in the finance department from sharing files with users in the research department.<br>Which type of policy should you configure?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tinformation barrier\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tinsider risk management",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConditional Access",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcommunication compliance"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-11-08T07:15:00.000Z",
        "voteCount": 3,
        "content": "Given answer is correct"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 36,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80091-exam-ms-500-topic-3-question-36-discussion/",
    "body": "You have a Microsoft 365 E5 subscription.<br>You need to prevent users from uploading data loss prevention (DLP)-protected documents to the following third-party websites:<br>✑ web1.contoso.com<br>web2.contoso.com<br><img src=\"/assets/media/exam-media/04320/0028500003.png\" class=\"in-exam-image\"><br>The solution must minimize administrative effort.<br>To what should you set the Service domains setting for Endpoint DLP?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tweb1.contoso.com and web2.contoso.com\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcontoso.com",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t*.contoso.com",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tweb*.contoso.com"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 7,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-26T18:45:00.000Z",
        "voteCount": 6,
        "content": "So, A, C or D would stop you uploading to web1.contoso.com and web2.contoso.com, but only A would stop you uploading to ONLY web1.contoso.com and web2.contoso.com.\n\nC would stop you from uploading to &lt;anysubdomain&gt;.contoso.com and D would stop you uploading to web&lt;anynumber&gt;.contoso.com, both of which could have unintented consequences.\n\nSo, like any multiple choice, it seems we need to go with the MOST correct answer, A."
      },
      {
        "date": "2023-03-12T08:39:00.000Z",
        "voteCount": 1,
        "content": "In real life, I would block the whole domain, not just specific URLs. If you can trust two addresses in the same external domain, you shouldn't trust any site in the domain."
      },
      {
        "date": "2023-04-30T01:06:00.000Z",
        "voteCount": 1,
        "content": "i disagree. doing entire domain wide blocks could break other apps. keep your denials as focused as possible. same as never use any | any rule."
      },
      {
        "date": "2022-09-25T20:17:00.000Z",
        "voteCount": 1,
        "content": "So what's the real answer here anyone? Its confusing..."
      },
      {
        "date": "2022-09-12T11:46:00.000Z",
        "voteCount": 1,
        "content": "an * is a wildcard for example :\n *.contoso.com wil include evrything befor .contoso.com and  will be blocked\nweb*.contoso.com \nweb1wil be blocked\nweb2 wil be blocked\nweb3 wil be blocked\n\nso the only correct awnser is A"
      },
      {
        "date": "2022-09-04T23:05:00.000Z",
        "voteCount": 2,
        "content": "I would say C as *contoso.com according to de site matches ://anysubdomain.contoso.com/"
      },
      {
        "date": "2022-09-04T07:42:00.000Z",
        "voteCount": 1,
        "content": "Why it is not D?\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/dlp-configure-endpoint-settings?view=o365-worldwide"
      },
      {
        "date": "2022-09-05T04:52:00.000Z",
        "voteCount": 2,
        "content": "Because you will also block all other numbers (web3, web4,...). Question is only to block web1 and web2"
      },
      {
        "date": "2023-06-20T12:47:00.000Z",
        "voteCount": 1,
        "content": "Because web*.contoso.com would block not only web1.contoso.com and web2.contoso.com, but also, web4, web5, ..... etc."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 37,
    "url": "https://www.examtopics.com/discussions/microsoft/view/96688-exam-ms-500-topic-3-question-37-discussion/",
    "body": "You have a Microsoft 365 subscription that uses Microsoft SharePoint Online.<br>You need to ensure that users can only share files with users at specified partner companies. The solution must minimize administrative effort.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLimit external sharing by domain.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet External sharing to New and existing guests.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAllow only users in specific security groups to share externally.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet File and folder links to Specific people."
    ],
    "answer": "A",
    "answerDescription": "Limiting domains -<br>You can limit domains by allowing only the domains you specify or by allowing all domains except those you block.<br>To limit domains at the organization level<br>1. Go to Sharing in the SharePoint admin center, and sign in with an account that has admin permissions for your organization.<br>2. Under Advanced settings for external sharing, select the Limit external sharing by domain check box, and then select Add domains.<br>3. To create an allowlist (most restrictive), select Allow only specific domains; to block only the domains you specify, select Block specific domains.<br>4. List the domains (maximum of 3000) in the box provided, using the format domain.com.<br>5. Etc.<br>Reference:<br>https://docs.microsoft.com/en-us/sharepoint/restricted-domains-sharing",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-23T19:04:00.000Z",
        "voteCount": 2,
        "content": "A is correct"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 38,
    "url": "https://www.examtopics.com/discussions/microsoft/view/87424-exam-ms-500-topic-3-question-38-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 E5 tenant that contains a published sensitivity label named Sensitivity1.<br>You plan to create an Azure Active Directory group named Group1 and assign Sensitivity1 to Group1.<br>How should you configure Group1? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0028800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0028900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: EnableMIPLabels -<br>The sensitivity label option is only displayed for groups when all the following conditions are met:<br>* The feature is enabled, EnableMIPLabels is set to True in from the Azure AD PowerShell module.<br>* The group is a Microsoft 365 group.<br>* Etc.<br><br>Box 2: Microsoft 365 -<br>Incorrect:<br>* Not ClassificationList:<br>Classic classifications are the old classifications you set up by defining values for the ClassificationList setting in Azure AD PowerShell. When this feature is enabled, those classifications will not be applied to groups.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/active-directory/enterprise-users/groups-assign-sensitivity-labels",
    "votes": [],
    "comments": [
      {
        "date": "2023-05-05T10:27:00.000Z",
        "voteCount": 1,
        "content": "Setting: EnableMIPLabels.\nType: Sensitivity labels apply to groups of services like Outlook, Microsoft Teams, and SharePoint (Microsoft 365).\n \nhttps://learn.microsoft.com/es-es/azure/active-directory/enterprise-users/groups-assign-sensitivity-labels"
      },
      {
        "date": "2023-03-06T11:55:00.000Z",
        "voteCount": 1,
        "content": "The type needs to be Microsoft 365. The key here is the wording of \"assign Sensitivity1 to Group1\" instead of using a label policy for the group. Many of these test questions appear to not be written carefully, so it is easy to miss in this case."
      },
      {
        "date": "2023-03-04T09:33:00.000Z",
        "voteCount": 1,
        "content": "Proposed answer is correct: statement says you need to apply Label1 to Group1. Labels can be applied to M365 groups only"
      },
      {
        "date": "2022-11-14T02:29:00.000Z",
        "voteCount": 3,
        "content": "I think on \"Type\" this is multi answer question.\nSo Distribution, Mail-enabled security and Microsoft 365 can be assigned a Label Policy.\nBasically all groups that are email enabled. Groups need to have an email address. Not possible for Security only group."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 39,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80092-exam-ms-500-topic-3-question-39-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft E5 subscription that contains two users named User1 and User2.<br>You have a Microsoft SharePoint site named Site1. Site1 stores files that contain IP addresses as shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0029000001.png\" class=\"in-exam-image\"><br>User1 is assigned the SharePoint admin role for Site1. User2 is a member of Site1.<br>You create the data loss prevention (DLP) policy shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04320/0029100001.png\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0029200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0029300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Yes -<br>Note: Key tasks of the SharePoint admin<br>Here are some of the key tasks users can do when they are assigned to the SharePoint admin role:<br><br>Create sites -<br><br>Delete sites -<br>Manage sharing settings at the organization level<br><br>Add and remove site admins -<br><br>Manage site storage limits -<br><br>Box 2: No -<br>File1.text contains 3 IP addresses.<br><br>Box 3: Yes -<br>File2.docx contains only 1 IP address.",
    "votes": [],
    "comments": [
      {
        "date": "2023-05-05T10:05:00.000Z",
        "voteCount": 3,
        "content": "Y: Yes, because you are a SharePoint administrator.\nN: No, because there are 2 instances, the file will be locked.\nY: Yes, since there are no more than 2 instances."
      },
      {
        "date": "2023-03-06T12:26:00.000Z",
        "voteCount": 4,
        "content": "For SharePoint, OneDrive, and Teams content the Block Everyone DLP action means \"Only the content owner, last modifier, and site admin will continue to have access\"\nFrom the Microsoft documentation: https://learn.microsoft.com/en-us/microsoft-365/compliance/dlp-policy-reference?view=o365-worldwide"
      },
      {
        "date": "2022-09-04T07:55:00.000Z",
        "voteCount": 2,
        "content": "I suppose here the answer is Y,Y,Y. Because we need 2 instances of sensitive info it means 2x 3 times IP address, so one instance of 3 IP addresses should not work.\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/create-test-tune-dlp-policy?view=o365-worldwide"
      },
      {
        "date": "2022-09-04T07:57:00.000Z",
        "voteCount": 3,
        "content": "My fault, I read three times instead of these :) so the answers are correct."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 40,
    "url": "https://www.examtopics.com/discussions/microsoft/view/84137-exam-ms-500-topic-3-question-40-discussion/",
    "body": "You have a Microsoft 365 E5 subscription that contains the devices shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0029400001.png\" class=\"in-exam-image\"><br>You plan to use the encryption report in Microsoft Endpoint Manager to view devices that have encryption enabled.<br>Which devices will be included in the encryption report?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDevice1 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDevice and Device2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDevice1 and Device4 only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDevice1, Device2, and Device4 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDevice1, Device2, Device3, and Device4"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 20,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-12-04T02:51:00.000Z",
        "voteCount": 9,
        "content": "system versions: macOS 10.13 or later Windows version 1607 or later https://learn.microsoft.com/en-us/mem/intune/protect/encryption-monitor"
      },
      {
        "date": "2022-12-15T02:36:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      },
      {
        "date": "2023-05-05T10:19:00.000Z",
        "voteCount": 2,
        "content": "Only devices that meet the following minimum requirements can be included in the Microsoft Endpoint Manager encryption report:\n\n* macOS 10.13 or later\n* Windows version 1607 or higher\n\nhttps://learn.microsoft.com/en-us/mem/intune/protect/encryption-monitor"
      },
      {
        "date": "2022-11-02T01:57:00.000Z",
        "voteCount": 2,
        "content": "system versions:\nmacOS 10.13 or later\nWindows version 1607 or later\nhttps://learn.microsoft.com/en-us/mem/intune/protect/encryption-monitor"
      },
      {
        "date": "2022-11-02T01:57:00.000Z",
        "voteCount": 2,
        "content": "system versions:\nmacOS 10.13 or later\nWindows version 1607 or later\nhttps://learn.microsoft.com/en-us/mem/intune/protect/encryption-monitor"
      },
      {
        "date": "2022-10-30T03:14:00.000Z",
        "voteCount": 3,
        "content": "View encryption details\nThe encryption report shows common details across the supported devices you manage. The following sections provide details about the information that Intune presents in the report.\n\nPrerequisites\nThe encryption report supports reporting on devices that run the following operating system versions:\n\nmacOS 10.13 or later\nWindows version 1607 or later"
      },
      {
        "date": "2022-10-02T03:00:00.000Z",
        "voteCount": 2,
        "content": "The question is about being able to view encryption report. As per Nobal's answer, only Mac and Windows are supported."
      },
      {
        "date": "2022-09-30T19:09:00.000Z",
        "voteCount": 2,
        "content": "Prerequisites\nThe encryption report supports reporting on devices that run the following operating system versions:\nmacOS 10.13 or later\nWindows version 1607 or later\nhttps://learn.microsoft.com/en-us/mem/intune/protect/encryption-monitor"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 41,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82622-exam-ms-500-topic-3-question-41-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft SharePoint Online site named Site1 that has the users shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0029500001.jpg\" class=\"in-exam-image\"><br>You create the retention labels shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0029500002.jpg\" class=\"in-exam-image\"><br>You publish the retention labels to Site1.<br>On March 1, 2021, you assign the retention labels to the files shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0029500003.jpg\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0029600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0029600002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: No -<br>User1 is the owner. Retention1 applies to File1. Retention1 has a 4 year retention period.<br>Note: How retention settings work with content in place<br>When content has retention settings assigned to it, that content remains in its original location. Most of the time, people continue to work with their documents or mail as if nothing's changed. But if they edit or delete content that's included in the retention policy, a copy of the content is automatically retained.<br><br>Box 2: Yes -<br>March 10 2025 is outside the retention period. The file can be deleted.<br><br>Box 3: No -<br>The file has already been deleted by the retention policy at that point in time.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/compliance/retention?view=o365-worldwide",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-30T19:29:00.000Z",
        "voteCount": 9,
        "content": "I believe the answer should be Y Y N\nIf the content is modified or deleted during the retention period, a copy of the original content as it existed when the retention settings were assigned is created in the Preservation Hold library. \nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/retention-policies-sharepoint?view=o365-worldwide#how-retention-works-for-sharepoint-and-onedrive"
      },
      {
        "date": "2023-05-05T09:21:00.000Z",
        "voteCount": 1,
        "content": "Y: Even if a file is in or out of the retention period, it is still possible to delete it, but not permanently.\nY: Even if a file is in or out of the retention period, it is still possible to delete it, but not permanently.\nN: No, since by that date the file will have been deleted and no editing will be possible."
      },
      {
        "date": "2022-12-20T11:31:00.000Z",
        "voteCount": 1,
        "content": "The answer is YYN. Regarding the first question, retention policies/labels do not change the regular operation of office docs. So the file can be deleted. Actually, the only interruption by the retention feature is that users receive an error if they try to delete a document library or site subject to a retention policy."
      },
      {
        "date": "2022-12-19T04:25:00.000Z",
        "voteCount": 2,
        "content": "I think YYN:\nY: User1 can delete file1 and the file will be retained in preservation hold library\nY: If file is still there user2 can delete as the label is retain only\nN: file2 is already deleted by the label (retain and delete after 2 years)"
      },
      {
        "date": "2022-11-24T06:44:00.000Z",
        "voteCount": 1,
        "content": "Y Y Y \n\nit's a retention label , not a retention policy that require to mark a content as a record !!!!!!!!!!!!!!!!!!!!!!!"
      },
      {
        "date": "2022-12-19T04:20:00.000Z",
        "voteCount": 1,
        "content": "The label is published. Read the question: \"You publish the retention labels to Site1.\""
      },
      {
        "date": "2022-10-15T14:49:00.000Z",
        "voteCount": 1,
        "content": "Y Y N \nHe can delete it"
      },
      {
        "date": "2022-09-24T07:35:00.000Z",
        "voteCount": 2,
        "content": "Note: How retention settings work with content in place\nWhen content has retention settings assigned to it, that content remains in its original location. Most of the time, people continue to work with their documents or mail as if nothing's changed. But if they edit or delete content that's included in the retention policy, a copy of the content is automatically retained.\n\nSo user1 should be able to delete file1 and then the copy is retained in another location?"
      },
      {
        "date": "2022-09-18T03:07:00.000Z",
        "voteCount": 2,
        "content": "Given answers are correct"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 42,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82297-exam-ms-500-topic-3-question-42-discussion/",
    "body": "HOTSPOT -<br>You have a Microsoft 365 E5 subscription that contains a Microsoft SharePoint Online site named Site1 and a sensitivity label named Label1.<br>The external sharing settings for Site1 are configured as shown in the Site1 exhibit. (Click the Site1 tab.)<br><img src=\"/assets/media/exam-media/04320/0029800001.jpg\" class=\"in-exam-image\"><br>The external sharing settings for Label1 are configured as shown in the Label1 exhibit. (Click the Label1 tab.)<br><img src=\"/assets/media/exam-media/04320/0029900001.jpg\" class=\"in-exam-image\"><br>Label 1 is applied to Site1.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04320/0029900002.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0030000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Yes -<br>The Sensitive label setting of Label1 in the second exhibit 2overrides the setting in exhibit 1.<br><br>Box 2: No -<br>Box 3: No",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-15T05:54:00.000Z",
        "voteCount": 7,
        "content": "Correct!"
      },
      {
        "date": "2023-05-05T09:32:00.000Z",
        "voteCount": 2,
        "content": "Y: The sensitivity label takes precedence over any type of configuration.\nN: It says so right there, no invitation required.\nN: Anyone can do it."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 43,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83403-exam-ms-500-topic-3-question-43-discussion/",
    "body": "You have a Microsoft 365 subscription that contains a Microsoft 365 group named Group1. Group1 contains 100 users and has dynamic user membership.<br>All users have Windows 10 devices and use Microsoft SharePoint Online and Exchange Online.<br>You create a sensitivity label named Label1 and publish Label1 as the default label for Group1.<br>You need to ensure that the users in Group1 must apply Label1 to their email and documents.<br>Which two actions should you perform? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the Azure Information Protection unified labeling client on the Windows 10 devices.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft 365 Compliance center, modify the settings of the Label1 policy.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstall the Active Directory Rights Management Services (AD RMS) client on the Windows 10 devices.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft 365 Compliance center, create an auto-labeling policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Active Directory admin center, set Membership type for Group1 to Assigned."
    ],
    "answer": "AB",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AB",
        "count": 4,
        "isMostVoted": true
      },
      {
        "answer": "BE",
        "count": 3,
        "isMostVoted": false
      },
      {
        "answer": "DE",
        "count": 3,
        "isMostVoted": false
      },
      {
        "answer": "UB",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-24T05:20:00.000Z",
        "voteCount": 10,
        "content": "A = unified labeling client (client side) + D = auto labeling policy (service side)"
      },
      {
        "date": "2023-05-05T10:35:00.000Z",
        "voteCount": 2,
        "content": "A: Azure Information Protection unified labeling is a feature of the Microsoft Azure data protection platform that enables users and administrators to label and classify data based on its level of sensitivity and define corresponding protection policies.\nB: By modifying the label we can enable labeling by users."
      },
      {
        "date": "2023-03-12T09:40:00.000Z",
        "voteCount": 2,
        "content": "I have been managing Sensitivity Labels and policies (previously classification) for over 3 years in our or organisation. It's AB."
      },
      {
        "date": "2023-01-31T02:40:00.000Z",
        "voteCount": 3,
        "content": "I think B and E. The label is already published. All you have to do is modify the policy. Edit the policy, tab Settings \"Require users to apply a label to their emails and documents\""
      },
      {
        "date": "2023-01-08T21:37:00.000Z",
        "voteCount": 2,
        "content": "Answer: A, B\nD is wrong. Auto-Labeling policy will not achieve the requirement “You need to ensure that the users in Group1 must apply Label1 to their email and documents”\nThis requirement is a setting in the sensitivity label policy that can be selected.\nAuto-Labeling is an admin activity. \nAuto-Labeling policy: \nWhen you create a sensitivity label, you can automatically assign that label to files and emails when it matches conditions that you specify.\nThis ability to apply sensitivity labels to content automatically is important because:\n•\tYou don't need to train your users when to use each of your classifications.\n•\tYou don't need to rely on users to classify all content correctly.\n•\tUsers no longer need to know about your policies—they can instead focus on their work.\nE is wrong. It is not a must to Membership type for Group1 to be Assigned.\nLabel can be applied to both Assigned and Dynamic."
      },
      {
        "date": "2022-12-20T12:32:00.000Z",
        "voteCount": 3,
        "content": "Answers are DE. A is not selected because the question did not mention any local storage. It is only about Sharepoint online and exchange online,"
      },
      {
        "date": "2023-01-09T11:14:00.000Z",
        "voteCount": 1,
        "content": "Here people, this is the way. @King2 is wrong because users are only using online apps."
      },
      {
        "date": "2022-11-24T07:27:00.000Z",
        "voteCount": 2,
        "content": "the answers are A and B"
      },
      {
        "date": "2023-01-21T16:02:00.000Z",
        "voteCount": 3,
        "content": "This is correct, the key part of the question is users MUST apply the labels.  You edit the policy to make labeling mandatory and install the client side enforcement app to extend that requirement to the desktop apps.  Auto-lableing may apply labels automatically but it is not forcing the users to apply them"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 44,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81898-exam-ms-500-topic-3-question-44-discussion/",
    "body": "DRAG DROP -<br>Your company has two departments named department1 and department2 and a Microsoft 365 E5 subscription.<br>You need to prevent communication between the users in department1 and the users in department2.<br>How should you complete the PowerShell script? To answer, drag the appropriate values to the correct targets. Each value may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04320/0030100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04320/0030200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: New-OrganizationSegment -<br>Use the New-OrganizationSegment cmdlet to create organization segments for use with information barrier policies in the Microsoft Purview compliance portal.<br>Organization Segments are not in effect until you apply information barrier policies.<br>Syntax:<br><br>New-OrganizationSegment -<br>[-Name] &lt;String&gt;<br>-UserGroupFilter &lt;String&gt;<br>[-Confirm]<br>[-WhatIf]<br>[&lt;CommonParameters&gt;]<br>Box 2: New-InformationBarrierPolicy<br>To define your first blocking policy, use the New-InformationBarrierPolicy cmdlet with the SegmentsBlocked parameter.<br>Reference:<br>https://docs.microsoft.com/en-us/powershell/module/exchange/new-organizationsegment https://docs.microsoft.com/en-us/microsoft-365/compliance/information-barriers-policies",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-12T17:41:00.000Z",
        "voteCount": 3,
        "content": "The given answers are correct.\nhttps://docs.microsoft.com/en-us/powershell/module/exchange/new-organizationsegment?view=exchange-ps\nhttps://docs.microsoft.com/en-us/powershell/module/exchange/new-informationbarrierpolicy?view=exchange-ps"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 45,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80511-exam-ms-500-topic-3-question-45-discussion/",
    "body": "You have a Microsoft 365 E5 subscription that contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/04320/0030300001.jpg\" class=\"in-exam-image\"><br>You have a retention label configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04320/0030400001.jpg\" class=\"in-exam-image\"><br>You apply the label to the resources.<br>Which items can you delete?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMail1 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFile1.docx and File2.xlsx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMail1 and File1.docx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMail1 and File2.xlsx only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMail1, File1.docx, and File2.xlsx\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "E",
    "answerDescription": "",
    "votes": [
      {
        "answer": "E",
        "count": 21,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-05-05T10:45:00.000Z",
        "voteCount": 4,
        "content": "It is possible to delete all of these files, but due to current policy a copy of their content will always be kept."
      },
      {
        "date": "2023-01-20T03:13:00.000Z",
        "voteCount": 3,
        "content": "all items"
      },
      {
        "date": "2022-10-15T15:25:00.000Z",
        "voteCount": 3,
        "content": "Valid on exam October 14, 2022"
      },
      {
        "date": "2022-12-04T07:13:00.000Z",
        "voteCount": 2,
        "content": "Answer D is correct or Answer E ?"
      },
      {
        "date": "2023-01-09T11:23:00.000Z",
        "voteCount": 2,
        "content": "Have you done a test? System doesn't tell you if you got it right or wrong, just your final score."
      },
      {
        "date": "2022-10-14T00:38:00.000Z",
        "voteCount": 2,
        "content": "All items"
      },
      {
        "date": "2022-10-05T10:43:00.000Z",
        "voteCount": 1,
        "content": "All items"
      },
      {
        "date": "2022-09-26T23:21:00.000Z",
        "voteCount": 1,
        "content": "It clearly shows all locations."
      },
      {
        "date": "2022-09-12T10:03:00.000Z",
        "voteCount": 4,
        "content": "All the items can be deleted according to the settings\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/retention?view=o365-worldwide#how-retention-settings-work-with-content-in-place"
      },
      {
        "date": "2022-09-11T05:23:00.000Z",
        "voteCount": 2,
        "content": "All the items can be deleted according to the settings"
      },
      {
        "date": "2022-09-05T23:05:00.000Z",
        "voteCount": 4,
        "content": "All the items can be deleted according to the settings\nhttps://docs.microsoft.com/en-us/microsoft-365/compliance/retention?view=o365-worldwide#how-retention-settings-work-with-content-in-place"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 46,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79189-exam-ms-500-topic-3-question-46-discussion/",
    "body": "You have a Microsoft 365 E5 subscription.<br>You plan to implement retention policies for Microsoft Teams.<br>Which item types can be retained?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tvoice memos from the Teams mobile client",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tcode snippets",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tembedded images\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 23,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-09-01T15:17:00.000Z",
        "voteCount": 14,
        "content": "https://docs.microsoft.com/en-us/microsoft-365/compliance/retention-policies-teams?view=o365-worldwide"
      },
      {
        "date": "2022-10-23T15:32:00.000Z",
        "voteCount": 2,
        "content": "From the link above: Code snippets, recorded voice memos from the Teams mobile client, thumbnails, announcement images, and reactions from others in the form of emoticons aren't retained when you use retention policies for Teams."
      },
      {
        "date": "2023-05-15T15:28:00.000Z",
        "voteCount": 1,
        "content": "...the following items can be retained for compliance reasons:&nbsp;Video clips, embedded images, tables, hypertext links, links to other Teams messages and files, and&nbsp;card content.\n\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/retention-policies-teams?view=o365-worldwide#whats-included-for-retention-and-deletion"
      },
      {
        "date": "2023-05-05T10:46:00.000Z",
        "voteCount": 1,
        "content": "Embedded images."
      },
      {
        "date": "2023-01-20T03:16:00.000Z",
        "voteCount": 2,
        "content": "\"following items can be retained for compliance reasons: Video clips, embedded images, tables, hypertext links, links to other Teams messages and files, and card content\""
      },
      {
        "date": "2022-09-12T03:49:00.000Z",
        "voteCount": 3,
        "content": "Code snippets, recorded voice memos from the Teams mobile client, thumbnails, announcement images, and reactions from others in the form of emoticons aren't retained when you use retention policies for Teams."
      },
      {
        "date": "2022-09-06T07:02:00.000Z",
        "voteCount": 1,
        "content": "123WB got it"
      },
      {
        "date": "2022-09-05T23:11:00.000Z",
        "voteCount": 1,
        "content": "They mislead us with their incorrect answers."
      },
      {
        "date": "2023-01-09T11:25:00.000Z",
        "voteCount": 1,
        "content": "Lol yes and retention is the easiest part of the test"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 47,
    "url": "https://www.examtopics.com/discussions/microsoft/view/102634-exam-ms-500-topic-3-question-47-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft 365 E5 tenant that contains two users named User1 and User2 and a Microsoft SharePoint Online site named Site1 as shown in the following exhibit.<br><br><img src=\"https://img.examtopics.com/ms-500/image389.png\"><br><br>For Site1, the users are assigned the roles shown in the following table.<br><br><img src=\"https://img.examtopics.com/ms-500/image390.png\"><br><br>You publish a retention label named Retention1 to Site1.<br><br>To which files can the users apply Retention1? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/ms-500/image391.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/ms-500/image392.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-05-16T09:01:00.000Z",
        "voteCount": 1,
        "content": "correct is C"
      },
      {
        "date": "2023-03-14T12:59:00.000Z",
        "voteCount": 1,
        "content": "Resource for the icons. Answer still not clear\n\nhttps://gcc.microsoftcrmportals.com/blogs/office365-news/190220SPIcons/"
      },
      {
        "date": "2023-03-14T13:04:00.000Z",
        "voteCount": 10,
        "content": "Both User1 and User2 can apply Retention1 to all the files in Site1.\n\nExplanation:\nAs User1 is the owner of the Site1, they have full control over the site and its contents, including the ability to apply retention labels to any file in the site. Therefore, User1 can apply Retention1 to all the files in Site1, including File1.docx, File2.docx, and File3.docx.\n\nUser2 is assigned the Member role in Site1, which gives them the ability to add, edit, and delete files in the site, as well as apply retention labels to files. Although File2.docx and File3.docx have DLP warning and blocked icons respectively, this does not prevent User2 from applying a retention label to these files. Therefore, User2 can apply Retention1 to all the files in Site1, including File1.docx, File2.docx, and File3.docx.\n\nC for both"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 48,
    "url": "https://www.examtopics.com/discussions/microsoft/view/102018-exam-ms-500-topic-3-question-48-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft SharePoint Online site named Site1 that contains the files shown in the following table.<br><br><img src=\"https://img.examtopics.com/ms-500/image393.png\"><br><br>You have a data loss prevention (DLP) policy named DLP1 that has the advanced DLP rules shown in the following table.<br><br><img src=\"https://img.examtopics.com/ms-500/image394.png\"><br><br>You apply DLP1 to Site1.<br><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/ms-500/image395.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/ms-500/image396.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-09T09:35:00.000Z",
        "voteCount": 10,
        "content": "Answer is YNN\nAll 3 files have the Tip1 policy tip.\n\nFrom the doc:\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/use-notifications-and-policy-tips?view=o365-worldwide\nIt's possible for content to match several rules in a DLP policy, but only the policy tip from the most restrictive, highest-priority rule will be shown. For example, a policy tip from a rule that blocks access to content will be shown over a policy tip from a rule that simply sends a notification. This prevents people from seeing a cascade of policy tips."
      },
      {
        "date": "2023-03-14T07:17:00.000Z",
        "voteCount": 3,
        "content": "Agreed, the answer is YNN but N for Q3 because .dat files are not monitored\n.docx and .txt files are monitored. This is the answer in another question.\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/endpoint-dlp-learn-about?view=o365-worldwide"
      },
      {
        "date": "2023-04-16T20:35:00.000Z",
        "voteCount": 2,
        "content": "Answer is YYN\nEndpoint DLP supports monitoring of these file types through policy:\n\nWord files\nPowerPoint files\nExcel files\nPDF files\n.csv files\n.tsv files\n.txt files\n.rtf files\n.c files\n.class files (Windows only)\n.cpp files\n.cs files\n.h files\n.java files"
      },
      {
        "date": "2023-05-20T06:35:00.000Z",
        "voteCount": 1,
        "content": ".docx files are \"Word files\". So the answer should be YNN"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 49,
    "url": "https://www.examtopics.com/discussions/microsoft/view/101918-exam-ms-500-topic-3-question-49-discussion/",
    "body": "You have a Microsoft 365 tenant that uses Azure Information Protection to encrypt sensitive content.<br><br>You plan to implement Microsoft Defender for Cloud Apps to inspect protected files that are uploaded to Microsoft OneDrive for Business.<br><br>You need to ensure that all Azure Information Protection-protected files can be scanned by using Defender for Cloud Apps.<br><br>Which two actions should you perform? Each correct answer presents part of the solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Purview compliance portal, create a data loss prevention (DLP) policy that contains an exception for content that contains a sensitive information type.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Defender for Cloud Apps portal, enable file monitoring of software as a service (SaaS) apps.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Defender for Cloud Apps portal, create an OAuth app policy for apps that have the Have full access to user files permission.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Azure Active Directory admin center, grant Microsoft Defender for Cloud Apps permission to read all the protected content of the tenant."
    ],
    "answer": "AD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-08T10:58:00.000Z",
        "voteCount": 3,
        "content": "To ensure that all Azure Information Protection-protected files can be scanned by using Defender for Cloud Apps, the following actions should be performed:\n\nB. From the Microsoft Defender for Cloud Apps portal, enable file monitoring of software as a service (SaaS) apps: This will allow Defender for Cloud Apps to monitor the files uploaded to OneDrive for Business and other SaaS apps.\n\nD. From the Azure Active Directory admin center, grant Microsoft Defender for Cloud Apps permission to read all the protected content of the tenant: This will allow Defender for Cloud Apps to access the encrypted content and scan it for threats.\n\nOption A is not relevant to this scenario as it pertains to creating a data loss prevention policy that contains an exception for content that contains a sensitive information type, which is not related to enabling Defender for Cloud Apps to scan encrypted content.\n\nOption C is also not relevant to this scenario as it pertains to creating an OAuth app policy for apps that have the \"Have full access to user files\" permission, which is not related to enabling Defender for Cloud Apps to scan encrypted content."
      },
      {
        "date": "2023-03-22T02:00:00.000Z",
        "voteCount": 3,
        "content": "I don’t know how much accurate ChatGPT answers are."
      },
      {
        "date": "2023-05-20T09:31:00.000Z",
        "voteCount": 1,
        "content": "I agree, I got similar answer from ChatGPT with out putting answers on the message. AI can be wrong, and will be wrong at times. Humans write these exam questions and parse the answers. So I agree I do not believe ChatGPT answers are solid ones."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 50,
    "url": "https://www.examtopics.com/discussions/microsoft/view/101919-exam-ms-500-topic-3-question-50-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a Microsoft 365 E5 subscription that contains the users shown in the following table.<br><br><img src=\"https://img.examtopics.com/ms-500/image397.png\"><br><br>You need to delegate the following tasks:<br><br>•\tCreate and manage data loss prevention (DLP) policies.<br>•\tReview classified content by using Content explorer.<br><br>The solution must use the principle of least privilege.<br><br>Which user should perform each task? To answer, drag the appropriate users to the correct tasks. Each user may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/ms-500/image398.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/ms-500/image399.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-20T19:08:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct.\n\nInformation Protection Admins:\tCreate, edit, and delete DLP policies, sensitivity labels and their policies, and all classifier types. Manage endpoint DLP settings and simulation mode for auto-labeling policies.\n\nInformation Protection Analysts:\tAccess and manage DLP alerts and activity explorer. View-only access to DLP policies, sensitivity labels and their policies, and all classifier types.\n\nInformation Protection Investigators: \tAccess and manage DLP alerts, activity explorer, and content explorer. View-only access to DLP policies, sensitivity labels and their policies, and all classifier types."
      },
      {
        "date": "2023-03-28T15:01:00.000Z",
        "voteCount": 1,
        "content": "Given answer is correct. \n\nplease don't copy and paste chat gpt, check MS documentation. \nhttps://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/scc-permissions?view=o365-worldwide\n\nUser1 - admin is the only one who can create DLP policies. User3 - investigator is the least priv who can use content explorer"
      },
      {
        "date": "2023-03-19T03:50:00.000Z",
        "voteCount": 2,
        "content": "If using the principle of least privilege, the Information protection analyst should perform both tasks. The Information protection administrator should not be used for either task, and the Information protection investigator is not required for either task.\n\nBothe times user 2"
      },
      {
        "date": "2023-03-13T04:45:00.000Z",
        "voteCount": 2,
        "content": "Create and manage DLP policies -&gt; User1\nReview classified content by using Content explorer -&gt; User3\n\nInformation Protection Admin: Create, edit, and delete DLP policies, sensitivity labels and their policies, and all classifier types. Manage endpoint DLP settings and simulation mode for auto-labeling policies.\n\nInformation Protection Investigators:\tAccess and manage DLP alerts, activity explorer, and content explorer. View-only access to DLP policies, sensitivity labels and their policies, and all classifier types.\n\nReference: https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/scc-permissions"
      },
      {
        "date": "2023-03-08T11:00:00.000Z",
        "voteCount": 1,
        "content": "• Create and manage data loss prevention (DLP) policies: User2\n• Review classified content by using Content explorer: User3\n\nExplanation:\n• User2 should create and manage data loss prevention (DLP) policies as this task requires a user with permissions to create and manage DLP policies. User2 is a member of the Compliance Management role group, which has the necessary permissions to create and manage DLP policies.\n\n• User3 should review classified content by using Content explorer as this task requires a user with permissions to review content that has been classified by DLP policies. User3 is a member of the Compliance Data Administrator role group, which has the necessary permissions to review classified content using Content explorer.\n\nUser1 does not have the necessary permissions to perform either task. User4 is a Global Admin, who has full permissions across all Microsoft 365 services and features, but assigning such high-level permissions to a user for such specific tasks is not in line with the principle of least privilege."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 51,
    "url": "https://www.examtopics.com/discussions/microsoft/view/106011-exam-ms-500-topic-3-question-51-discussion/",
    "body": "You have a Microsoft 365 E5 subscription that contains a retention policy named RP1 as shown in the following table.<br><br><img src=\"https://img.examtopics.com/ms-500/image422.png\"><br><br>You place a preservation lock on RP1.<br><br>You need to modify RP1.<br><br>Which two actions should you perform? Each correct answer presents part of the solution.<br><br>NOTE: Each correct selection is worth one point.",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove locations from the policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDecrease the retention period of the policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIncrease the retention period of the policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd locations to the policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable the policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the policy."
    ],
    "answer": "CD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-12T02:50:00.000Z",
        "voteCount": 5,
        "content": "correct\nWhen a retention policy is locked:\n- No one can disable the policy or delete it\n- Locations can be added but not removed\n- You can extend the retention period but not decrease it\nWhen a retention label policy is locked:\n- No one can disable the policy or delete it\n- Locations can be added but not removed\n- Labels can be added but not removed\n\nhttps://learn.microsoft.com/en-us/microsoft-365/compliance/retention-preservation-lock?view=o365-worldwide"
      },
      {
        "date": "2023-05-05T10:56:00.000Z",
        "voteCount": 1,
        "content": "In short, a locked policy can be increased or extended, but it cannot be reduced or disabled."
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 52,
    "url": "https://www.examtopics.com/discussions/microsoft/view/112596-exam-ms-500-topic-3-question-53-discussion/",
    "body": "DRAG DROP<br> -<br><br>You have a Microsoft 365 E5 subscription.<br><br>You need to meet the following requirements:<br><br>•\tPrevent the sharing of files between the users in a department named department1 and the users in a department named department2.<br>•\tGenerate an alert if a user downloads large quantities of sensitive customer data.<br><br>Which type of policy should you use for each requirement? To answer, drag the appropriate policy types to the correct requirements. Each policy type may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/ms-500/image447.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/ms-500/image448.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-06-19T04:29:00.000Z",
        "voteCount": 2,
        "content": "1: Information Barrier Policy\n2: DLP"
      }
    ],
    "examNameCode": "ms-500",
    "topicNumber": "3"
  }
]