[
  {
    "topic": 11,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74628-exam-az-700-topic-11-question-1-discussion/",
    "body": "You need to configure the default route on Vnet2 and Vnet3. The solution must meet the virtual networking requirements.<br>What should you use to configure the default route?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\troute filters",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBGP route exchange\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta user-defined route assigned to GatewaySubnet in Vnet1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta user-defined route assigned to GatewaySubnet in Vnet2 and Vnet3"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 14,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-06-27T21:42:00.000Z",
        "voteCount": 12,
        "content": "B. BGP route exchange\nVirtual Networking Requirements\nDirect the default route of 0.0.0.0/0 on Vnet2 and Vnet3 to the Boston datacenter over an ExpressRoute circuit."
      },
      {
        "date": "2022-06-27T21:50:00.000Z",
        "voteCount": 2,
        "content": "Repeated question\nhttps://www.examtopics.com/discussions/microsoft/view/74497-exam-az-700-topic-10-question-3-discussion/"
      },
      {
        "date": "2022-06-27T22:59:00.000Z",
        "voteCount": 2,
        "content": "Repeated question\nhttps://www.examtopics.com/discussions/microsoft/view/64711-exam-az-700-topic-9-question-2-discussion/"
      },
      {
        "date": "2022-06-27T21:44:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/azure/virtual-network/virtual-networks-udr-overview#user-defined\nVirtual network gateway: Specify when you want traffic destined for specific address prefixes routed to a virtual network gateway. The virtual network gateway must be created with type VPN. You can't specify a virtual network gateway created as type ExpressRoute in a user-defined route because with ExpressRoute, you must use BGP for custom routes. You can't specify Virtual Network Gateways if you have VPN and ExpressRoute coexisting connections either. You can define a route that directs traffic destined for the 0.0.0.0/0 address prefix to a route-based virtual network gateway. On your premises, you might have a device that inspects the traffic and determines whether to forward or drop the traffic. If you intend to create a user-defined route for the 0.0.0.0/0 address prefix, read 0.0.0.0/0 address prefix first. Instead of configuring a user-defined route for the 0.0.0.0/0 address prefix, you can advertise a route with the 0.0.0.0/0 prefix via BGP, if you've enabled BGP for a VPN virtual network gateway."
      },
      {
        "date": "2022-06-27T21:43:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/azure/virtual-network/virtual-networks-udr-overview#border-gateway-protocol\nBorder gateway protocol\nAn on-premises network gateway can exchange routes with an Azure virtual network gateway using the border gateway protocol (BGP). Using BGP with an Azure virtual network gateway is dependent on the type you selected when you created the gateway. If the type you selected were:\n•\tExpressRoute: You must use BGP to advertise on-premises routes to the Microsoft Edge router. You can't create user-defined routes to force traffic to the ExpressRoute virtual network gateway if you deploy a virtual network gateway deployed as type: ExpressRoute. You can use user-defined routes for forcing traffic from the Express Route to, for example, a Network Virtual Appliance."
      },
      {
        "date": "2023-03-28T10:07:00.000Z",
        "voteCount": 5,
        "content": "To configure the default route on Vnet2 and Vnet3, we can use BGP route exchange. This would allow us to advertise the default route of 0.0.0.0/0 from the Boston datacenter over an ExpressRoute circuit to Vnet2 and Vnet3. This meets the requirement to direct the default route of 0.0.0.0/0 on Vnet2 and Vnet3 to the Boston datacenter over an ExpressRoute circuit.\n\nOption A, route filters, are used to allow or deny routes based on a set of defined rules. They are not used to configure the default route.\n\nOption C, a user-defined route assigned to GatewaySubnet in Vnet1, would only affect traffic within Vnet1, and not traffic from Vnet2 and Vnet3 to the Boston datacenter.\n\nOption D, a user-defined route assigned to GatewaySubnet in Vnet2 and Vnet3, would only affect traffic within Vnet2 and Vnet3, and not traffic from Vnet2 and Vnet3 to the Boston datacenter.\n\nTherefore, the correct answer is B. BGP route exchange."
      },
      {
        "date": "2024-07-24T13:20:00.000Z",
        "voteCount": 1,
        "content": "Well, this is tricky question\n\nWith Vnet-to-Vnet connections the answer would have been B, but we have peerings between VNets, in this case we need a user-defined route assigned to GatewaySubnet in Vnet2 and Vnet3 RTs to route the traffic from spoke VNets to On-prem via GW.\n\nSummary you can NOT direct the default route of 0.0.0.0/0 on Vnet2 and Vnet3 using BGP Exchange over peering connections.\n\nAnswer Should be D"
      },
      {
        "date": "2024-02-24T20:04:00.000Z",
        "voteCount": 1,
        "content": "B is only correct if vnet2 and vnet3 are connecting directly to express route on Boston DC.\nif not, then UDR assigned to GS in VNET 1 , given vnet2 and 3 are peered and they have UDRs 0.0.0.0/0 to VNET1"
      },
      {
        "date": "2024-02-25T13:46:00.000Z",
        "voteCount": 1,
        "content": "sorry, this is wrong as VNEt1 would have to have NVA to forward traffic to gateway.\nAs long as VNETs are peered, BGP should be able to propagate routes from ERGW"
      },
      {
        "date": "2023-10-28T22:09:00.000Z",
        "voteCount": 1,
        "content": "Is B Is Honey as per\nhttps://learn.microsoft.com/en-us/azure/virtual-network/virtual-network-peering-overview"
      },
      {
        "date": "2024-03-24T00:11:00.000Z",
        "voteCount": 2,
        "content": "Stop saying honey"
      },
      {
        "date": "2023-02-23T19:07:00.000Z",
        "voteCount": 2,
        "content": "In exam Feb 2023"
      },
      {
        "date": "2023-01-01T00:47:00.000Z",
        "voteCount": 3,
        "content": "I think D is Ans.\n\nIf you enable BGP and 0.0.0.0/0 is propagated from on-premises,\nWorks like a request.\nHowever, this question does not have information that confirms that it is propagated from on-premises.\nNo.\nhttps://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-about-forced-tunneling\nThere is also a method of setting a forced tunnel with UDR without using BGP as follows,\nThere is a possibility that D is the correct answer\nIn that case, the nexthop will be the gateway."
      },
      {
        "date": "2022-07-19T01:56:00.000Z",
        "voteCount": 1,
        "content": "B is correct."
      },
      {
        "date": "2022-06-30T02:57:00.000Z",
        "voteCount": 5,
        "content": "All answers are wrong :) BGP will not help to propagate default route? VNet2 and VNet3 don't know that they have to send default traffic (0.0.0.0/0) to Vnet1"
      },
      {
        "date": "2022-10-03T10:56:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-bgp-resource-manager-ps?toc=%2Fazure%2Fvirtual-network%2Ftoc.json#part-3---establish-a-vnet-to-vnet-connection-with-bgp\nVNet2 and VNet3 will exchange route informations though vnet to vnet connection via bgp with vnet1"
      },
      {
        "date": "2022-10-09T08:59:00.000Z",
        "voteCount": 1,
        "content": "You are wrong homie.\nBGP enables multiple gateways to learn and propagate prefixes from different networks, whether they are directly or indirectly connected. This can enable transit routing with Azure VPN gateways between your on-premises sites or across multiple Azure Virtual Networks.\nhttps://learn.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-bgp-overview#transitrouting"
      },
      {
        "date": "2022-06-28T15:03:00.000Z",
        "voteCount": 1,
        "content": "Appeared on exam Jun/28/22"
      },
      {
        "date": "2022-05-23T07:59:00.000Z",
        "voteCount": 1,
        "content": "It's correct.\n\nYou can create custom routes by either creating user-defined routes, or by exchanging border gateway protocol (BGP) routes between your on-premises network gateway and an Azure virtual network gateway. \n \nAs it's mentionned \"Direct the default route of 0.0.0.0/0 on Vnet2 and Vnet3 to the Boston datacenter over an ExpressRoute circuit.\" then UDR doesn't match, we need BGP protocol"
      },
      {
        "date": "2022-04-26T16:18:00.000Z",
        "voteCount": 1,
        "content": "is the answer B or C?"
      },
      {
        "date": "2022-05-18T06:58:00.000Z",
        "voteCount": 1,
        "content": "the action on vnet 1 is c, but the question is what needs to be done on vnet2 &amp;3, so i guess enabling bgp is required."
      }
    ],
    "examNameCode": "az-700",
    "topicNumber": "11"
  },
  {
    "topic": 11,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/76195-exam-az-700-topic-11-question-2-discussion/",
    "body": "DRAG DROP -<br>You need to implement outbound connectivity for VMScaleSet1. The solution must meet the virtual networking requirements and the business requirements.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04253/0010200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04253/0010300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/load-balancer/skus<br>https://docs.microsoft.com/en-us/azure/load-balancer/load-balancer-outbound-connections#outboundrules",
    "votes": [],
    "comments": [
      {
        "date": "2022-06-27T22:01:00.000Z",
        "voteCount": 13,
        "content": "Answer\nCreate a public load balancer in the Standard SKU\nCreate a backend pool that contains VMScaleSet1\nCreate an outbound rule"
      },
      {
        "date": "2022-06-27T22:45:00.000Z",
        "voteCount": 1,
        "content": "Repeat\nhttps://www.examtopics.com/discussions/microsoft/view/68612-exam-az-700-topic-9-question-1-discussion/"
      },
      {
        "date": "2024-10-09T12:48:00.000Z",
        "voteCount": 1,
        "content": "I don't get it: Requirement says \"Allow traffic from VMScaleSet1 to VMScaleSet2 on the TCP port 443 only.\"\nWhy would the backend pool contain VMScaleSet1? isn't it supposed to be the opposite?"
      },
      {
        "date": "2024-10-09T13:20:00.000Z",
        "voteCount": 1,
        "content": "sorry I was focused on the VMSS to VMSS requirement and did not read correctly \"providing outbound connectivity\"  - hence through SNAT through load-balancer as it the only possibility given to us."
      },
      {
        "date": "2023-10-28T22:39:00.000Z",
        "voteCount": 2,
        "content": "Given answer is correct HTTPS health probe and Outbound Rules are ONLY supported on STD LB"
      },
      {
        "date": "2023-06-02T13:29:00.000Z",
        "voteCount": 3,
        "content": "public Standard Load Balancer with an HTTPS configuration, along with a backend pool, health probe, and outbound rule, you can follow the steps outlined in the Microsoft Learn module you provided. However, I can provide you with a high-level overview of the steps involved:\n\nCreate a Standard Load Balancer:\nSpecify the load balancer's name, SKU (Standard), and public frontend IP configuration.\nConfigure the HTTPS protocol for the frontend IP configuration.\nSet up the SSL certificate if required.\nCreate a Backend Pool:\nCreate a backend pool that includes the virtual machines in VMScaleSet1.\nAssociate the backend pool with the frontend IP configuration of the load balancer.\nConfigure Health Probe:\nCreate a health probe with the required settings, such as the port (443) and probe interval.\nAssociate the health probe with the backend pool.\nCreate Outbound Rule:\nDefine an outbound rule for the load balancer.\nSpecify the backend pool and health probe to use for outbound traffic."
      },
      {
        "date": "2023-05-26T04:36:00.000Z",
        "voteCount": 1,
        "content": "As far as i know, if you don't create a health probe, then the LB is not going to work. I think it should be in this order\n1 - Create a public load Standard balancer (HTTPS = Standard)\n2 - Create a backend pool that contains VMScaleSet1\n3 - Create a Health probe (port 443)\n4 - Create a Outbound rule (needs a backend pool and a Health Probe)"
      },
      {
        "date": "2023-01-20T11:19:00.000Z",
        "voteCount": 1,
        "content": "correct answer"
      },
      {
        "date": "2023-01-14T04:22:00.000Z",
        "voteCount": 3,
        "content": "1 - Create a public load Standard balancer (HTTPS = Standard)\n2 - Create a backend pool that contains VMScaleSet1 \n3 - Create a Health probe (port 443) \n4 - Create a Outbound rule (needs a backend pool and a Health Probe)\nhttps://learn.microsoft.com/en-us/training/modules/load-balancing-non-https-traffic-azure/4-exercise-create-configure-azure-load-balancer"
      },
      {
        "date": "2023-01-14T04:24:00.000Z",
        "voteCount": 1,
        "content": "1 - Create a public Standard Load balancer (HTTPS = Standard)\nhttps://learn.microsoft.com/en-us/training/modules/load-balancing-non-https-traffic-azure/3-design-implement-azure-load-balancer-using-azure-portal"
      },
      {
        "date": "2022-06-28T15:03:00.000Z",
        "voteCount": 3,
        "content": "Appeared on exam Jun/28/22"
      },
      {
        "date": "2022-06-27T17:51:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/azure/load-balancer/skus\nSKU comparison\nAzure Load Balancer has 3 SKUs - Basic, Standard, and Gateway. Each SKU is catered towards a specific scenario and has differences in scale, features, and pricing.\n\nTo compare and understand the differences between Basic and Standard SKU, see the following table. \nOutbound Rules\t\nStandard Load Balancer - Declarative outbound NAT configuration\nBasic Load Balancer - Not available"
      },
      {
        "date": "2022-06-27T21:59:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/load-balancer/quickstart-load-balancer-standard-public-portal\nCreate the virtual network\nIn this section, you'll create a virtual network, subnet, and Azure Bastion host. The virtual network and subnet contains the load balancer and virtual machines. The bastion host is used to securely manage the virtual machines and install IIS to test the load balancer."
      },
      {
        "date": "2022-06-27T22:00:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/load-balancer/quickstart-load-balancer-standard-public-portal\nCreate virtual machines\nIn this section, you'll create two VMs (myVM1 and myVM2) in two different zones (Zone 1, and Zone 2).\nThese VMs are added to the backend pool of the load balancer that was created earlier."
      },
      {
        "date": "2022-06-27T22:01:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/load-balancer/quickstart-load-balancer-standard-public-portal\nNote\nAzure provides a default outbound access IP for VMs that either aren't assigned a public IP address or are in the back-end pool of an internal basic Azure load balancer. The default outbound access IP mechanism provides an outbound IP address that isn't configurable.\n\nFor more information, see Default outbound access in Azure.\n\nThe default outbound access IP is disabled when either a public IP address is assigned to the VM or the VM is placed in the back-end pool of a standard load balancer, with or without outbound rules. If an Azure Virtual Network network address translation (NAT) gateway resource is assigned to the subnet of the virtual machine, the default outbound access IP is disabled.\n\nVMs that are created by virtual machine scale sets in flexible orchestration mode don't have default outbound access.\n\nFor more information about outbound connections in Azure, see Use source network address translation (SNAT) for outbound connections."
      },
      {
        "date": "2022-06-27T21:59:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/load-balancer/quickstart-load-balancer-standard-public-portal\nCreate NAT gateway\nIn this section, you'll create a NAT gateway for outbound internet access for resources in the virtual network."
      },
      {
        "date": "2022-05-23T08:09:00.000Z",
        "voteCount": 2,
        "content": "It's correct.\n\nOutbound rules is not available for Basic Load Balancer then Standard SKU is required. \nAfter it's a backend pool to link VMScaleSet and the LB. And it's an outbound rule as there's no address translation in this case."
      }
    ],
    "examNameCode": "az-700",
    "topicNumber": "11"
  }
]