[
  {
    "topic": 9,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81483-exam-sc-100-topic-8-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to recommend a solution to evaluate regulatory compliance across the entire managed environment. The solution must meet the regulatory compliance requirements and the business requirements.<br>What should you recommend? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04228/0005800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04228/0005800002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Azure Policy initiatives to management groups<br>If your organization has many Azure subscriptions, you may need a way to efficiently manage access, policies, and compliance for those subscriptions.<br>Management groups provide a governance scope above subscriptions. You organize subscriptions into management groups the governance conditions you apply cascade by inheritance to all associated subscriptions.<br>If you plan to apply a policy definition to multiple subscriptions, the location must be a management group that contains the subscriptions you assign the policy to.<br>The same is true for an initiative definition.<br>With an initiative definition, you can group several policy definitions to achieve one overarching goal. An initiative evaluates resources within scope of the assignment for compliance to the included policies.<br>Incorrect:<br>Not: Azure Policy initiatives to subscriptions<br>Must use a management group as we have multiple subscriptions.<br>Scenario:<br>Requirements. Business Requirements<br>Litware identifies the following business requirements:<br>ג€¢    Minimize any additional on-premises infrastructure.<br>ג€¢    Minimize the operational costs associated with administrative overhead.<br><br>Box 2: Azure Arc -<br>With Azure Arc:<br>Meet governance and compliance standards for apps, infrastructure, and data with Azure Policy.<br>Take advantage of elastic scale, consistent on-premises and multicloud management, and cloud-style billing models.<br>Note: Azure Arc is a bridge that extends the Azure platform to help you build applications and services with the flexibility to run across datacenters, at the edge, and in multicloud environments. Develop cloud-native applications with a consistent development, operations, and security model. Azure Arc runs on both new and existing hardware, virtualization and Kubernetes platforms, IoT devices, and integrated systems.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/governance/management-groups/overview https://azure.microsoft.com/en-us/services/azure-arc/#product-overview",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-09T20:28:00.000Z",
        "voteCount": 26,
        "content": "answer seems correct."
      },
      {
        "date": "2023-05-22T08:28:00.000Z",
        "voteCount": 9,
        "content": "1. Azure Policy initiatives to MG\n2. Azure Arc\n\nhttps://learn.microsoft.com/en-us/azure/governance/policy/concepts/initiative-definition-structure\nInitiatives enable you to group several related policy definitions to simplify assignments and management because you work with a group as a single item. For example, you can group related tagging policy definitions into a single initiative. Rather than assigning each policy individually, you apply the initiative.\n\nhttps://learn.microsoft.com/en-us/azure/azure-arc/overview\nAzure Arc simplifies governance and management by delivering a consistent multicloud and on-premises management platform."
      },
      {
        "date": "2023-10-06T05:27:00.000Z",
        "voteCount": 6,
        "content": "got this in exam 6oct23. passed with 896 marks. I answered as per given answer"
      },
      {
        "date": "2023-09-20T23:57:00.000Z",
        "voteCount": 2,
        "content": "Box1: Azure Policy initiatives to MG\nBox2: Azure Arc\nhttps://www.youtube.com/watch?v=YJqZjdzC9xE&amp;list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&amp;index=7\nQuestion 95"
      },
      {
        "date": "2023-02-19T05:13:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct they want to monitor the entire management --&gt;management group\nto evaluate the regularity compliance on-perm it would be Azure ARC as you are on-boarding the devices on perm into it, now you can on-board VM, SQL server and many more."
      },
      {
        "date": "2023-02-10T05:59:00.000Z",
        "voteCount": 1,
        "content": "agreed with the answers"
      },
      {
        "date": "2022-12-29T04:26:00.000Z",
        "voteCount": 4,
        "content": "answers seems correct"
      },
      {
        "date": "2022-10-15T11:50:00.000Z",
        "voteCount": 4,
        "content": "Agree with the answer."
      }
    ],
    "examNameCode": "sc-100",
    "topicNumber": "8"
  }
]