[
  {
    "topic": 11,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17471-exam-az-101-topic-11-question-1-discussion/",
    "body": "You have the Azure virtual networks shown in the following table.<br><img src=\"/assets/media/exam-media/02519/n40671800004.png\" class=\"in-exam-image\"><br>To which virtual networks can you establish a peering connection from VNet1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVNet3 and VNet4 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVNet2 and VNet3 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVNet2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVNet2, VNet3, and VNet4"
    ],
    "answer": "Correct",
    "answerDescription": "References:<br>https://docs.microsoft.com/en-us/azure/virtual-network/tutorial-connect-virtual-networks-portal<br><br>Testlet 2 -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you<br>However, there may be additional case studies and sections on this would like to complete each case. exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studied might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changed before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. Note that the information displayed on the All information tab is identical to the information displayed on the subsequent tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br>ADatum Corporation is a financial company that has two main offices in New York and Los Angeles. ADatum has a subsidiary named Fabrikam, Inc. that shares the Los Angeles office.<br>ADatum is conducting an initial deployment of Azure services to host new line-of-business applications and is preparing to migrate its existing on-premises workloads to Azure.<br>ADatum uses Microsoft Exchange Online for email.<br><br>Existing Environment -<br><br>On-Premises Environment -<br>The on-premises workloads run on virtual machines hosted in a VMware vSphere 6 infrastructure. All the virtual machines are members of an Active Directory forest named adatum.com and run Windows Server<br>2016.<br>The New York office uses an IP address space of 10.0.0.0/16. The Los Angeles office uses an IP address space of 10.10.0.0/16.<br>The offices connect by using a VPN provided by an ISP. Each office has one Azure ExpressRoute circuit that provides access to Azure services and Microsoft Online Services. Routing is implemented by using Microsoft peering.<br>The New York office has a virtual machine named VM1 that has the vSphere console installed.<br><br>Azure Environment -<br>You provision the Azure infrastructure by using the Azure portal. The infrastructure contains the resources shown in the following table.<br><img src=\"/assets/media/exam-media/02519/n40671800001.png\" class=\"in-exam-image\"><br>AG1 has two backend pools named Pool11 and Pool12. AG2 has two backend pools named Pool21 and<br>Pool22.<br><br>Requirements -<br><br>Planned Changes -<br>ADatum plans to migrate the virtual machines from the New York office to the East US Azure region by using<br>Azure Site Recovery.<br><br>Infrastructure Requirements -<br>ADatum identifies the following infrastructure requirements:<br>✑ A new web app named App1 that will access third-parties for credit card processing must be deployed.<br>✑ A newly developed API must be implemented as an Azure function named App2. App2 will use a blob storage trigger. App2 must process new blobs immediately.<br>✑ The Azure infrastructure and the on-premises infrastructure must be prepared for the migration of the<br>VMware virtual machines to Azure.<br>✑ The sizes of the Azure virtual machines that will be used to migrate the on-premises workloads must be identified.<br>✑ All migrated and newly deployed Azure virtual machines must be joined to the adatum.com domain.<br>✑ AG1 must load balance incoming traffic in the following manner:<br>- http://corporate.adatum.com/video/* will be load balanced across Pool11.<br>- http://corporate.adatum.com/images/* will be load balanced across Pool12.<br>✑ AG2 must load balance incoming traffic in the following manner:<br>- http://www.adatum.com will be load balanced across Pool21.<br>- http://fabrikam.com will be load balanced across Pool22.<br>✑ ER1 must route traffic between the New York office and platform as a service (PaaS) services in the East<br>US Azure region, as long as ER1 is available.<br>✑ ER1 must route traffic between the Los Angeles office and the PaaS services in the West US region, as long as ER2 is available.<br>✑ ER1 and ER2 must be configured to fail over automatically.<br><br>Application Requirements -<br>App2 must be available to connect directly to the private IP addresses of the Azure virtual machines. App2 will be deployed directly to an Azure virtual network.<br>Inbound and outbound communications to App1 must be controlled by using NSGs.<br><br>Pricing Requirements -<br>ADatum identifies the following pricing requirements:<br>✑ The cost of App1 and App2 must be minimized<br>The transactional charges of Azure Storage accounts must be minimized<br><img src=\"/assets/media/exam-media/02519/n40671800003.png\" class=\"in-exam-image\"><br><br>QUESTION 1 -<br>You need to configure AG1.<br>What should you create?<br><br>A. a multi-site listener -<br>B. a URL path-based routing rule<br><br>C. a basic listener -<br><br>D. a basic routing rule -<br><br>B -<br>Section: [none]<br><br>Explanation -<br>References:<br>https://docs.microsoft.com/en-us/azure/application-gateway/application-gateway-create-url-route-portal<br><br>QUESTION 2 -<br><br>DRAG DROP -<br>You need to configure the Azure ExpressRoute circuits.<br>How should you configure Azure ExpressRoute routing? To answer, drag the appropriate configurations to the correct locations. Each configuration may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Each correct selection is worth one point.<br>NOTE:<br>Select and Place:<br>Section: [none]<br><br>Explanation -<br><br>QUESTION 3 -<br><br>HOTSPOT -<br>You need to provision the resources in Azure to support the virtual machine that will be migrated from the New<br>York office.<br>What should you include in the solution? To answer, select the appropriate options in the answer area.<br>: Each correct selection is worth one point.<br><br>NOTE -<br>Hot Area:<br><img src=\"/assets/media/exam-media/02519/n40671800006.jpg\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/02519/n40671800005.jpg\" class=\"in-exam-image\"><br>Section: [none]<br><br>Explanation -<br><br>The IP address space must be one that isnt already in use.<br>The transactional charges of Azure Storage accounts must be minimized.  V1 is the cheapest.<br><br>QUESTION 4 -<br>What should you create to configure AG2?<br><br>A. multi-site listeners -<br><br>B. basic listeners -<br><br>C. URL path-based routing rules -<br><br>D. basic routing rules -<br>E. an additional public IP address<br><br>A -<br>Section: [none]<br><br>Explanation -<br><br>✑ AG2 must load balance incoming traffic in the following manner:<br>- http://www.adatum.com will be load balanced across Pool21.<br>- http://fabrikam.com will be load balanced across Pool22.<br>You need to configure an Azure Application Gateway with multi-site listeners to direct different URLs to different pools.<br>References:<br>https://docs.microsoft.com/en-us/azure/application-gateway/multiple-site-overview<br><br>Testlet 1 -<br>This is a case study. Case studies are not timed separately. You can use as much exam time as you<br>However, there may be additional case studies and sections on this would like to complete each case. exam. You must manage your time to ensure that you are able to complete all questions included on this exam in the time provided.<br>To answer the questions included in a case study, you will need to reference information that is provided in the case study. Case studies might contain exhibits and other resources that provide more information about the scenario that is described in the case study. Each question is independent of the other questions in this case study.<br>At the end of this case study, a review screen will appear. This screen allows you to review your answers and to make changes before you move to the next section of the exam. After you begin a new section, you cannot return to this section.<br><br>To start the case study -<br>To display the first question in this case study, click the Next button. Use the buttons in the left pane to explore the content of the case study before you answer the questions. Clicking these buttons displays information such as business requirements, existing environment, and problem statements. If the case study has an All tab, note that the information displayed is identical to the information displayed on the subsequent<br><br>Information -<br>tabs. When you are ready to answer a question, click the Question button to return to the question.<br><br>Overview -<br>Contoso, Ltd. is a consulting company that has a main office in Montreal and two branch offices in Seattle and<br>New York.<br>The Montreal office has 2,000 employees. The Seattle office has 1,000 employees. The New York office has<br>200 employees.<br>All the resources used by Contoso are hosted on-premises.<br>Contoso creates a new Azure subscription. The Azure Active Directory (Azure AD) tenant uses a domain named contoso.onmicrosoft.com. The tenant uses the P1 pricing tier.<br><br>Existing Environment -<br>The network contains an Active Directory forest named contoso.com. All domain controllers are configured as<br>DNS servers and host the contoso.com DNS zone.<br>Contoso has finance, human resources, sales, research, and information technology departments. Each department has an organizational unit (OU) that contains all the accounts of that respective department. All the user accounts have the department attribute set to their respective department. New users are added frequently.<br>Contoso.com contains a user named User1.<br>All the offices connect by using private links.<br>Contoso has data centers in the Montreal and Seattle offices. Each data center has a firewall that can be configured as a VPN device.<br>All infrastructure servers are virtualized. The virtualization environment contains the servers in the following table.<br><img src=\"/assets/media/exam-media/02519/n40671800000.png\" class=\"in-exam-image\"><br>Contoso uses two web applications named App1 and App2. Each instance on each web application requires<br>1GB of memory.<br>The Azure subscription contains the resources in the following table.<br><img src=\"/assets/media/exam-media/02519/n40671800002.png\" class=\"in-exam-image\"><br>The network security team implements several network security groups (NSGs).<br><br>Planned Changes -<br>Contoso plans to implement the following changes:<br>✑ Deploy Azure ExpressRoute to the Montreal office.<br>✑ Migrate the virtual machines hosted on Server1 and Server2 to Azure.<br>✑ Synchronize on-premises Active Directory to Azure Active Directory (Azure AD).<br>✑ Migrate App1 and App2 to two Azure web apps named WebApp1 and WebApp2.<br><br>Technical requirements -<br>Contoso must meet the following technical requirements:<br>✑ Ensure that WebApp1 can adjust the number of instances automatically based on the load and can scale up to five instances.<br>✑ Ensure that VM3 can establish outbound connections over TCP port 8080 to the applications servers in the<br>Montreal office.<br>✑ Ensure that routing information is exchanged automatically between Azure and the routers in the Montreal office.<br>✑ Ensure Azure Multi-Factor Authentication (MFA) for the users in the finance department only.<br>✑ Ensure that webapp2.azurewebsites.net can be accessed by using the name app2.contoso.com<br>✑ Connect the New York office to VNet1 over the Internet by using an encrypted connection.<br>✑ Create a workflow to send an email message when the settings of VM4 are modified.<br>✑ Create a custom Azure role named Role1 that is based on the Reader role.<br>✑ Minimize costs whenever possible.<br><br>QUESTION 1 -<br>You need to recommend a solution to automate the configuration for the finance department users. The solution must meet the technical requirements.<br>What should you include in the recommendation?<br><br>A. Azure AD B2C -<br><br>B. Azure AD Identity Protection -<br>C. an Azure logic app and the Microsoft Identity Management (MIM) client<br>D. dynamic groups and conditional access policies<br><br>D -<br>Section: [none]<br><br>Explanation -<br><br>Scenario: Ensure Azure Multi-Factor Authentication (MFA) for the users in the finance department only.<br>The recommendation is to use conditional access policies that can then be targeted to groups of users, specific applications, or other conditions.<br>References:<br>https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-userstates<br>Question Set 2",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-03T19:17:00.000Z",
        "voteCount": 1,
        "content": "A is the correct answer.\nYou cannot have an overlapping ip addresses ."
      },
      {
        "date": "2020-03-24T22:34:00.000Z",
        "voteCount": 1,
        "content": "D-is the answer"
      }
    ],
    "examNameCode": "az-101",
    "topicNumber": "11"
  }
]