[
  {
    "topic": 8,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4617-exam-mb-200-topic-8-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to prompt the caseworker when populating the allergies field.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02751/0005100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02751/0005200001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-13T07:37:00.000Z",
        "voteCount": 94,
        "content": "I guess it is:\nAdd a condition (if the option \"other\" is selected, then:)\nSet field visibility to true (text field for allergies field)\nSet the Business required to true (the text field that now is displayed)"
      },
      {
        "date": "2020-08-07T03:36:00.000Z",
        "voteCount": 1,
        "content": "I agree with the first 2, but why set the field to business required? The requirement is to prompt the caseworker to record this information, not force them to do so. Allergies isn't something you can make mandatory. So, adding a recommendation makes a lot more sense in the 3rd step."
      },
      {
        "date": "2020-08-13T22:34:00.000Z",
        "voteCount": 5,
        "content": "There is this portion in the requirements section around setting of Allergy field, the text field is required when Other is selected: When Other is selected, the form must display a text field that requires entry"
      },
      {
        "date": "2020-01-15T10:18:00.000Z",
        "voteCount": 14,
        "content": "1) Add a condition if the option \"other\" is selected, \n2) Set Text field visibility to true for allergies details (managing visibility)\n3) Set the Business required to true because, the form must display a text field that requires entry."
      },
      {
        "date": "2020-12-17T10:56:00.000Z",
        "voteCount": 1,
        "content": "I agree, it is:\nAdd a condition (if the option \"other\" is selected, then:)\nSet field visibility to true (text field for allergies field)\nSet the Business required to true (the text field that now is displayed)"
      },
      {
        "date": "2020-08-30T13:24:00.000Z",
        "voteCount": 1,
        "content": "Going with Feminho's answer here."
      },
      {
        "date": "2020-08-06T11:31:00.000Z",
        "voteCount": 7,
        "content": "his answers are not true:\nthe correct answers shall be \n- Add condition (if value = other)\n- Set text field visibility (he stated: the form must display a text field..)\n- set business required option to true.\n(he stated: the form must display a text field that requires entry)"
      },
      {
        "date": "2020-06-27T20:15:00.000Z",
        "voteCount": 5,
        "content": "Was in my exam, asked in a different way"
      },
      {
        "date": "2020-06-24T14:14:00.000Z",
        "voteCount": 6,
        "content": "add a condition\nset field visibility \nset business requirements \n\nin exam"
      },
      {
        "date": "2020-05-22T02:24:00.000Z",
        "voteCount": 3,
        "content": "I think it's:\n1. Add a condition\n2. Set field required\n3. Add a recommendation\nBecause it's urgent information you should force users to fill in this field (that's why it's required). Recommendation should be prompted in case user doesn't know how correctly input information."
      },
      {
        "date": "2020-05-19T12:52:00.000Z",
        "voteCount": 1,
        "content": "I would go for \n1) Add a condition (primarily step of the business rule) : if the value is 'other'\n2) Recommendation (the only way I see to prompt the user within a business rule\n3) Set the text field to business required (it is not said that this field was hidden on the form, it just have to become required in the appropriate situation)"
      },
      {
        "date": "2020-05-17T06:34:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/map-entity-fields"
      },
      {
        "date": "2020-04-09T03:35:00.000Z",
        "voteCount": 1,
        "content": "1)Add a condition\n2)Add a recommendation\n3)Set the default value"
      },
      {
        "date": "2020-04-21T07:50:00.000Z",
        "voteCount": 2,
        "content": "whay ? can you expalin more please!"
      },
      {
        "date": "2020-04-23T09:36:00.000Z",
        "voteCount": 2,
        "content": "Without condition, you can't add any action and as you need to prompt the user for default values that can only be achieved with the help of recommendation and the there you can set the default values"
      },
      {
        "date": "2020-02-02T18:11:00.000Z",
        "voteCount": 2,
        "content": "in exam"
      },
      {
        "date": "2019-12-25T09:30:00.000Z",
        "voteCount": 2,
        "content": "As a business rule \"Add a condition\" must be first among the choices. The answer is not correct. \"Add a recommendation\"  and  \"Set the Business Required option to true\" provides visible indicators to enter information, thus prompting the user."
      },
      {
        "date": "2019-12-28T18:00:00.000Z",
        "voteCount": 4,
        "content": "I was thinking of the recommendation as well, BUT, without setting the field to visible, you're in a world of trouble.  There is a statement that any supplemental fields need to be hidden by default, and another that the text field for the \"other\" allergy details needs to be displayed if they choose others.  Therefore, I believe Feminho has the correct items and sequence above.  Condition on Other being selected, show the text field, make it required.  Bingo.  \n\nThe revealed answer talks about setting a default value for the field, but this makes zero sense.  What would you default it to?  If you knew a likely value, you'd have added it to the option set options already."
      },
      {
        "date": "2019-09-03T02:15:00.000Z",
        "voteCount": 6,
        "content": "How is this correct answer prompting the user at all?"
      }
    ],
    "examNameCode": "mb-200",
    "topicNumber": "8"
  }
]