[
  {
    "topic": 3,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35076-exam-mb-600-topic-3-question-1-discussion/",
    "body": "A client manages users on Dynamics 365 Sales by using Microsoft Azure Active Directory (Azure AD) groups to assign security roles. The client also uses team ownership of records in Dynamics 365 Sales extensively.<br>Users report that they do not have the access they expect. They cannot edit their own records but can edit team-owned records.<br>You need to recommend a solution to fix the security role issues while continuing to manage users via Azure AD groups.<br>What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign Security Roles to users directly instead of through Azure AD groups.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign Security Roles to the Local Business Owner Team instead of the Owner Team.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnsure that member security role privileges are set to Direct User.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign Security Roles to the Access Team instead of the Owner Team.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnsure that member security role privileges are set to Default."
    ],
    "answer": "C",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/power-platform/admin/security-roles-privileges",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-01T13:58:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/power-platform/admin/security-roles-privileges#user-and-team-privileges"
      },
      {
        "date": "2021-01-01T14:07:00.000Z",
        "voteCount": 1,
        "content": "C is correct \nif we assume that the user has a security role with (team privileges) type and doesn't have a security role of their own.\n\nTeam privileges: User is granted these privileges as member of the team. For team members who do not have user privileges of their own, they can only create records with the team as the owner and they have access to records owned by the Team when Basic access level for Create and Read were given."
      },
      {
        "date": "2020-10-23T23:46:00.000Z",
        "voteCount": 4,
        "content": "Yes, C is correct, I have experienced many times when role is not assigned with proper permission to Direct User then self owned records are not behave as expected however team owned are fine."
      },
      {
        "date": "2020-12-31T05:47:00.000Z",
        "voteCount": 1,
        "content": "Agree!"
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43234-exam-mb-600-topic-3-question-2-discussion/",
    "body": "DRAG DROP -<br>Your company is implementing Dynamics 365 Customer Service. You are part of the project team that meets weekly to review implementation progress and troubleshoot.<br>During the weekly project management meeting, you receive the following updates from developers:<br>✑ Versions of exported solution.zip files are being stored in source control.<br>✑ Solution segmentation is not being practiced with first-party solution integrations.<br>✑ Each independent solution is using a unique publisher.<br>Solution versions are not being updated.<br><img src=\"/assets/media/exam-media/03385/0007500004.png\" class=\"in-exam-image\"><br>You need to identify the common risk for each item.<br>Which common risk is represented? To answer, drag the appropriate risks to the correct developer updates. Each risk may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03385/0007600001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03385/0007600002.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://novacontext.com/solution-lifecycle-management-for-dynamics-365/",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-25T02:57:00.000Z",
        "voteCount": 2,
        "content": "This is correct"
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30757-exam-mb-600-topic-3-question-3-discussion/",
    "body": "HOTSPOT -<br>A toy manufacturer is testing its processes in Dynamics 365 Sales and notices the following issues:<br>✑ The drop-down list of toy colors is different for different entities. They should be static and always the same.<br>✑ Too many decimal places are in the Quantity field. The field should have two decimal places instead of four.<br>✑ The Order Date field includes Date and Time but should include only Date.<br>You need to recommend how to fix the fields.<br>What should you recommend? To answer, select the appropriate option in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03385/0007700004.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03385/0007800001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/behavior-format-date-time-field https://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/create-edit-global-option-sets",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-23T02:22:00.000Z",
        "voteCount": 18,
        "content": "First answer is incorrect. You cannot change \"Use Existing Option Set\" value for an existing field."
      },
      {
        "date": "2020-10-03T19:13:00.000Z",
        "voteCount": 5,
        "content": "You are right, once the field is created you cannot switch the option set to a global option set. you must create a new global option set and then add a new option set to your entity and then select the user existing global option."
      },
      {
        "date": "2021-04-13T13:40:00.000Z",
        "voteCount": 1,
        "content": "I disagree.  You can create or edit a field using a Global Option set.\nhttps://docs.microsoft.com/en-us/dynamics365/customerengagement/on-premises/customize/create-edit-global-option-sets#use-a-global-option-set"
      },
      {
        "date": "2020-09-07T02:49:00.000Z",
        "voteCount": 15,
        "content": "Option 3 should be update the format"
      },
      {
        "date": "2021-03-21T10:44:00.000Z",
        "voteCount": 1,
        "content": "Changing the format only changes how it is displayed, not how the underlying data is stored. If I remember correctly, when doing a fetch xml query a field with Date Only behavior will return only the date, but a field with Date format with return date and time adjusted from input users timezone to UTC. This is very noticeable when making requests with the SDK or Web API/oData service, or using a tool like fetchxml tester. \n\nA bit more detail on the question would provide better decision making, like most questions on these exams."
      },
      {
        "date": "2021-03-17T13:13:00.000Z",
        "voteCount": 6,
        "content": "1. correct answer is option 3 because we cannot update the existing field to replace to global option set\n2. option 1 (update the precision)\n3. Both option 1 &amp; 2 (update format or behavior) are correct. If you use Format, you can set either \"Date Only\" or \"Date &amp; Time\". In this case, we can select Date Only and issue is resolved. But if you use Behavior, you can set either \"Local Time\", \"Date Only\" or \"Time Zone Independent\". When you select \"Date Only\", the issue is resolved. However, once you set to \"Date Only\" in Behavior, you cannot revert it back. So I would choose Format to resolve this."
      },
      {
        "date": "2021-03-04T15:40:00.000Z",
        "voteCount": 3,
        "content": "1. Create new field using global option set. Once a field has been created using an local option set, you can only change the option set values.\n3. Create new field bc format cannot be changed. If a date time field is created, you cannot change the format only the behavior. The behavior allows you to select local or time zone independent neither of which will remove the time component."
      },
      {
        "date": "2020-12-22T07:56:00.000Z",
        "voteCount": 1,
        "content": "The change from Optionset to Global Optionset is by design a new field.  So the first is 3\nThe second is 1 \nThe third is more puzzling In the old interface you can change the Format  &amp; Behavior , but with new One this is not possible, but would still opt for 1 until they deprecate the old interface"
      },
      {
        "date": "2020-11-20T06:47:00.000Z",
        "voteCount": 2,
        "content": "You cannot update and existing option set field  to transform it into a global once is created/\nTherefore you need a new global option set field.\nYou need to update the precision of decimals to  two.\nThe behavior of a date field does not control the time. This is controlled by the format. You need to update the format.\nAnswers are 3-1-1"
      },
      {
        "date": "2020-11-19T09:35:00.000Z",
        "voteCount": 3,
        "content": "The answer at the question 3 could be both A or B because i can change date both modify the format or the behaviuor too. The format would be the best way"
      },
      {
        "date": "2020-11-08T08:22:00.000Z",
        "voteCount": 1,
        "content": "Correct answer is 3-1-4;"
      },
      {
        "date": "2020-10-24T01:36:00.000Z",
        "voteCount": 5,
        "content": "Correct answer is 3,1 and 1."
      },
      {
        "date": "2020-10-15T06:35:00.000Z",
        "voteCount": 6,
        "content": "Good answer : 3 - 1 - 1"
      },
      {
        "date": "2020-10-10T10:20:00.000Z",
        "voteCount": 3,
        "content": "Number 3 is actually \"Update the format\" because you can switch between \"Date Only\" and \"Date and Time\". But you cannot change the behaviour, once set it is locked. So definetly \"Update the format\" for number 3."
      },
      {
        "date": "2020-11-14T11:51:00.000Z",
        "voteCount": 1,
        "content": "\"The Order Date field includes Date and Time but should include only Date\" - if you update the format, time still there and date will not be the same in different geographies."
      },
      {
        "date": "2020-10-03T19:11:00.000Z",
        "voteCount": 5,
        "content": "Number 3 cannot update the format, the format is set in the data type field which is locked after the field is created. You can update the behavior but that only allows for setting the time zone and local zone. So if you want to change a date format form date and time to date only you have to create a new field."
      },
      {
        "date": "2020-11-20T04:39:00.000Z",
        "voteCount": 3,
        "content": "Disagree - you can update the Format (after field is created) if the behaviour (on field creation) was set to User Local or Time-zone Independent (which it has to be if you want to set the format to Date and Time). Therefore 'format' is the right answer for number 3. Try it."
      },
      {
        "date": "2021-03-17T13:17:00.000Z",
        "voteCount": 1,
        "content": "You can use \"Behavior\" also. Under behavior, there are 3 drop downs where Date Only is one of them which you have not mentioned above. The question is tricky though"
      },
      {
        "date": "2020-10-02T12:25:00.000Z",
        "voteCount": 4,
        "content": "On 1rst the correct answer is:Create a global option set. Then create a new field by using global option set."
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/41159-exam-mb-600-topic-3-question-4-discussion/",
    "body": "A client is using Dynamics 365 Sales and Power BI with stringent security on read access to accounts.<br>You need to ensure that users will be unable to view restricted accounts in Power BI.<br>What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tShare the reports in Power BI to the same Microsoft Azure Active Directory (Azure AD) groups used in Dynamics 365 Sales.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEmbed the Power BI reports in Dynamics 365 Sales instead of sharing them by using Power BI to retain security.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet up the Data Export Service and use DirectQuery for reporting to include security roles.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd row-level security (RLS) roles to the DataSet in Power BI that matches the privileges assigned in Dynamics 365 Sales."
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-07T09:16:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      },
      {
        "date": "2021-01-01T14:44:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/power-bi/admin/service-admin-rls"
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/41160-exam-mb-600-topic-3-question-5-discussion/",
    "body": "A client is preparing to go live with a Dynamics 365 Sales implementation that uses Microsoft Azure Active Directory (Azure AD) group to manage security.<br>The chief compliance officer (CCO) requires that all solutions meet the following requirements:<br>✑ Undergo security testing to verify they are secure.<br>✑ Address the needs of users with disabilities.<br>You need to recommend additional tests to be performed.<br>Which tests should you recommend? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform bounds testing by using a user account assigned to the custom security role directly.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform accessibility testing in the same model-driven apps the users will be using.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform penetration testing on the Azure AD tenant.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform user acceptance tests for all security user stories."
    ],
    "answer": "BC",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-12T07:02:00.000Z",
        "voteCount": 2,
        "content": "Correct Answer\nC. Penetration testing, also called pen testing or ethical hacking, is the practice of testing a computer system, network or web application to find security vulnerabilities that an attacker could exploit. Penetration testing can be automated with software applications or performed manually."
      },
      {
        "date": "2021-01-01T14:53:00.000Z",
        "voteCount": 2,
        "content": "I think it's B,D"
      },
      {
        "date": "2021-01-05T06:48:00.000Z",
        "voteCount": 2,
        "content": "Maybe B, C is correct\nhttps://www.microsoft.com/en-us/msrc/pentest-rules-of-engagement"
      },
      {
        "date": "2021-02-22T02:49:00.000Z",
        "voteCount": 1,
        "content": "tests are not for see if they work, but if it is secure, so is b and c"
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35132-exam-mb-600-topic-3-question-6-discussion/",
    "body": "A company asks you to migrate more than 5,000 records from Dynamics 365 Customer Engagement (on-premises) to the online version of Dynamics 365 Sales.<br>You used a third-party utility to migrate the data. The city and state are displayed in the field that should show the street address.<br>You must get the data migrated properly in the next 24 hours but have no one to help with this task. You have no other add-ins and do not want any more customization.<br>You need to resolve the issues to migrate the data.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove data, ensure that field mappings of city and state are correct, and then migrate the data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a custom connector in the Common Data Service, and then migrate the data.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExport the street address field, make changes, and then import the changes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tManually edit the street address, state, and city field, and then enter appropriate data."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-24T23:37:00.000Z",
        "voteCount": 5,
        "content": "Answer should be C only, as City and State are representing Street Address then just export excel and create a column as Street Address and use concatenate formula CONCATINATE(City,\" \",State) and finally import it in production. That simple!"
      },
      {
        "date": "2020-11-08T08:33:00.000Z",
        "voteCount": 1,
        "content": "Yes, I dont understand the \"remove data\", from A."
      },
      {
        "date": "2020-11-10T01:12:00.000Z",
        "voteCount": 2,
        "content": "Assumption here is that street address field is not correct so you need to add the street back + You need to place the state in state field and city in the city field.... So by only exporting street adress field (no s here) you won't be able to perform that"
      },
      {
        "date": "2020-12-22T07:18:00.000Z",
        "voteCount": 3,
        "content": "Question describes data load already happened with error. need to fix in 24 hrs. so Answer is A."
      },
      {
        "date": "2020-12-16T06:45:00.000Z",
        "voteCount": 3,
        "content": "A is correct. In the question it is assumed that you already did the migration, then notice the mistake in the street address field. So you need to remove the data, correct the mapping, and migrate again."
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33070-exam-mb-600-topic-3-question-7-discussion/",
    "body": "You design a solution for a client that is moving from Microsoft Dynamics CRM on-premises to Dynamics 365 Sales.<br>During user acceptance testing, testers report significant performance issues.<br>You need to recommend a solution to mitigate the performance issues.<br>What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIncrease the plug-in execution time limit of the organization to five minutes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Microsoft Azure Service Bus endpoint in Dynamics 365 Sales. Implement business logic in Azure functions.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable direct access to a Microsoft Azure-replicated SQL database.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement workflows. Schedule workflows to run at daily intervals."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-27T16:48:00.000Z",
        "voteCount": 9,
        "content": "This is UAT performance in D365 UI. An Azure SLQ will help with reporting but will not improve D365 performance. Option two moving part of business logic out of Dynamics to Azure Functions will help performance."
      },
      {
        "date": "2020-11-10T01:15:00.000Z",
        "voteCount": 1,
        "content": "I guess C is because it comes from on-prem, assuming there might be SQL direct queries which were not impacting perf onprem, but same function is impacting perf online as you don't query sql directly anymore."
      },
      {
        "date": "2021-03-06T11:54:00.000Z",
        "voteCount": 1,
        "content": "Tryly is correct. Solution architected is for online not on prem. UAT team will be testing online implementation and is experiencing performance issues. None of the options but moving logic to Azure Functions will improve performance."
      },
      {
        "date": "2021-04-04T06:40:00.000Z",
        "voteCount": 2,
        "content": "C because of the nature of access a baseline improvement of perf will be there for every op. And please don't say we should have used Azure Functions when you are on UAT - You might lose your job !"
      },
      {
        "date": "2020-10-03T06:04:00.000Z",
        "voteCount": 1,
        "content": "I guess C is correct. \"business logic out of Dynamics to Azure Functions will help performance\", is true, but C is true too and less tricky."
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35219-exam-mb-600-topic-3-question-8-discussion/",
    "body": "DRAG DROP -<br>A client plans to upgrade several solutions in the Dynamics 365 Customer Service application.<br>You need to recommend which upgrade option will achieve the outcome.<br>Which method should you use? To answer, drag the appropriate options to the correct outcomes. Each option may be used once, more than once, or not at all.<br>You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03385/0008100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03385/0008200001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://crmkeeper.com/2019/10/09/managed-solutions-update-vs-upgrade-vs-stage/",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-28T08:51:00.000Z",
        "voteCount": 7,
        "content": "anwer is correct"
      },
      {
        "date": "2020-11-10T01:20:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct, you can check directly when importing managed solution"
      },
      {
        "date": "2021-06-24T21:50:00.000Z",
        "voteCount": 1,
        "content": "The answer given is correct. \nUpgrade, Stage for Upgrade , Update \nhttps://crmkeeper.com/2019/10/09/managed-solutions-update-vs-upgrade-vs-stage/"
      },
      {
        "date": "2021-05-16T06:23:00.000Z",
        "voteCount": 1,
        "content": "First is Update and last is Upgrade, because you want to replace previous versions"
      },
      {
        "date": "2020-10-26T06:10:00.000Z",
        "voteCount": 1,
        "content": "I think, it should be: \n\nUpdate - because you don't need a upgrade to roll up patches. \nStage for Upgrade\nUpgrade - because you need a upgrade to replace previous versions."
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32267-exam-mb-600-topic-3-question-9-discussion/",
    "body": "A company is implementing Dynamics 365 Sales.<br>The company has turned off out-of-the-box quote calculations in order to implement its own custom calculations.<br>When users update a line item on a quote, they expect to see an updates total for the quote in real time. Users are reporting inconsistent behavior, with some aggregations taking up to two hours.<br>You review the system design and notice many asynchronous workflows.<br>You need to recommend a solution to enable the calculation in real time.<br>Which two options should you recommend? Each answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement a business process flow to replace the existing workflows.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConvert the asynchronous workflows to a synchronous plug-in.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConsolidate asynchronous workflows into a single real-time workflow.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConsolidate multiple asynchronous workflows into a single asynchronous workflow."
    ],
    "answer": "CD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-23T07:46:00.000Z",
        "voteCount": 14,
        "content": "Should be bc"
      },
      {
        "date": "2020-10-03T07:15:00.000Z",
        "voteCount": 7,
        "content": "\"You need to recommend a solution to enable the calculation in real time.\"\n\nBecause it's asked a realtime calculation, the answer has to be BC."
      },
      {
        "date": "2020-10-25T21:07:00.000Z",
        "voteCount": 7,
        "content": "Answer should be B &amp; C"
      },
      {
        "date": "2020-12-22T07:35:00.000Z",
        "voteCount": 3,
        "content": "ans   : bc"
      },
      {
        "date": "2020-11-28T08:17:00.000Z",
        "voteCount": 2,
        "content": "If the second answer should be D, always asynchronous remain! Then B and C"
      },
      {
        "date": "2020-11-20T07:16:00.000Z",
        "voteCount": 2,
        "content": "D is incorrect here. The main point of the question is REAL TIME; therefore, you can only focus on solutions that can deliver real time responses.\nThat only leaves by default B and C and both are valid solutions."
      },
      {
        "date": "2020-09-23T02:46:00.000Z",
        "voteCount": 3,
        "content": "Why not \"B. Convert the asynchronous workflows to a synchronous plug-in.\" ?"
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/31340-exam-mb-600-topic-3-question-10-discussion/",
    "body": "A company has extended Dynamics 365 Sales with an ISV product.<br>The ISV has locked the product. The ISV product fails to meet the business needs of the company. The company has a contractual obligation to continue using the ISV product but requires additional business logic.<br>You need to recommend a solution.<br>What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a managed solution with the components that you need to extend.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUpdate the business logic of the ISV to meet the needs of the company.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExtend the ISV with a secondary ISV that adds the additional business logic.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new unmanaged solution with the components that you need to extend."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-10T12:43:00.000Z",
        "voteCount": 9,
        "content": "So I think when the question says \"the ISV locked the product\" it means the product is delivered as a managed solution (as intended by Microsoft when distributing), so that means whenever you would like to customize any logic that came managed into your system you need to create a new (unmanaged) solution, add the desired components and edit them in order achieve your specific requirements. I have done this before several times."
      },
      {
        "date": "2020-09-15T07:48:00.000Z",
        "voteCount": 6,
        "content": "I'd go D."
      },
      {
        "date": "2020-09-23T07:48:00.000Z",
        "voteCount": 3,
        "content": "Same. D makes the most sense"
      },
      {
        "date": "2021-04-21T09:27:00.000Z",
        "voteCount": 1,
        "content": "C and D are definitely the two better choices, but I think D, the given answer is correct because the client has EXTENDED the product, which implies that this is not normally logic that is solved with out of the box functionality which an unmanaged solution would provide.  Also, an unmanaged solution is less desirable to a managed extension with another ISV."
      },
      {
        "date": "2021-04-21T09:28:00.000Z",
        "voteCount": 1,
        "content": "I meant to say C, the given answer is correct."
      },
      {
        "date": "2021-03-20T20:50:00.000Z",
        "voteCount": 1,
        "content": "C is correct. Extending Dynamics with ISV says that the logic needs an ISV. The ISV is not enough so we can extend it but not extending the Dynamics. D is incorrect for it is not possible to be removed when the  contractual obligation ends."
      },
      {
        "date": "2021-04-05T09:57:00.000Z",
        "voteCount": 1,
        "content": "Why do you assume the need for removal ? The customer wasn't happy with the ISV solution that's why locking came to picture, but if the unmanaged + ISV solves it then why would they still uninstall something already paid for ?"
      },
      {
        "date": "2021-01-07T10:13:00.000Z",
        "voteCount": 1,
        "content": "For my the correct answer is C becouse you dont should make changes a third party solution. You may lose support guarantees and future updates. For my the best practice is other ISV."
      },
      {
        "date": "2020-12-27T15:43:00.000Z",
        "voteCount": 1,
        "content": "I supposed C is correct:\n1- ISV means Independent Software Vendor but we use the ISV term for the ZIP file with the ISV managed solution... Let's call it ISV_SOL1..\n2- The Customer should use the ISV_SOL1 solution because of contractual constraints. Locked product means it is a managed solution that cannot be modified.\n3- in this scenario, the Idependent Software Vendor should creates a secondary managed solution (Let's call it ISV_SOL2) to resolve the additional business logic gaps. \n4- The final coverage of business needs will be an union of the ISV_SOL1 and ISV_SOL2. \nMake sense?"
      },
      {
        "date": "2020-12-20T23:54:00.000Z",
        "voteCount": 1,
        "content": "Microsoft are strongly recommending unmanaged for internal use.  So, it is correct that the ISV provided this as a managed, but the fix will be based on unmanaged"
      },
      {
        "date": "2020-11-20T07:23:00.000Z",
        "voteCount": 4,
        "content": "A: if you create a managed solution, later you will have headaches to remove dependencies.\nB. You cannot update the business logic of the ISV. We have a locked product.\nC. Why would you create another ISV? You just need to  add the additional logic.\nD. Yes, this is the answer. Add the components required and add your business logic to your solution. Because it is unmanaged you avoid creating lock-outs due to dependencies."
      },
      {
        "date": "2020-10-29T01:52:00.000Z",
        "voteCount": 3,
        "content": "D is what i think"
      },
      {
        "date": "2020-10-25T21:16:00.000Z",
        "voteCount": 3,
        "content": "As per my understanding answer should be D more logical and close to question."
      },
      {
        "date": "2020-10-15T22:05:00.000Z",
        "voteCount": 2,
        "content": "I will say A"
      },
      {
        "date": "2021-02-03T10:56:00.000Z",
        "voteCount": 1,
        "content": "you cannot update components in managed solution, so D is correct."
      },
      {
        "date": "2020-09-27T16:54:00.000Z",
        "voteCount": 3,
        "content": "I will say A. Microsoft is pushing for Managed (A) \nD is unmanaged."
      },
      {
        "date": "2021-03-18T13:33:00.000Z",
        "voteCount": 1,
        "content": "But how will you create a managed solution. You will create an unmanaged solution and later import as managed in production. This is what I think you meant to."
      }
    ],
    "examNameCode": "mb-600",
    "topicNumber": "3"
  }
]