[
  {
    "topic": 15,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82981-exam-az-305-topic-15-question-1-discussion/",
    "body": "HOTSPOT -<br>How should the migrated databases DB1 and DB2 be implemented in Azure?<br>Hot Area:<br><img src=\"/assets/media/exam-media/04224/0012300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04224/0012400001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: SQL Managed Instance -<br>Scenario: Once migrated to Azure, DB1 and DB2 must meet the following requirements:<br>✑ Maintain availability if two availability zones in the local Azure region fail.<br>✑ Fail over automatically.<br>✑ Minimize I/O latency.<br>The auto-failover groups feature allows you to manage the replication and failover of a group of databases on a server or all databases in a managed instance to another region. It is a declarative abstraction on top of the existing active geo-replication feature, designed to simplify deployment and management of geo- replicated databases at scale. You can initiate a geo-failover manually or you can delegate it to the Azure service based on a user-defined policy. The latter option allows you to automatically recover multiple related databases in a secondary region after a catastrophic failure or other unplanned event that results in full or partial loss of the SQL Database or SQL Managed Instance availability in the primary region.<br><br>Box 2: Business critical -<br>SQL Managed Instance is available in two service tiers:<br>General purpose: Designed for applications with typical performance and I/O latency requirements.<br>Business critical: Designed for applications with low I/O latency requirements and minimal impact of underlying maintenance operations on the workload.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/azure-sql/database/auto-failover-group-overview https://docs.microsoft.com/en-us/azure/azure-sql/managed-instance/sql-managed-instance-paas-overview",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-29T13:38:00.000Z",
        "voteCount": 46,
        "content": "Elastic Pool.\n\nManaged instance does not support zone redundancy \n\nZone-redundant configuration is not available in SQL Managed Instance. In SQL Database this feature is only available when the Gen5 hardware is selected.\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/high-availability-sla?view=azuresql&amp;tabs=azure-powershell"
      },
      {
        "date": "2023-11-30T20:01:00.000Z",
        "voteCount": 7,
        "content": "Update - MI now supports ZR\nhttps://learn.microsoft.com/en-us/azure/reliability/migrate-sql-managed-instance?tabs=portal"
      },
      {
        "date": "2024-08-31T07:04:00.000Z",
        "voteCount": 1,
        "content": "Its still in preview"
      },
      {
        "date": "2024-10-11T07:27:00.000Z",
        "voteCount": 2,
        "content": "preview only in general purpose tier. it is available for business critical"
      },
      {
        "date": "2023-02-19T05:38:00.000Z",
        "voteCount": 12,
        "content": "We're talking about 2 DBs, so a single DB won't cut it.  Managed Instances support zone redundancy in preview - so that's not something we'd want in production yet.  Only option left: elastic pool.  Makes sense since we're using 2 DBs.\n\nRegarding the tier:\nGeneral Purpose fits the bill for zone redundancy - you can turn on Zone Redundancy in GP.  However... they also want high IOPS (requirement 3).  So that means Business Critical or Hyperscale (500 IOPS per vCore with 7,000 maximum IOPS in GP, 8,000 IOPS per vCore with 200,000 maximum in BC an Hyperscale has 327,680 IOPS with max local SSD). \n\nI'm not sure if you can use Hyperscale with elastic pools (portal won't let me select it in my lab), so I'd go for Business Critical."
      },
      {
        "date": "2023-02-13T07:59:00.000Z",
        "voteCount": 6,
        "content": "Updating my comment: now the feature is in preview, but for production and reduce administrative effort, i would still go with elastic pool:\n\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/high-availability-sla?view=azuresql&amp;tabs=azure-powershell\nThis feature is currently in Preview for SQL Managed Instance. In SQL Database, when using the Business Critical tier, zone-redundant configuration is only available when the standard-series (Gen5) hardware is selected. For up to date information about the regions that support zone-redundant databases, see Services support by region."
      },
      {
        "date": "2023-09-26T08:45:00.000Z",
        "voteCount": 6,
        "content": "The following answer is right.\n\nDatabase: An Azure SQL Database elastic pool\nService Tier: Business Critical"
      },
      {
        "date": "2024-03-22T08:05:00.000Z",
        "voteCount": 2,
        "content": "Elastic pool because the cost should be minimum. MI will be more expensive"
      },
      {
        "date": "2023-09-27T07:54:00.000Z",
        "voteCount": 3,
        "content": "This is the same question. https://www.examtopics.com/discussions/microsoft/view/82084-exam-az-305-topic-12-question-1-discussion/"
      },
      {
        "date": "2023-08-16T04:13:00.000Z",
        "voteCount": 5,
        "content": "Elastic pool / business critical for both of the case study questions purely due to the redundancy requirement.  You should NEVER use preview in prod!"
      },
      {
        "date": "2023-03-03T07:14:00.000Z",
        "voteCount": 3,
        "content": "1.SQL Managed Instance\n2. Business Critical service tier\n\"Zone-redundant configuration is currently in preview for SQL Managed Instance, and only available for the Business Critical service tier.\"\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/high-availability-sla?view=azuresql&amp;tabs=azure-powershell"
      },
      {
        "date": "2023-02-11T08:59:00.000Z",
        "voteCount": 3,
        "content": "Hello guys,\nI guess is correct, should be the following:\n&gt; Database: \"AZURE SQL MANAGED INSTANCE\" - it can provide AUTO-FAILOVER\n&gt; Service Tier: \"Business Critical\""
      },
      {
        "date": "2023-02-02T08:54:00.000Z",
        "voteCount": 1,
        "content": "Question #1-Page47 - this question looks similar\nfor this question the answer is Elastic Pool now Why Single Azure SQL Database here?\n\nI think GarryK is correct"
      },
      {
        "date": "2023-01-28T17:13:00.000Z",
        "voteCount": 3,
        "content": "Single Azure SQL Database\nBusiness Critical\n\nIndeed a repeated question IMHO\n\nA single azure sql db for each db would meet the requirements.\n\nYou can't use an elastic pool unless you are aware of the load pattern of each db to make it worthwhile to use elastic db. There is no indication in the question to hint pool will be useful.\n\nalso there is no indication in the answer that single azure db has to be for both dbs. It can a single db for each - db1 and db2. Therefore Multi DB in question doesn't rule out a single azure db as potential answer."
      },
      {
        "date": "2023-03-28T08:04:00.000Z",
        "voteCount": 1,
        "content": "in most of the answer it use Azure SQL Database. only this question it use \"A Single Azure SQL Database\". so I don't think it imply 1 SQL DB for each."
      },
      {
        "date": "2023-01-18T02:18:00.000Z",
        "voteCount": 2,
        "content": "SQL Managed Instance does support zone redundancy, however you need to choose Gen5 hardware, so it all depends on when this question was released. One of the business requirements is to minimize cost, so elastic pool would be the preferred choice to minimize cost, however MI would work too."
      },
      {
        "date": "2023-01-18T02:31:00.000Z",
        "voteCount": 3,
        "content": "Additional comments, General Purpose has zone redundancy on elastic pool too, so so the answer should be Elastic Pool and General Purpose."
      },
      {
        "date": "2022-12-24T22:41:00.000Z",
        "voteCount": 2,
        "content": "Yes, Azure SQL Managed Instance supports Zone Redundancy. Zone Redundancy is a feature that provides additional resiliency and availability for Azure SQL Managed Instance by replicating the data to a secondary region within the same geography. This allows you to maintain availability in the event of a region-wide failure or disaster.\n\nTo enable Zone Redundancy for your Azure SQL Managed Instance, you can specify the zone redundancy option when you create the instance. You can also enable or disable this feature later on by modifying the instance's properties.\n\nIt's important to note that Zone Redundancy is only available for Azure SQL Managed Instance in the General Purpose and Business Critical service tiers. It is not available for the Hyperscale service tier."
      },
      {
        "date": "2023-01-08T08:17:00.000Z",
        "voteCount": 4,
        "content": "I think you are getting confused. \n\n\"Zone Redundancy is a feature that provides additional resiliency and availability for Azure SQL Managed Instance by replicating the data to a secondary region within the same geography\" - Wrong. \n\nSee below correction:\nZone Redundancy is a feature that provides additional resiliency and availability for Azure SQL Managed Instance by replicating the data across multiple physical locations within an Azure region. \n\nNote - \"Physical Locations\" \nMeaning, your data is replicated to other availability zones within the same region. Hence \"ZONE\" Redundancy.\n\nAn availability zone consists of one or more data centers (physical locations)."
      },
      {
        "date": "2022-12-06T11:52:00.000Z",
        "voteCount": 4,
        "content": "Agree with others.\n\nElastic Pool\n\nMulti DB so not Azure SQL and as per below not SQL MI either\n\n\nBusiness Critical\n\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/high-availability-sla?view=azuresql&amp;tabs=azure-powershell\n\nFrom above URL;\n\nPremium and Business Critical service tier zone redundant availability\n\nThis feature is not available in SQL Managed Instance. In SQL Database, when using the Business Critical tier, zone-redundant configuration is only available when the standard-series (Gen5) hardware is selected. For up to date information about the regions that support zone-redundant databases, see Services support by region."
      },
      {
        "date": "2023-01-20T07:47:00.000Z",
        "voteCount": 4,
        "content": "Correction.\nAfter a further look given answer looks correct.\nSQL MI does support zone redundancy.\n\nhttps://techcommunity.microsoft.com/t5/azure-sql-blog/zone-redundancy-for-azure-sql-managed-instance-business-critical/ba-p/3677646"
      },
      {
        "date": "2023-02-08T12:50:00.000Z",
        "voteCount": 2,
        "content": "According to official docs https://learn.microsoft.com/en-us/azure/azure-sql/database/features-comparison?view=azuresql#platform-capabilities it is still in Preview. This means it is not official for the general public. Also I doubt that the test questions are updated on monthly basis for the latest feature updates. Not sure though, question is a bit tricky."
      },
      {
        "date": "2023-02-11T08:45:00.000Z",
        "voteCount": 2,
        "content": "Great point regarding preview mode, and the frequency of when the questions are updated.\nThere are usually assumptions with Microsoft.\nI think I'll see which way the wind blows on the big day if this crops up :)"
      },
      {
        "date": "2024-03-08T06:21:00.000Z",
        "voteCount": 1,
        "content": "As of today, zone-redundant config is generally available for the Business Critical tier:\n\n\"Zone-redundant configuration is in public preview for the General Purpose service tier and generaly (sic) available for the Business Critical service tier.\"\n\nSource: https://learn.microsoft.com/en-us/azure/azure-sql/managed-instance/high-availability-sla?view=azuresql-mi&amp;preserve-view=true"
      },
      {
        "date": "2024-07-20T04:09:00.000Z",
        "voteCount": 1,
        "content": "...and it referst to MI General Purpose, not Azure SQL General Purpose"
      },
      {
        "date": "2022-11-27T00:05:00.000Z",
        "voteCount": 2,
        "content": "Questions is when DB1 and Db2 are already migrated to Azure! The given answers are correct and it's not a repeated question."
      },
      {
        "date": "2022-12-04T14:41:00.000Z",
        "voteCount": 2,
        "content": "The zone redundant availability is not available for SQL Managed Instance. So one of the requirements is not met"
      },
      {
        "date": "2022-11-22T08:48:00.000Z",
        "voteCount": 3,
        "content": "Repeat questions"
      },
      {
        "date": "2022-09-20T12:51:00.000Z",
        "voteCount": 2,
        "content": "\"Azure SQL Database elastic pool\" in the Premium and Business Critical service tiers of the Premium Availability model support both locally redundant and zone redundant availability. Premium and Business Critical service tier zone redundant availability is not available for SQL Managed Instance. Azure SQL Database with General Purpose supports zone redundant availability, but, the answer calls for \"Single Azure SQL database\", which won't work for this use case. \n\nhttps://azure.microsoft.com/en-gb/blog/azure-sql-database-now-offers-zone-redundant-premium-databases-and-elastic-pools/#:~:text=To%20take%20advantage%20of%20this%20capability%2C%20you%20simply,reconfigure%20the%20database%20or%20pool%20without%20any%20downtime.\n\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/high-availability-sla?view=azuresql&amp;tabs=azure-powershell#premium-and-business-critical-service-tier-locally-redundant-availability"
      },
      {
        "date": "2022-09-21T23:28:00.000Z",
        "voteCount": 1,
        "content": "Business Critical service is available for managed instance with zone redundancy and auto failover. It is also cheaper than elastic pool..."
      },
      {
        "date": "2022-09-22T01:01:00.000Z",
        "voteCount": 3,
        "content": "Sorry not zone redundant ... zone redundancy backup"
      },
      {
        "date": "2022-10-05T03:16:00.000Z",
        "voteCount": 3,
        "content": "\"Zone-redundant configuration is not available in SQL Managed Instance. In SQL Database this feature is only available when the Gen5 hardware is selected.\""
      }
    ],
    "examNameCode": "az-305",
    "topicNumber": "15"
  }
]