[
  {
    "topic": 9,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81775-exam-pl-300-topic-9-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to design the data model and the relationships for the Customer Details worksheet and the Orders table by using Power BI. The solution must meet the report requirements.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04331/0006000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04331/0006000002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Yes -<br>Need to link the tables for: The Top Customers report will show the top 20 customers based on the highest sales amounts in a selected order month or quarter, product category, and sales region.<br><br>Box 2: No -<br>It should be set to Integer.<br><br>Box 3: No -<br>Can  use the Region field of the Customer Details table.<br>The Orders table only has the ShipRegion field",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-13T00:38:00.000Z",
        "voteCount": 94,
        "content": "Answer should be No - Yes - No. According to the sample data the CustomerID in Customer Details is a number (1 through 10 is shown in the example data) and the CustomerID in the Orders table has an example value of VINET, which looks like it corresponds to the value of CustomerCRMID instead of CustomerID from the Customer Details worksheet so the first answer should be No. The second answer should be Yes, the CustomerID from Orders has example value VINET, which is text."
      },
      {
        "date": "2024-02-18T16:49:00.000Z",
        "voteCount": 2,
        "content": "Correct! Also, for the 3rd question, the region sould be considered from the Customer Detail worksheet and not the Orders table"
      },
      {
        "date": "2022-12-22T13:51:00.000Z",
        "voteCount": 6,
        "content": "Yeah, ThariCD is right; I was wrong."
      },
      {
        "date": "2022-11-19T06:40:00.000Z",
        "voteCount": 3,
        "content": "Wrong: there is no CustomerCRMID on the Orders table. It's explicitly stated CustomerID, pls don't manufacture questions."
      },
      {
        "date": "2022-11-25T02:15:00.000Z",
        "voteCount": 13,
        "content": "ThariCD is right. We cannot link CustomerID from both tables because of the reasons he said. One is a number and one is a five characters text.\nThe fact that there is no CustomerCRMID on the Orders table is entirely irrelevant to the question."
      },
      {
        "date": "2022-09-18T12:55:00.000Z",
        "voteCount": 6,
        "content": "Also the Region should come from Customer Details as the one in Order table is a shipping region, not sales region"
      },
      {
        "date": "2022-11-05T07:22:00.000Z",
        "voteCount": 23,
        "content": "1/ NO : the relationship is between CustomerCRMID from Customer Details and CustomerID from Orders\n2/ YES: the relationship is between CustomerCRMID from Customer Details and CustomerID(NCHAR) from Orders --&gt; CustomerCRMID have to be text too.\n3/ NO: from Customer Details"
      },
      {
        "date": "2024-05-27T01:57:00.000Z",
        "voteCount": 1,
        "content": "How do you know CustomerCRMID in Customer Details Sheets is Text ? I meant, it seems a text value but is it because we are getting it from Excel so thats why Text ?\nKindly confirm"
      },
      {
        "date": "2024-05-02T08:24:00.000Z",
        "voteCount": 1,
        "content": "Passed with 917/1000\nQuestion and answers were exactly the same but different order with the options!\nAnswer given:\n- No\n- Yes\n- No"
      },
      {
        "date": "2024-04-11T22:52:00.000Z",
        "voteCount": 1,
        "content": "According to the sample data I will go for:\nNo\nNo\nNo"
      },
      {
        "date": "2024-03-15T09:11:00.000Z",
        "voteCount": 1,
        "content": "1: NO : link should be on customer CRMID as it is the same datatype as 'orders'[customerID]\n2. YES : both are string based\n3. NO : Top customers = The one with most sales, worksheet alone does not provide the needed info"
      },
      {
        "date": "2024-01-03T10:30:00.000Z",
        "voteCount": 2,
        "content": "Full access with commentaries is totally worth it!"
      },
      {
        "date": "2023-09-09T18:38:00.000Z",
        "voteCount": 1,
        "content": "Where is the damn example data??"
      },
      {
        "date": "2023-08-11T08:17:00.000Z",
        "voteCount": 3,
        "content": "1 NO - You can't join 02 tables using columns that are not the same type. In this scenario, if we assume that we are going to change the column type before joining them, we won't have any results. Because the values in those columns (The value of customer id in the table Customer is not the same as customer Id in the table Orders) are different. (in the customer table, we have 1,2,3,.. and in the the orders, we have VINET as exemple\n\n2 NO - Even if we change the type of column to TEXT it won't work because the values in those columns (The value of customer id in the table Customer is not the same as customer Id in the table Orders) are different. (in the customer table, we have 1,2,3,.. and in the the orders, we have VINET as exemple\n\n3 No - Region is not relevant to filter according to the requirement"
      },
      {
        "date": "2023-05-18T07:56:00.000Z",
        "voteCount": 7,
        "content": "I don't get the logic of many of you:\nFirst the questions asks , if there must be a relation in Customer ID column. The answer is yes, of course there must be a relation in that column as is the only comon table.\nNext question is if there must be changed to text data type. The answer is no, it doesn't have to be of a text data type, it can be also an integer data type. Is true that to create a relationship you need the same data type in both columns but doesn't have to be of a text data type.\nAnd third, the region doesn't have to come from the Order table to work correctly. Furthermore, it isn't even there, it comes from Customer details table.\nSo Y/N/N I think are the answers. It can get tricky but I would say I followed the correct logic here."
      },
      {
        "date": "2024-04-20T06:01:00.000Z",
        "voteCount": 1,
        "content": "Totally agree.\n\nThe first statement is about creating a relationship between Customer Details and Orders table, which of course is YES as they must be linked. The fact that before linking you need to change the data type is a different topic, almost irrelevant.\n\nComments in discussion are super helpful, but sometimes I feel like it can lead to wrong answers based on people's interpretation of the question."
      },
      {
        "date": "2023-05-18T08:03:00.000Z",
        "voteCount": 3,
        "content": "Ok I just saw the example value of Cutomer ID in Orders table and seems to be the same as CustomerCRMID column from Customer details table, so is a No the first as the relation should be in those 2 columns. This also changes my answer to the second question, as now we know what data types are both so, it can only be a text data type. Final answer is N/Y/N , sorry for confusion"
      },
      {
        "date": "2023-05-17T05:15:00.000Z",
        "voteCount": 1,
        "content": "NO (Relationship should be based on CustomerDetails.CustomerCRMID = Orders.CustomerID\nYES technically, if it's not so already in the CustomerDetails table\nNO Region field in this case is associated to customer and should come from CustomerDetails Table."
      },
      {
        "date": "2022-12-29T02:30:00.000Z",
        "voteCount": 6,
        "content": "1) NO - CustomerID in Orders is text (\"VINET\") while CustomerID in Customer Details is number (\"1\"). \n2) YES - Relationship between Orders and Customer Details will be via column CustomerCRMID in Customer Details and CustomerID in Orders, which are both text.\n3) NO - the Orders table only contains shipping address, which is different from the billing address which should be used for sales region. Thus, it should come from Customer Details table."
      },
      {
        "date": "2022-12-16T17:33:00.000Z",
        "voteCount": 6,
        "content": "1) Y\n2) N\n3) N\nGuys, please consider the 3 questions as connected process. \nFor 1), we must build relationship for these two tables. CustomerID is the only common filed in both tables; \n2) is to achieve 1), we will set the Data Type of CustomerID to Integer rather than Text.\n3) The Region field also exists in Customer Details table, not only in Orders table."
      },
      {
        "date": "2022-11-23T03:38:00.000Z",
        "voteCount": 3,
        "content": "No-yes-no"
      },
      {
        "date": "2022-10-25T00:24:00.000Z",
        "voteCount": 8,
        "content": "no - no - no\n1. no, because Customer Details CustomerID is int and Order CustomerID is text - not the same content\n2. no, because there is no common column where we could join on. Furthermore, it should be avoided to join via text columns, because integer fields in relations are faster\n3. no, because sales region is nowhere defined as the ship-to country or the sold-to country. So it can't be said, that it MUST come from the Orders."
      },
      {
        "date": "2022-12-07T07:35:00.000Z",
        "voteCount": 1,
        "content": "I agree with no - no - no\nOnly for the last one I would simply argue that Region is already in the Customer Details, so no need to get it from somewhere else."
      },
      {
        "date": "2023-02-10T10:39:00.000Z",
        "voteCount": 2,
        "content": "Agree about no-no-no, but in 2nd both columns are already text columns, so it is not necessary to set to text..."
      },
      {
        "date": "2022-09-12T03:40:00.000Z",
        "voteCount": 3,
        "content": "According to the example value in the CustomerID column of the ORDERS table, this table contains strings such as \"VINET\" which can't be converted to an integer. Therefore, in my opinion, the primary and foreign keys of the relationship must be TEXT and not INTEGER.\nAs a consequence, I believe the second statement is TRUE"
      }
    ],
    "examNameCode": "pl-300",
    "topicNumber": "9"
  },
  {
    "topic": 9,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/86380-exam-pl-300-topic-9-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to create a measure that will return the percentage of late orders.<br>How should you complete the DAX expression? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04331/0006200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04331/0006300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: CALCULATE -<br>CALCULATE evaluates an expression in a modified filter context.<br>Syntax: CALCULATE(&lt;expression&gt;[, &lt;filter1&gt; [, &lt;filter2&gt; [, ג€¦]]]) expression - The expression to be evaluated. filter1, filter2,.. - (Optional) Boolean expressions or table expressions that defines filters, or filter modifier functions.<br>Incorrect:<br>* COUNTX - Counts the number of rows that contain a non-blank value or an expression that evaluates to a non-blank value, when evaluating an expression over a table.<br>* CALCULATETABLE evaluates a table expression in a modified filter context.<br>Syntax: CALCULATETABLE(&lt;expression&gt;[, &lt;filter1&gt; [, &lt;filter2&gt; [, ג€¦]]])<br>Expression - The table expression to be evaluated.<br><br>Box 2: FILTER -<br>FILTER returns a table that represents a subset of another table or expression.<br>Syntax: FILTER(&lt;table&gt;,&lt;filter&gt;)<br>Box 3: Orders[ShippedDate] &gt; Orders[RequiredDate]<br>Northwind Traders defines late orders as those shipped after the required shipping date.<br>Reference:<br>https://docs.microsoft.com/en-us/dax/calculate-function-dax<br>https://docs.microsoft.com/en-us/dax/filter-function-dax",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-25T00:29:00.000Z",
        "voteCount": 32,
        "content": "Answer is correct.\nCALCULATE\nFILTER\nOrders[ShippedDate] &gt; Orders[RequiredDate]"
      },
      {
        "date": "2022-11-19T07:02:00.000Z",
        "voteCount": 11,
        "content": "Correct Answer"
      },
      {
        "date": "2023-05-05T00:23:00.000Z",
        "voteCount": 6,
        "content": "Given answer is correct."
      },
      {
        "date": "2022-12-07T08:00:00.000Z",
        "voteCount": 5,
        "content": "Answer is correct."
      },
      {
        "date": "2022-12-01T18:41:00.000Z",
        "voteCount": 7,
        "content": "Answer is correct.\nCALCULATE\nFILTER\nOrders[ShippedDate] &gt; Orders[RequiredDate]"
      }
    ],
    "examNameCode": "pl-300",
    "topicNumber": "9"
  },
  {
    "topic": 9,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/86381-exam-pl-300-topic-9-question-3-discussion/",
    "body": "You need to minimize the size of the dataset. The solution must meet the report requirements.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGroup the Categories table by the CategoryID column.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove the QuantityPerUnit column from the Products table.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFilter out discontinued products while importing the Products table.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChange the OrderID column in the Orders table to the Text data type."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 22,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-10-25T00:31:00.000Z",
        "voteCount": 11,
        "content": "Answer is correct"
      },
      {
        "date": "2022-12-07T08:35:00.000Z",
        "voteCount": 7,
        "content": "B is correct.\nQuantityPerUnit column from the Products table is not necessary for the analysis.\nDiscontinued products may not be filtered out because OrderDetails can still have foreign key referencing to them (historical data must be kept)."
      },
      {
        "date": "2024-03-15T09:25:00.000Z",
        "voteCount": 1,
        "content": "B, remove unused data"
      },
      {
        "date": "2023-05-01T00:40:00.000Z",
        "voteCount": 2,
        "content": "The column is unnecessary."
      },
      {
        "date": "2023-04-24T00:10:00.000Z",
        "voteCount": 2,
        "content": "B is correct"
      },
      {
        "date": "2022-12-01T18:42:00.000Z",
        "voteCount": 1,
        "content": "B is correct"
      },
      {
        "date": "2022-11-03T05:26:00.000Z",
        "voteCount": 2,
        "content": "Can anyone explain it for me? Many thanks"
      },
      {
        "date": "2022-11-09T06:56:00.000Z",
        "voteCount": 7,
        "content": "The QuantityPerUnit column from the Products table is not necessary for the analysis, so that is the correct answer.   Filtering does not affect the size of the dataset, so as the grouping."
      },
      {
        "date": "2022-12-07T08:30:00.000Z",
        "voteCount": 2,
        "content": "Filtering rows during import DOES affect the size of the dataset.\nI think that the correct argumentation should be that discontinued products may not be filtered out because OrderDetails can still have foreign key referencing to them."
      },
      {
        "date": "2023-01-15T11:59:00.000Z",
        "voteCount": 8,
        "content": "\"The reports must show historical data\" including discontinued products."
      }
    ],
    "examNameCode": "pl-300",
    "topicNumber": "9"
  },
  {
    "topic": 9,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82716-exam-pl-300-topic-9-question-4-discussion/",
    "body": "You need to design the data model to meet the report requirements.<br>What should you do in Power BI Desktop?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Power Query, add a date table. Create an active relationship to the OrderDate column in the Orders table and an inactive relationship to the ShippedDate column in the Orders table.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Power Query, add columns to the Orders table to calculate the calendar quarter and the calendar month of the OrderDate column.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Power BI Desktop, use the Auto date/time option when creating the reports.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Power Query, use a DAX expression to add columns to the Orders table to calculate the calendar quarter of the OrderDate column, the calendar month of the OrderDate column, the calendar quarter of the ShippedDate column, and the calendar month of the ShippedDate column."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 69,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 19,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-18T13:15:00.000Z",
        "voteCount": 48,
        "content": "Auto date/time does not meet the criteria:  The data model must minimize the size of the dataset as much as possible, while meeting the report requirements and the technical requirements.\n\nThe correct answer is A"
      },
      {
        "date": "2022-11-24T16:38:00.000Z",
        "voteCount": 3,
        "content": "A is not correct. 2 tables can only have a pair of relationship. Option A cannot fulfill the requirements of display by either order quarter (month) or shipdate quarter (month)."
      },
      {
        "date": "2023-04-14T05:03:00.000Z",
        "voteCount": 11,
        "content": "nope, just use USERELATIONSHIP"
      },
      {
        "date": "2023-03-10T17:36:00.000Z",
        "voteCount": 1,
        "content": "A is not right, because there's no sufficient information regarding the date table, whether it will have \"quarter\" details."
      },
      {
        "date": "2022-09-20T08:21:00.000Z",
        "voteCount": 15,
        "content": "I think that the C option is the correct one.\nthe option A creates an active relationship between Sales.orderDate and Date and a inactive relationship between sales.shippedDate and Date. However we will have visuals where we will have to filter either shippedDate or orderDate, so we will no be able to filter by shipedDate because of the relationship is inactive (we could create measures using the USERELATIONSHIP() function but this is not the case due to we have to use the filters directly from the visuals)"
      },
      {
        "date": "2022-11-25T02:25:00.000Z",
        "voteCount": 7,
        "content": "I think A is right, because we do have visuals that need a filter on either order or shipping date, but no visual requires a filter on both at the same time."
      },
      {
        "date": "2022-12-07T08:54:00.000Z",
        "voteCount": 2,
        "content": "I agree with your argumentation."
      },
      {
        "date": "2023-04-26T21:08:00.000Z",
        "voteCount": 1,
        "content": "To show \"on time shipping\" we need to have  both order data and shipped date as active column"
      },
      {
        "date": "2024-01-03T16:30:00.000Z",
        "voteCount": 1,
        "content": "This is not right, on-time shipping requires ship date and required date NOT order date. USERELATIONSHIP() can still be used for the inactive relationships as mentioned by @Fer079"
      },
      {
        "date": "2024-06-11T12:06:00.000Z",
        "voteCount": 1,
        "content": "I know \"A\" could do the job, but does anyone think \"D\" can also do the work? If so, it creates fewer columns and rows than adds a complete date table."
      },
      {
        "date": "2024-04-18T02:40:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/power-bi/transform-model/desktop-auto-date-time"
      },
      {
        "date": "2024-03-15T09:36:00.000Z",
        "voteCount": 2,
        "content": "this is weird because in the learning path they explicit state not to use auto date/time as it is bad practice and use date table only. But in this scope... one date table is not enough and it's not mentioned to duplicate the date table. So to fulfill the requirements, the only stable solution I see is D, I do agree It doesn't minimize the size but it doesn't make it that much bigger either...\n\nD. From Power Query, use a DAX expression to add columns to the Orders table to calculate the calendar quarter of the OrderDate column, the calendar month of the OrderDate column, the calendar quarter of the ShippedDate column, and the calendar month of the ShippedDate column."
      },
      {
        "date": "2024-02-22T07:14:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is A. Any Model should have a Data Table to make it easier for us later to create DAX measures for analysis, hierarchies and so on."
      },
      {
        "date": "2023-08-06T04:07:00.000Z",
        "voteCount": 2,
        "content": "❌A\n✔ C/D\nThings to take take notice of. Power Query is not the best place to create Date table and relationships."
      },
      {
        "date": "2024-03-02T14:39:00.000Z",
        "voteCount": 1,
        "content": "This is not true. Also in the documentation it is specified that we can create a new date table in Power Query using M code (and for that, we have many examples and very useful functions that are used) or in Power BI using DAX (CALENDAR() CALENDARAUTO() functions). By creating more columns, we'll increase the size of the model."
      },
      {
        "date": "2023-08-03T15:47:00.000Z",
        "voteCount": 2,
        "content": "A: for me\nAlso, I notice people mention that since its 2GB it cannot be imported into Power BI. That isn't true. 1) it depends on its finalized compression sizes, not the size of the DB etc and 2) also depends on if they have premium or not"
      },
      {
        "date": "2023-05-01T00:54:00.000Z",
        "voteCount": 6,
        "content": "we need a calendar table for current year and last 3 years! \nAuto data/time  increase the size of data model."
      },
      {
        "date": "2023-04-26T21:06:00.000Z",
        "voteCount": 1,
        "content": "In the previous question , where we need to use both order date and shipped date to calculate the late orders,In that case we need both columns as active. So I think its C.\nIf it was an independent question then definitely answer would be C"
      },
      {
        "date": "2022-12-30T16:24:00.000Z",
        "voteCount": 2,
        "content": "Answer A does not have correct active/inactive relationship. Order Shipped date should be active. So that leaves C as correct option"
      },
      {
        "date": "2022-12-07T08:58:00.000Z",
        "voteCount": 13,
        "content": "I think the answer is A.\nThe inactive relationship on shipping date can be used in a measure with USERELATIONSHIP() function, because nowhere is being filtered on both order date and shipping date at the same time."
      },
      {
        "date": "2022-11-19T07:16:00.000Z",
        "voteCount": 1,
        "content": "A is the answer"
      },
      {
        "date": "2022-11-08T05:55:00.000Z",
        "voteCount": 3,
        "content": "C is correct."
      },
      {
        "date": "2022-09-28T03:11:00.000Z",
        "voteCount": 8,
        "content": "--&gt; Top Customers report : \"will show the top 20 customers based on the highest sales amounts in a selected order month or quarter, product category, and sales region.\". Therefore you don't need a Dates Table at all. All you need is month and quarter from the sales-date which you will get if you enable auto-dateTime.\n--&gt; Top Products report \"will show the top 20 products based on the highest sales amounts sold in a selected order month or quarter, sales region, and product category\". You don't need a Dates table for this report. With auto-DateTime you can get the month and quarter from the sales-date.\n--&gt; On-Time Shipping report \"will show the following metrics for a selected shipping month or quarter:\". Therefore, you don't need a dates table for this report. You only need the shipping month and quarter from the shipping-date which are gonne be automatically created once you will have enabled auto-dateTime"
      },
      {
        "date": "2022-09-30T01:33:00.000Z",
        "voteCount": 2,
        "content": "Agree with you"
      },
      {
        "date": "2023-02-21T12:47:00.000Z",
        "voteCount": 9,
        "content": "The auto Date/Time only works in Import mode and the dataset is 2GB so it can't be imported."
      },
      {
        "date": "2023-09-08T10:46:00.000Z",
        "voteCount": 2,
        "content": "The whole database is 2GB. You will not be imported all the information. You keep historical data from 3 years prior and create to 20 reports."
      }
    ],
    "examNameCode": "pl-300",
    "topicNumber": "9"
  },
  {
    "topic": 9,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82717-exam-pl-300-topic-9-question-5-discussion/",
    "body": "HOTSPOT -<br>You need to create a relationship in the dataset for RLS.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04331/0006600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04331/0006600002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: many-to-many -<br>Users in the sales department must be able to access only the data of the sales region to which they are assigned in the Sales Employees table.<br>With composite models, you can establish a many-to-many relationship between tables, which removes requirements for unique values in tables. It also removes previous workarounds, such as introducing new tables only to establish relationships.<br><br>Box 2: Orders table -<br>The Orders table has a ShipRegion column.<br>Reference:<br>https://docs.microsoft.com/en-us/power-bi/transform-model/desktop-create-and-manage-relationships",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-29T02:59:00.000Z",
        "voteCount": 57,
        "content": "Many-to-Many\nCustomer details\n\nSales employees should see the sales of their region only, so all sales ordered by customers whose billing address belongs to the sales employee's region.\nTherefore, the relationship between sales employees (region) and customer details (region) should be many-to-many (a sales employee has many customers in his region and a customer in a region can have many sales employees for that region).\nIn this case, as the customer table is related to the order table, the sales employees will only be able to see the orders of the customers in their region."
      },
      {
        "date": "2022-12-23T09:49:00.000Z",
        "voteCount": 1,
        "content": "I agree Many-to-Many, but where are we able to see that Order table is related to the Customer table? They do not have a shared data type between their ID columns, unless the pictures have a typo. For me it would be Order Details because I don't see where the relationship is declared between Customer Details (one) and Order Details (many)."
      },
      {
        "date": "2022-12-29T10:46:00.000Z",
        "voteCount": 3,
        "content": "The billing address is in the customer details, therefore, when assigning and working out commission etc for sales employees, the billing address in customer details will be counted not the shipping address which is in the orders table. Although the case study should have made it clear.\n\nMany to many link with customer details worksheet"
      },
      {
        "date": "2022-12-30T17:58:00.000Z",
        "voteCount": 2,
        "content": "Customers can have placed orders in multiple regions so then the sales employees will be able to see other regions sales"
      },
      {
        "date": "2022-12-29T10:46:00.000Z",
        "voteCount": 6,
        "content": "The billing address is in the customer details, therefore, when assigning and working out commission etc for sales employees, the billing address in customer details will be counted not the shipping address which is in the orders table. Although the case study should have made it clear.\n\nMany to many link with customer details worksheet"
      },
      {
        "date": "2022-10-08T08:36:00.000Z",
        "voteCount": 4,
        "content": "Agreed as \"Each employee in the Sales Employees table is assigned to one sales region. Multiple employees can be assigned to each region.\"\nIn a good operations and real life model, customers will be assigned to Sales employees ID for performance tracking and bonuses."
      },
      {
        "date": "2022-09-18T13:30:00.000Z",
        "voteCount": 11,
        "content": "One to Many\nCustomer Details \n\n'EACH employee in the Sales Employees table is assigned to one SALES region '"
      },
      {
        "date": "2022-10-25T00:57:00.000Z",
        "voteCount": 14,
        "content": "But we are not connecting to a region entity but to a customer entity. There'll be more than one customer in a region. There are also more than one sales employee assigned to one region. \nSo it should be many-to-many."
      },
      {
        "date": "2024-09-25T11:26:00.000Z",
        "voteCount": 1,
        "content": "Agree with the answer given actually....In a star schema with Orders as the fact table, we would want to use Sales employees as the dimension to relate to the fact. We can use the Sales Employees(Region) and Orders(ShippingRegion) as the key for a many to many relationship. The tricky bit in these questions is the keys in the tables don't have the same name."
      },
      {
        "date": "2024-05-02T08:25:00.000Z",
        "voteCount": 4,
        "content": "Passed with 917/1000\nQuestion and answers were exactly the same but different order with the options!\nAnswer given:\n- Many-to-Many\n- Customer details worksheet"
      },
      {
        "date": "2024-04-18T05:24:00.000Z",
        "voteCount": 2,
        "content": "One to many\norder table\nOrders are made of order header one record per order. A given order can only have one sales employee.  Otherwise, they will have duplicates.  Realistically, we do have a One to many relationship between sales employee and orders table.  The order table already has the customer.  We don't need to associate customers to sales employee.   By adding sales employee relationship to the order table, the report requirement  is satisfied."
      },
      {
        "date": "2023-12-30T12:40:00.000Z",
        "voteCount": 2,
        "content": "De uno a varios. Recordemos que es un filtro de seguridad. El empleado solo podra ver los datos de su región y de los clientes de su región, con sus pedidos y detalles de pedidos."
      },
      {
        "date": "2023-12-14T13:48:00.000Z",
        "voteCount": 1,
        "content": "The should be answer would be to make and intermediate table"
      },
      {
        "date": "2023-10-05T05:23:00.000Z",
        "voteCount": 2,
        "content": "Many to Many with Order Table.\nThe answer is correct. The relationship make by region column."
      },
      {
        "date": "2023-09-17T00:54:00.000Z",
        "voteCount": 1,
        "content": "I don't agree with customer details. \nIf you are a customer from eg France and you order a product from the US, the customer detail page will make this sale visble for the sales department in France, breaking this rule:\n\nUsers in the sales department must be able to access only the data of the sales region to which they are assigned in the Sales Employees table."
      },
      {
        "date": "2023-08-03T15:53:00.000Z",
        "voteCount": 3,
        "content": "Many to Many\nCustomer Details\n\nFor those who may have confused using one to many, think of it like this.\nThere are many sales people in a region\nthe same  customer can buy from many sales people\nbut since there are multiple customers and they can do the same thing its many to many"
      },
      {
        "date": "2023-06-09T23:44:00.000Z",
        "voteCount": 1,
        "content": "I'm getting confused by this question. Can anyone explain to me how to make a relationship between customer details and Sales Employees? I don't see any common data type to make a relationship."
      },
      {
        "date": "2023-07-02T00:32:00.000Z",
        "voteCount": 1,
        "content": "SalesEmployee[Region] - CustomerDetails[Region]. You have multiple sales employees in that same region handling all customers there."
      },
      {
        "date": "2023-01-22T02:54:00.000Z",
        "voteCount": 2,
        "content": "Many to many relationship between Sales employee and Orders table. And some more general question on the test case: How a sales employee is related to a particular order? Who has created that order? I assume all the orders should be created by a sales agent, right?!"
      },
      {
        "date": "2022-12-07T09:17:00.000Z",
        "voteCount": 1,
        "content": "One to Many\nCustomer Details\nIt doesn't make sense to me that an order could be placed by more than one sales person. So One-to-Many and not Many-to-Many."
      },
      {
        "date": "2022-12-11T10:53:00.000Z",
        "voteCount": 4,
        "content": "Correction:\nMany to Many\nCustomer Details\nI go with reasoning of Fer079\nA very confusing question."
      },
      {
        "date": "2023-01-21T15:41:00.000Z",
        "voteCount": 3,
        "content": "Many to Many. You are going to make a relationship using Region, where you will have multples Sales Employees assign to the same region"
      },
      {
        "date": "2022-09-25T07:37:00.000Z",
        "voteCount": 4,
        "content": "I think many-to-many is right\nRegion in employee table is nullable.\nSo you can have a one-to-many relationship if one value of region is null"
      }
    ],
    "examNameCode": "pl-300",
    "topicNumber": "9"
  }
]