[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/73340-exam-ms-740-topic-7-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to troubleshoot the Microsoft Teams performance. To answer select the appropriate options in the answer area.<br>:<br><br>NOTE -<br>Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04071/0001000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04071/0001000002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-02-02T05:39:00.000Z",
        "voteCount": 1,
        "content": "If 80/443 were closed then nothing else would work either. I don't see anywhere stating that ports 1024 to 2048 are used for Teams. 1024 to 2048 are used for AD though, but that shouldn't impact Teams. They only other answer is \"Route audio and video traffic for Microsoft Teams using UDP ports\""
      },
      {
        "date": "2022-12-30T04:32:00.000Z",
        "voteCount": 2,
        "content": "When the 80/443 ports are closed, then it shouldn't work at all. The main issue here is that everything works slow and calls drop from time to time. The only possible answer for this question is : \"Route audio  and video traffic  for Microsoft Teams using UDP ports\"\n\nI agree with second one, split tunneling should do the job"
      },
      {
        "date": "2022-04-06T18:42:00.000Z",
        "voteCount": 1,
        "content": "Open ports and Firewall~"
      },
      {
        "date": "2022-04-25T19:39:00.000Z",
        "voteCount": 1,
        "content": "VPN split tunneling correct~"
      },
      {
        "date": "2022-04-06T18:32:00.000Z",
        "voteCount": 1,
        "content": "I got it:\nhttps://docs.microsoft.com/en-us/microsoftteams/connectivity-issues"
      },
      {
        "date": "2022-04-05T04:43:00.000Z",
        "voteCount": 1,
        "content": "I don't agree with the first one. TCP80/443 are required but I'd expect symptoms to be different from what's described: chat shouldn't work at all instead of slowly if those ports are blocked.\nPoor audio\\video on the other hand is typical for blocked UDP ports. Hence \"Route audio and video traffic through UDP\" seems to be the correct answer.\n\nAgree with split tunnel, even though not required to exempt it from a VPN tunnel, it's bad practice to route Teams through a VPN"
      }
    ],
    "examNameCode": "ms-740",
    "topicNumber": "7"
  }
]