[
  {
    "topic": 22,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/67961-exam-mb-300-topic-22-question-3-discussion/",
    "body": "You need to design the security roles to assign user teams.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse a single security role but use two different duties with two different privileges for the table that contains the commission restrictions.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse segregation of duties for the security roles assigned to the two sales teams.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse two separate versions of the sales order form for the two different teams.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse two different security policies for the internal sales team and the Adventure Works Cycles administrative sales team security roles.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse two different security roles for the internal sales team and the Adventure Works Cycles administrative sales team.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/dynamics365/fin-ops-core/dev-itpro/sysadmin/extensible-data-security-policies",
    "votes": [
      {
        "answer": "E",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-06-23T05:09:00.000Z",
        "voteCount": 1,
        "content": "Using two different security roles for the internal sales team and the Adventure Works Cycles administrative sales team (option E) would not address the need to segregate the duties between the two sales teams."
      },
      {
        "date": "2023-06-23T05:09:00.000Z",
        "voteCount": 2,
        "content": "Based on the given requirements and scenario, the most appropriate solution for designing the security roles to assign user teams is:\n\nB. Use segregation of duties for the security roles assigned to the two sales teams.\n\nExplanation:\nIn the scenario, there are three distinct sales teams: an internal sales team (B2B), a street sales team (B2C), and an Adventure Works Cycles administrative sales team. It is mentioned that the internal sales team and the administrative sales team have the same responsibilities and activities. However, the street sales team has a different role as they sell directly to high-profile or social media influencer consumers and provide discounts or marketing arrangements.\n\nSegregation of duties is a security principle that involves assigning different duties and responsibilities to different roles or teams to prevent conflicts of interest and unauthorized actions. In this case, it is important to separate the security roles assigned to the two sales teams (internal sales team and street sales team) to ensure proper segregation of duties."
      },
      {
        "date": "2022-12-26T10:17:00.000Z",
        "voteCount": 1,
        "content": "The correct choice would be E: Use two different security roles for Adventure Works Cycles inside sales team and back office sales team. This will allow you to assign each sales team the appropriate permissions and privileges for their responsibilities and activities, and ensure proper separation of duties to avoid conflicts of interest. This way, you can implement commission restrictions more effectively and meet security and compliance requirements."
      },
      {
        "date": "2022-01-06T13:05:00.000Z",
        "voteCount": 2,
        "content": "@Nouman047\nWhy should this be E ?"
      },
      {
        "date": "2021-12-14T10:03:00.000Z",
        "voteCount": 3,
        "content": "should be E"
      },
      {
        "date": "2022-01-11T05:44:00.000Z",
        "voteCount": 3,
        "content": "@Nouman047\nWhy should this be E ?"
      }
    ],
    "examNameCode": "mb-300",
    "topicNumber": "22"
  }
]