[
  {
    "topic": 10,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/55433-exam-pl-400-topic-10-question-1-discussion/",
    "body": "You need to modify the Power Automate flow to resolve CustomerC's issue.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a configure run that is set to is successful.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a data operation that specifies the false conditions.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a condition containing approval hierarchy.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a timeout setting to the approval flow."
    ],
    "answer": "D",
    "answerDescription": "Scenario: CustomerC requested additional information from the parts department through the customer survey and has not received a response one week later.<br>Timeout in Power Automate Approval<br>Timeout in Power Automate Approval is setting which is allowing control what will happen when Approver will not act on time.<br>Default value is empty and it equals time of how long Flow can run so 30 days.<br>Reference:<br>https://docs.microsoft.com/en-us/power-automate/sequential-modern-approvals",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-29T08:24:00.000Z",
        "voteCount": 1,
        "content": "I think C. Part Manager is on sabbatical and Customer has requested information about Part. Approval should go to inline manager in approval heirarchy."
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/105397-exam-pl-400-topic-10-question-2-discussion/",
    "body": "DRAG DROP -<br>You need to recommend solutions to meet the e-commerce automation requirements.<br>Which platform tools should you recommend? To answer, drag the appropriate tools to the correct requirements. Each tool may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04332/0021100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04332/0021200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Logic Apps -<br>Scenario: Ecommerce sales orders must be integrated into Dynamics 365 Finance and then exported to Azure every night.<br>For integration with Dynamics 365 Logic Apps can be used. It also supports scheduled actions.<br>For integration with Azure use Logic Apps, instead of Power Automate.<br>Incorrect Answers:<br>Workflow does not support run on schedule.<br>Power Automate does not support Azure integration. (For integration with Dynamics 365 Power Automate can be used. It also supports scheduled actions.)<br><br>Box 2: Power Automate -<br>Scenario: Submitted customer surveys must generate an email to the correct department. Approval and follow-up must occur within a week.<br>Power Automate has approval flows.<br>Incorrect Answers:<br>Workflow does not support Approval workflows.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/community/power-automate-vs-logic-apps https://docs.microsoft.com/en-us/power-automate/replace-workflows-with-flows",
    "votes": [],
    "comments": [
      {
        "date": "2023-08-29T09:12:00.000Z",
        "voteCount": 2,
        "content": "i see no reason why power automate couldn't achieve both"
      },
      {
        "date": "2023-09-07T05:47:00.000Z",
        "voteCount": 3,
        "content": "Given Anwsers are ok.\nI think the first one should be Logic Apps  --&gt; https://dynamics.folio3.com/blog/logic-apps-vs-power-automate/#:~:text=The%20main%20difference%20between%20Power,and%20scope%20of%20automation%20possible.\n\"Logic Apps is designed for automating complex processes that involve multiple systems and require human interaction at various points. For example, a process might start when an order is received in an e-commerce system, then trigger an approval request in a CRM system, followed by a series of actions in an accounting system to generate invoices and payments\""
      },
      {
        "date": "2023-04-06T05:27:00.000Z",
        "voteCount": 1,
        "content": "ower Automate provides a variety of connectors that enable users to create workflows that interact with Azure services. For example, users can use the \"Azure Blob Storage,\" \"Azure Table Storage,\" or \"Azure Queue Storage\" connectors to interact with Azure Storage, or use the \"Azure Functions\" connector to trigger and execute functions hosted on Azure.\n\nIn addition, users can use the \"HTTP\" connector to interact with any Azure service that exposes a REST API, or use the \"Azure Service Bus\" or \"Azure Event Grid\" connectors to integrate with messaging and event-based services on Azure.\n\nOverall, Power Automate provides a range of options for integrating with Azure services, and can be a powerful tool for automating business processes and workflows that involve Azure."
      },
      {
        "date": "2023-04-26T00:17:00.000Z",
        "voteCount": 26,
        "content": "Your answer is from chatGPT and not helpful to the discussion."
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "10"
  }
]