[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4664-exam-az-301-topic-7-question-1-discussion/",
    "body": "You need to recommend a solution for the collection of security logs for the middle tier of the payment processing system.<br>What should you include in the recommendation?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe Azure Log Analytics agent",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Event Hubs",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Notification Hubs",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe Azure Diagnostics agent"
    ],
    "answer": "D",
    "answerDescription": "References:<br>https://docs.microsoft.com/en-us/azure/azure-monitor/platform/diagnostics-extension-overview",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-14T09:10:00.000Z",
        "voteCount": 32,
        "content": "I believe the answer is \"D\" because an Azure Diagnostics agent (WAD) can send Event Logs to a storage account where it can be stored indefinitely or, this scenario's requirements, up to 7 years. The reason why \"A\" (Log Analytics Agent) is wrong is because it can store its Event Log data only to a Log Analytics workspace which has a max retention of 730 days (~2 years) which does not meet the 7 year retention requirement given in this scenario."
      },
      {
        "date": "2020-01-08T05:38:00.000Z",
        "voteCount": 25,
        "content": "The correct answer is \"D. the Azure Diagnostics agent\". Please watch this: https://azure.microsoft.com/en-us/resources/videos/security-logging-and-audit-log-collection/"
      },
      {
        "date": "2020-04-28T02:05:00.000Z",
        "voteCount": 4,
        "content": "This video makes it clear ..\nAnswer is D."
      },
      {
        "date": "2021-03-22T13:09:00.000Z",
        "voteCount": 1,
        "content": "Both A and D collect logs and but given the requirement to retain the Data for 7 years, D is more likely to have an advantage over A,\nWAD- can be sent to Azure storage and can be retained longer period of time whereas Log analytics  sent data to log analytics workspace which can retain data max for 730 days"
      },
      {
        "date": "2021-03-09T08:22:00.000Z",
        "voteCount": 1,
        "content": "D. the Azure Diagnostics agent"
      },
      {
        "date": "2021-02-15T02:48:00.000Z",
        "voteCount": 1,
        "content": "given answer is correct as requirement is Collect Windows security logs from all the middle-tier servers and retain the logs for a period of seven years.\nthe Azure Log Analytics agent can only be correct answer if period is less than 730 days but here period is 7 years so only Diagnostics extension (WAD) option not sure why people is preferring Azure Log Analytics agent even if it is not fulfiling the requiremnt..\nDiagnostics extension (WAD) Data collected on azure resource only Event Logs ,ETW events, Performance, File based logs ,IIS logs,.NET app logs, Crash dumps, Agent diagnostics logs.\nDiagnostics extension (WAD) Data sent to Azure Storage,Azure Monitor Metrics,Event Hub\nLog Analytics agent Data collected on azure resource,Other cloud,On-premises are Event Logs,Performance,File based logs ,IIS logs,Insights and solutions,Other services\nLog Analytics agent Data sent to Azure Monitor Logs"
      },
      {
        "date": "2021-02-15T02:48:00.000Z",
        "voteCount": 1,
        "content": "Diagnostics extension (WAD) Comparison to Log Analytics agent\nThe Log Analytics agent in Azure Monitor can also be used to collect monitoring data from the guest operating system of virtual machines. You may choose to use either or both depending on your requirements. See Overview of the Azure Monitor agents for a detailed comparison of the Azure Monitor agents.\n\nThe key differences to consider are:\n\nAzure Diagnostics Extension can be used only with Azure virtual machines. The Log Analytics agent can be used with virtual machines in Azure, other clouds, and on-premises.\nAzure Diagnostics extension sends data to Azure Storage, Azure Monitor Metrics (Windows only) and Event Hubs. The Log Analytics agent collects data to Azure Monitor Logs.\nThe Log Analytics agent is required for solutions, Azure Monitor for VMs, and other services such as Azure Security Center."
      },
      {
        "date": "2021-01-02T04:35:00.000Z",
        "voteCount": 2,
        "content": "As per the link - https://docs.microsoft.com/en-us/azure/azure-monitor/platform/diagnostics-extension-overview#comparison-to-log-analytics-agent\nComparison Diagnostic Agent to Log Analytics Agent \nThe key differences to consider are:\nThe Log Analytics agent is required for solutions, Azure Monitor for VMs, and other services such as Azure Security Center.\nI'm more incline to select (A) Log Analytics Agent as the answer"
      },
      {
        "date": "2020-11-16T17:46:00.000Z",
        "voteCount": 1,
        "content": "7 years is the requirement for data backup retention. it is not applicable for logs. I would select diagnostics agent because it can forward data to Event Hub which is required to meet the requirement to send notification for invalid login attempts."
      },
      {
        "date": "2020-09-16T12:42:00.000Z",
        "voteCount": 1,
        "content": "D is the answer as you can configure it to send the dat to the storage account which you can then keep for however long you want. Whereas Log Analytics you can only keep it for 730 days"
      },
      {
        "date": "2020-08-30T13:55:00.000Z",
        "voteCount": 3,
        "content": "Answer seems correct. In some sample questions on other site I saw it is mentioned specifically 2 year and then Log analytical work space is correct answer as it can keep for 730 days."
      },
      {
        "date": "2020-08-14T06:20:00.000Z",
        "voteCount": 3,
        "content": "The answer phrasing is incorrect; there is no such thing as 'the Azure Diagnostics agent'. There is either a Diagnostic Extension or a Log Analytics agent."
      },
      {
        "date": "2020-08-11T11:35:00.000Z",
        "voteCount": 1,
        "content": "The Azure Diagnostics agent should be used when you want to archive logs and metrics to Azure storage."
      },
      {
        "date": "2020-07-28T11:47:00.000Z",
        "voteCount": 1,
        "content": "The answer is A:\n\nHere the security logs can be sent to a Log Analytics workspace. Hence the Azure Log Analytics agent needs to be installed on the virtual machines hosting the middle tier component."
      },
      {
        "date": "2020-07-01T03:41:00.000Z",
        "voteCount": 2,
        "content": "Host the middle tier of the payment processing system on a virtual machine.   So this is a Virtual Machine... Azure Diagnostics agent is the correct one."
      },
      {
        "date": "2020-06-27T11:18:00.000Z",
        "voteCount": 1,
        "content": "Answer A. Azure Log Analytics agent"
      },
      {
        "date": "2020-06-27T11:02:00.000Z",
        "voteCount": 3,
        "content": "Max retention in log analytics workspace is 730 days...requirement is 7 years of retention so Diagnostics agent"
      },
      {
        "date": "2020-06-01T02:40:00.000Z",
        "voteCount": 1,
        "content": "Correct answer i A.\nhttps://docs.microsoft.com/pl-pl/azure/azure-monitor/platform/log-analytics-agent\n\nAzure Diagnostic agent can be used only on virtual machines."
      },
      {
        "date": "2020-07-11T11:44:00.000Z",
        "voteCount": 1,
        "content": "Middle tier is hosted in a virtual machine."
      },
      {
        "date": "2020-05-31T03:20:00.000Z",
        "voteCount": 1,
        "content": "A\nAzure Diagnostics Extension can be used only with Azure virtual machines. The Log Analytics agent can be used with virtual machines in Azure, other clouds, and on-premises."
      }
    ],
    "examNameCode": "az-301",
    "topicNumber": "7"
  }
]