[
  {
    "topic": 10,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/77527-exam-mb-800-topic-10-question-1-discussion/",
    "body": "You need to set up units of measure for an item to meet the requirements.<br>What are two possible ways to achieve the goal? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet a Unit of Measure for case to a Qty. of 10.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet a Qty. per Unit of Measure to 1 in the Item Units of Measure table.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet a Unit of Measure for case to a Qty. of 1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd a Code and Description to the Units of Measure table.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "AD",
    "answerDescription": "",
    "votes": [
      {
        "answer": "AD",
        "count": 5,
        "isMostVoted": true
      },
      {
        "answer": "BD",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2024-01-23T21:28:00.000Z",
        "voteCount": 1,
        "content": "la respuesta es b, debido a The company wants to expand their capabilities for managing returns by setting up all inventory in a quantity of Each. y D, como ya han mencionado"
      },
      {
        "date": "2023-07-20T07:18:00.000Z",
        "voteCount": 1,
        "content": "reasoning for A. \nthe company sells crates. the crates are filled with items.  In order to get a handle on returns (noone said all of the crates came back closed) giving a crate as the base an Unit od Measure of 10 allows the warehosue to track if the returns were complete cates (10) or only partialy filled (1-9). \nProblem here there are similar questions in the Topics before this one. and when you sold 1 unit that also consits of 1 unit the correct answer was B but if you sold a box of something and wanted to be more preciese on the items the answer was A 1 crate 10 units. \n\nIt feels a bit that here only D is set. A or B both are possible and logicaly correct (depending only on the point of view). MS didnt do a good job on this question"
      },
      {
        "date": "2023-05-28T16:58:00.000Z",
        "voteCount": 2,
        "content": "The company's requirements indicate that they warehouse all products as Case quantities but want to expand their capabilities for managing returns by setting up all inventory in a quantity of Each. This suggests that they want to track inventory on an individual item basis, even though they warehouse and ship in case quantities. Given this, the two possible ways to set up units of measure for an item to meet the requirements would be:\n\nB. Set a Qty. per Unit of Measure to 1 in the Item Units of Measure table.\nThis option will allow the company to track each individual item within a case, which is useful for managing returns and keeping accurate inventory counts.\n\nD. Add a Code and Description to the Units of Measure table.\nAdding a code and description to the Units of Measure table will allow the company to easily identify and use the new unit of measure. The code could be something like \"EACH\" and the description could provide more detail about the unit of measure, like \"Individual item within a case\"."
      },
      {
        "date": "2023-06-01T08:31:00.000Z",
        "voteCount": 1,
        "content": "So is it BD or AD?"
      },
      {
        "date": "2023-06-03T08:58:00.000Z",
        "voteCount": 1,
        "content": "Honestly, I'm not very sure, but if I get it on the exam, I vote for the latter. BD."
      },
      {
        "date": "2023-05-07T12:23:00.000Z",
        "voteCount": 4,
        "content": "o meet the requirements, two possible ways to set up units of measure for an item are:\n\nA. Set a Unit of Measure for case to a Qty. of 10.\nBy setting a Unit of Measure for 'Case' with a quantity of 10, you establish a conversion factor between the base unit of measure (e.g., 'Each') and the 'Case' unit of measure. This allows the company to manage inventory in both 'Each' and 'Case' quantities and ensure accurate costs for product returns.\n\nD. Add a Code and Description to the Units of Measure table.\nBy adding a code (e.g., 'EA' for 'Each' and 'CS' for 'Case') and description (e.g., 'Each' and 'Case') to the Units of Measure table, you can define multiple units of measure for the item. This enables the company to handle inventory in both 'Each' and 'Case' quantities, making it easier to manage returns and accurately track costs."
      },
      {
        "date": "2023-02-15T23:56:00.000Z",
        "voteCount": 1,
        "content": "Why not C ?"
      },
      {
        "date": "2022-12-14T18:00:00.000Z",
        "voteCount": 2,
        "content": "The scenario says the company warehouses all product in cases, which makes it difficult to track. They want to have a quantity of EACH. Then in the question it says \"you need to set of unit of measure for AN (1) item\"\n\nSo should be B &amp; D"
      },
      {
        "date": "2022-10-12T05:19:00.000Z",
        "voteCount": 1,
        "content": "I guess B is correct.\nA doesn't make any sense."
      },
      {
        "date": "2022-07-15T01:37:00.000Z",
        "voteCount": 4,
        "content": "i don't get it; why \"A\"? Why qty of 10? and why not the \"item units of measure\" table?"
      }
    ],
    "examNameCode": "mb-800",
    "topicNumber": "10"
  }
]