[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/62788-exam-az-304-topic-6-question-1-discussion/",
    "body": "HOTSPOT -<br>You plan to migrate App1 to Azure.<br>You need to estimate the compute costs for App1 in Azure. The solution must meet the security and compliance requirements.<br>What should you use to estimate the costs, and what should you implement to minimize the costs? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04027/0000500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04027/0000600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: The Azure Total Cost of Ownership (TCO) Calculator<br>The Total Cost of Ownership (TCO) Calculator estimates the cost savings you can realize by migrating your workloads to Azure.<br>Note: The TCO Calculator recommends a set of equivalent services in Azure that will support your applications. Our analysis will show each cost area with an estimate of your on-premises spend versus your spend in Azure. There are several cost categories that either decrease or go away completely when you move workloads to the cloud.<br><br>Box 2: Azure Hybrid Benefit -<br>Azure Hybrid Benefit is a licensing benefit that helps you to significantly reduce the costs of running your workloads in the cloud. It works by letting you use your on-premises Software Assurance-enabled Windows Server and SQL Server licenses on Azure. And now, this benefit applies to RedHat and SUSE Linux subscriptions, too.<br>Scenario:<br>Litware identifies the following security and compliance requirements:<br>Once App1 is migrated to Azure, you must ensure that new data can be written to the app, and the modification of new and existing data is prevented for a<br><img src=\"/assets/media/exam-media/04027/0000600002.png\" class=\"in-exam-image\"> period of three years.<br>✑ On-premises users and services must be able to access the Azure Storage account that will host the data in App1.<br>✑ Access to the public endpoint of the Azure Storage account that will host the App1 data must be prevented.<br>✑ All Azure SQL databases in the production environment must have Transparent Data Encryption (TDE) enabled.<br>✑ App1 must not share physical hardware with other workloads.<br>Reference:<br>https://azure.microsoft.com/en-us/pricing/tco/<br>https://azure.microsoft.com/en-us/pricing/hybrid-benefit/",
    "votes": [],
    "comments": [
      {
        "date": "2021-09-27T15:52:00.000Z",
        "voteCount": 25,
        "content": "1st box: Azure Total Cost of Ownership calculator. TCO can estimate the cost savings you can realize by migrating your workloads to Azure\n\n2nd box: Azure Reservations:\n[Once App1 is migrated to Azure, you must ensure that new data can be written to the app, and the modification of new and existing data is prevented for a period of three years.]\n[App1 must not share physical hardware with other workloads.]\n\nAzure reserved instances can purchased for one year or three years. Therefore Litware can purchase 3 years Reserved instances to save cost. And reserved instances guarantees dedicated compute resources to App1.\n\nWhy not Hybrid Benefit?\nthis is for customers with Software Assurance. We are not sure if Litware has Software Assurance."
      },
      {
        "date": "2021-10-09T07:35:00.000Z",
        "voteCount": 1,
        "content": "They have an enterprise agreement - if I'm understanding correctly this means they do have software assurance as part of that?\n\nhttps://www.microsoft.com/en-us/licensing/licensing-programs/enterprise?activetab=enterprise-tab%3aprimaryr2\n\n\"Get 24x7 technical support, planning services, end-user and technical training, as well as unique technologies with Software Assurance.\""
      },
      {
        "date": "2021-10-18T16:11:00.000Z",
        "voteCount": 2,
        "content": "enterprise agreement doesn't include software assurance. you still need to purchase it in addition to enterprise agreement"
      },
      {
        "date": "2021-11-15T13:06:00.000Z",
        "voteCount": 5,
        "content": "You are wrong: Microsoft Enterprise Agreement and Microsoft Enterprise Subscription Agreement - Software Assurance is included.\nhttps://download.microsoft.com/download/1/F/5/1F5357DD-F7C8-4CC8-8C5F-7F6B1569ECF0/Transactional_Licensing_Comparison_Chart.pdf"
      },
      {
        "date": "2021-12-22T00:43:00.000Z",
        "voteCount": 1,
        "content": "Enterprise Agreement includes Software Assurance\nhttps://www.microsoft.com/en-us/licensing/licensing-programs/software-assurance-getting-started\n\nLitware has 10 Azure subscriptions that are linked to the Litware.com tenant and five Azure subscriptions that are linked to the dev.Litware.com tenant. All the subscriptions are in an Enterprise Agreement (EA).\n\nAnswer: Azure Hybrid Benefit"
      },
      {
        "date": "2021-12-05T04:06:00.000Z",
        "voteCount": 14,
        "content": "I think you are correct but for another reason: VMs in Dedicated Hosts will host Ubuntu 18.04 machine (as-is on-premises VM) which is an open source operating system. So you have no cost saving with Azure Hybrid Benefit. Correct answer is Azure Reservations"
      },
      {
        "date": "2022-01-19T12:27:00.000Z",
        "voteCount": 1,
        "content": "Where the hell are you getting ubuntu? I even copied this to a word doc and searched."
      },
      {
        "date": "2022-01-27T01:57:00.000Z",
        "voteCount": 8,
        "content": "https://www.examtopics.com/assets/media/exam-media/04027/0002800001.png\nMissing img on this case, few q later there are images included and there is Ubuntu"
      },
      {
        "date": "2022-03-13T03:23:00.000Z",
        "voteCount": 1,
        "content": "Thanks for adding here"
      },
      {
        "date": "2022-01-14T01:27:00.000Z",
        "voteCount": 2,
        "content": "I agree. Also, reading the documentation, the hybrid benefit licence available for a dedicated host is for the cores used to run VMs on that host. So you're licencing the OS of the VMs on the host, not the host OS. Since our VMs are Ubuntu they don't need a MS licence so HB is not relevant here.\nA surprisingly complex question!"
      },
      {
        "date": "2021-10-28T08:57:00.000Z",
        "voteCount": 6,
        "content": "Passed exam today. There is not a word about a \"corporate agreement\" in this case study.\nSo i choose Azure Resevation in 2nd box."
      },
      {
        "date": "2022-10-13T14:30:00.000Z",
        "voteCount": 2,
        "content": "Azure Hybrid benefit: save up to 40% on VM\nAzure RI: save up to 72%\nAzure RI+Hybrid: save up to 82%\nSo if I have to choose one, I will chose RI\nhttps://azure.microsoft.com/en-us/pricihttps://www.examtopics.com/exams/microsoft/az-304/view/43/#ng/hybrid-benefit/faq/\nhttps://azure.microsoft.com/en-us/pricing/reserved-vm-instances/"
      },
      {
        "date": "2022-10-13T14:31:00.000Z",
        "voteCount": 1,
        "content": "correction: Azure RI+Hybrid: save up to 80%(not 82%)"
      },
      {
        "date": "2022-03-12T09:34:00.000Z",
        "voteCount": 1,
        "content": "1. TCO is correct unarguable. \n2. Azure Reservations is a best suitable for App1. if it's SQL then Hybrid is best suitable."
      },
      {
        "date": "2022-03-11T07:49:00.000Z",
        "voteCount": 1,
        "content": "Key point in question is 'solution should meet security requirements that is to keep data for 3 years'... so answer to 2nd box is 'Azure Reservations'"
      },
      {
        "date": "2022-02-03T21:28:00.000Z",
        "voteCount": 1,
        "content": "This link 'https://www.microsoft.com/en-us/licensing/licensing-programs/enterprise?activetab=enterprise-tab:primaryr2' states:\nWith Enterprise Agreement:\n-Automatically access the latest software and technologies with Software Assurance.\n-Simplify purchasing with predictable payments through a single agreement for cloud services and software.\n\nBut the question asks:\n'The solution must meet the security and compliance requirements.' \nUnder these requirements is 'App1 must not share physical hardware with other workloads.'\nHence Azure Reservations is required.\n\nFrom my point of view the entire solution uses/needs both Azure Hybrid Benefit and Azure Reservations, but to answer this question Azure Reservations will do."
      },
      {
        "date": "2022-01-22T10:14:00.000Z",
        "voteCount": 1,
        "content": "They have an enterprise agreement which includes SA. They have data requirements stating that data written to app1 can't be deleted for three years. With Azure reservations you can also incorporate VM reservations. So the second answer is Azure reservations."
      },
      {
        "date": "2022-01-22T10:15:00.000Z",
        "voteCount": 2,
        "content": "*With Azure reservations you can also incorporate *Hybrid Benefit."
      },
      {
        "date": "2021-12-13T17:10:00.000Z",
        "voteCount": 2,
        "content": "To qualify for the benefit, this license must be used either on-premises or in Azure—you'll get 180 days of concurrent use rights while migrating servers. &gt;&gt; you cannot use Hybrid Benefit because it only last for 180days. In this case, it needs 3 years. I would go for reservations."
      },
      {
        "date": "2021-11-15T13:03:00.000Z",
        "voteCount": 2,
        "content": "1. TCO\n2. Hybrid Benefits -&gt; Who is eligible for this offer?\nThe Azure Hybrid Use Benefit is available if you own Windows Server Standard or Datacenter edition licenses with active Software Assurance. It is not restricted to any specific licensing program.... Enterprise Agreement customers can deploy Windows Server virtual machines pre-configured with the Azure Hybrid Use Benefit in three easy steps..."
      },
      {
        "date": "2021-11-03T02:58:00.000Z",
        "voteCount": 2,
        "content": "Azure Hybrid Benefit is a licensing benefit that helps you to significantly reduce the costs of running your Red Hat Enterprise Linux (RHEL) and SUSE Linux Enterprise Server (SLES) virtual machines (VMs) , and the VM's are Ubuntu based so seems Hybrid Benifit not an option here ."
      },
      {
        "date": "2021-10-31T02:57:00.000Z",
        "voteCount": 3,
        "content": "1. TCO\n2. Reservations \n---\n\"Only the compute costs are included with the Dedicated host\"\nhttps://docs.microsoft.com/en-us/azure/cost-management-billing/reservations/save-compute-costs-reservations"
      },
      {
        "date": "2021-10-08T10:29:00.000Z",
        "voteCount": 2,
        "content": "Its Azure Hybrid benefits for 2nd option. Azure Hybrid Benefit is a cost-savings benefit that lets you bring your existing on-premises Windows Server and SQL Server licenses with active Software Assurance or subscriptions to Azure. Save up to 85 percent* compared to standard pay-as-you-go rates and achieve the lowest cost of ownership when you combine Azure Hybrid Benefit, reservations savings, and extended security updates. Azure Hybrid Benefit also applies to SQL on Azure and Azure Dedicated Host. Additionally, it provides 180 days of dual-use rights so you can maintain your on-premises operation while migrating to Azure. And now, this benefit applies to RedHat and SUSE Linux subscriptions, too."
      },
      {
        "date": "2021-10-08T00:47:00.000Z",
        "voteCount": 3,
        "content": "Migrate to Azure so estimate costs using TCO is correct\n\n\"Deploy the Azure virtual machines that will host App1 to Azure dedicated hosts\"\n\nhttps://docs.microsoft.com/en-us/azure/cost-management-billing/reservations/save-compute-costs-reservations\n\nAzure Dedicated Host - Only the compute costs are included with the Dedicated host\n\nImplement Azure reservations"
      },
      {
        "date": "2021-10-02T10:23:00.000Z",
        "voteCount": 2,
        "content": "1st : Azure TCO is the only option that makes sense. i would use Azure Migrate to calculate the cost\n\n2nd : Azure Reservations is the only option since VM would be on dedicated host and you cannot use the Hybrid benefit"
      },
      {
        "date": "2021-10-20T12:08:00.000Z",
        "voteCount": 2,
        "content": "Based on this docs: https://docs.microsoft.com/en-us/azure/virtual-machines/dedicated-hosts you are not right. You can use Hybrid Benefit with Dedicated Host"
      },
      {
        "date": "2021-09-29T10:07:00.000Z",
        "voteCount": 1,
        "content": "it is a great point to bring up Software Assurance. \nIt seems it is not available. therefore, Azure Reservation is a better answer.\nIf we go \"Azure Reservation\", the answer for the first question will be \"Power BI app\"\nhttps://docs.microsoft.com/en-us/azure/cost-management-billing/reservations/save-compute-costs-reservations#determine-what-to-purchase"
      },
      {
        "date": "2021-09-27T06:43:00.000Z",
        "voteCount": 2,
        "content": "The given answer is correct and the links are valid."
      }
    ],
    "examNameCode": "az-304",
    "topicNumber": "6"
  }
]