[
  {
    "topic": 8,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80847-exam-sc-100-topic-7-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to recommend a solution to meet the AWS requirements.<br>What should you include in the recommendation? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04228/0004800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04228/0004900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Microsoft Defender for servers<br>Scenario: Notify security administrators at Fabrikam if any AWS EC2 instances are noncompliant with secure score recommendations.<br>Defender for Servers is one of the enhanced security features available in Microsoft Defender for Cloud. You can use it to add threat detection and advanced defenses to your Windows and Linux machines that exist in hybrid and multicloud environments.<br>Available Defender for Server plans<br>Defender for Servers offers you a choice between two paid plans.<br>Both include automatic onboarding for resources in Azure, AWS, GCP.<br><img src=\"/assets/media/exam-media/04228/0005000001.png\" class=\"in-exam-image\"><br>Plan 1 includes the following benefits:<br>Automatic onboarding for resources in Azure, AWS, GCP<br>Microsoft threat and vulnerability management<br>Flexibility to use Microsoft Defender for Cloud or Microsoft 365 Defender portal<br>A Microsoft Defender for Endpoint subscription that includes access to alerts, software inventory, Vulnerability Assessment and an automatic integration with<br>Microsoft Defender for Cloud.<br>Plan 2 includes everything in Plan 1 plus some additional benefits.<br><br>Box 2: Microsoft Sentinel -<br><br>Scenario: AWS Requirements -<br>Fabrikam identifies the following security requirements for the data hosted in ContosoAWS1:<br>Ensure that the security administrators can query AWS service logs directly from the Azure environment.<br>Use the Amazon Web Services (AWS) connectors to pull AWS service logs into Microsoft Sentinel.<br>Note: These connectors work by granting Microsoft Sentinel access to your AWS resource logs. Setting up the connector establishes a trust relationship between<br>Amazon Web Services and Microsoft Sentinel. This is accomplished on AWS by creating a role that gives permission to Microsoft Sentinel to access your AWS logs.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/defender-for-cloud/defender-for-servers-introduction https://docs.microsoft.com/en-us/azure/defender-for-cloud/recommendations-reference-aws https://docs.microsoft.com/en-us/azure/sentinel/connect-aws",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-21T06:35:00.000Z",
        "voteCount": 48,
        "content": "The requirement is to identify EC2 instances which are noncompliant with secure score recommendations. Secure Score = Defender for Cloud."
      },
      {
        "date": "2022-09-30T03:53:00.000Z",
        "voteCount": 8,
        "content": "I agree with d3an.\nhttps://learn.microsoft.com/en-us/azure/architecture/guide/aws/aws-azure-security-solutions"
      },
      {
        "date": "2022-10-26T06:47:00.000Z",
        "voteCount": 2,
        "content": "an to complete https://learn.microsoft.com/en-us/azure/defender-for-cloud/quickstart-onboard-aws?pivots=env-settings\n\nnative AWS connector, defender for server will be for advanced threat protection"
      },
      {
        "date": "2022-10-28T10:05:00.000Z",
        "voteCount": 19,
        "content": "Defender for Cloud\nMicrosoft Sentinel\nhttps://learn.microsoft.com/en-us/azure/sentinel/connect-aws?tabs=s3"
      },
      {
        "date": "2024-01-14T14:25:00.000Z",
        "voteCount": 3,
        "content": "This line \"Defender for Servers is one of the enhanced security features available in Microsoft Defender for Cloud.\" is making me think twice to choose the correct answer between Defender for Cloud and Defeder for servers. Any clarifications?"
      },
      {
        "date": "2024-01-02T10:53:00.000Z",
        "voteCount": 3,
        "content": "Microsoft Defender for Cloud provides \"Cloud Security Posture Management\" (CSPM), providing a security analysis of all the resources in your cloud estates"
      },
      {
        "date": "2023-09-20T23:45:00.000Z",
        "voteCount": 1,
        "content": "Box1:  Defender for Cloud\nBox2: Microsoft Sentinel\nhttps://www.youtube.com/watch?v=r-P-2lGzPFQ&amp;list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&amp;index=9\nQuestion 108"
      },
      {
        "date": "2023-08-20T02:52:00.000Z",
        "voteCount": 2,
        "content": "secure score recommendations are in Defender for Cloud. I'm going with Defender for Cloud and Sentinel."
      },
      {
        "date": "2023-08-20T02:59:00.000Z",
        "voteCount": 1,
        "content": "and the case study says:\nDefender for Cloud is configured to assess all the resources in Sub1 for compliance to the HIPAA HITRUST standard.\nCurrently, resources that are noncompliant with the HIPAA HITRUST standard are remediated manually.\n\nThis applies to AWS instances and machines in the Sub. Therefore is Defender for Cloud to give you secure score recommendations."
      },
      {
        "date": "2023-05-28T17:16:00.000Z",
        "voteCount": 2,
        "content": "In the exam 29.05.2023"
      },
      {
        "date": "2023-05-22T08:33:00.000Z",
        "voteCount": 4,
        "content": "1. Defender for Cloud\n2. Microsoft Sentinel\n\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/quickstart-onboard-aws?pivots=env-settings\nWith cloud workloads commonly spanning multiple cloud platforms, cloud security services must do the same. Microsoft Defender for Cloud protects workloads in Azure, Amazon Web Services (AWS), Google Cloud Platform (GCP), GitHub and Azure DevOps (ADO).\n\nhttps://learn.microsoft.com/en-us/azure/sentinel/connect-aws?tabs=s3\nUse the Amazon Web Services (AWS) connectors to pull AWS service logs into Microsoft Sentinel. These connectors work by granting Microsoft Sentinel access to your AWS resource logs. Setting up the connector establishes a trust relationship between Amazon Web Services and Microsoft Sentinel. This is accomplished on AWS by creating a role that gives permission to Microsoft Sentinel to access your AWS logs."
      },
      {
        "date": "2023-05-25T17:26:00.000Z",
        "voteCount": 1,
        "content": "Gotten this in May 2023 exam."
      },
      {
        "date": "2023-03-15T03:06:00.000Z",
        "voteCount": 1,
        "content": "For requirement: “ Notify security administrators at Fabrikam if any AWS EC2 instances are noncompliant with secure score recommendations”\n&gt;&gt; Even though Defender for servers is a prerequisite to get secure score and recommendations in Defender for Cloud, I lean towards where we get recommendations:\n“ Native cloud connector (recommended) - Provides an agentless connection to your AWS account that you can extend with Defender for Cloud's Defender plans to secure your AWS resources:\nCloud Security Posture Management (CSPM) assesses your AWS resources according to AWS-specific security recommendations and reflects your security posture in your secure score. ”"
      },
      {
        "date": "2023-03-17T02:38:00.000Z",
        "voteCount": 2,
        "content": "Defender for Cloud is dependent on Defender for Servers for Secure score and recommendations"
      },
      {
        "date": "2023-02-25T20:11:00.000Z",
        "voteCount": 4,
        "content": "For box1, it is Microsoft Defender for servers.\nMicrosoft Defender for servers is part of Microsoft Defender for Cloud. This answer is more specific and should be chosen over the general Microsoft Defender for Cloud. If the option is not available, we can choose Defender for Cloud as well."
      },
      {
        "date": "2023-02-12T00:05:00.000Z",
        "voteCount": 3,
        "content": "Box 1 is Microsoft Defender for Cloud\nhttps://techcommunity.microsoft.com/t5/itops-talk-blog/step-by-step-how-to-connect-aws-machines-to-microsoft-defender/ba-p/3251096"
      },
      {
        "date": "2023-01-16T04:06:00.000Z",
        "voteCount": 1,
        "content": "Defender for cloud for EC2 https://learn.microsoft.com/en-us/azure/defender-for-cloud/recommendations-reference-aws"
      },
      {
        "date": "2022-11-24T19:34:00.000Z",
        "voteCount": 3,
        "content": "You can't view a secure score in Defender for servers. You configure defender for servers so that you can receive logs for AWS.You review a secure score in defender for cloud."
      },
      {
        "date": "2023-02-25T20:20:00.000Z",
        "voteCount": 2,
        "content": "That is correct, you first need Defender for servers and then you can view scores in Defender for servers. The question does not ask where you should view scores, and it asks what you should include in the recommendation. We should include both Defender for servers and Defender for cloud in the recommendation. But since Defender for servers is part of Defender for cloud, and it is more specific, I would vote for Defender for servers."
      },
      {
        "date": "2022-11-04T04:30:00.000Z",
        "voteCount": 2,
        "content": "MDC and Sentinel"
      },
      {
        "date": "2022-10-17T19:12:00.000Z",
        "voteCount": 4,
        "content": "For AWS EC2 its Defender for cloud \nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/quickstart-onboard-aws?pivots=env-settings"
      },
      {
        "date": "2022-09-09T19:47:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct."
      },
      {
        "date": "2022-10-17T09:48:00.000Z",
        "voteCount": 2,
        "content": "No its not itsmicrosoft defender for cloud. not microsoft defender for servers"
      },
      {
        "date": "2022-10-17T09:54:00.000Z",
        "voteCount": 1,
        "content": "sorry, i take it back, youre right"
      },
      {
        "date": "2023-02-04T16:51:00.000Z",
        "voteCount": 1,
        "content": "Defender for Cloud and Sentinel."
      },
      {
        "date": "2022-09-07T02:58:00.000Z",
        "voteCount": 5,
        "content": "https://docs.microsoft.com/en-us/azure/sentinel/connect-aws?tabs=s3\nUse the Amazon Web Services (AWS) connectors to pull AWS service logs into Microsoft Sentinel. These connectors work by granting Microsoft Sentinel access to your AWS resource logs. Setting up the connector establishes a trust relationship between Amazon Web Services and Microsoft Sentinel. This is accomplished on AWS by creating a role that gives permission to Microsoft Sentinel to access your AWS logs."
      }
    ],
    "examNameCode": "sc-100",
    "topicNumber": "7"
  },
  {
    "topic": 8,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81480-exam-sc-100-topic-7-question-2-discussion/",
    "body": "You need to recommend a solution to resolve the virtual machine issue.<br>What should you include in the recommendation?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Qualys scanner in Defender for Cloud.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOnboard the virtual machines to Microsoft Defender for Endpoint.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a device compliance policy in Microsoft Endpoint Manager.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOnboard the virtual machines to Azure Arc."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 30,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 14,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-11-07T01:53:00.000Z",
        "voteCount": 20,
        "content": "In the current Exam it takes 2 choices!!\n\nI took both onboarding choices (A &amp; D)"
      },
      {
        "date": "2023-01-15T20:43:00.000Z",
        "voteCount": 6,
        "content": "Appreciate this Luke93"
      },
      {
        "date": "2023-05-28T17:17:00.000Z",
        "voteCount": 4,
        "content": "He is correct.In the exam 29.05.2023"
      },
      {
        "date": "2024-01-17T03:01:00.000Z",
        "voteCount": 3,
        "content": "Think you meant to say B &amp; D as A is not a onboarding choice."
      },
      {
        "date": "2022-11-09T03:25:00.000Z",
        "voteCount": 12,
        "content": "A is correct:\nA = Go to MDC &gt; recommendations &gt; Search for = Machines should have a vulnerability assessment solution &gt; select a vm &gt; Fix &gt; and you will be prompted to deploy the integrated vulnerabilty scanner powered by Qualys\nB = The question talks about \"The secure score in Defender for Cloud shows that all the virtual machines generate the following recommendation: Machines should have a vulnerability assessment solution.\" &gt; This has NOTHING to do with MDE\nC = The question talks about \"The secure score in Defender for Cloud shows that all the virtual machines generate the following recommendation: Machines should have a vulnerability assessment solution.\" &gt; This has NOTHING to do with MEM and device compliance. \nD = Since these 20 vms are mentioned in the Azure Enviroment - Azure Arc is not required NOT D"
      },
      {
        "date": "2024-02-11T14:08:00.000Z",
        "voteCount": 4,
        "content": "If one answer then its B; if two answers then B+C\nA is deprecated (Enable vulnerability scanning with the integrated Qualys scanner (deprecated))"
      },
      {
        "date": "2024-05-16T22:39:00.000Z",
        "voteCount": 1,
        "content": "Correct. A is out. B is required as VMs are not onboarded.\n\"20 virtual machines that are configured as application servers and are NOT onboarded to Microsoft Defender for Cloud\"\nIf two answers then also D for onboarding the AWS EC2 instances"
      },
      {
        "date": "2024-01-31T23:50:00.000Z",
        "voteCount": 3,
        "content": "vulnerability scanning with the integrated Qualys scanner is already deprecated. You should go with answer of B. Onboard to defender for endpoint since it supports vulnerability assessment."
      },
      {
        "date": "2023-09-20T23:46:00.000Z",
        "voteCount": 2,
        "content": "A. Enable the Qualys scanner in Defender for Cloud.\nB. Onboard the virtual machines to Microsoft Defender for Endpoint.\nhttps://www.youtube.com/watch?v=r-P-2lGzPFQ&amp;list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&amp;index=9"
      },
      {
        "date": "2023-09-18T12:28:00.000Z",
        "voteCount": 2,
        "content": "To resolve the virtual machine issue and ensure that they are compliant with the HIPAA HITRUST standard, you should:\n\nB. Onboard the virtual machines to Microsoft Defender for Endpoint.\n\nHere's how this recommendation aligns with the requirements:\n\nMicrosoft Defender for Cloud does not offer direct vulnerability scanning for virtual machines, but Microsoft Defender for Endpoint does. By onboarding the virtual machines to Microsoft Defender for Endpoint, you can enable vulnerability assessments and remediation for those virtual machines. This addresses the requirement for the virtual machines to be compliant in Defender for Cloud.\n\nEnabling vulnerability assessments through Microsoft Defender for Endpoint will help to address the secure score recommendation regarding the virtual machines needing a vulnerability assessment solution."
      },
      {
        "date": "2023-08-22T04:18:00.000Z",
        "voteCount": 1,
        "content": "A: . If you're using Microsoft Defender for Cloud’s standard tier for VMs, you can quickly deploy a vulnerability assessment solution powered by Qualys with no additional configuration or extra costs."
      },
      {
        "date": "2023-08-20T03:09:00.000Z",
        "voteCount": 1,
        "content": "The answer is A, you to have a Qualys vulnerability scanner not just Defender for Cloud."
      },
      {
        "date": "2023-05-22T08:39:00.000Z",
        "voteCount": 3,
        "content": "A is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-vm\nWhen a machine is found that doesn't have a vulnerability assessment solution deployed, Defender for Cloud generates the security recommendation: Machines should have a vulnerability assessment solution. Use this recommendation to deploy the vulnerability assessment solution to your Azure virtual machines and your Azure Arc-enabled hybrid machines.\n\nDefender for Cloud includes vulnerability scanning for your machines at no extra cost. You don't need a Qualys license or even a Qualys account - everything's handled seamlessly inside Defender for Cloud. This page provides details of this scanner and instructions for how to deploy it."
      },
      {
        "date": "2023-05-25T17:26:00.000Z",
        "voteCount": 2,
        "content": "Gotten this in May 2023 exam."
      },
      {
        "date": "2023-03-18T11:47:00.000Z",
        "voteCount": 2,
        "content": "Focusing on the VM issue with vuln scanning."
      },
      {
        "date": "2023-02-27T11:30:00.000Z",
        "voteCount": 2,
        "content": "I was thinking it should B but after reading the below section i have noticed that it really is A:\nThe secure score in Defender for Cloud shows that all the virtual machines generate the following recommendation: Machines should have a vulnerability assessment solution.\n\nIf all of the machines should have a vulnerability assessment solution then you should enable the Vulnerability access solution ..."
      },
      {
        "date": "2023-02-21T09:02:00.000Z",
        "voteCount": 1,
        "content": "Answer A &amp; B are correct, IMHO.\nFrom https://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-vm\nAnswer A is correct because of \"Defender for Cloud includes vulnerability scanning for your machines at no extra cost. You don't need a Qualys license or even a Qualys account - everything's handled seamlessly inside Defender for Cloud. This page provides details of this scanner and instructions for how to deploy it.\"\nAnswer B is correct because of \"If you don't want to use the vulnerability assessment powered by Qualys, you can use Microsoft Defender for Endpoint's threat and vulnerability management or deploy a BYOL solution with your own Qualys license, Rapid7 license, or another vulnerability assessment solution.\""
      },
      {
        "date": "2023-01-28T02:44:00.000Z",
        "voteCount": 1,
        "content": "Answer A is correct,  Defender for Cloud's integrated Qualys vulnerability scanner for Azure and hybrid machines, \nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/deploy-vulnerability-assessment-vm"
      },
      {
        "date": "2023-01-02T20:29:00.000Z",
        "voteCount": 1,
        "content": "I will go for B as (IMHO) Qualys is for vulnerability and hotfix management"
      },
      {
        "date": "2022-12-11T14:12:00.000Z",
        "voteCount": 4,
        "content": "Defender for EndPoint does not have server licenses and those VMs are servers. So won’t be B."
      },
      {
        "date": "2023-03-17T02:46:00.000Z",
        "voteCount": 1,
        "content": "Excellent point"
      },
      {
        "date": "2022-12-02T03:36:00.000Z",
        "voteCount": 1,
        "content": "As per answer, issue is they are NOT onboarded to Defender for Cloud"
      },
      {
        "date": "2022-10-03T11:26:00.000Z",
        "voteCount": 2,
        "content": "Agree with B"
      }
    ],
    "examNameCode": "sc-100",
    "topicNumber": "7"
  },
  {
    "topic": 8,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79503-exam-sc-100-topic-7-question-3-discussion/",
    "body": "You need to recommend a solution to meet the security requirements for the virtual machines.<br>What should you include in the recommendation?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tjust-in-time (JIT) VM access",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tan Azure Bastion host",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAzure Virtual Desktop\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta network security group (NSG)"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 72,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 7,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-02T11:17:00.000Z",
        "voteCount": 42,
        "content": "The security requirement this question wants us to meet is \"The secure host must be provisioned from a custom operating system image.\"\nhttps://docs.microsoft.com/en-us/azure/virtual-desktop/set-up-golden-image"
      },
      {
        "date": "2023-03-01T19:44:00.000Z",
        "voteCount": 4,
        "content": "Just coming back to this. I'd say you're wrong, sorry.\\\n\nReasons: \n\n1. Compliance requirements trumps all others and remote access connections need to be secure to meet HIPAA, so use of Azure Bastion most probably wins.\n\n2. Azure Bastion doesn't support Azure Virtual Desktop: https://learn.microsoft.com/en-us/azure/bastion/bastion-faq#peering\n\n3. You can deploy a custom image without needing AVD - what do you guys think a VM is exactly?"
      },
      {
        "date": "2024-07-07T17:44:00.000Z",
        "voteCount": 1,
        "content": "It says \"You need to recommend a solution to meet the security requirements for the virtual machines\" ignore the other requirements such as HIPAA etc for this question"
      },
      {
        "date": "2023-04-26T10:04:00.000Z",
        "voteCount": 4,
        "content": "I agree that compliance requirements are the most important, but HIPAA or any compliance for that matter does not mandate use of Azure Bastion. As long as you are able to fulfil the security requirements using AVD, it should fit the bill. I would go for C option here."
      },
      {
        "date": "2022-10-17T09:57:00.000Z",
        "voteCount": 11,
        "content": "We need custom image so answer C is only correct.\n\nA yes, but this is in addition to Azure Virtual Desktop\nB no because custom image\nC yes\nD no,  but needed for Jit"
      },
      {
        "date": "2023-03-04T05:34:00.000Z",
        "voteCount": 1,
        "content": "I totally agreed."
      },
      {
        "date": "2024-03-17T04:12:00.000Z",
        "voteCount": 1,
        "content": "I think it's C. Reason: AVD can use custom images, and can host secure PAWs."
      },
      {
        "date": "2024-02-17T02:37:00.000Z",
        "voteCount": 1,
        "content": "\"Administrators must connect to a \"secure host\" to perform any remote administration of the virtual machines. The \"secure host\" must be provisioned from a custom operating system image.\"\n\nIt is the \"Secure Host\" that must be provisioned from a custom operating system = locked down with minimum services = Bastion Host"
      },
      {
        "date": "2024-01-19T02:12:00.000Z",
        "voteCount": 1,
        "content": "Not sure that is the question : \"Administrators must connect to a secure host to perform any remote administration of the virtual machines. The secure host must be provisioned from a custom operating system image.\" Is normaly intended to use a PAW station not an VDA station to make administration. Solution is for Dev not admins, so Bastion can respond I think."
      },
      {
        "date": "2023-12-21T17:22:00.000Z",
        "voteCount": 1,
        "content": "Answer: C\nthis is Azure Virtual Desktop\nAdministrators must connect to a secure host to perform any remote administration of the virtual machines. The secure host must be provisioned from a custom operating system image."
      },
      {
        "date": "2023-09-23T07:05:00.000Z",
        "voteCount": 3,
        "content": "By all accounts Bastion is for secure connections to host (win and linux) for admin and more purposes. Virtual desktop is not a security solution, but a workforce solution saving money and hassle, so not correct for this purpose.\n\nAnd if a custom VM is needed as the host to connect to other VMs from, then why not set up Bastion to connect to that custom admin VM only."
      },
      {
        "date": "2023-09-20T23:51:00.000Z",
        "voteCount": 1,
        "content": "Selected Answer: C\n\"The secure host must be provisioned from a custom operating system image.\"\nhttps://www.youtube.com/watch?v=r-P-2lGzPFQ&amp;list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&amp;index=9"
      },
      {
        "date": "2023-09-18T12:32:00.000Z",
        "voteCount": 2,
        "content": "To meet the security requirements for the virtual machines, including allowing administrators to connect to a secure host for remote administration, you should recommend:\n\nB. an Azure Bastion host.\n\nHere's how this recommendation aligns with the requirements:\n\nAzure Bastion is a secure and managed jump server that allows you to connect to your virtual machines directly through the Azure portal over SSH or RDP. This ensures secure remote administration of the virtual machines.\n\nThe requirement for administrators to connect to a secure host for remote administration is met by using Azure Bastion."
      },
      {
        "date": "2023-05-28T17:17:00.000Z",
        "voteCount": 2,
        "content": "In the exam 29.05.2023"
      },
      {
        "date": "2023-05-22T08:43:00.000Z",
        "voteCount": 4,
        "content": "C is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/virtual-desktop/create-custom-image-templates\nCustom image templates in Azure Virtual Desktop enable you to easily create a custom image that you can use when deploying session host virtual machines (VMs). Using custom images helps you to standardize the configuration of your session host VMs for your organization. Custom image templates are built on Azure Image Builder and tailored for Azure Virtual Desktop."
      },
      {
        "date": "2023-05-25T17:26:00.000Z",
        "voteCount": 2,
        "content": "Gotten this in May 2023 exam."
      },
      {
        "date": "2023-03-04T05:34:00.000Z",
        "voteCount": 3,
        "content": "I totally agree it's AVD because of the need for custom image."
      },
      {
        "date": "2022-12-29T04:24:00.000Z",
        "voteCount": 2,
        "content": "custom image is the key - hence will go for AVD"
      },
      {
        "date": "2022-12-20T07:50:00.000Z",
        "voteCount": 7,
        "content": "Obviously C here. The requirements state that the \"jump box\" must be running a custom image. Bastion is a fully managed non-customisanle PaaS product. The only answer that supports the requirement for a custom image is AVD."
      },
      {
        "date": "2023-03-15T10:53:00.000Z",
        "voteCount": 1,
        "content": "“Administrators must connect to a secure host to perform any remote administration of the virtual machines. The secure host must be provisioned from a custom operating system image.”\n===\nFront the requirements, the second sentence would rule out bastion"
      },
      {
        "date": "2022-11-04T05:31:00.000Z",
        "voteCount": 1,
        "content": "I totally agreed with you guys here. AVD"
      },
      {
        "date": "2022-10-08T00:54:00.000Z",
        "voteCount": 1,
        "content": "we talk about ALL  VMs.\n\nothers comments re customer image is related to secure host ONLY. Therefore, its not applicable"
      },
      {
        "date": "2022-09-29T19:30:00.000Z",
        "voteCount": 5,
        "content": "I agree with PlumpyTumbler, if we need a custom image, we have to use AVD to provision it."
      }
    ],
    "examNameCode": "sc-100",
    "topicNumber": "7"
  },
  {
    "topic": 8,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80213-exam-sc-100-topic-7-question-4-discussion/",
    "body": "HOTSPOT -<br>You need to recommend a solution to meet the compliance requirements.<br>What should you include in the recommendation? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04228/0005300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04228/0005300002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: A blueprint -<br>Scenario: Requirements. Compliance Requirements<br>Fabrikam wants to automatically remediate the virtual machines in Sub1 to be compliant with the HIPAA HITRUST standard.<br>Microsoft releases automation for HIPAA/HITRUST compliance<br>I am excited to share our new Azure Security and Compliance Blueprint for HIPAA/HITRUST ג€\" Health Data &amp; AI. Microsoft's Azure Blueprints are resources to help build and launch cloud-powered applications that comply with stringent regulations and standards. Included in the blueprints are reference architectures, compliance guidance and deployment scripts.<br>An Azure Blueprint is a package for creating specific sets of standards and requirements that govern the implementation of Azure services, security, and design.<br>Such packages are reusable so that consistency and compliance among resources can be maintained.<br>Incorrect:<br>* not Workflow automation<br>Workflow automation is an approach to making the flow of tasks, documents and information across work-related activities perform independently in accordance with defined business rules.<br>Box 2: Modify an Azure policy definition<br>Scenario: The virtual machines in TestRG must be excluded from the compliance assessment.<br>Use a Policy definition to include the TestRG virtual machines from the Blueprint.<br>Note: Azure Policy establishes conventions for resources. Policy definitions describe resource compliance conditions and the effect to take if a condition is met. A condition compares a resource property field or a value to a required value. Resource property fields are accessed by using aliases. When a resource property field is an array, a special array alias can be used to select values from all array members and apply a condition to each one.<br>By defining conventions, you can control costs and more easily manage your resources. For example, you can specify that only certain types of virtual machines are allowed. Or, you can require that resources have a particular tag. Policy assignments are inherited by child resources. If a policy assignment is applied to a resource group, it's applicable to all the resources in that resource group.<br>Incorrect:<br>* Not Update a policy assignment<br>A policy assignment assigns a Blueprint to a subscription. The scope is at the subscription level.<br>Note: Policy Assignments provide a means for applying policy to a subscription to which a blueprint is assigned.  That said, the policy must be within the scope of the blueprint containing the policy. Parameters defined with a policy are assigned during blueprint creation or during blueprint assignment.<br>Reference:<br>https://azure.microsoft.com/en-us/blog/microsoft-releases-automation-for-hipaa-hitrust-compliance/ https://cloudacademy.com/blog/what-are-azure-blueprints/ https://k21academy.com/microsoft-azure/azure-rbac-vs-azure-policies-vs-azure-blueprints/",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-18T17:58:00.000Z",
        "voteCount": 45,
        "content": "for second one it sould be update assignement:\nhttps://learn.microsoft.com/en-us/azure/governance/policy/tutorials/create-and-manage#update-assignment-with-exclusion"
      },
      {
        "date": "2022-09-09T04:55:00.000Z",
        "voteCount": 23,
        "content": "The question is about what you can use to enforce compliance to regulatory standards not to remediate non-compliance - A Blueprint is Correct. Azure Blueprints are used to enforce standards."
      },
      {
        "date": "2023-01-15T20:37:00.000Z",
        "voteCount": 3,
        "content": "I see your point - Tricky wording"
      },
      {
        "date": "2023-03-25T02:04:00.000Z",
        "voteCount": 1,
        "content": "Not correct in my opinion: \"Fabrikam wants to automatically remediate the virtual machines in Sub1 to be compliant with the HIPAA HITRUST standard.\"\nMS says: Remediation is accomplished through remediation tasks that deploy the deployIfNotExists template or the modify operations of the assigned policy \n\nDefender Workflow Automation is described as follows:\nThis feature can trigger consumption Logic Apps on security alerts, recommendations, and changes to regulatory compliance. \nhttps://learn.microsoft.com/en-us/azure/defender-for-cloud/workflow-automation\n\nFrom my point of view, Workflow Automation offers the best set of possibilities to enforce compliance.\n\nAlso: Blueprint is still in PREVIEW and will be replaced in the future."
      },
      {
        "date": "2024-10-01T16:16:00.000Z",
        "voteCount": 1,
        "content": "The answer is right. "
      },
      {
        "date": "2024-02-03T22:56:00.000Z",
        "voteCount": 1,
        "content": "For connectivity from App Service web apps to virtual machines, use:\n\nPrivate endpoints: This provides a private IP address for the App Service web app within the virtual network, enabling secure connectivity to virtual machines.\nFor connectivity from virtual machines to App Service web apps, use:\n\nService endpoints: This secures your Azure service resources to only your virtual network by extending your virtual network private address space and the identity of your VNet to the Azure services over a direct connection."
      },
      {
        "date": "2023-09-20T23:53:00.000Z",
        "voteCount": 7,
        "content": "Box1: A blueprint\nBox2: Update an Azure policy assignment\nhttps://www.youtube.com/watch?v=r-P-2lGzPFQ&amp;list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&amp;index=9\nQuestion 111"
      },
      {
        "date": "2023-08-22T04:28:00.000Z",
        "voteCount": 3,
        "content": "Seems like the following answers fit given https://learn.microsoft.com/en-us/azure/governance/policy/samples/hipaa-hitrust-9-2:\n1 - Blueprint\n2 - Update Azure Policy"
      },
      {
        "date": "2023-05-28T17:38:00.000Z",
        "voteCount": 3,
        "content": "First you need a managed identity to enforce policies with remediation tasks.\n2nd Question: You need to modify the assignment not the definition."
      },
      {
        "date": "2023-05-22T08:51:00.000Z",
        "voteCount": 5,
        "content": "1. Blueprint\n2. Update an Azure policy assignment\n\nhttps://learn.microsoft.com/en-us/azure/governance/blueprints/overview#blueprint-definition\nPolicy Assignment\n- Allows assignment of a policy or initiative to the subscription the blueprint is assigned to. The policy or initiative must be within the scope of the blueprint definition location. If the policy or initiative has parameters, these parameters are assigned at creation of the blueprint or during blueprint assignment."
      },
      {
        "date": "2023-05-26T08:19:00.000Z",
        "voteCount": 5,
        "content": "Gotten this in May 2023 exam."
      },
      {
        "date": "2023-02-10T05:56:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/governance/policy/concepts/exemption-structure#policy-assignment-id\nThe Azure Policy exemptions feature is used to exempt a resource hierarchy or an individual resource from evaluation of initiatives or definitions. \nExcluded scopes\nThe scope of the assignment includes all child resource containers and child resources. If a child resource container or child resource shouldn't have the definition applied, each can be excluded from evaluation by setting notScopes. This property is an array to enable excluding one or more resource containers or resources from evaluation. notScopes can be added or updated after creation of the initial assignment.\nSo second one should be \"update assignement\""
      },
      {
        "date": "2023-01-21T15:28:00.000Z",
        "voteCount": 3,
        "content": "\"Workflow Automation\" for enforcing regulatory standard, it uses Logic App which can enforce compliance to the standard by reverting back a change.\nSecond one should be update a policy assignment."
      },
      {
        "date": "2022-11-19T00:06:00.000Z",
        "voteCount": 12,
        "content": "Answer is \"Managed Identity\" to enforce compliance to existing environment resources\nOther one is \"Update a policy assignment\"  \nTricky question but we need to know policies are already in place in their environment according to given background."
      },
      {
        "date": "2022-09-14T06:01:00.000Z",
        "voteCount": 12,
        "content": "I think \"Update a policy assignment\" is the correct answer for second question. There is no exemption component in policy definition - https://docs.microsoft.com/en-us/azure/governance/policy/concepts/definition-structure, while it is in policy assignment - https://docs.microsoft.com/en-us/azure/governance/policy/concepts/assignment-structure"
      },
      {
        "date": "2022-09-04T23:39:00.000Z",
        "voteCount": 14,
        "content": "I believe “To enforce compliance…” is “A managed identity”, based on the info at this link: https://docs.microsoft.com/en-us/azure/governance/policy/how-to/remediate-resources\n\nThe second answer looks correct to me."
      },
      {
        "date": "2022-10-26T07:06:00.000Z",
        "voteCount": 3,
        "content": "good catch, there will be an initiative assigne with remediation tasks and apply if not exist that can run on MI,\nthe blueprint will only assign the policy or initiative, not really enforce it"
      }
    ],
    "examNameCode": "sc-100",
    "topicNumber": "7"
  }
]