[
  {
    "topic": 18,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81670-exam-pl-400-topic-18-question-1-discussion/",
    "body": "You need to create the customer mobile app.<br>Which type of function expression should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFilter\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFind",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLookUp"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 18,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-18T09:56:00.000Z",
        "voteCount": 6,
        "content": "Should be filter, as lookup is for one record only. And as only one field for search, we use Filter, if multiple - Search."
      },
      {
        "date": "2022-11-15T07:34:00.000Z",
        "voteCount": 5,
        "content": "Filter is correct based on requirement to Search"
      },
      {
        "date": "2024-04-04T00:26:00.000Z",
        "voteCount": 1,
        "content": "\"A custom mobile app must be created to allow salespeople to add or search by pharmacy name.\n\"\n=&gt; Should be filter"
      },
      {
        "date": "2023-09-11T03:54:00.000Z",
        "voteCount": 2,
        "content": "The correct answer is C. LookUp.\n\nThe LookUp function is used to retrieve a record from a table based on a unique identifier. In this case, the unique identifier is the pharmacy name.\n\nThe Filter and Find functions can also be used to search for pharmacy records. However, they will return all records that match the search criteria, including records that have duplicate pharmacy names. The LookUp function will only return the record with the specified pharmacy name."
      },
      {
        "date": "2023-08-29T09:31:00.000Z",
        "voteCount": 1,
        "content": "pharmacy name that we are searching is told to be uniquely identifiable, due to that they are only looking for one record to return (its not a street name or city theyre using) as they only want one record lookup is correct.\n\ndamn annoying though"
      },
      {
        "date": "2023-07-04T16:38:00.000Z",
        "voteCount": 1,
        "content": "A is correct"
      },
      {
        "date": "2023-06-16T13:35:00.000Z",
        "voteCount": 1,
        "content": "Should be A: \"General -\nYou must create a model-driven app to meet Contoso's needs. You must minimize the use of custom code and custom connectors.\""
      },
      {
        "date": "2023-01-28T05:08:00.000Z",
        "voteCount": 2,
        "content": "To create a mobile app that allows salespeople to add or search by pharmacy name and have records uniquely identified by pharmacy name, address, contact name, and phone number, you should use the LookUp function expression. The LookUp function allows you to search for a specific record in a dataset based on one or more specific field values and return the corresponding information. In this case, you can use LookUp function to search for a pharmacy record based on the pharmacy name, address, contact name, and phone number, and return the record that matches those criteria. This will ensure that each pharmacy record is uniquely identified by these four fields and can be easily searched and accessed by salespeople through the mobile app."
      },
      {
        "date": "2023-05-22T12:21:00.000Z",
        "voteCount": 4,
        "content": "but question says only: \"search by pharmacy name\", not by all the other fields you mention."
      },
      {
        "date": "2022-09-11T07:28:00.000Z",
        "voteCount": 5,
        "content": "A\n---\nA custom mobile app must be created to allow salespeople to add or search by pharmacy name. Pharmacy records must be uniquely identified by pharmacy name, address, contact name, and phone number.\n\nas we need to search by pharmacy name but pharmacies are uniquely identified by name, address, contact name and phone number, the results if we are searching by name only may contains more records --&gt; filter"
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "18"
  }
]