[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79614-exam-az-700-topic-6-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to recommend a configuration for the ExpressRoute connection from the Boston datacenter. The solution must meet the hybrid networking requirements and business requirements.<br>What should you recommend? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04253/0000600001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04253/0000600002.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-02-23T19:01:00.000Z",
        "voteCount": 9,
        "content": "In exam Feb, 2023"
      },
      {
        "date": "2023-01-18T13:26:00.000Z",
        "voteCount": 6,
        "content": "Correct answers are:\n- Ultra performance: https://learn.microsoft.com/en-us/azure/expressroute/about-fastpath#gateways\n- Gateway transit for peering: https://learn.microsoft.com/en-us/azure/expressroute/about-fastpath#virtual-network-vnet-peering"
      },
      {
        "date": "2024-03-14T06:23:00.000Z",
        "voteCount": 3,
        "content": "https://learn.microsoft.com/en-us/azure/expressroute/about-fastpath#gateways\nbox1: Ultra Performance\n\nhttps://learn.microsoft.com/en-us/azure/expressroute/about-fastpath#limited-general-availability-ga\nin the NOTE section point 3:\nFastPath connectivity to a Private endpoint/Link service deployed to a spoke Virtual Network, peered to the Hub Virtual Network (where the ExpressRoute Virtual Network Gateway is deployed), IS NOT SUPPORTED. FastPath only supports connectivity to Private Endpoints/Link services deployed to the Hub Virtual Network.\nFastPath connectivity to a Private endpoint/Link service deployed to a spoke Virtual Network, peered to the Hub Virtual Network (where the ExpressRoute Virtual Network Gateway is deployed), is not supported. FastPath only supports connectivity to Private Endpoints/Link services deployed to the Hub Virtual Network.\nbox 2: connect vnet2 directly to the ER circuit"
      },
      {
        "date": "2023-07-27T16:07:00.000Z",
        "voteCount": 2,
        "content": "Virtual network (VNet) Peering\nFastPath will send traffic directly to any VM deployed in a virtual network peered to the one connected to ExpressRoute, bypassing the ExpressRoute virtual network gateway. This feature is available for both IPv4 and IPv6 connectivity."
      },
      {
        "date": "2022-11-15T20:35:00.000Z",
        "voteCount": 4,
        "content": "This is a tricky question on regard of the second option. It's true that FastPath now can send traffic directly to the VM including the peered networks. But , this is talking about if we have only in place express route Direct. For the other options express route, it's not available yet and still it on public review. The case study says that they want to minimize costs..so having an express route direct circuit is not the best idea.  However, by adding express route Ultra performance gateway , we can say that we can afford express route direct .. .. cheapest solution would be to add the vm2 traffic directly through the express route circuit... But , once again it's tricky... I will take the Risk and select the option of enabling gateway transit ."
      },
      {
        "date": "2022-11-15T20:37:00.000Z",
        "voteCount": 3,
        "content": "Here is the updated link of fastpath new availability just in case u guys don't have it : https://learn.microsoft.com/en-us/azure/expressroute/about-fastpath"
      },
      {
        "date": "2022-10-12T19:17:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/expressroute/about-fastpath\n\nso in box 2:  peering with transit gateway, leveriging off the fastpath feature in vnet1"
      },
      {
        "date": "2022-10-02T12:01:00.000Z",
        "voteCount": 2,
        "content": "FastPath now supports virtual network peering . FastPath will send traffic directly to any VM deployed in a spoke virtual network peered to the virtual network where the ExpressRoute virtual network gateway is deployed.\nhttps://azure.microsoft.com/en-ca/updates/general-availability-expressroute-fastpath-support-for-virtual-network-vnet-peering-and-user-defined-routes-udrs-2/"
      },
      {
        "date": "2022-09-28T21:27:00.000Z",
        "voteCount": 1,
        "content": "First answer is correct as FastPath only works with Ultra Performance SKU.\nThe second answe must be the dedicated ER:\nIf you have other virtual networks peered with the one that is connected to ExpressRoute, the network traffic from your on-premises network to the other virtual networks (i.e., the so-called \"Spoke\" VNets) will continue to be sent to the virtual network gateway. The workaround is to connect all the virtual networks to the ExpressRoute circuit directly."
      },
      {
        "date": "2022-09-25T02:17:00.000Z",
        "voteCount": 2,
        "content": "FastPath doesn't work for peered VNets, thus Vnet2 needs a direct connection to the ExpressRoute as well. The data can still flow through Vnet1: Vnet 2 &gt; ExpressRoute &gt; Vnet 1 -&gt; ExpressRoute &gt; ..."
      },
      {
        "date": "2022-09-25T10:25:00.000Z",
        "voteCount": 1,
        "content": "I agree:\n\nVNet Peering: If you have other virtual networks peered with the one that is connected to ExpressRoute, the network traffic from your on-premises network to the other virtual networks (i.e., the so-called “Spoke” VNets) will continue to be sent to the virtual network gateway. The workaround is to connect all the virtual networks to the ExpressRoute circuit directly."
      },
      {
        "date": "2022-09-18T04:51:00.000Z",
        "voteCount": 1,
        "content": "but there is a condition that Traffic between Vnet2 and Vnet3 must be routed through Vnet1.\ni thinkthe gateway transit in vnet1 is correct."
      },
      {
        "date": "2022-12-29T23:46:00.000Z",
        "voteCount": 1,
        "content": "Traffic between VNET2 and 3 and not traffic between VNET2 and On-Prem"
      },
      {
        "date": "2022-09-02T16:00:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2022-09-02T16:09:00.000Z",
        "voteCount": 7,
        "content": "Correcting myself here. Should be Ultra for the first box and the second box since it mentions FastPath it needs to have Vnet2 directly connected to ExpressRoute."
      }
    ],
    "examNameCode": "az-700",
    "topicNumber": "6"
  }
]