[
  {
    "topic": 20,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/72242-exam-mb-500-topic-20-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to create the outstanding invoice report for the CFO.<br>Which attributes should you use? To answer, drag the appropriate attributes to the requirements. Each attribute answer may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04327/0018400001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04327/0018400002.png\" class=\"in-exam-image\">",
    "answerDescription": "Scenario: The Chief Financial Officer (CFO) requires the following reports:<br>✑ A report that shows all outstanding invoices, their cash discount types including the new minimum threshold applicable, and the amount of the discount. The report must only be accessed by users who are members of the Accounts Payable Manager role.<br><br>Box 1: DataContractAttribute -<br>DataContractAttribute ג€\" This attribute is applied to an X++ class and specifies that the class can be used as a data contract (that it should be serialized).<br><br>Box 2: DataMemberAttribute -<br>DataMemberAttribute ג€\" This attribute is applied to a parm (parameter) method on an X++ data contract class and specifies that the data member should be serialized.<br>Box 3: SRSReportParameterAttribute<br>You set the SRSReportParameterAttribute attribute to the data contract you created for the RDP class.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamicsax-2012/appuser-itpro/how-to-use-a-report-data-provider-class-in-a-report",
    "votes": [],
    "comments": [
      {
        "date": "2022-03-02T06:23:00.000Z",
        "voteCount": 4,
        "content": "Correct"
      }
    ],
    "examNameCode": "mb-500",
    "topicNumber": "20"
  }
]