[
  {
    "topic": 8,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/26455-exam-mb-400-topic-8-question-1-discussion/",
    "body": "You need to replace the bicycle inspection forms.<br>Which two solutions should you use? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta canvas app that guides the technician through the inspection",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta logic app that guides the technician through the inspection",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta flow that maps inspection data to Dynamics 365 for Field Service",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta model-driven app based on customer service entities"
    ],
    "answer": "CD",
    "answerDescription": "Scenario: The Adventure Works Cycles retail location performs bicycle inspections and performance tune-ups. Technicians use paper forms to document the bicycle inspection performed before a tune-up and any additional work performed on the bicycle.<br>C: The Dynamics 365 Field Service business application helps organizations deliver onsite service to customer locations. The application combines workflow automation, scheduling algorithms, and mobility to set mobile workers up for success when they're onsite with customers fixing issues.<br>D: Model-driven apps are good for creating end-to-end solutions. For example, after a customer service support ticket has been created, it must be routed, addressed, updated, marked as complete, and so on. There will likely be quite a few teams, roles, and processes involved in this complete cycle of case resolution, which would require a model-driven app.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/field-service/overview https://us.hitachi-solutions.com/blog/canvas-vs-model-driven-apps/<br>Configure Common Data Service",
    "votes": [],
    "comments": [
      {
        "date": "2020-07-23T00:45:00.000Z",
        "voteCount": 8,
        "content": "I would say A,D is correct.\nhow could I replace a paper form with a workflow (B,C)? without having any frontend for it."
      },
      {
        "date": "2021-04-22T10:39:00.000Z",
        "voteCount": 2,
        "content": "i think the correct answers are C and D."
      },
      {
        "date": "2021-04-11T09:20:00.000Z",
        "voteCount": 2,
        "content": "I think it should be A and C\n\nA: \n - Currently technicians doing inspections using paper form.\n- Replacement is a canvas app that GUIDE THEM through bike inspection\n\nC: After inspection completed the workflow will transfer inspection data to the Customer Services entities"
      },
      {
        "date": "2020-12-16T23:32:00.000Z",
        "voteCount": 1,
        "content": "I think C &amp; D correct."
      },
      {
        "date": "2020-12-20T04:35:00.000Z",
        "voteCount": 1,
        "content": "why you think that?"
      },
      {
        "date": "2020-12-09T00:03:00.000Z",
        "voteCount": 3,
        "content": "I would say A &amp; C,\n\"Each correct answer presents part of the solution\" - this means we are looking for multiple answers that will combine to become a FULL Solution.\n\nIn the background section it says \"A canvas app is being developed to capture customer information...\" this gives us the answer to \"A\" and to complete the solution we need another answer that will support it and that points us to \"C\".\n\nB is too much\nD is based on customer services entities and depicts the existing development which is Canvas."
      },
      {
        "date": "2020-12-02T10:50:00.000Z",
        "voteCount": 3,
        "content": "How can D be correct? It is based on Customer Service entity.\nEach answer is correct and not part of a whole solution.\nso A and C"
      },
      {
        "date": "2020-11-30T09:18:00.000Z",
        "voteCount": 2,
        "content": "You can't have both a Canvas App and Model-Driven app together in one app as there is no such thing.  C and D are correct"
      },
      {
        "date": "2020-11-06T23:07:00.000Z",
        "voteCount": 1,
        "content": "Technician documents bike state via a paper form.\n\nTo replace this, the technician has to interact with an interface to document bike state. \n\nBased on options provided, **most** viable solution via Canvas and Model Driven Apps."
      },
      {
        "date": "2020-10-15T11:13:00.000Z",
        "voteCount": 2,
        "content": "I have to agree with CD."
      },
      {
        "date": "2020-09-15T14:49:00.000Z",
        "voteCount": 1,
        "content": "Each correct answer presents part of the solution. While, I think, A and D are complete solutions on their own?"
      },
      {
        "date": "2020-09-17T14:41:00.000Z",
        "voteCount": 2,
        "content": "So A &amp; D are not a good choice."
      },
      {
        "date": "2020-08-02T18:47:00.000Z",
        "voteCount": 2,
        "content": "Agree with you, it should be AD"
      }
    ],
    "examNameCode": "mb-400",
    "topicNumber": "8"
  }
]