[
  {
    "topic": 13,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/74592-exam-az-700-topic-13-question-1-discussion/",
    "body": "HOTSPOT -<br>You create NSG10 and NSG11 to meet the network security requirements.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04253/0015800004.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04253/0015900001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: No -<br>NSG10 which is attached to VM1's subnet blocks RDP (port TCP 3389) to 'Any' which means the port is blocked to all destinations.<br><br>Box 2: Yes -<br>NSG10 blocks ICMP from VNet4 (source 10.10.0.0/16) but it is not blocked from VM2's subnet (VNet1/Subnet2).<br><br>Box 3: No -<br>NSG11 blocks RDP (port TCP 3389) destined for 'VirtualNetwork'.  VirtualNetwork is a service tag and means the address space of the virtual network (VNet1) which in this case is 10.1.0.0/16.  Therefore, RDP traffic from subnet2 to anywhere else in VNet1 is blocked.",
    "votes": [],
    "comments": [
      {
        "date": "2022-04-26T07:03:00.000Z",
        "voteCount": 53,
        "content": "I thin the response should be YES, YES, NO\n1) VM1 can establish a RDP session to VM as the filtering is set to inbound even if the rule would have matched ( it would have required outbound)\n2) as stated already, this is for vnet4, so no problem, the traffic will be granted\n3) the traffic will be dropped by NSG11 set as abound and from the subnet 10.1.0.0/16 to the vnet, so it matches and is dropped."
      },
      {
        "date": "2023-08-29T04:57:00.000Z",
        "voteCount": 2,
        "content": "Tested and you are right!"
      },
      {
        "date": "2022-08-10T11:00:00.000Z",
        "voteCount": 5,
        "content": "You are right!"
      },
      {
        "date": "2022-10-12T20:38:00.000Z",
        "voteCount": 1,
        "content": "agreed"
      },
      {
        "date": "2023-08-07T03:35:00.000Z",
        "voteCount": 2,
        "content": "3 - outbound means from inside of subnet to outside so in my opinion NSG allows RDP connection. If rule would be associated with inbound direction then traffic should be blocked. \nSo, correct should be YYY"
      },
      {
        "date": "2022-08-28T19:39:00.000Z",
        "voteCount": 17,
        "content": "Yes, Yes, No is correct. Make sure you double-check each of the NSG rules, so it's clear!\n\n1. From VM1 to inbound RDP VM2, there are no NSGs blocking this. There is only a custom inbound NSG for VM1, and a custom outbound NSG for VM2-- neither of which will block our connection \n\n2. VM2 outbound NSG has no rules blocking ping (ICMP). Next review the inbound NSG for VM1. There is an priority rule 1000 -- inbound ICMP deny, but the source is pointing to VNET4 (tricky!)\n\n3. Blocked. VM2 NSG has an outbound deny for 3389 RDP."
      },
      {
        "date": "2024-04-21T10:38:00.000Z",
        "voteCount": 1,
        "content": "Y N Y\n\n1: Yes, the RDP block is set to inbound on subnet 1, so from vm1 (outbound) to VM 2 works\n2: Yes: subnet 1 has ICMP blocked from virtualnetwork as tag destination, but the source is the subnet-4 range. so VM2 (subnet 2) can still perform RDP\n3: Yes. the source IP range of the NSG does not match subnet2, this renders the custom rule useless"
      },
      {
        "date": "2023-09-27T10:07:00.000Z",
        "voteCount": 2,
        "content": "In exam Sep, 2023"
      },
      {
        "date": "2023-04-02T01:40:00.000Z",
        "voteCount": 5,
        "content": "Some basics: \n1. NSG on NIC always takes precedence over NSG on Subnet. \n2. Default setting for NSG is DenyAllInbound. There is one rule for all NSG linked to NIC which says RDP from Internet is allowed, which indicates that default setting for Inbound is active.\nWhat does ist mean? It means that VM1 cannot establish RDP to VM2 which NSG2 only allows RDP from Internet.\nQ1: No\nFor outbound traffic default setting is Allow All. NSG10 (VNET1/Subnet2) denies ICMP only  to Vnet4.\nQ2: YES\nNSG 11 on Vnet1/Subnet2 does not allow outbound  for Virtual Network\nAlso Default for NSG of Vm3 (NIC)  is DenyAllInbound.\nQ3: NO\nSo, in my opinion NYN is correct.\n\nhttps://learn.microsoft.com/en-us/azure/virtual-network/network-security-group-how-it-works"
      },
      {
        "date": "2023-08-25T09:14:00.000Z",
        "voteCount": 2,
        "content": "Carefull with the point 2. yesm you have the DenyAllinbound, but also have  AllowVNetInBound with better priority. with the default rules All inbound traffic from the vnet is allowed."
      },
      {
        "date": "2023-02-23T19:08:00.000Z",
        "voteCount": 2,
        "content": "In exam Feb 2023"
      },
      {
        "date": "2023-01-20T11:23:00.000Z",
        "voteCount": 3,
        "content": "yes yes no"
      },
      {
        "date": "2023-01-21T09:19:00.000Z",
        "voteCount": 2,
        "content": "same vnet so route is present ...only check NSG rules...."
      },
      {
        "date": "2023-01-01T22:53:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct, it will be NYN.\nNo - Traffic will be dropped by NSG10. Subnet NSG will take precedence over VM interface NSG.\nYes - ICMP is allowed.\nNo - Traffic will be be dropped by NSG11."
      },
      {
        "date": "2022-11-30T09:33:00.000Z",
        "voteCount": 1,
        "content": "check these two NSGS table \n\nCreate an NSG named NSG10 that will be associated to Vnet1/Subnet1 and will have the custom inbound security rules shown in the following table.\nCreate an NSG named NSG11 that will be associated to Vnet1/Subnet2 and will have the custom outbound security rules shown in the following table.\n\nso the answer is NNN"
      },
      {
        "date": "2022-11-30T09:32:00.000Z",
        "voteCount": 1,
        "content": "its NNN , AS THE custom nsg denies any communication from 10.1.0.0/16 which is the address space of vnet1 , and vm1 and vm2 uses that address space"
      },
      {
        "date": "2022-11-04T04:05:00.000Z",
        "voteCount": 1,
        "content": "What about the NSG's connected to the NIC's? There is only 1 rule (inbound), which is to allow RDP from Internet. Won't these block any VM/subnet RDP connections allowed via the subnet NSG?\n\n'The NSGs are associated to the network interfaces on the virtual machines. Each NSG has one custom security rule that allows RDP connections from the internet'"
      },
      {
        "date": "2022-08-27T06:52:00.000Z",
        "voteCount": 1,
        "content": "Yes, Yes, No"
      },
      {
        "date": "2022-06-21T12:36:00.000Z",
        "voteCount": 3,
        "content": "Y,Y,N."
      },
      {
        "date": "2022-05-23T07:23:00.000Z",
        "voteCount": 6,
        "content": "NSG10 is an inbound rule attached to subnet 1... It doesn't prevent an outbound RDP to subnet 2. Its Yes, Yes, No"
      },
      {
        "date": "2022-04-27T18:15:00.000Z",
        "voteCount": 3,
        "content": "I believe yes yes no, no outbound filter on subnet 1."
      },
      {
        "date": "2022-04-26T13:21:00.000Z",
        "voteCount": 5,
        "content": "I think YYN for the answers"
      }
    ],
    "examNameCode": "az-700",
    "topicNumber": "13"
  }
]