[
  {
    "topic": 19,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/131014-exam-mb-310-topic-19-question-4-discussion/",
    "body": "HOTSPOT -<br>You need to ensure accounting entries are transferred from subledgers to general ledgers.<br>How should you configure the batch transfer rule? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04326/0015000001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04326/0015100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Configure subledger transfer as a scheduled batch<br>Humongous Insurance's subsidiary requires accounting entries to be posted from the subledger to the general ledger by 5:00 PM each day.<br>Box 2: Configure subledger transfer as Synchronous<br>Trey Research requires accounting entries to be posted from the subledger to the ledger immediately.<br>The following options are available for transferring subledger batches:<br>Asynchronous ג€\" Transfer of the subledger accounting entries to the general ledger is scheduled immediately. The General ledger voucher will be recorded as soon as resources are available to process the request on the server.<br>Scheduled batch ג€\" The subledger accounting entries that must be transferred are added to the processing queue in General ledger. The entries in the queue will be processed in the order that they are received in. Each General ledger voucher will update accounts at the scheduled time if resources are available to process the batch job on the server.<br>Incorrect:<br>* synchrounous<br>In version 8.1, changes were made to allow the transfer of rules, which deprecated the Synchronous option.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/finance/general-ledger/subledger-transfer",
    "votes": [],
    "comments": [
      {
        "date": "2024-01-12T20:12:00.000Z",
        "voteCount": 1,
        "content": "I think the 2nd question should be Synchronous, because it requires posted from the subledger to the ledger immediately."
      }
    ],
    "examNameCode": "mb-310",
    "topicNumber": "19"
  },
  {
    "topic": 19,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/93866-exam-mb-310-topic-19-question-7-discussion/",
    "body": "You need to configure the posting groups for Humongous Insurance s subsidiary.<br>Which ledger posting group field should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSales tax payable",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSales tax receivable",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCustomer case discount",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse tax payable\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse tax expense"
    ],
    "answer": "A",
    "answerDescription": "Set up Ledger posting groups for sales tax<br>In the Sales tax payable field, select the main account for outgoing sales taxes that are payable to the tax authority. Sales taxes are collected on behalf of the tax authority when you sell taxable goods and services.<br>Incorrect:<br>* In the Sales tax receivable field, select the main account for incoming taxes that are received from the tax authority. Vendors collect taxes on behalf of the tax authority when you buy taxable goods and services. This field is not available if the Apply sales tax taxation rules option is selected in the General ledger parameters page. Instead, sales taxes that are paid to vendors are debited to the same account as the purchase.<br>* In the Use tax expense field, select the main account for posting deductible Use taxes that are not claimed or reported to the tax authority by vendors as part of<br>EU reverse charge GST/HST. The Use tax option must be selected for the Sales tax code in the Sales tax group that is used in the transaction. This field won't be available if the Apply sales tax taxation rules option is selected on the General ledger parameters page.<br>* In the Use tax payable field, select the main account for posting incoming Use taxes that are payable to tax authorities. The Use tax option must be selected in the Sales tax code in the Sales tax group to post Use tax. If Apply sales tax taxation rules option is selected in General ledger parameters page, the offset is posted to the transaction's expense account.<br>Note:<br><br>Requirements, Ledger -<br>ג€¢    One of Humongous Insurance's companies provides insurance to government clients and must separate that particular company into its own subsidiary.<br>ג€¢    The Humongous subsidiary will operate in China, which requires a fiscal year from February 1 to January 31.<br>ג€¢    Transactions must be posted in the business of record.<br>ג€¢    Humongous Insurance's subsidiary requires accounting entries to be posted from the subledger to the general ledger by 5:00 PM each day.<br><br>Taxes -<br>As part of the spinoff to a subsidiary, Humongous Insurance's subsidiaries taxes must be changed from US government rates to Chinese government rates.<br>Humongous Insurance's subsidiary must track use taxes that are not claimed or reported to the Chinese tax agency.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/finance/general-ledger/tasks/set-up-ledger-posting-groups-sales-tax",
    "votes": [
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2024-06-23T05:19:00.000Z",
        "voteCount": 2,
        "content": "The missing part of the question is that \"Humongous Insurance's subsidiary must track use taxes that are not claimed or reported to Chinese tax agency\"\nThe solution is to \"Use tax payable\" field which allow you to select the main account for posting incoming Use taxes that are payable to tax authorities. \nMake sure the \"Use tax\" option is selected in the Sales tax code within the Sales tax group to post Use tax."
      },
      {
        "date": "2024-02-23T02:57:00.000Z",
        "voteCount": 2,
        "content": "Should be D: background of the reverse charge principle lies in the fact that some vendors don't report the taxes to the tax authority - and the receiving company nevertheless deducts those taxes as deductible input taxex."
      },
      {
        "date": "2023-01-04T08:03:00.000Z",
        "voteCount": 4,
        "content": "This question makes no sense. What posting groups? For what? It is not written in the question."
      }
    ],
    "examNameCode": "mb-310",
    "topicNumber": "19"
  }
]