[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/71798-exam-pl-600-topic-7-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to ensure that the solution meets the data security and compliance requirements.<br>What should you recommend? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04333/0014200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04333/0014300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Assign: Cascade None -<br>Scenario: Worker skill records must be archived after ten years and are then removed from the main system.<br>Assign: The referenced table record owner is changed.<br>Cascade None: Do nothing.<br>Incorrect Answers:<br>Cascade All: Perform the action on all referencing table records associated with the referenced table record.<br><br>Box 2: Delete: Restrict -<br>Scenario: Worker information must not be deleted from the system while skill and job placement history records for the worker exist in the system.<br>Referential, Restrict Delete: In a referential, restrict delete relationship between two tables, you can navigate to any related rows. Actions taken on the parent row will not be applied to the child row, but the parent row cannot be deleted while the child row exists. This is useful if you do not want child rows to become orphaned. This forces the user to delete all of the children before deleting the parent.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/maker/data-platform/data-platform-entity-lookup",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-11T01:19:00.000Z",
        "voteCount": 16,
        "content": "Actually one of the issues is this:\n--- Recruiters report that they cannot see historical job placement data for workers.\n\nSo I go with Assign: CASCADE ALL"
      },
      {
        "date": "2023-04-20T21:40:00.000Z",
        "voteCount": 6,
        "content": "Assign: Cascade All\nDelete: Restrict"
      },
      {
        "date": "2024-03-11T05:22:00.000Z",
        "voteCount": 1,
        "content": "a worker transfers to a new client company ---&gt; how does this affect 'assign'?\nI mean you reassign owners, which are the primary recruiters.\nyou could make a lookup to an account. yes, but not reassign a contact  from one account to another. weird stuff. if you reassign a worker from one recruiter to another, nothing should cascade (the owner of the old records probably remain the old recruiters). \n\n\nRecruiters report that they cannot see historical job placement data for workers.\nThe solution must provide a worker appointment booking system that can access worker historical job placement data.\nFirst Up staff members must be able to view and update worker records. They must be able to see current and historical job placement data on the same form in the new solution.\n\nI go for: cascade none"
      },
      {
        "date": "2023-12-20T14:59:00.000Z",
        "voteCount": 5,
        "content": "Why on earth are an IT recruitment company doing this?\n\n\"First Up uses an on-premises system to manage current and historical patient data including medications and medical visits.\""
      },
      {
        "date": "2022-03-10T09:08:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      },
      {
        "date": "2022-02-20T17:04:00.000Z",
        "voteCount": 4,
        "content": "correct"
      }
    ],
    "examNameCode": "pl-600",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/68371-exam-pl-600-topic-7-question-2-discussion/",
    "body": "You need to recommend technology for accessing historical job placement data.<br>What should you recommend?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower Virtual Agents chatbots",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVirtual tables\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower BI",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower Automate flows"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 16,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-12-21T07:04:00.000Z",
        "voteCount": 13,
        "content": "Correct"
      },
      {
        "date": "2023-11-19T03:47:00.000Z",
        "voteCount": 2,
        "content": "I read this \"First Up uses an on-premises system to manage current and historical patient data including medications and medical visits.\nThe company plans to reference historical data in the existing system. The records held in these systems will not be migrated to the new solution except for medication information.\" assuming that the on prem system only managed \"patient data\" and NOT historical job placement. \n\nIf I assume historical job placements were on prem it makes sense with virtual table."
      },
      {
        "date": "2023-05-09T17:34:00.000Z",
        "voteCount": 1,
        "content": "WHY VIRTUAL TABLES ?    \"Workers must be able to request copies of their records by using a chatbot\".  PVA.       Why do people like \"correct\" comments just for answering."
      },
      {
        "date": "2023-05-29T05:56:00.000Z",
        "voteCount": 3,
        "content": "Read the question again and check where \"historical job placement data\" is mentioned in the case study. Workers don't need access to historical job placement data, recruiters and First Up staff members do; there's nothing relating to PVA in this question or workers' access to their employment records."
      },
      {
        "date": "2022-02-20T17:04:00.000Z",
        "voteCount": 3,
        "content": "correct"
      }
    ],
    "examNameCode": "pl-600",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66659-exam-pl-600-topic-7-question-3-discussion/",
    "body": "HOTSPOT -<br>You need to design tables for the solution.<br>What should you recommend? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04333/0014500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04333/0014600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Virtual Table -<br>A virtual table is a custom table in Microsoft Dataverse that has columns containing data from an external data source. Virtual tables appear in your app to users as regular table rows, but contain data that is sourced from an external database, such as an Azure SQL Database. Rows based on virtual tables are available in all clients including custom clients developed using the Dataverse web services.<br>Scenario:<br>✑ First Up uses an on-premises system to manage current and historical patient data including medications and medical visits.<br>✑ The company plans to reference historical data in the existing system. The records held in these systems will not be migrated to the new solution except for medication information.<br>✑ The solution must provide a worker appointment booking system that can access worker historical job placement data.<br>✑ First Up staff members must be able to view and update worker records. They must be able to see current and historical job placement data on the same form in the new solution.<br>Box 2: Lookup (N:1)<br>Each worker can have many security clearances, so need a 1:N relationship.<br>Scenario: The solution must support tracking of security clearance information for a worker including the date, status, and certifying agency.<br>Reference:<br>https://docs.microsoft.com/en-us/powerapps/maker/data-platform/create-edit-virtual-entities https://docs.microsoft.com/en-us/powerapps/maker/data-platform/create-edit-entity-relationships",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-24T12:04:00.000Z",
        "voteCount": 16,
        "content": "Correct"
      },
      {
        "date": "2022-07-29T03:47:00.000Z",
        "voteCount": 12,
        "content": "1: Custom\n2: Lookup 1:N"
      },
      {
        "date": "2022-09-06T05:21:00.000Z",
        "voteCount": 2,
        "content": "Agree!\n- \"Worker information must not be deleted from the system while skill and job placement history records for the worker exist in the system.\" - is only possible with a custom table.\n- Lookup 1:N (or N:1 if you look from the security clearance record) - Each clearance record belongs to one Worker."
      },
      {
        "date": "2024-09-21T09:31:00.000Z",
        "voteCount": 1,
        "content": "Ok.  Why wouldn't 1 be an Activity table....?? Am I missing something?  Job placements have start and end dates, and can be related to workers, security clearances, etc.  You can also utilize the timeline to show current and previous job placements (which is a callout in the case).  Maybe because this would need to be a \"Custom Activity Table\", which falls under custom....  ehhh"
      },
      {
        "date": "2023-07-30T09:45:00.000Z",
        "voteCount": 1,
        "content": "I agree, it is virtual for this \"The company plans to reference historical data in the existing system\" . So, you need to create a virtual table for this. in another hand, i use custom table too."
      },
      {
        "date": "2023-07-09T09:10:00.000Z",
        "voteCount": 3,
        "content": "1: Custom we do not use or need a virtual table. that is used for the historical, but new stuff should go in the Custom Table"
      },
      {
        "date": "2023-05-16T11:16:00.000Z",
        "voteCount": 2,
        "content": "A custom table is the most appropriate choice for the Job Placement record because it allows you to create a table specifically designed to store the required information about workers' job placements within the Power Platform solution. This ensures that the data is stored and managed efficiently and can be easily accessed and updated as needed.\n\nSo, then answer for 1st one is Custom Table \n\n2: Lookup 1:N"
      }
    ],
    "examNameCode": "pl-600",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66122-exam-pl-600-topic-7-question-4-discussion/",
    "body": "HOTSPOT -<br>You need to recommend solutions for the organization's technical challenges.<br>What should you recommend? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04333/0014800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04333/0014900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Power Automate -<br>Self-service purchase is available for Power Platform (Power BI, Power Apps, and Power Automate), Project, and Visio.<br>Box 2: Azure Active Directory B2B<br>Scenario: First Up Consulting recruits information technology (IT) workers for temporary or permanent positions at client companies.<br>Azure Active Directory (Azure AD) business-to-business (B2B) collaboration is a feature within External Identities that lets you invite guest users to collaborate with your organization. With B2B collaboration, you can securely share your company's applications and services with guest users from any other organization, while maintaining control over your own corporate data. Work safely and securely with external partners, large or small, even if they don't have Azure AD or an IT department. A simple invitation and redemption process lets partners use their own credentials to access your company's resources.<br>Note, Scenario:<br>✑ Workers must be able to sign into a portal by using their own email address. Workers must be required to use a secure method of authentication to be able to view their data.<br>✑ User security roles must be customized to ensure that users are able to interact only with the specific data in which they need access.<br>Box 3: Dynamics 365 Field Service<br>Dynamics 365 Field Service functionality include:<br>An interactive schedule board helps dispatchers assign work orders to the best resources based on location, availability, skill set, priority, and more. This is done via a manual drag-and-drop method, a semi-automated scheduling assistant, or fully automated with Resource Scheduling Optimization.<br>The schedule board displays each resource--whether an employee, contractor, or equipment--and their scheduled work orders. Resources and their assigned jobs are also displayed on a map along with routes and traffic patterns in real time.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-365/commerce/subscriptions/self-service-purchase-faq https://docs.microsoft.com/en-us/azure/active-directory/external-identities/what-is-b2b https://docs.microsoft.com/en-us/dynamics365/field-service/overview",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-24T13:07:00.000Z",
        "voteCount": 25,
        "content": "Azure cognitive services\nB2C\nField service"
      },
      {
        "date": "2022-09-15T12:53:00.000Z",
        "voteCount": 3,
        "content": "Seriously ,.....How can ACS provide personal and skills information? Such information is available enough to be extracted by AI."
      },
      {
        "date": "2023-05-09T18:16:00.000Z",
        "voteCount": 2,
        "content": "Number 1 is Power Automate. (used by PVA to run flow to get personal / skills info)"
      },
      {
        "date": "2022-07-24T12:34:00.000Z",
        "voteCount": 11,
        "content": "The first one - I'm not sure how any of those can help. I do not think it is ACS or PA, Q&amp;AM will be gone. anyway.... For the second, B2C. These temporary workers should be using their personal authentications and not their placement companies authentication. Third is Field Service."
      },
      {
        "date": "2024-03-11T09:24:00.000Z",
        "voteCount": 1,
        "content": "1) sounds like a power pages scenario, users log in , query and update. but maybe it is Azure Cognitive Services because they want to create a chatbot (it is not very obvious...)\n2) B2B because of guest saves licenses: workers are sort of contractors, no full license needed\n2) field service"
      },
      {
        "date": "2023-07-09T09:15:00.000Z",
        "voteCount": 1,
        "content": "1. ACS (and I dont know when this was updated if it was before / after QnA Maker was deprecated) but Power Automate Flow will not do anything. What is the UI they are using to ask their questions / request the information that the PA would find and then display it where???\n\n2. B2C : temp workers, I guess technically if you invited them all as guests it would then be b2b but doesn't seem right to me\n\n3. Field Service"
      },
      {
        "date": "2023-12-27T17:00:00.000Z",
        "voteCount": 1,
        "content": "1. For the UI part:\nWorkers must be able to request copies of their records by using a chatbot.\nSeems Power Automate is the right answer."
      },
      {
        "date": "2023-05-16T11:24:00.000Z",
        "voteCount": 3,
        "content": "Power Automate\nAzure B2C\nField Service"
      },
      {
        "date": "2023-04-23T01:58:00.000Z",
        "voteCount": 1,
        "content": "The 1 question is Power automate and not Power platform...???"
      },
      {
        "date": "2023-04-23T02:13:00.000Z",
        "voteCount": 1,
        "content": "Edit: My bad. Misread the question"
      },
      {
        "date": "2023-02-15T18:16:00.000Z",
        "voteCount": 1,
        "content": "first question: automation, maybe need to achieve skills older than 10 years?"
      },
      {
        "date": "2022-10-29T09:11:00.000Z",
        "voteCount": 2,
        "content": "I select this:\nACS\nB2C\nField Service.\nAs per Microsoft docs:\nThe QnA Maker service is being retired on the 31st of March, 2025. A newer version of the question and answering capability is now available as part of Azure Cognitive Service for Language."
      },
      {
        "date": "2022-09-12T22:44:00.000Z",
        "voteCount": 2,
        "content": "PowerAutomate (since the other two don't make sense)\nB2B (all other requirements need workers to become part of the tenant (e.g. teams); B2C does not provide this)\nField Service (no doubt)"
      },
      {
        "date": "2022-09-04T06:12:00.000Z",
        "voteCount": 2,
        "content": "QnA Maker\nAzure Directory BTC (Workers must be able to sign into a portal by using their own email address)\nField Service - schedule board"
      },
      {
        "date": "2021-11-23T09:34:00.000Z",
        "voteCount": 4,
        "content": "Why not Q And A Maker?"
      },
      {
        "date": "2022-06-10T05:33:00.000Z",
        "voteCount": 1,
        "content": "it will be deprecated"
      },
      {
        "date": "2021-11-16T03:41:00.000Z",
        "voteCount": 3,
        "content": "How can power automate help regarding  the first question?"
      }
    ],
    "examNameCode": "pl-600",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66467-exam-pl-600-topic-7-question-5-discussion/",
    "body": "HOTSPOT -<br>You need to recommend methods to resolve the organization's issues.<br>What should you recommend? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04333/0015100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04333/0015200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Add users to Microsoft 365.<br>Scenario: Users cannot view Power BI reports within the Power Platform apps.<br>Issue: The people you share with may see a locked tile in a dashboard, or a \"Permission required\" message when they try to view a report.<br>Solution: You need to grant them permission to the underlying dataset.<br>1. Go to the All or the Datasets + dataflows tab in your content list.<br>2. Select More options (...) next to a dataset, then select Manage permissions.<br>3. Select Add user.<br>4. Enter the full email addresses for individuals, distribution groups, or security groups.<br>5. Select Grant access.<br>Box 2: Configure an on-premises data gateway.<br>Scenario: The company plans to reference historical data in the [on-premises] existing system. The records held in these systems will not be migrated to the new solution except for medication information.<br>The on-premises data gateway acts as a bridge to provide quick and secure data transfer between on-premises data (data that isn't in the cloud) and several<br>Microsoft cloud services. These cloud services include Power BI, PowerApps, Power Automate, Azure Analysis Services, and Azure Logic Apps. By using a gateway, organizations can keep databases and other data sources on their on-premises networks, yet securely use that on-premises data in cloud services.<br>Reference:<br>https://docs.microsoft.com/en-us/power-bi/collaborate-share/service-troubleshoot-sharing https://docs.microsoft.com/en-us/power-bi/connect-data/service-gateway-onprem https://docs.microsoft.com/en-us/powerapps/maker/data-platform/use-powerapps-checker",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-24T13:15:00.000Z",
        "voteCount": 40,
        "content": "Assign Power BI License\nConfigure on-prem data gateway"
      },
      {
        "date": "2023-06-25T07:25:00.000Z",
        "voteCount": 2,
        "content": "Assign Power BI license to user is the answer, because according to the Issue \"Users cannot view Power BI reports within the Power Platform apps\" meaning that they have Microsoft 365 accounts and can get into any other apps. Moreover, to visualize data in any Power BI tile or report is required to have a license."
      },
      {
        "date": "2023-05-16T12:06:00.000Z",
        "voteCount": 1,
        "content": "Microsoft 365 (includes Power BI Pro) - https://powerbi.microsoft.com/en-us/pricing/\nOn-prem data gateway"
      },
      {
        "date": "2023-07-09T09:22:00.000Z",
        "voteCount": 1,
        "content": "I dont see anywhere that it says they have an M365 E5 license(s), so you would need a Power BI License"
      },
      {
        "date": "2022-02-20T17:07:00.000Z",
        "voteCount": 2,
        "content": "Assign Power BI License\nConfigure on-prem data gateway"
      },
      {
        "date": "2021-11-21T09:16:00.000Z",
        "voteCount": 4,
        "content": "why is first one be 'assign Power BI licenses?"
      },
      {
        "date": "2022-03-15T12:22:00.000Z",
        "voteCount": 1,
        "content": "and they can already access the Power App so they alreay have access to M365"
      },
      {
        "date": "2022-02-06T04:39:00.000Z",
        "voteCount": 3,
        "content": "I guess because of:\nUsers cannot view Power BI reports within the Power Platform apps.\n\nhttps://powerusers.microsoft.com/t5/Building-Power-Apps/Licensing-question-Power-BI-and-Power-Apps/td-p/527628\n\nIf you want to use Power BI tile control in your canvas app, you need to have sufficient permission to access Power BI features, so you need to own Power BI Pro license at least for your current sign in account."
      },
      {
        "date": "2023-07-09T09:23:00.000Z",
        "voteCount": 1,
        "content": "Because they dont mention having an M365 E5 licenses to M365, so they would need to buy licenses for Power BI for each person and assign them"
      }
    ],
    "examNameCode": "pl-600",
    "topicNumber": "7"
  },
  {
    "topic": 7,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66662-exam-pl-600-topic-7-question-6-discussion/",
    "body": "DRAG DROP -<br>You need to recommend methods for assigning security to each group of users.<br>What should you recommend? To answer, drag the appropriate methods to the correct groups of users. Each method may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04333/0015300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04333/0015400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Power Platform Local Business Owner Team<br>Owner team: An owner team owns records and has security roles assigned to the team. A user's privileges can come from their individual security roles, those of the teams that they're part of or the ones they inherit. A team has full access rights on the records that the team owns. Team members are added manually to the owner team.<br>Scenario: Employee authentication with the existing system is provided by an on-premises Active Directory instance that is linked to Azure Active Directory.<br>Box 2: Azure Active Directory Security Group Team<br>An Azure Active Directory (Azure AD) group team. Similar to owner team, an Azure AD group team can own records and can have security roles assigned to the team.<br>Note: The administration of app and data access for Microsoft Dataverse has been extended to allow administrators to use their organization's Azure Active<br>Directory (Azure AD) groups to manage access rights for licensed Dataverse users.<br>Box 3: Azure Active Directory B2B Guest Access<br>An Azure AD B2B collaboration user is an external user, typically from a partner organization, that you invite to sign into your Azure AD organization using their own credentials. This B2B collaboration user (also generally referred to as a guest user) can then access the apps and resources you want to share with them. A user object is created for the B2B collaboration user in the same directory as your employees. B2B collaboration user objects have limited privileges in your directory by default, and they can be managed like employees, added to groups, and so on.<br>Scenario: Before First Up signs a contract to place workers at a client company, a member of the audit team visits the company and interviews company management. Audit members use different types of devices including Android and iOS devices. First Up has no plans to require the use of a single type of device.<br>Reference:<br>https://docs.microsoft.com/en-us/power-platform/admin/manage-group-teams https://docs.microsoft.com/en-us/azure/active-directory/external-identities/user-properties",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-24T13:16:00.000Z",
        "voteCount": 11,
        "content": "Correct"
      },
      {
        "date": "2021-12-20T19:20:00.000Z",
        "voteCount": 9,
        "content": "Automation - Why not Dataverse Application User?"
      },
      {
        "date": "2022-02-06T04:54:00.000Z",
        "voteCount": 3,
        "content": "I guess because of:\nYou can use server-to-server (S2S) authentication to securely and seamlessly communicate between Dataverse and your web applications and services. S2S authentication is the common way that apps registered on Microsoft AppSource use to access the Dataverse data of their subscribers. All operations performed by your application or service by using S2S will be performed as the application user you provide, rather than the user who's accessing your application.\n\nhttps://docs.microsoft.com/en-us/power-platform/admin/create-users#create-an-application-user\nhttps://docs.microsoft.com/en-us/power-platform/admin/system-application-users"
      },
      {
        "date": "2023-05-29T06:22:00.000Z",
        "voteCount": 1,
        "content": "If automation includes Power Automate flows, an account is required to own the Power Automate licence, configure and use the flows. \"Automation\" is a pretty vague notion in this case, I would not recommend an app user unless we're sure it's what's required."
      },
      {
        "date": "2024-03-12T08:00:00.000Z",
        "voteCount": 2,
        "content": "Azure Active Directory B2B Guest Access for corporate governance auditing team?\nNow I was wondering if the 'auditing team members' are internal or external people?\n\nin favour external people:\n- in many markets active\n- use individual mobile devices\n- audit people may intentionally have some independence to any of their 'clients' a too deep relationship may not been wished, neither to the employer nor to the customer.\n\nin favour internal:\n- special knowledge how to assess a potential customer company\n- the assessment could be delicate data information you don't want to share externally\n- GOVERNANCE as it explicitly says is maybe you want to have internal. (potentially the governance audit team is another team than the international auditing team member, the case study is not so clear here)\n\nmy solution is: Governance is internal stuff. and maybe not even related to the international audit team members. therefore: B2B Guest Access is not an option as it is internal staff. \n\n3 D:  Azure Active Directory Security Group Team"
      },
      {
        "date": "2024-03-12T08:14:00.000Z",
        "voteCount": 1,
        "content": "1) D: Azure Active Directory Security Group Team \n2) A: Dataverse application user  \n3) D: Azure Active Directory Security Group Team\nUnused:\nPower Platform Local Business Onwer Team: too much privileges says gpt when asked specifically\nAzure Active Directory B2B Guest Access: none of the 3 group of users in this question is external to First Up Consulting.\n\nbut: i am not a security nor license expert."
      },
      {
        "date": "2022-09-27T18:42:00.000Z",
        "voteCount": 4,
        "content": "For automation i'll go with app user."
      },
      {
        "date": "2022-09-27T18:43:00.000Z",
        "voteCount": 2,
        "content": "cause we shouldn't waste a license for the time that app users can be helpful."
      },
      {
        "date": "2022-02-20T17:08:00.000Z",
        "voteCount": 1,
        "content": "correct"
      }
    ],
    "examNameCode": "pl-600",
    "topicNumber": "7"
  }
]