[
  {
    "topic": 13,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/119227-exam-mb-220-topic-12-question-1-discussion/",
    "body": "You create a customer survey. Contoso wants to make sure that the survey is accessible to their sales team.<br>You use the survey as part of a customer journey, where you have written conditional logic to create leads based on the survey responses from each contact.<br>These leads will be processed by Contoso's Sales team.<br>The sales team wants to send out surveys whenever they qualify a Lead. Contoso does not want the sales team to have access to the Dynamics 365 Customer<br>Voice app.<br>What should you do to achieve this goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t1. Install the ג€Send Customer Voice survey from Dynamics 365 appג€ in the Sales Hub app. 2. Members of the Sales team can send the survey manually from a Sales Hub app by clicking on the ג€Send Surveyג€ button on the Lead record.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t1. Enable the Dynamics 365 Customer Voice application from the environment in Microsoft Dataverse to enable the feature for all licensed Dynamics 365 applications. 2. Members of the Sales team can send the survey manually from a Sales Hub app by clicking on the ג€Send Surveyג€ button on the Lead record.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t1. Click on ג€Enable Customer Voice on Sales Hubג€. 2. Members of the Sales team can send the survey manually from a Sales Hub app by clicking on the ג€Send Surveyג€ button on the Lead record.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t1. Enable the Dynamics 365 Customer Voice application from the environment in Microsoft Dataverse to enable the feature for all licensed Dynamics 365 applications. 2. Create a Power Automate flow to send a survey automatically every time a lead is qualified."
    ],
    "answer": "D",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/dynamics365/customer-voice/send-survey-from-dynamics-365",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-11-29T02:24:00.000Z",
        "voteCount": 1,
        "content": "Why not B. Enable the Dynamics 365 Customer Voice application from the environment in Microsoft Dataverse to enable the feature for all licensed Dynamics 365 applications. 2. Members of the Sales team can send the survey manually from a Sales Hub app by clicking on the ג€Send Surveyג€ button on the Lead record.\n\nUsing Power Automate sounds defeating the purpose."
      },
      {
        "date": "2024-04-12T00:56:00.000Z",
        "voteCount": 1,
        "content": "\"to enable the feature for all licensed Dynamics 365 applications\"\nusers need a license too for Customer Voice.\n(the \"fo all licensed Dynamics 365 applications\" you license the user not the application?)"
      },
      {
        "date": "2024-04-10T22:43:00.000Z",
        "voteCount": 1,
        "content": "\"Using Power Automate sounds defeating the purpose.\" Why?\n\nI get a bad gut feeling when the sales team says \"every\" because, sooner or later they complain that it does it on \"every\", e.g. 4 leads get qualified for the same customer at the same day (because he is interested in 4 products!) and then the poor customer ends up in getting 4 surveys... leading to the point that people get \"trained to ignore surveys\" and then we ask us why response rates are low. \nbut here i would believe in the case \"every\" scenario"
      },
      {
        "date": "2023-11-29T02:36:00.000Z",
        "voteCount": 2,
        "content": "Or \"The sales team wants to send out surveys whenever they qualify a Lead.\" suggested it's automated not by manual?"
      },
      {
        "date": "2023-08-28T05:07:00.000Z",
        "voteCount": 1,
        "content": "I assume the reason you cant use the 'Send survey' option, is because the survey hasnt been shared with sales team members?\n\"You can only send surveys that are shared with you or created by you. If no surveys are shared with you,\"\nhttps://learn.microsoft.com/en-us/dynamics365/customer-voice/send-survey-from-dynamics-365"
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "12"
  },
  {
    "topic": 13,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/119229-exam-mb-220-topic-12-question-2-discussion/",
    "body": "DRAG DROP -<br>You need to create a Global Customer Survey to capture the responses from your customers.<br>You need to make sure that Contoso's focused customers have the option to choose their preferred language while responding. You also need to automate customer journey actions based on the Customer Survey Response data.<br>Which five actions should you perform in sequence to achieve your goal? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04131/0013800001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04131/0013900001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/dynamics365/marketing/customer-voice",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-10T23:12:00.000Z",
        "voteCount": 1,
        "content": "1)\tCreate a customer survey and \"enable localization option\n2)\tGo to the customer journey designer. Then create… with an email tile\n3)\tSelect the email tile… email elements +add item Customer Voice survey\n4)\tIn the email element section, select a customer voice survey from the lookup field. \n//for me this is a duplication of the step above! But yeah, more detailed\n5)\tAdd an \"if/then tile\" to further understand how contacts engage with the survey\n//you could use it to continue with the journey on customer voice \"has been opened\", \"has been submitted\", \"has been answered\" (answered but not submitted?? Partial answered?)"
      },
      {
        "date": "2024-04-10T23:13:00.000Z",
        "voteCount": 1,
        "content": "Survey: \n-\t2 Options with specific languages listed, but both options do not include all languages to fit with the requirement of a \"global\" survey\n-\tCreate a customer survey and \"enable localization option\": no such option to enable, but maybe this is a clumsy description of what you could do with the \"Customization / languages\""
      },
      {
        "date": "2023-08-28T05:19:00.000Z",
        "voteCount": 1,
        "content": "This is not clear..\nThis is meant for global distribution but the provided answer does not cater for adding all languages (including for North America and Japan).\nAlso I'm not sure how the final if/then statement could add any benefit.."
      }
    ],
    "examNameCode": "mb-220",
    "topicNumber": "12"
  }
]