[
  {
    "topic": 13,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/59349-exam-az-400-topic-13-question-1-discussion/",
    "body": "HOTSPOT -<br>How should you configure the release retention policy for the investment planning depletions suite? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04257/0021100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04257/0021200001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Shared Access Authorization token<br>Every request made against a storage service must be authorized, unless the request is for a blob or container resource that has been made available for public or signed access. One option for authorizing a request is by using Shared Key.<br>Box 2: Azure Storage with HTTPS access<br>Scenario: The mobile applications must be able to call the share pricing service of the existing retirement fund management system. Until the system is upgraded, the service will only support basic authentication over HTTPS.<br>The investment planning application suite will include one multi-tier web application and two iOS mobile application. One mobile application will be used by employees; the other will be used by customers.<br>Reference:<br>https://docs.microsoft.com/en-us/rest/api/storageservices/authorize-with-shared-key",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-12T01:08:00.000Z",
        "voteCount": 26,
        "content": "For the correct questions and answers see: https://www.examtopics.com/discussions/microsoft/view/30619-exam-az-400-topic-18-question-4-discussion/\nThanks to Simon_G for pointing this."
      },
      {
        "date": "2023-05-12T03:30:00.000Z",
        "voteCount": 14,
        "content": "Examtopics continues to inflate it's contributor access pricing but leaving this question wrong, okay."
      },
      {
        "date": "2023-12-24T18:03:00.000Z",
        "voteCount": 1,
        "content": "Questions does not have correct answer options displayed.  As suggested by Def21 and Simon_G. https://www.examtopics.com/discussions/microsoft/view/30619-exam-az-400-topic-18-question-4-discussion/\n\n1. Set default retention policy to 30 days\n2. Set stage retention policy to 60 days"
      },
      {
        "date": "2023-06-04T09:13:00.000Z",
        "voteCount": 4,
        "content": "Same as Topic 8 Question 1.\nhttps://www.examtopics.com/discussions/microsoft/view/49768-exam-az-400-topic-8-question-1-discussion"
      },
      {
        "date": "2023-06-04T09:13:00.000Z",
        "voteCount": 4,
        "content": "1. Shared Access Authorisation Token\n2. Azure Storage with HTTPS access\n\nhttps://learn.microsoft.com/en-us/azure/storage/common/storage-sas-overview\nA shared access signature (SAS) provides secure delegated access to resources in your storage account. With a SAS, you have granular control over how a client can access your data."
      },
      {
        "date": "2022-12-08T21:37:00.000Z",
        "voteCount": 4,
        "content": "It was on my exam on December 7, 2022."
      },
      {
        "date": "2022-08-06T18:21:00.000Z",
        "voteCount": 5,
        "content": "Wrong question for options displayed\n\nIn any case, the answers are\n\nrequired secrets ---&gt; username and password\n(https://docs.microsoft.com/en-us/azure/api-management/api-management-authentication-policies)\nstorage ---&gt;  key vault (pretty much the standard service to go for when it comes to storage of credentials in Azure)"
      },
      {
        "date": "2022-03-29T23:57:00.000Z",
        "voteCount": 5,
        "content": "The question is: \"How should you configure the release retention policy for the investment planning Applications suite?\"\nSo we need to configure a retention policy, that is how long a release should be retained in azure devops. Here authentication methods or storage have nothing to do. The proposed answers are clearly wrong. In fact they appear again in the next question where it is asked for a service to stora mobile app secrets.\nTo set a retetion policy configuration you should go to Project Settings in the Devops portal and choose \"Release retention\".\n\nhttps://docs.microsoft.com/en-us/azure/devops/pipelines/policies/retention?view=azure-devops&amp;tabs=yaml"
      },
      {
        "date": "2022-03-30T00:46:00.000Z",
        "voteCount": 3,
        "content": "This question asks for a solution to the following requirement: \"By default, all releases must remain available for 30 days, except for production releases, which must be kept for 60 days\"\nYou can find the same question but with the correct answer options on Topic 13 question #4."
      },
      {
        "date": "2022-05-18T08:13:00.000Z",
        "voteCount": 9,
        "content": "The correct question+answer is currently Topic 18 Question 4:\nhttps://www.examtopics.com/discussions/microsoft/view/30619-exam-az-400-topic-18-question-4-discussion/"
      },
      {
        "date": "2022-06-06T18:06:00.000Z",
        "voteCount": 1,
        "content": "Thanks for providing the link to the correct question and answer!!!!!"
      },
      {
        "date": "2022-01-31T03:26:00.000Z",
        "voteCount": 3,
        "content": "The image doesn't relate to the question...so wonder how can the answer be token, username, password :))))"
      },
      {
        "date": "2022-01-24T22:30:00.000Z",
        "voteCount": 1,
        "content": "box1:shared access authorization token\nbox2:azure storage with HTTP access"
      },
      {
        "date": "2021-11-12T09:40:00.000Z",
        "voteCount": 1,
        "content": "I don't understand this question. How \"should you configure the release retention policy for the investment planning depletions suite\" relate to the questions?"
      },
      {
        "date": "2021-11-12T09:42:00.000Z",
        "voteCount": 15,
        "content": "The question should be relate to \"The mobile applications must be able to call the share pricing service of the existing retirement fund management system. Until the system is upgraded, the service will only support basic authentication over HTTPS.\"\nBasic authentication is username and password\nAnd the option to store it is AZ Vault"
      },
      {
        "date": "2022-01-25T23:42:00.000Z",
        "voteCount": 1,
        "content": "Exactly this is what I think. And other answers in comments just don't make sense to me"
      },
      {
        "date": "2022-03-26T01:53:00.000Z",
        "voteCount": 1,
        "content": "Vote for this one. Thank you!"
      },
      {
        "date": "2021-10-05T10:33:00.000Z",
        "voteCount": 2,
        "content": "HTTP basic authentication is a simple challenge and response mechanism with which a server can request authentication information (a user ID and password) from a client. And Azure Key Vault is the best way to save the username and password"
      },
      {
        "date": "2021-09-17T11:03:00.000Z",
        "voteCount": 2,
        "content": "Options are not correct"
      },
      {
        "date": "2021-09-23T08:53:00.000Z",
        "voteCount": 1,
        "content": "see q2 topic11"
      },
      {
        "date": "2021-09-25T08:29:00.000Z",
        "voteCount": 6,
        "content": "1. Username and Password\n2. Azure Key vault"
      },
      {
        "date": "2021-08-05T19:53:00.000Z",
        "voteCount": 4,
        "content": "I think the given answer is correct."
      },
      {
        "date": "2021-10-09T13:35:00.000Z",
        "voteCount": 2,
        "content": "I think the storage location is talking about where to store the suite, you can use SAS url to get the suite from azure storage, so the given ans is correct. It's not talking about store secret."
      },
      {
        "date": "2021-10-09T13:42:00.000Z",
        "voteCount": 1,
        "content": "Aha, username and password, key vault is the answers for next question, for this one SAS and Https are the answers"
      },
      {
        "date": "2023-05-15T10:59:00.000Z",
        "voteCount": 1,
        "content": "Sounds right. Question about release retention policy, Which is: By default, all releases must remain available for 30 days, except for production releases, which must be kept for 60 days."
      }
    ],
    "examNameCode": "az-400",
    "topicNumber": "13"
  },
  {
    "topic": 13,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17094-exam-az-400-topic-13-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to configure a cloud service to store the secrets required by the mobile applications to call the share pricing service.<br>What should you include in the solution? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04257/0021300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04257/0021400001.png\" class=\"in-exam-image\">",
    "answerDescription": "Every request made against a storage service must be authorized, unless the request is for a blob or container resource that has been made available for public or signed access. One option for authorizing a request is by using Shared Key.<br>Scenario: The mobile applications must be able to call the share pricing service of the existing retirement fund management system. Until the system is upgraded, the service will only support basic authentication over HTTPS.<br>The investment planning applications suite will include one multi-tier web application and two iOS mobile applications. One mobile application will be used by employees; the other will be used by customers.<br>Reference:<br>https://docs.microsoft.com/en-us/rest/api/storageservices/authorize-with-shared-key",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-21T04:56:00.000Z",
        "voteCount": 93,
        "content": "Basic authentication uses username and password, and an ideal place to store those is in KeyVault"
      },
      {
        "date": "2020-05-05T05:01:00.000Z",
        "voteCount": 3,
        "content": "Agreed.\nBasic auth - base64-encoded username:password string.\nBest place to store those is in Key Vault.\nMobile app accesses AKV with managed identity."
      },
      {
        "date": "2020-04-06T01:55:00.000Z",
        "voteCount": 3,
        "content": "This is for acessing azure storage. APP user cannot access storage with username and password. And key vault can not be used here. Imagine those aren't B2B or B2C users of aad"
      },
      {
        "date": "2020-06-07T09:20:00.000Z",
        "voteCount": 10,
        "content": "There is no storage there !\nAnswer is : \n1. Username and password \n2. key vault"
      },
      {
        "date": "2020-08-01T02:29:00.000Z",
        "voteCount": 4,
        "content": "You need to configure a cloud service to store the secrets required by the mobile applications to call the share pricing service."
      },
      {
        "date": "2020-05-23T11:24:00.000Z",
        "voteCount": 11,
        "content": "Since only Basic Authentication is available: it has to be username and password \nAs everyone knows the best place to store is : KeyVault"
      },
      {
        "date": "2024-01-22T03:29:00.000Z",
        "voteCount": 1,
        "content": "1 Secrets\n2 KeyVault\n\nExplanation:\nThe authentication method used to connect to the Azure Key Vault (where the secrets are stored) and the authentication method used by your mobile application to connect to the share pricing service of the legacy system are two separate things.\n\nThe Azure Key Vault uses Azure Active Directory for authentication, which is more secure than basic authentication. Your mobile application would use this method (not basic auth) to retrieve the secrets (like username and password) from the Key Vault\n\nRemember, the basic authentication here is between your mobile application and the legacy system, not between your mobile application and Azure Key Vault."
      },
      {
        "date": "2023-07-03T17:42:00.000Z",
        "voteCount": 1,
        "content": "Configure your mobile applications to can call the share pricing service and configure a cloud service to store the secrets required\n\n1. Username and password, because is Basic authentication over HTTPS.\n2. Azure Key Vault, is the recommended storage location for secure storing secrets (Username and password)\n\nShared Access Authorization Token, may not be the most suitable option, if the app only supports basic authentication typically requires providing the username and password, however Shared Access Authorization Token is a token-based authentication (e.g. OAuth or JWT)"
      },
      {
        "date": "2023-04-28T11:08:00.000Z",
        "voteCount": 1,
        "content": "To store the secrets required by the mobile applications to call the share pricing service, you should select the following options:\n\nRequired secrets:\nc. Shared access authorization token\n\nStorage location:\nb. Personal key vault\n\nThese options ensure secure storage of the required secrets and minimize the risk of unauthorized access. Shared access authorization token can be used for authentication with the service, and a personal key vault can be used to securely store and manage the tokens. Azure Storage with HTTP/HTTPS access and Azure Data Lake are not appropriate for storing secrets as they are not designed for secure secret management."
      },
      {
        "date": "2024-05-14T10:38:00.000Z",
        "voteCount": 2,
        "content": "The question is only part of a case study. One of the requirements is:\n\"The mobile applications must be able to call the share pricing service of the existing retirement fund management system. Until the system is upgraded, the service will only support basic authentication over HTTPS.\".\nSo the \"Shared Access Authorization token\" is not correct, basic authentication requires \"username and password\"."
      },
      {
        "date": "2022-12-25T02:11:00.000Z",
        "voteCount": 2,
        "content": "Basic Authentication sends a Base64 encoded string (could be the shared token) that contains a user name and password for the client via HTTP headers."
      },
      {
        "date": "2022-12-08T21:38:00.000Z",
        "voteCount": 2,
        "content": "It was on my exam on December 7, 2022."
      },
      {
        "date": "2022-10-04T07:04:00.000Z",
        "voteCount": 1,
        "content": "i think that answer is right. \nYou cannot call KeyVault from app because it need to impersonate a user. \nThe only way, for me is to apply a keyvallet pattern in app to obtain the sas token. After this you can call a storage for having the authetication information for basic auth to the service."
      },
      {
        "date": "2022-08-06T18:26:00.000Z",
        "voteCount": 1,
        "content": "required secrets ---&gt; username and password\n(https://docs.microsoft.com/en-us/azure/api-management/api-management-authentication-policies)\nstorage ---&gt; key vault (pretty much the standard service to go for when it comes to storage of credentials in Azure)"
      },
      {
        "date": "2022-05-18T20:45:00.000Z",
        "voteCount": 1,
        "content": "1) certificate\n2) azure key vault"
      },
      {
        "date": "2022-03-29T23:28:00.000Z",
        "voteCount": 3,
        "content": "Basic authentication means username and password\nhttps://developer.mozilla.org/en-US/docs/Web/HTTP/Authentication#basic_authentication_scheme\n\nThe best cloud service to save them is Azure Key Vault"
      },
      {
        "date": "2022-01-24T22:32:00.000Z",
        "voteCount": 2,
        "content": "There is no storage there \nit is for mobile applications to call \n1. Username and password\n2. key vault"
      },
      {
        "date": "2021-02-10T11:43:00.000Z",
        "voteCount": 6,
        "content": "Correct answer is 1. Username and Password\n2. Azure Key vault"
      },
      {
        "date": "2020-12-18T07:31:00.000Z",
        "voteCount": 5,
        "content": "The only problem I see with using the Key Vault is how the Mobile Application using IOS will register with AAD to get a Service Principal able to retrieve the secret. https://docs.microsoft.com/en-us/azure/key-vault/general/authentication \nfor that reason I think the proposed solution with Storage account holding the username and password in a json file can be retrieved by the app to authenticate."
      },
      {
        "date": "2021-02-03T13:03:00.000Z",
        "voteCount": 2,
        "content": "You are right. It would be required to register an application in AAD. The shared token is much easily."
      },
      {
        "date": "2020-08-14T04:05:00.000Z",
        "voteCount": 7,
        "content": "Here you can find a solution for the exact example:\nhttps://github.com/MicrosoftLearning/AZ-203-DevelopingSolutionsforMicrosoftAzure/blob/master/Instructions/Labs/AZ-203_04_lab_ak.md\nAs you can see TLS enabled storage and HTPPS also using connection string to access with password via a Key Vault. \nBut this is a mobile app going through a PSN Service. I think the given answer is correct."
      },
      {
        "date": "2020-07-07T01:15:00.000Z",
        "voteCount": 1,
        "content": "For sure 2nd: Azure Key Vault because  'Requests to the Azure Key Vault are directed to a valid Azure Key Vault URL using HTTPS with some URL parameters and JSON encoded request and response bodies'"
      },
      {
        "date": "2020-05-10T04:31:00.000Z",
        "voteCount": 1,
        "content": "for that you have to \n1- Generate a shared access key on the storage account \n2- store this key in the key vault"
      }
    ],
    "examNameCode": "az-400",
    "topicNumber": "13"
  },
  {
    "topic": 13,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17259-exam-az-400-topic-13-question-3-discussion/",
    "body": "DRAG DROP -<br>Which package feed access levels should be assigned to the Developers and Team Leaders groups for the investment planning applications suite? To answer, drag the appropriate access levels to the correct groups. Each access level may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04257/0021500001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04257/0021600001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Reader -<br>Members of a group named Developers must be able to install packages.<br>Feeds have four levels of access: Owners, Contributors, Collaborators, and Readers. Owners can add any type of identity-individuals, teams, and groups-to any access level.<br><br>Box 2: Owner -<br>Members of a group named Team Leaders must be able to create new packages and edit the permissions of package feeds.<br><img src=\"/assets/media/exam-media/04257/0021700001.png\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-17T07:37:00.000Z",
        "voteCount": 56,
        "content": "https://docs.microsoft.com/en-us/azure/devops/organizations/security/permissions-access?view=azure-devops#azure-artifacts\n1. Developers - Reader\n2. Team Leaders - Owner"
      },
      {
        "date": "2020-03-29T11:55:00.000Z",
        "voteCount": 26,
        "content": "Members of a group named Developers must be able to install packages.\nReader permission is sufficient for the developers."
      },
      {
        "date": "2023-08-08T00:42:00.000Z",
        "voteCount": 1,
        "content": "As evidenced from the table in the answer itself, provided solution is correct"
      },
      {
        "date": "2023-06-04T09:43:00.000Z",
        "voteCount": 3,
        "content": "1. Reader\n2. Owner\n\nhttps://learn.microsoft.com/en-us/azure/devops/artifacts/feeds/feed-permissions?view=azure-devops#permissions-table"
      },
      {
        "date": "2022-12-08T21:38:00.000Z",
        "voteCount": 5,
        "content": "It was on my exam on December 7, 2022."
      },
      {
        "date": "2022-08-07T02:49:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/azure/devops/artifacts/feeds/feed-permissions?view=azure-devops#permissions-table\n\nGiven answer is correct"
      },
      {
        "date": "2022-03-30T00:17:00.000Z",
        "voteCount": 1,
        "content": "correct answer and explanation"
      },
      {
        "date": "2022-02-11T07:14:00.000Z",
        "voteCount": 2,
        "content": "Got this case study in Feb-2022."
      },
      {
        "date": "2022-01-24T21:43:00.000Z",
        "voteCount": 2,
        "content": "1. Developers - Reader\n2. Team Leaders - Owner"
      },
      {
        "date": "2021-03-03T11:15:00.000Z",
        "voteCount": 2,
        "content": "It is correct"
      },
      {
        "date": "2021-02-10T12:34:00.000Z",
        "voteCount": 2,
        "content": "Given Answer is Correct"
      },
      {
        "date": "2020-05-23T09:04:00.000Z",
        "voteCount": 9,
        "content": "Members of a group named Developers must be able to install packages.\nAns &gt;&gt; Developer can have Reader Permission \n\nMembers of a group named Team Leaders must be able to create new packages and edit the permissions of package feeds.\nAns &gt;&gt; Team Leaders can have Owner Permission to edit permissions of the package feed. Without owner its not possible to edit permission \n\nCollaborator &amp; Contributor  is not sufficient for TL as it can not edit permission \n\nhttps://docs.microsoft.com/en-us/azure/devops/artifacts/feeds/feed-permissions?view=azure-devops"
      },
      {
        "date": "2020-05-14T20:00:00.000Z",
        "voteCount": 15,
        "content": "Given Answers are correct"
      },
      {
        "date": "2020-03-23T22:04:00.000Z",
        "voteCount": 8,
        "content": "Should work reader"
      },
      {
        "date": "2020-03-22T09:31:00.000Z",
        "voteCount": 3,
        "content": "The developers must have Contributors access level.  Readers access will not work."
      },
      {
        "date": "2020-08-13T07:43:00.000Z",
        "voteCount": 12,
        "content": "You can install packages with Reader access.\n\nhttps://docs.microsoft.com/en-us/azure/devops/artifacts/feeds/feed-permissions?view=azure-devops"
      }
    ],
    "examNameCode": "az-400",
    "topicNumber": "13"
  }
]