[
  {
    "topic": 17,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/38687-exam-mb-310-topic-17-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to determine the root cause for User1's issue.<br>Which configuration options should you check? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04326/0013100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04326/0013200001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2022-03-20T10:59:00.000Z",
        "voteCount": 1,
        "content": "User1 indicates that after packing slips are generated for purchase orders, there are no ledger postings.\n\nThe issues related to ledger posing.\nComputer -&gt; non stock -&gt; purchasing policy\nBarrels -&gt; item groups\n\nitem model group -&gt; inventory dimension\nprocurement category -&gt; product attribute."
      },
      {
        "date": "2021-04-12T00:05:00.000Z",
        "voteCount": 4,
        "content": "I provided the wrong answer in previous comment. The correct answer for Computer is Purchase policies if Computer is setup as a procurement category. Answer for barrel remains the same i.e. Item model group."
      },
      {
        "date": "2021-04-29T02:31:00.000Z",
        "voteCount": 4,
        "content": "computers are part of rental policies so answer should be purchasing policies\noffice rent is only paid and dosent transit from purch order"
      },
      {
        "date": "2021-04-11T23:24:00.000Z",
        "voteCount": 2,
        "content": "Both stocked and non-stocked item require item model group. In this context, Item groups controls actual ledger posting I.e. GL accounts while Item model group controls ledger integration (posting of physical and financial inventory), cost recognition options, inventory policy e.t.c. Relevant settings ‘post physical inventory’ and ‘accrue liability on product receipt’. If we assume Computer refers to a procurement category, then it will not normally produce a ledger transaction on receipt. Therefore, the correct answers are Procurement category for computer and item model group for barrels, assuming the correct posting setup (standard or item group) has been applied of course."
      },
      {
        "date": "2020-12-09T04:28:00.000Z",
        "voteCount": 2,
        "content": "Computer if fixed asset, does not have Item Model Group include physical checkbox, because stocked checkbox is not checked for a fixed asset. However, for inventory item like Barrel, the checkbox \"Include physical value\" in item model group is enabled and should be ticked.\n\nSo in case of Computer (a fixed asset), answer should be Item Group, and in case of barrel (inventoried item), it should be Item model group to have checkbox \"Include physical value\"."
      },
      {
        "date": "2021-04-11T21:29:00.000Z",
        "voteCount": 3,
        "content": "Both stocked and non stocked item require item model group. The include physical value option relates to whether inventory transactions are created. This should not be confused with packing slip option. So computer and barrel, both require item model group. As the question did not differentiate between types of purchase orders, the answer would be same for stocked and non stocked items."
      },
      {
        "date": "2020-12-03T09:42:00.000Z",
        "voteCount": 4,
        "content": "Barrels--it should be Item model group--Physical posting is not ticked."
      }
    ],
    "examNameCode": "mb-310",
    "topicNumber": "17"
  },
  {
    "topic": 17,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/38688-exam-mb-310-topic-17-question-2-discussion/",
    "body": "DRAG DROP -<br>You need to process expense allocations.<br>Which features should you use? To answer, drag the appropriate features to the correct requirements. Each feature may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04326/0013300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04326/0013300002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/dynamics365/finance/general-ledger/ledger-allocation-rules",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-03T09:45:00.000Z",
        "voteCount": 19,
        "content": "Postage expense-should this not be main account allocation (terms) as it is requirement automatically."
      },
      {
        "date": "2021-12-09T05:05:00.000Z",
        "voteCount": 7,
        "content": "For Process postage expensive is right answer Main account allocation (means Allocation terms), because there is a requirement \"AUTOMATICALLY\". \nFor Administrative expenses is right answer Ledger allocation rules (method of BASIS, which can distribute by percentage), because this action occurs monthly (not immediatly with posting)."
      },
      {
        "date": "2024-03-23T06:05:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct. In main account allocation terms you have to define percentage manually."
      },
      {
        "date": "2022-07-19T11:34:00.000Z",
        "voteCount": 1,
        "content": "Agree with Jay28 and Berda; though Postage expense could *almost* be accomplished with ledger allocation rules, LARs will not perform the allocation automatically; allocation terms (they frustratingly call this main account allocation) are required to do that."
      },
      {
        "date": "2021-05-31T00:27:00.000Z",
        "voteCount": 2,
        "content": "Correct \nEvenly and percentage are methods defined by Ledger allocation Rules"
      }
    ],
    "examNameCode": "mb-310",
    "topicNumber": "17"
  },
  {
    "topic": 17,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/38691-exam-mb-310-topic-17-question-3-discussion/",
    "body": "You need to configure system functionality for pickle type reporting.<br>What should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\titem model groups",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\titem groups",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tprocurement category hierarchies",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tfinancial dimensions\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tprocurement categories"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-01-15T11:14:00.000Z",
        "voteCount": 9,
        "content": "It says that pickles are posted to a single account for revenue, but I feel they are leaning more to the idea that you can utilize item groups for reporting without bringing product specific information into financial dimensions. Even the use of product dimensions is an applicable thought, but in my experience I wouldn't think a financial dimension is the right call in the real world. If the question had said, financially report by pickle type/cut, then I could agree with dimensions."
      },
      {
        "date": "2022-12-20T04:07:00.000Z",
        "voteCount": 1,
        "content": "Where have you seen Item Groups being used in reporting? Financial dimensions are only available for reporting as far as I know."
      },
      {
        "date": "2024-06-23T23:04:00.000Z",
        "voteCount": 2,
        "content": "Currently, Pickle Sales post to one revenue account, but this does not allow for targeted reporting by pickle cut and type \n\nSo, Financial dimensions allow you to categorize transactions and generate customized reports."
      },
      {
        "date": "2021-05-31T00:20:00.000Z",
        "voteCount": 1,
        "content": "Item Group"
      },
      {
        "date": "2020-12-09T04:36:00.000Z",
        "voteCount": 1,
        "content": "D. Financial dimension is correct answer, as mentioned in question, the postings is into one main account which does not help in reporting. That is the main reason for financial dimensions to come into being.\n\nIt can be two Custom financial dimensions for Cut and Type as mentioned by Jay."
      },
      {
        "date": "2020-12-03T09:49:00.000Z",
        "voteCount": 1,
        "content": "financial dimensions is probably more suitable. if a pickle (single product) has a 'cut' and 'type' and we want to analyse it, it is possible by assigning the 2 dimensions to it and analyse overall pickle revenue by cut/type."
      }
    ],
    "examNameCode": "mb-310",
    "topicNumber": "17"
  }
]