[
  {
    "topic": 10,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82894-exam-pl-100-topic-10-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to select data types for the app.<br>Which data type should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04323/0012600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0012700001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Choice -<br>Students select one main cuisine to specialize in when applying for enrollment.<br>A choice (picklist) is a type of column that can be included in a table. It defines a set of options. When a choice is displayed in a form it uses a drop-down list control. When displayed in Advanced Find it uses a picklist control. Sometimes choices are called picklists by developers.<br>You can define a choice to use a set of options defined within itself (locally) or it can use a set of options defined elsewhere (globally) which can be used by other choice columns.<br>Global choices are useful when you have a standard set of categories that can apply to more than one column. Maintaining two separate choices with the same values is difficult and if they are not synchronized you can see errors, especially if you are mapping table columns in a one-to-many table relationship.<br>Note: If you define every choice as a global choice your list of global choices will grow and could be difficult to manage. If you know that the set of options will only be used in one place, use a local choice.<br><br>Box 2: Global choice -<br>The college generates a QR code for high-volume subscribers to allow staff to vote for their favorite dishes.<br>Subscribers should be able to mark a dish as favorite directly from their order.<br><br>Box 3: Whole number -<br>Dish votes are counted based on the number of people who marked the dish as a favorite.<br>Reference:<br>https://docs.microsoft.com/en-us/power-apps/maker/data-platform/create-edit-global-option-sets",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-02T05:03:00.000Z",
        "voteCount": 12,
        "content": "1. Cuisine spesialisation is used in cooking classes, student enrollments and in credit tracking. Therefore, I would choose a Global choice.\n2. For Favorit dish a Yes/No-choice will do. If you need to keep track of people that not have voted for a dish I would advise Choice, with 3 choices: Yes/No/'blank'.\n3. Dish votes are counted based on the number of people who marked the dish as a favorite, Whole Number."
      },
      {
        "date": "2024-03-24T04:27:00.000Z",
        "voteCount": 1,
        "content": "Choice\nYes/No\nWhole Number"
      },
      {
        "date": "2023-01-07T23:03:00.000Z",
        "voteCount": 3,
        "content": "Choice - Yes/No - Whole Number"
      },
      {
        "date": "2022-12-28T13:52:00.000Z",
        "voteCount": 3,
        "content": "Subscribers should be able to mark a dish as favourite directly from their order. \nI think YES or No is sufficient for question 2."
      },
      {
        "date": "2022-11-14T01:13:00.000Z",
        "voteCount": 4,
        "content": "the second box shouldn't be yes/no ?"
      },
      {
        "date": "2022-09-20T02:14:00.000Z",
        "voteCount": 2,
        "content": "seems right"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/84358-exam-pl-100-topic-10-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to select tables to use for the main personas in the college implementation.<br>What should you use for each persona? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04323/0012900001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0013000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Microsoft Dataverse with User table<br>The instructors split the students in groups of five to seven students, depending on the specialty selected. Each instructor is in charge of one group of students.<br>User and team management is the area of Microsoft Dataverse where you can create and maintain user accounts and profiles.<br>* A user is any person who works for a business unit who uses Dataverse. Each user has a user account. All users must be associated with only one business unit. This association controls which customer data the user will have access to. Included in the user's account is information such as the user's telephone numbers, email address, and a link to the user's manager. Each user has privileges and rights to manage their own personal settings. Each user corresponds to a user in the Azure Active Directory for that organization. When you create a user, you must assign the user to at least one security role. Even if the user is part of a team that has assigned roles, the user should be assigned to a role.<br>* A team is a group of users. Teams let users across an organization collaborate and share information.<br>Box 2: Microsoft Dataverse for Teams<br>Students self-organize in teams and brainstorm to produce new recipes.<br>Students team up together to create new recipes and must keep their recipes confidential.<br>* A team is a group of users. Teams let users across an organization collaborate and share information.<br>Box 3: Microsoft Dataverse with the Contact table<br>The account and contact tables in Microsoft Dataverse are essential for identifying and managing customers, selling products and services, and providing superior service to the customers<br>Reference:<br>https://docs.microsoft.com/en-us/power-apps/developer/data-platform/user-team-entities https://docs.microsoft.com/en-us/power-apps/developer/data-platform/customer-entities-account-contact",
    "votes": [],
    "comments": [
      {
        "date": "2022-11-14T01:17:00.000Z",
        "voteCount": 14,
        "content": "USER / USER / CONTACT"
      },
      {
        "date": "2023-03-13T12:31:00.000Z",
        "voteCount": 1,
        "content": "Agree with the solutions. but what is the question being asked explicitly?"
      },
      {
        "date": "2022-12-28T23:36:00.000Z",
        "voteCount": 3,
        "content": "User\nUser\nContact\n\nI think the description in the answer for the second question suggest because the students work in teams physically they utilise Microsoft Teams however I think USER is required."
      },
      {
        "date": "2022-10-04T09:07:00.000Z",
        "voteCount": 1,
        "content": "User table\nContact table\nContact table"
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/93559-exam-pl-100-topic-10-question-3-discussion/",
    "body": "HOTSPOT -<br>You need to create the solution for subscriber orders.<br>What should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04323/0013200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04323/0013200002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Create a portal page -<br>Occasional and high-volume subscribers must be able to place orders online.<br>Use Power Apps portals to create external-facing websites that allow users outside their organizations to sign in with a wide variety of identities, create and view data in Dataverse, or even browse content anonymously.<br>Note:<br>Subscribers place orders from a menu published by the instructors. The menu displays all the dishes and quantities that students will create during a cooking lesson.<br>Subscribers place orders from a menu published by the instructors. The menu displays all the dishes and quantities that students will create during a cooking lesson.<br><br>Requirements. Subscriptions -<br>ג€¢    The subscriber administrators must approve the credit terms for high-volume subscribers.<br>ג€¢    Occasional and high-volume subscribers must be able to place orders online.<br>ג€¢    Subscribers should be able to mark a dish as favorite directly from their order.<br>Box 2: Create a connection using the SQL Server connector to the SQL subscriber data.<br>Current environment. Current systems<br>The college manages subscribers and their dish preferences by using a SQL Server-based app that is hosted in the college's on-premises datacenter. Each week, data is ex-tracted as a Microsoft Excel workbook and distributed to instructors.<br>Reference:<br>https://docs.microsoft.com/en-us/power-apps/maker/portals/",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-21T09:06:00.000Z",
        "voteCount": 6,
        "content": "Got this case study in 11/21/2023 exam. Total 6 questions from it. go through all questions related from this case study. Community discussions help a lot."
      },
      {
        "date": "2023-03-23T10:44:00.000Z",
        "voteCount": 4,
        "content": "1. Portal pages external facing website.\n2. import data via dataflow to dataverse. portal pages only works with dataverse."
      },
      {
        "date": "2023-03-12T00:23:00.000Z",
        "voteCount": 2,
        "content": "A. Portal Page (In Subscription Section mentioned: \"subscribers must be able to place order online\")\nB. Import using data-flow (Pages use dataverse)"
      },
      {
        "date": "2023-01-11T04:03:00.000Z",
        "voteCount": 2,
        "content": "1. Create a Portal Page\n2. The college manages subscribers and their dish preferences by using a SQL Server-based app that is hosted in the college's on-premises datacenter. So it should be Import data through on-premises data gateway"
      },
      {
        "date": "2023-01-07T23:05:00.000Z",
        "voteCount": 3,
        "content": "Correct"
      },
      {
        "date": "2023-01-02T05:21:00.000Z",
        "voteCount": 2,
        "content": "1. Solution needs to be available to the public: Portal page\n2. If you just need sample data, I would go for Excel becasue this the least work. If the sample data needs to be updated regularly from SQL during development/testing. If you need to write back to SQL a connector."
      }
    ],
    "examNameCode": "pl-100",
    "topicNumber": "10"
  }
]