[
  {
    "topic": 11,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/41638-exam-az-303-topic-11-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to meet the connection requirements for the New York office.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03862/0059600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03862/0059700001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Create a virtual network gateway and a local network gateway.<br>Azure VPN gateway. The VPN gateway service enables you to connect the VNet to the on-premises network through a VPN appliance. For more information, see<br>Connect an on-premises network to a Microsoft Azure virtual network. The VPN gateway includes the following elements:<br>✑ Virtual network gateway. A resource that provides a virtual VPN appliance for the VNet. It is responsible for routing traffic from the on-premises network to the<br>VNet.<br>✑ Local network gateway. An abstraction of the on-premises VPN appliance. Network traffic from the cloud application to the on-premises network is routed through this gateway.<br>✑ Connection. The connection has properties that specify the connection type (IPSec) and the key shared with the on-premises VPN appliance to encrypt traffic.<br>✑ Gateway subnet. The virtual network gateway is held in its own subnet, which is subject to various requirements, described in the Recommendations section below.<br>Box 2: Configure a site-to-site VPN connection<br>On premises create a site-to-site connection for the virtual network gateway and the local network gateway.<br><img src=\"/assets/media/exam-media/03862/0059800001.jpg\" class=\"in-exam-image\"><br>Scenario: Connect the New York office to VNet1 over the Internet by using an encrypted connection.<br>Incorrect Answers:<br>Azure ExpressRoute: Established between your network and Azure, through an ExpressRoute partner. This connection is private. Traffic does not go over the internet.<br>References:<br>https://docs.microsoft.com/en-us/azure/architecture/reference-architectures/hybrid-networking/vpn",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-16T02:59:00.000Z",
        "voteCount": 17,
        "content": "correct answers.\nhttps://docs.microsoft.com/de-de/learn/modules/connect-on-premises-network-with-vpn-gateway/3-exercise-prepare-azure-and-on-premises-vnets-using-azure-cli-commands"
      },
      {
        "date": "2021-01-23T19:44:00.000Z",
        "voteCount": 7,
        "content": "given answer is correct."
      },
      {
        "date": "2021-11-19T08:10:00.000Z",
        "voteCount": 1,
        "content": "Today 19/11/21. No use case of this help platform appeared in my exam. Score 860."
      },
      {
        "date": "2021-08-30T20:20:00.000Z",
        "voteCount": 3,
        "content": "Connect the New York office to VNet1 over the Internet by using an encrypted connection.\n\nhttps://docs.microsoft.com/en-us/azure/vpn-gateway/vpn-gateway-howto-site-to-site-classic-portal\n\nA Site-to-Site VPN gateway connection is used to connect your on-premises network to an Azure virtual network over an IPsec/IKE (IKEv1 or IKEv2) VPN tunnel. \n\nhttps://docs.microsoft.com/en-us/azure/vpn-gateway/tutorial-site-to-site-portal\n\nIn this tutorial, you learn how to:\n\nCreate a virtual network\nCreate a VPN gateway\nCreate a local network gateway\nCreate a VPN connection\nVerify the connection\nConnect to a virtual machine\n\nAnswer is correct"
      },
      {
        "date": "2021-07-12T09:13:00.000Z",
        "voteCount": 1,
        "content": "They didn't mention that in the New york office there is a VPN gateway. \n\"Contoso has data centers in the Montreal and Seattle offices. Each data center has a firewall that can be configured as a VPN device.\""
      },
      {
        "date": "2021-06-30T10:26:00.000Z",
        "voteCount": 2,
        "content": "Answer is correct. Since one of the requirements are: \"Connect the New York office to VNet1 over the Internet by using an encrypted connection.\" Accordingly, the connection is VPN where Virtual networking gateway, local gateway and Site to site connection is needed."
      },
      {
        "date": "2021-05-06T16:12:00.000Z",
        "voteCount": 3,
        "content": "Correct Answers!"
      },
      {
        "date": "2021-01-24T12:09:00.000Z",
        "voteCount": 2,
        "content": "This case study seems to be incomplete in the az303 section. refer to this link for other questions : https://www.examtopics.com/exams/microsoft/az-103/view/36/"
      },
      {
        "date": "2021-01-06T06:00:00.000Z",
        "voteCount": 2,
        "content": "Answer #1 should be \"Create a virtual network gateway only\", local network gateway couldn't be created on Azure portal but at on-premise environment."
      },
      {
        "date": "2021-01-16T14:43:00.000Z",
        "voteCount": 5,
        "content": "What they mean, is azure resource describing the existence of local network gateway, not the device itself. In this meaning it can be created in Azure."
      },
      {
        "date": "2021-01-09T07:26:00.000Z",
        "voteCount": 5,
        "content": "Create local gateway from azure: https://docs.microsoft.com/en-us/azure/vpn-gateway/tutorial-site-to-site-portal#:~:text=Location%3A%20East%20US-,From%20the%20Azure%20portal%2C%20in%20Search%20resources%2C%20services%2C%20and,Create%20local%20network%20gateway%20page."
      },
      {
        "date": "2021-01-12T12:08:00.000Z",
        "voteCount": 9,
        "content": "you are wrong. The given answers are correct."
      }
    ],
    "examNameCode": "az-303",
    "topicNumber": "11"
  }
]