[
  {
    "topic": 12,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/82084-exam-az-305-topic-12-question-1-discussion/",
    "body": "HOTSPOT -<br>You plan to migrate DB1 and DB2 to Azure.<br>You need to ensure that the Azure database and the service tier meet the resiliency and business requirements.<br>What should you configure? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04224/0008100001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04224/0008200001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: An Azure SQL Database elastic pool<br>Scenario:<br>* Resiliency Requirements. Once migrated to Azure, DB1 and DB2 must meet the following requirements:<br>Maintain availability if two availability zones in the local Azure region fail.<br>Fail over automatically.<br>Minimize I/O latency.<br>* Litware identifies the following business requirements:<br>Minimize administrative effort.<br>Minimize costs.<br>Box 2: Business Critical",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-09T23:44:00.000Z",
        "voteCount": 24,
        "content": "&gt; Database: \"An Azure SQL Database elastic pool\"\n&gt; Service Tier: \"Business Critical\"\n\nReference &amp; explanations:\nhttps://www.examtopics.com/discussions/microsoft/view/68044-exam-az-305-topic-9-question-1-discussion/"
      },
      {
        "date": "2023-01-23T08:32:00.000Z",
        "voteCount": 5,
        "content": "The reference you provided suggests that \"SQL Managed Instance\" is the answer"
      },
      {
        "date": "2023-12-14T16:56:00.000Z",
        "voteCount": 14,
        "content": "Today (14-DEC-2023) I took the AZ-305 exam and passed. Thanks to Examtopics and all members who participated in discussing AZ-305 Questionnaire and answers. This site has helped me greatly. Majority questions I had in the exam are in this set. I had Litware Test case in the exam. Thanks."
      },
      {
        "date": "2024-10-12T11:45:00.000Z",
        "voteCount": 1,
        "content": "as per microsoft , \" Zone-redundant configuration is in public preview for the General Purpose service tier and generally available for the Business Critical service tier.\" accordingly, the answer should be :\n1. Azure SQL Managed Instance for the database\n2. Business Critical service tier"
      },
      {
        "date": "2023-09-26T08:40:00.000Z",
        "voteCount": 1,
        "content": "What is different? https://www.examtopics.com/discussions/microsoft/view/68044-exam-az-305-topic-9-question-1-discussion/"
      },
      {
        "date": "2023-08-16T04:13:00.000Z",
        "voteCount": 3,
        "content": "Elastic and Business Critical for both questions... you should never use preview in prod, so you cannot choose managed instance!"
      },
      {
        "date": "2023-07-05T20:38:00.000Z",
        "voteCount": 12,
        "content": "1. Database: c. An Azure SQL Database elastic pool\n2. Service tier: b. Business Critical\n\nExplanation:\n\nAn Azure SQL Database Elastic Pool is a shared resource model that enables higher resource utilization efficiency. It allows multiple databases to share the same resources, which will be beneficial in this case where there are two databases, DB1 and DB2, to be migrated.\n\nBusiness Critical service tier provides high availability and low latency, and it is fully managed, which aligns with the business requirement to minimize administrative effort and the technical requirement to maintain availability if two availability zones fail. As you pointed out, the zone redundancy is still in preview for Managed Instances which can't guarantee the desired level of stability and reliability."
      },
      {
        "date": "2023-06-19T02:38:00.000Z",
        "voteCount": 2,
        "content": "any thoughts on this please as zone redundancy is not supported for  Azure SQL General Purpose. This would make it the most cost effective option above business critical.\n\nhttps://techcommunity.microsoft.com/t5/azure-sql-blog/zone-redundancy-for-azure-sql-database-general-purpose-tier/ba-p/3280376"
      },
      {
        "date": "2023-05-24T09:53:00.000Z",
        "voteCount": 4,
        "content": "1. Azure SQL Managed Instance for the database \n2. Business Critical service tier\n\nAzure SQL Managed Instance provides automatic failover within an availability zone and can be configured with auto-failover groups for cross-region disaster recovery. The Business Critical service tier provides high availability with several readable secondary replicas and fast failover within an availability zone. This configuration meets Litware’s requirements for maintaining availability if two availability zones in the local Azure region fail, failing over automatically, and minimizing I/O latency.\n\nAn Azure SQL Database Elastic Pool is a cost-effective solution for managing and scaling multiple databases that have varying and unpredictable resource demands. However, based on the information provided in the case study, it does not appear to be the best option for meeting Litware’s resiliency requirements for DB1 and DB2. Azure SQL Managed Instance would be a better choice for meeting these requirements."
      },
      {
        "date": "2023-04-29T13:07:00.000Z",
        "voteCount": 12,
        "content": "The given answer is correct:\n1. Azure SQL Database elastic pool\n2. Business Critical\nI had this case study on my exam today, and I passed it with 979"
      },
      {
        "date": "2023-02-25T09:55:00.000Z",
        "voteCount": 3,
        "content": "1. Azure SQL DB elastic pool\n2. Business Critical\n\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/service-tiers-sql-database-vcore?view=azuresql#when-to-choose-this-service-tier-1\nhe Business Critical service tier is designed for applications that require low-latency responses from the underlying SSD storage (1-2 ms in average), faster recovery if the underlying infrastructure fails, or need to off-load reports, analytics, and read-only queries to the free of charge readable secondary replica of the primary database.\n\nThe key reasons why you should choose Business Critical service tier instead of General Purpose tier are:\n- Low I/O latency requirements – workloads that need a consistently fast response from the storage layer (1-2 milliseconds in average) should use Business Critical tier."
      },
      {
        "date": "2023-02-25T09:55:00.000Z",
        "voteCount": 2,
        "content": "https://learn.microsoft.com/en-us/azure/azure-sql/database/high-availability-sla?view=azuresql&amp;tabs=azure-powershell#premium-and-business-critical-service-tier-zone-redundant-availability\nWith the introduction of Azure Availability Zones, SQL Database can place different replicas of the Business Critical database to different availability zones in the same region. To eliminate a single point of failure, the control ring is also duplicated across multiple zones as three gateway rings (GW). The routing to a specific gateway ring is controlled by Azure Traffic Manager (ATM). Because the zone-redundant configuration in the Premium or Business Critical service tiers doesn't create additional database redundancy, you can enable it at no extra cost. By selecting a zone-redundant configuration, you can make your Premium or Business Critical databases resilient to a much larger set of failures, including catastrophic datacenter outages, without any changes to the application logic."
      },
      {
        "date": "2023-02-15T08:07:00.000Z",
        "voteCount": 2,
        "content": "Database: \"An Azure SQL Database elastic pool\"\n  - Zone Redundancy still in Preview for Managed Instance so it's a nogo\n  - You could have deployed two Azure Databases but here it is written \"A SINGLE\" so it's not working as you have two databases to migrate\n\nService Tier: \"Business Critical\"\n - as you need to minimize I/O latency"
      },
      {
        "date": "2023-02-13T06:13:00.000Z",
        "voteCount": 1,
        "content": "Answer:\n\nDatabase: SQL Managed Instances\nService Tier: Business Critical\n\nSQL Managed Instance now supports zone redundancy"
      },
      {
        "date": "2023-02-14T14:04:00.000Z",
        "voteCount": 1,
        "content": "As at today, documentation still says its in PREVIEW only on BusCritical tier. I think its been raised before its not reliable as answer."
      },
      {
        "date": "2023-11-28T11:52:00.000Z",
        "voteCount": 4,
        "content": "Today MI &amp; Business Critical is General Available. MI &amp; General Purpose is now in Public Preview. \n\nAnswer is MI Business Critical. It's cheaper then SQL Database Elastic Pool.\n\nhttps://learn.microsoft.com/en-us/azure/azure-sql/managed-instance/high-availability-sla?view=azuresql"
      },
      {
        "date": "2023-02-11T08:43:00.000Z",
        "voteCount": 1,
        "content": "Hello guys,\nI guess should be the following:\n&gt; Database: \"AZURE SQL MANAGED INSTANCE\" - it can provide AUTO-FAILOVER\n&gt; Service Tier: \"Business Critical\""
      },
      {
        "date": "2023-02-08T10:43:00.000Z",
        "voteCount": 1,
        "content": "The scenario ask for availability zone and I wanted to opt for MI Business Critical but zone redundant feature is in preview. Single Azure SQL Database doesn't make sense because we got two databases.\n\nSo the only option is actually elastic pool. So the answer is correct."
      },
      {
        "date": "2023-01-28T17:09:00.000Z",
        "voteCount": 2,
        "content": "Single Azure SQL Database\nBusiness Critical\n\nA single azure sql db for each db would meet the requirements.\n\nYou can't use an elastic pool unless you are aware of the load pattern of each db to make it worthwhile to use elastic db. There is no indication in the question to hint pool will be useful.\n\nalso there is no indication in the answer that single azure db has to be for both dbs. It can a single db for each - db1 and db2. Therefore Multi DB in question doesn't rule out a single azure db as potential answer."
      },
      {
        "date": "2023-01-20T07:23:00.000Z",
        "voteCount": 2,
        "content": "SQL MI with Business critical seems to meet the resiliency and business requirement.\n\nhttps://learn.microsoft.com/en-us/azure/azure-sql/database/high-availability-sla?view=azuresql&amp;tabs=azure-powershell\n\nhttps://techcommunity.microsoft.com/t5/azure-sql-blog/zone-redundancy-for-azure-sql-managed-instance-business-critical/ba-p/3677646"
      },
      {
        "date": "2023-01-18T02:49:00.000Z",
        "voteCount": 2,
        "content": "Database: \"An Azure SQL Database elastic pool\"\nService Tier: \"Business Critical\"\nReason as per my understanding -\nZone-redundant configration is not available in SQL Managed Instances \nScenario:\n* Resiliency Requirements. Once migrated to Azure, DB1 and DB2 must meet the following requirements:\nMaintain availability if two availability zones in the local Azure region fail.\nFail over automatically."
      },
      {
        "date": "2023-04-21T02:37:00.000Z",
        "voteCount": 1,
        "content": "You are wrong in 2023... it seems ZRS is avalibale and you can see how here: https://techcommunity.microsoft.com/t5/azure-sql-blog/zone-redundancy-for-azure-sql-managed-instance-business-critical/ba-p/3677646#:~:text=1%20Step%201%3A%20Select%20Configure%20Managed%20Instance%20in,of%20the%20compatible%20redundancy%20options%20for%20backup%20storage%3A"
      },
      {
        "date": "2023-11-30T19:51:00.000Z",
        "voteCount": 1,
        "content": "Correct it is MI\nhttps://learn.microsoft.com/en-us/azure/reliability/migrate-sql-managed-instance?tabs=portal"
      }
    ],
    "examNameCode": "az-305",
    "topicNumber": "12"
  }
]