[
  {
    "topic": 13,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79413-exam-pl-200-topic-13-question-1-discussion/",
    "body": "You need to add the missing components to the Verification Process Automation solution.<br>Which two components should you add? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tService Request statuscode field",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDataverse connection reference",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tQualification statuscode field\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn-premises data gateway reference",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOutlook connection reference\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "CE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "CE",
        "count": 31,
        "isMostVoted": true
      },
      {
        "answer": "AC",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-24T04:33:00.000Z",
        "voteCount": 31,
        "content": "I guess the key piece of information is\n\"Internal IT reports that the solution import to the test environment failed because of missing dependencies related to the flow for completing service requests.\"\nThe answer lies in what *new* components are being used for the Flow, which dont already exist in their system. As per the reference on the answer provided, the new Flow must automate sending an email on complete of service request, and update Qualification record's status. Hence the answer is C and E. The new components added for the Flow would be a connection reference to Outlook, and new Qualification status fields.\n(I think)"
      },
      {
        "date": "2022-10-24T04:24:00.000Z",
        "voteCount": 3,
        "content": "Your comments are always enlightfull. Thanks a lot!"
      },
      {
        "date": "2023-08-05T09:24:00.000Z",
        "voteCount": 1,
        "content": "Thanks for the explanation!"
      },
      {
        "date": "2024-10-05T18:57:00.000Z",
        "voteCount": 1,
        "content": "C and E"
      },
      {
        "date": "2023-12-28T02:20:00.000Z",
        "voteCount": 3,
        "content": "In the exam 28/Dec/2023"
      },
      {
        "date": "2023-09-20T01:28:00.000Z",
        "voteCount": 3,
        "content": "Hi there, the question is not about automation of service request process, but Verification Process Automation solution :'The new process for verifying professional qualifications must automate the following:\n\n✑ Enter data and navigate the authority’s website. The authority website UI changes frequently because the company constantly improves the user experience.\n✑ Search page contents for a specified value to determine validity.\n✑ Update the corresponding Qualification record in Dataverse.'. Hence, I would go for B and C"
      },
      {
        "date": "2023-08-04T09:47:00.000Z",
        "voteCount": 4,
        "content": "Also in exam 8/1/23. It looks like the ADatum is coming up for the case studies now instead of the Alpine Resort series."
      },
      {
        "date": "2023-08-07T01:12:00.000Z",
        "voteCount": 1,
        "content": "Thank you for the update!"
      },
      {
        "date": "2023-08-04T04:29:00.000Z",
        "voteCount": 3,
        "content": "In exam 04-08-2023"
      },
      {
        "date": "2023-05-01T12:16:00.000Z",
        "voteCount": 1,
        "content": "B. Yes. because it may need Dataverse connection to the Qualification record \nC. Yes. I agree.\nE. I agree.\n\nSo the question is kind of vague. It needs more information regarding the type of missing dependencies"
      },
      {
        "date": "2023-05-01T12:19:00.000Z",
        "voteCount": 1,
        "content": "since the automation flow can only be triggered by modification to Dataverse."
      },
      {
        "date": "2023-03-16T09:02:00.000Z",
        "voteCount": 1,
        "content": "B. Dataverse connection reference\nC. Qualification statuscode field"
      },
      {
        "date": "2023-03-14T15:43:00.000Z",
        "voteCount": 1,
        "content": "On exam March 2023"
      },
      {
        "date": "2022-11-17T12:58:00.000Z",
        "voteCount": 2,
        "content": "\"Internal IT reports that the solution import to the test environment failed because of missing dependencies related to the flow for completing service requests.\" If you create a cloud flow and you use email and Dataverse. You will need to set up two connections. However, if you then export that in a managed solution and import it in a 'clean' test environment. The import will ask you for credentials so it can create two new connections one for the test-Dataverse and one for the test-email.  The import will not fail. The import will fail when you did not include all of the fields that your flow is using in the solution."
      },
      {
        "date": "2022-09-24T13:47:00.000Z",
        "voteCount": 1,
        "content": "This question was on Sept 24th\nScored  712\nSelected the same answer CE"
      },
      {
        "date": "2022-09-02T06:45:00.000Z",
        "voteCount": 2,
        "content": "Shouldn't be the correct answers B and E?\n\"All information sent by clients for services is stored in Microsoft Dataverse with a model-driven app as the interface.\""
      },
      {
        "date": "2022-09-17T04:14:00.000Z",
        "voteCount": 2,
        "content": "This one is a bit confusing. I'm going to go with the given answer."
      },
      {
        "date": "2022-11-17T12:45:00.000Z",
        "voteCount": 1,
        "content": "B is not correct. Because the IT department has missing components. The connection can never be the missing component. If the connection is not set up on the target environment (test), then the import of the solution would show a popup to create a new connection."
      }
    ],
    "examNameCode": "pl-200",
    "topicNumber": "13"
  },
  {
    "topic": 13,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83463-exam-pl-200-topic-13-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to coordinate updates and deployment for managed solutions containing completed work without disrupting the system.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04324/0026400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04324/0026400002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Deploy a patch with the changes made from the current solution.<br>Scenario:<br>The Onsite Visit managed solution has a table that is not in the Verification Process Automation managed solution. This table must be upgraded prior to the go-live date without the other shared components.<br>Box 2: Deploy a full copy of the original solution using the upgrade option. Then, deploy the new solution by using the update option.<br>Scenario: All components required for the verification process must be included in a new solution.<br>Corporate security requires that deployments to non-development environments must be automated using service accounts.<br>Managed solutions are used to move customizations from the development environment to other higher-level environments. These solutions are created and maintained by the power users and provided to internal IT for deployment when they are ready.<br>Note:<br>Upgrade This is the default option and upgrades your solution to the latest version and rolls up all previous patches in one step. Any components associated to the previous solution version that are not in the newer solution version will be deleted. This is the recommended option as it will ensure that your resulting configuration state is consistent with the importing solution including removal of components that are no longer part of the solution.<br>Update This option replaces your solution with this version. Components that are not in the newer solution won't be deleted and will remain in the system. This option is not recommended as your destination environment will differ in configuration from your source environment and could cause issues that are difficult to reproduce and diagnose.<br>Reference:<br>https://docs.microsoft.com/en-us/power-apps/maker/data-platform/update-solutions",
    "votes": [],
    "comments": [
      {
        "date": "2024-04-06T19:15:00.000Z",
        "voteCount": 3,
        "content": "1 and 2"
      },
      {
        "date": "2023-05-01T12:40:00.000Z",
        "voteCount": 1,
        "content": "1. deploy a patch. not ideal answer. not recommended by Microsoft and do not make sense when a better answer is use segmented solution and select component to update. https://learn.microsoft.com/en-us/power-platform/alm/segmented-solutions-alm\n2. wording is bad. eploy a full copy of the original solution and deploy the new solution. use the upgrade option for both deployments\n\nNO. Use import solution for first deploymeent and then upgrade for second deploymeent"
      },
      {
        "date": "2023-03-16T08:53:00.000Z",
        "voteCount": 1,
        "content": "1- deploy a patch with the changes made from the current solution \n2- deploy a full copy of the original solution and deploy the new solution. use the upgrade option for both deployments"
      },
      {
        "date": "2022-11-17T13:25:00.000Z",
        "voteCount": 1,
        "content": "I would choose Upgrade and Upgrade. Update removes an older version of the solution completely including all data that is stored. So, you never do that... and Patch that is a word used for an older on-premise crm environment. (You may want to use Stage for upgrade but that is not one of the options here)"
      },
      {
        "date": "2022-09-29T20:34:00.000Z",
        "voteCount": 4,
        "content": "I would choose 1 and 2, not 1 and 3. (using Upgrade for both solutions).\nThe supplied link says update is not recommended...\nhttps://learn.microsoft.com/en-us/power-apps/maker/data-platform/update-solutions\n. This option is not recommended as your destination environment will differ in configuration from your source environment and could cause issues that are difficult to reproduce and diagnose."
      },
      {
        "date": "2022-10-27T12:23:00.000Z",
        "voteCount": 1,
        "content": "Can someone explain why does this option even exist if MS suggest that its not advised to be used?!"
      },
      {
        "date": "2023-04-16T15:23:00.000Z",
        "voteCount": 1,
        "content": "The MS link does not say 'Not recommended' any more. \nGuess they removed it. Just says 'beware' now.\nMy opinion it should be 1 and 3 as doing an Update seems to be a 'safer' option and the question does say it wants to minimise disruption"
      },
      {
        "date": "2024-02-12T04:45:00.000Z",
        "voteCount": 2,
        "content": "what i don't understand is why do you do the first part 'Deploy a full copy of the original solution using the upgrade option'. Assuming that after deployment the production environemnt equals the dev envrionment, then you develop new solutions on the dev environment, you basically only need to deploy the new developped items with 1) update deployment with no need of prior 'deploy full copy...\" (this would only be needed if you were to create a new environment?)\n\nUpdate: This option has the best performance by typically finishing in less time than the upgrade methods\n\nhttps://learn.microsoft.com/en-us/power-apps/maker/data-platform/update-solutions"
      },
      {
        "date": "2022-09-24T13:47:00.000Z",
        "voteCount": 2,
        "content": "This question was on Sept 24th\nScored  712\nSelected the same answer 1 and 3"
      },
      {
        "date": "2023-03-21T07:09:00.000Z",
        "voteCount": 5,
        "content": "You should have selected 1 and 2...and wd have got better score  :-)"
      }
    ],
    "examNameCode": "pl-200",
    "topicNumber": "13"
  }
]