[
  {
    "topic": 10,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/62640-exam-pl-200-topic-10-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to design the FAQ solution to handle unknown responses.<br>Which component should you use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04324/0019200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04324/0019300001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/power-virtual-agents/advanced-hand-off",
    "votes": [],
    "comments": [
      {
        "date": "2021-09-28T13:42:00.000Z",
        "voteCount": 27,
        "content": "1. Fallback topic \n2. Omnichannel"
      },
      {
        "date": "2021-12-16T10:50:00.000Z",
        "voteCount": 13,
        "content": "For Q1, I believe Escalate is correct because the case study requirement is \"If guests ask about topics that are not listed in the FAQ, the chat solution must identify the issue and escalate to a staff member.\""
      },
      {
        "date": "2022-07-17T16:21:00.000Z",
        "voteCount": 5,
        "content": "The requirements say \"the chat solution must identify the issue\" before escalate.\nThis can only be done with fallback."
      },
      {
        "date": "2023-01-31T03:46:00.000Z",
        "voteCount": 1,
        "content": "a falback topic will not identify the issue it will just present the user with a default page"
      },
      {
        "date": "2024-10-05T18:36:00.000Z",
        "voteCount": 1,
        "content": "Handle an unknown question from a guest in a conversation:\nB. Fallback topic: This component is used to handle situations where the chatbot does not understand the user’s question. It provides a generic response and can guide the user to rephrase their question or offer alternative options.\nRedirect a guest with an unknown question to a live staff member:\nD. Omnichannel for Dynamics 365 Customer Service: This solution allows seamless escalation to a live agent when the chatbot cannot handle a query. It ensures that the guest is connected to the appropriate staff member for further assistance."
      },
      {
        "date": "2024-07-15T05:44:00.000Z",
        "voteCount": 4,
        "content": "Power Virtual Agents are not on PL-200 in July 2024 but the correct answer for this i believe is Fallback topic and Omni-channel.\n\nFallback topic: The best way to handle an unknown question in Power Virtual Agents is to use the fallback topic (Option B). When a user asks a question that the bot doesn’t recognize or have a specific response for, the fallback topic provides a default action or response. \n\nOmnichannel: Omnichannel for Customer Service is a robust application that extends the power of Dynamics 365 Customer Service to enable organizations to instantly connect and engage with their customers via channels like Live Chat, voice, and SMS.\n\nWhy Omnichannel? Because we are not trying to fit into the client's existing setup, we are designing a new solution. Omnic-channel for customer service would handle live chat with customers, not Teams."
      },
      {
        "date": "2024-02-10T03:09:00.000Z",
        "voteCount": 2,
        "content": "You must implement the following solutions:\n… a customer service solution\nthats a long list of solution for a family owned apline ski house with 2 staff members able to make excel formulas. \n1) fallback topic\n2) first thought: Microsoft Teams, because of: Communication between team members must be centrally managed and unified in Microsoft Teams. so they primarily look into teams and not any dozen separate browser tabs) but it also states ' you must implement' ...'a customer service solution' :-(.  I go for the must-have C) Omni channel for Dynamics 365 Customer Service"
      },
      {
        "date": "2024-02-10T03:09:00.000Z",
        "voteCount": 1,
        "content": "A fallback topic triggers On Unknown Intent to capture the unrecognized input.\nAfter two prompts, the copilot escalates to a live agent through a system topic called Escalate.\nIn some instances, the bot may be unable to determine the intent of a customer's conversation. For example, the customer may be asking a specific question for which there's no topic, or no matching option within a topic."
      },
      {
        "date": "2023-05-06T14:27:00.000Z",
        "voteCount": 3,
        "content": "1. Fallback topic. \nEscalate is handing off to live agent. In some instances, the bot may be unable to determine the intent of a customer's conversation. For example, the customer may be asking a specific question for which there's no topic, or no matching option within a topic.\n2. Ominichannel"
      },
      {
        "date": "2023-03-16T21:27:00.000Z",
        "voteCount": 2,
        "content": "1. Fallback topic\n2. Omnichannel for dynamics 365 customer service"
      },
      {
        "date": "2022-10-20T21:04:00.000Z",
        "voteCount": 7,
        "content": "1. Fallback topic : \"When you open this topic in the authoring canvas, you'll see that the default fallback topic contains two nodes: a Message node that rephrases the user input and an Escalate node that redirects to a live agent.\"\n2. Microsoft Teams: \"Communication between team members must be centrally managed and unified in Microsoft Teams\" so there's really no need to use Omnichannel because \"An additional license is required to access Omnichannel for Customer Service\" \"(...) does not employ technical staff and does not have the budget to... any solution must use the capabilities of current team members. All solutions must be simple to use, easy to maintain and represent the brand of the resort\"\n\nBut still, correct me if I'm wrong"
      },
      {
        "date": "2022-08-27T16:22:00.000Z",
        "voteCount": 1,
        "content": "Took the exam in August 2022. This question was on it."
      },
      {
        "date": "2022-08-03T15:33:00.000Z",
        "voteCount": 1,
        "content": "1. Escalate\n2. Omnichannel\nAre the right answers"
      },
      {
        "date": "2022-08-10T00:12:00.000Z",
        "voteCount": 2,
        "content": "Jimmy You are wrong it is Fall back for 1"
      },
      {
        "date": "2022-05-09T07:11:00.000Z",
        "voteCount": 7,
        "content": "For the first one:\n\"When you open this topic in the authoring canvas, you'll see that the default fallback topic contains two nodes: a Message node that rephrases the user input and an Escalate node that redirects to a live agent.\"\n\nIt should be \"Fallback topic\" and, inside it, the right thing to do is probably to escalate... c'mon Microsoft, what a s*** question..."
      },
      {
        "date": "2022-03-25T02:44:00.000Z",
        "voteCount": 7,
        "content": "Surely Omnichannel isn't the answer, it does'nt meet the business requirement! To use Omnichannel they'd need Dynamics 365 Customer Service PLUS extra licenses for Omnichannel for Customer Service, with live agents waiting on that system to take the live ticket.  There's no way that meets the business requirement - more likely they'd just use an escalation path to send a message via Teams to have someone answer, or give the person an email/phone number/website to contact."
      },
      {
        "date": "2022-09-24T04:09:00.000Z",
        "voteCount": 1,
        "content": "I agree! The case study already establishes that they are using Teams, so that makes more sense."
      },
      {
        "date": "2024-02-10T03:18:00.000Z",
        "voteCount": 1,
        "content": "You must implement the following solutions:\n… a customer service solution\nstill in two minds... \nhaving teams open and omnichannel aside it makes Ux not better."
      },
      {
        "date": "2022-02-24T10:16:00.000Z",
        "voteCount": 3,
        "content": "Fallback topic\nOmnichannel"
      },
      {
        "date": "2022-02-02T10:36:00.000Z",
        "voteCount": 2,
        "content": "On exam 1 Feb, 2022.\nChosed:\nFallback topic\nOmnichannel"
      },
      {
        "date": "2022-01-27T22:37:00.000Z",
        "voteCount": 3,
        "content": "On exam Jan 27, 2022. Passed, choosed  Fallback topic and Omnichannel."
      },
      {
        "date": "2021-12-30T13:48:00.000Z",
        "voteCount": 3,
        "content": "I believe for Q1, the important word is conversations.\n\nEscalate &gt; \"During a conversation, a Power Virtual Agents bot triggers the appropriate topic based on the user's input. If the bot can't determine the user's intent, it prompts the user again. After two prompts, the bot escalates to a live agent through the system Escalate topic.\"\nhttps://docs.microsoft.com/en-us/power-virtual-agents/authoring-system-fallback-topic\n\nFallback is more when you are not in any conversation or topic &gt; \"In some scenarios, you might want to customize how the bot behaves when user input doesn't trigger any topic. For example, you can build a catchall topic to capture unrecognized user intent, or use a topic to call back-end systems or route to existing services.\""
      },
      {
        "date": "2021-11-24T01:31:00.000Z",
        "voteCount": 1,
        "content": "on exam 11/24/21"
      }
    ],
    "examNameCode": "pl-200",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64137-exam-pl-200-topic-10-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to embed the FAQbot into the communication solution.<br>Which actions should you perform? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04324/0019400001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04324/0019500001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-10-15T00:37:00.000Z",
        "voteCount": 30,
        "content": "For me it's:\n1) import an existing app\n2) configure the FAQbot"
      },
      {
        "date": "2021-10-29T06:11:00.000Z",
        "voteCount": 6,
        "content": "Here I would say : \n1/ Create a New App : Because we have to add the new FAQ solution to the communication solution \"FOR THE FIRST TIME\".\n2/ I agree with you : Configure the FAQBot seems to be the logical choice!\n\nFor me it 's : 1/Create a New App. 2/ configure the FAQbot"
      },
      {
        "date": "2021-12-16T08:39:00.000Z",
        "voteCount": 3,
        "content": "Why is it configure and not import as the given answer says?"
      },
      {
        "date": "2023-02-16T13:04:00.000Z",
        "voteCount": 1,
        "content": "I agree, but could someone explain better?"
      },
      {
        "date": "2023-02-16T13:11:00.000Z",
        "voteCount": 1,
        "content": "and the first one why it's not \"import bot\"?"
      },
      {
        "date": "2021-12-18T08:01:00.000Z",
        "voteCount": 21,
        "content": "1) is Import Existing App, not Create New App - Case states \"The company recently purchased a chatbot named FAQbot from AppSource.\" So you are importing the purchased App\n2) is Configure the FAQBot"
      },
      {
        "date": "2024-10-05T18:41:00.000Z",
        "voteCount": 1,
        "content": "Add the new FAQ solution to the communication solution for the first time:\nD. Import bot: This action allows you to bring the existing FAQbot into your communication solution.\nConfigure the FAQ solution in Microsoft Teams:\nB. Import a chatbot: This action integrates the FAQbot into Microsoft Teams, making it accessible to users within the Teams environment."
      },
      {
        "date": "2024-02-10T03:36:00.000Z",
        "voteCount": 1,
        "content": "You need to embed the FAQbot into the communication solution.\n1 d) import bot --&gt; though bot is a bit unprofessional the name is add existing CHATbot\n2) Configue ghe FAQbot because it is already imported in 1) so you need to CONFIGURE as the lable states Configure the FAQ..."
      },
      {
        "date": "2023-05-06T14:57:00.000Z",
        "voteCount": 1,
        "content": "1. import existing app in App studio. https://www.youtube.com/watch?v=yGvASYiWRmI\n2. configure"
      },
      {
        "date": "2023-05-06T15:03:00.000Z",
        "voteCount": 1,
        "content": "I mean \n1. import existing app\n2. import FAQBot"
      },
      {
        "date": "2023-03-16T09:04:00.000Z",
        "voteCount": 1,
        "content": "1- import an existing app\n configure the FAQbot"
      },
      {
        "date": "2023-02-27T22:51:00.000Z",
        "voteCount": 1,
        "content": "For me it is:\n\n1) import bot\n2) configure FAQbot"
      },
      {
        "date": "2022-08-27T16:23:00.000Z",
        "voteCount": 1,
        "content": "Took the exam in August 2022. This question was on it."
      },
      {
        "date": "2022-02-24T10:17:00.000Z",
        "voteCount": 2,
        "content": "import an existing app\nconfigure the FAQbot"
      },
      {
        "date": "2022-02-02T10:37:00.000Z",
        "voteCount": 2,
        "content": "On exam 1 Feb, 2022."
      },
      {
        "date": "2022-01-27T22:38:00.000Z",
        "voteCount": 3,
        "content": "On exam Jan 27, 2022. Passed, choosed create a new App and Import Chatbot."
      },
      {
        "date": "2021-11-25T09:48:00.000Z",
        "voteCount": 2,
        "content": "In exam 24 Nov 21"
      }
    ],
    "examNameCode": "pl-200",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/62202-exam-pl-200-topic-10-question-3-discussion/",
    "body": "HOTSPOT -<br>A guest asks about the start time of a specific scheduled event and wants to know what the snow conditions will be like during their stay.<br>You need to determine how to design the chat solution to answer those questions.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04324/0019600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04324/0019600002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Load the extracted topic into a variable<br>Power Virtual Agents uses entities to understand and identify a specific type of information from a user's responses. When saving the identified information to a variable, a variable type will be associated with it. The variable type is analogous with the entity.<br>In Power Virtual Agents, a topic defines a how a bot conversation plays out.<br>A topic has trigger phrases ג€\" these are phrases, keywords, or questions that a user is likely to type that is related to a specific issue ג€\" and conversation nodes ג€\" these are what you use to define how a bot should respond and what it should do.<br><br>Box 2: Create a custom entity -<br>The prebuilt entities cover commonly used information types, but on some occasions, such as when building a bot that serves a specific purpose, you'll need to teach the bot's language understanding model some domain-specific knowledge.<br>Reference:<br>https://docs.microsoft.com/en-us/power-virtual-agents/advanced-entities-slot-filling",
    "votes": [],
    "comments": [
      {
        "date": "2021-12-09T18:17:00.000Z",
        "voteCount": 24,
        "content": "Selected \n1 - \"Load the response into a variable\"\n2- custom entity\n\non exam 10-Dec-2021. Pass with 870 marks"
      },
      {
        "date": "2021-09-16T07:07:00.000Z",
        "voteCount": 9,
        "content": "I'm not 100% sold on the first solution... Is it possible to \"load a topic into a variable\"? I don't know how that would work, if I'm not mistaken a topic doesn't have a value you can store in a variable, right?\n\n\"Use smart matching to load an entity into a topic\" sounds weird too but a bit more reasonable. You're trying to identify a company, smart matching could help with that if the name isn't exactly as defined in the custom entity. It's the \"load into a topic\" part that sounds weird though.\n\n\"Load the response into a variable\" is really simple, but it's the most correct one I guess. You can use the variable later to do anything..."
      },
      {
        "date": "2024-10-05T18:46:00.000Z",
        "voteCount": 1,
        "content": "Identify and reference the company event a guest mentions:\nB. Use smart matching to load an entity into a topic: This allows the chatbot to recognize and reference specific events mentioned by the guest, ensuring accurate responses related to the event’s start time.\nIdentify attributes for snow conditions:\nA. Create a custom entity: This allows you to define and store specific attributes related to snow conditions, such as current snow depth, forecast, and conditions, which the chatbot can then use to provide detailed and accurate information."
      },
      {
        "date": "2024-02-10T04:11:00.000Z",
        "voteCount": 1,
        "content": "1B\n2A\n\nUse smart matching to load an entity into a topic. \"load\" sounds really weird, you just add it.\nLoad the extracted topic into a variable. if we define topic like the bot topics, the full conversation path you do not load that 'topic' into a variable. but the end consumer has a 'topic' but that's not the point from my perspective."
      },
      {
        "date": "2024-02-19T13:25:00.000Z",
        "voteCount": 1,
        "content": "1\na) question-&gt;Identify-&gt;response: variable. in this sense response... maybe makes sense (question/response)\nb) use smart matching to load an entity into a topic.  smart matching does not 'load an entity into a topic' you select the entity .\nc) load the extracted topic into a variable. so means it loads the full system topic or user topic to a variable? or is it here, again, two sides of the meaning 'topic'?"
      },
      {
        "date": "2023-03-16T09:05:00.000Z",
        "voteCount": 2,
        "content": "Use smart matching to load an entity into a topic.\nCreate a custom entity."
      },
      {
        "date": "2022-11-11T06:03:00.000Z",
        "voteCount": 1,
        "content": "I've translated the question and the answers in my mother tongue and I can't understand why it can't be the smart matching, if you populate the entity table with the name of that events, won't the bot be able to identify them ? about the snow forecast... I can't understand why the entity, and how the bot can correlate with the actual weather forecast?"
      },
      {
        "date": "2022-11-11T06:08:00.000Z",
        "voteCount": 1,
        "content": "https://carldesouza.com/entities-and-smart-matching-in-power-virtual-agents/"
      },
      {
        "date": "2022-07-17T16:37:00.000Z",
        "voteCount": 2,
        "content": "1 - Smart Matching\n2- custom entity\nThe user types a sentence about the start time of an event. Smart matching can extract this information and apply it in the next Topic \"Snow conditions\".  \"Snow Condition\" would be a custom entity."
      },
      {
        "date": "2022-07-17T23:35:00.000Z",
        "voteCount": 1,
        "content": "Addendum - SlotFilling does the inserting into the Topic after Smart Matching does its work."
      },
      {
        "date": "2022-04-26T12:35:00.000Z",
        "voteCount": 1,
        "content": "can't we get snow conditions from mns weather? so just create a new variable?"
      },
      {
        "date": "2022-02-24T10:18:00.000Z",
        "voteCount": 2,
        "content": "1 - \"Load the response into a variable\"\n2- custom entity"
      },
      {
        "date": "2024-02-10T03:55:00.000Z",
        "voteCount": 1,
        "content": "the response from what? the consumer? there is no indication what delivers the response."
      },
      {
        "date": "2022-01-19T16:55:00.000Z",
        "voteCount": 2,
        "content": "- since a company event is not a predefined event, I wouldn't choose 'extracted topic' i choose 'Load the response into a variable'"
      },
      {
        "date": "2024-02-10T03:56:00.000Z",
        "voteCount": 1,
        "content": "that's not a response, that is a question"
      },
      {
        "date": "2021-11-23T02:14:00.000Z",
        "voteCount": 1,
        "content": "in exam 11/23/21"
      },
      {
        "date": "2021-11-01T13:24:00.000Z",
        "voteCount": 7,
        "content": "1 - \"Load the response into a variable\"\n2- custom entity \nMore logic"
      },
      {
        "date": "2021-09-20T14:04:00.000Z",
        "voteCount": 3,
        "content": "in exam 16/09/2021"
      },
      {
        "date": "2021-09-29T00:07:00.000Z",
        "voteCount": 27,
        "content": "it is useless to write that it was in the exam if you do not say the answer, you had better not write anything"
      },
      {
        "date": "2021-11-03T05:39:00.000Z",
        "voteCount": 34,
        "content": "well unless u get 100% on a topic u dont know if u got the answer right or not, the comment is useful so u can see that its still relevant at a certain date."
      },
      {
        "date": "2021-09-20T14:03:00.000Z",
        "voteCount": 1,
        "content": "resort portal"
      },
      {
        "date": "2021-09-20T14:03:00.000Z",
        "voteCount": 1,
        "content": "please ignore."
      }
    ],
    "examNameCode": "pl-200",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/62448-exam-pl-200-topic-10-question-4-discussion/",
    "body": "You need to design the chat solution to answer the inquiry from Guest1.<br>Which three components can you use? Each correct answer presents a complete solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tVariables",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEscalations\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSmart match\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSynonyms",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTopics\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "BCE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "BCE",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "ABE",
        "count": 5,
        "isMostVoted": false
      },
      {
        "answer": "ABC",
        "count": 2,
        "isMostVoted": false
      },
      {
        "answer": "BDE",
        "count": 1,
        "isMostVoted": false
      },
      {
        "answer": "ADE",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-07-17T17:40:00.000Z",
        "voteCount": 19,
        "content": "B: Yes Escalations is a compete solution to answer question\nC: Yes Smart Match can auto fill a topic to complete an enquiry \nE: Yes Topics is a complete solution to answer question.\nWrong Answers;\nA: Variables only store values and do not answer a question completely\nD: Synonym is an alternate value.  On its own it is not a complete solution"
      },
      {
        "date": "2024-02-10T04:16:00.000Z",
        "voteCount": 1,
        "content": "the question does not say that each option needs to be a 'complete' solution. I used D instead of B."
      },
      {
        "date": "2024-06-27T17:33:00.000Z",
        "voteCount": 1,
        "content": "\"Each correct answer presents a complete solution\""
      },
      {
        "date": "2021-09-27T23:19:00.000Z",
        "voteCount": 8,
        "content": "shouldnt it be Topics. Since the key words snow and condition are already there in the chat solution?"
      },
      {
        "date": "2021-10-28T08:47:00.000Z",
        "voteCount": 19,
        "content": "I agree. That's why for me it's : \nA. Variables : To match them\nB. Escalations : To redirect to Employees\nE. Topics : To match with Diferent topics"
      },
      {
        "date": "2021-11-01T02:20:00.000Z",
        "voteCount": 2,
        "content": "If I see the question on the exam, I will also awnser this."
      },
      {
        "date": "2021-11-13T22:51:00.000Z",
        "voteCount": 1,
        "content": "I agree with you."
      },
      {
        "date": "2022-08-06T04:15:00.000Z",
        "voteCount": 1,
        "content": "How Variables ? Question asks each should be the Complete solution Hence I will go for B C E"
      },
      {
        "date": "2023-04-13T04:43:00.000Z",
        "voteCount": 2,
        "content": "A. Variables: You can use variables to store information about the user's stay, such as their location and dates of stay. Each time Guest1 inquires about snow conditions, the bot can use these variables to provide up-to-date information about the weather conditions during their stay."
      },
      {
        "date": "2024-10-05T18:47:00.000Z",
        "voteCount": 1,
        "content": "C. Smart match: This helps the chatbot recognize and match specific keywords or phrases related to snow conditions, ensuring accurate responses.\nD. Synonyms: This allows the chatbot to understand different ways guests might ask about snow conditions, improving the chatbot’s ability to provide relevant answers.\nE. Topics: This organizes the conversation around specific subjects, such as snow conditions, making it easier for the chatbot to handle inquiries and provide detailed information."
      },
      {
        "date": "2024-08-13T09:00:00.000Z",
        "voteCount": 1,
        "content": "B. Escalations - This allows the chat solution to escalate the question to a staff member if it cannot provide an answer.\nD. Synonyms - Helps the chat solution understand variations of the term \"snow conditions\" or similar phrases.\nE. Topics - This enables the chat solution to recognize and respond to specific inquiries like snow conditions based on pre-defined topics."
      },
      {
        "date": "2024-02-10T04:21:00.000Z",
        "voteCount": 1,
        "content": "As a swiss I would say the reason why the person asks multiple times is that she/he wants to have updated information about the actual developments of snow conditions. Maybe early morning you are unable to ski but towards lunch time the weather changes and the snow conditions allow for skiing in the afternoon. Therefore picking the answer from a variable that saved the stat of early morning is not acceptable. I don't want to hear the snow condition from early morning when i re-consider going to ski at luch time. The current outlook is important."
      },
      {
        "date": "2024-02-10T04:23:00.000Z",
        "voteCount": 1,
        "content": "Topics to define the conversation all around weather (snow) conditions and recommendations. \nSmart match and Synonyms for talking about what the various alternative expressions for 'snow' (there are several words for different kind of snow). Plus in alpine regions you speak german, french, italian... somtimes even english ;-)"
      },
      {
        "date": "2023-08-30T05:47:00.000Z",
        "voteCount": 1,
        "content": "A. Variables\nB. Escalations\nC. Smart Match\n\nThe question mentions \"If a question does require a staff member's attention, the solution must determine which staff member is best to assist the customer with the question.\"\nThis can be achieved by capturing the key information like a department in a Variable\n\n\"The information in the FAQ on the legacy website must be used in the chat solution but retyping all the data from the website should not be required.\"\nThis is done by B. Topics which has trigger phrases. No need to type everything\n\n\"If quests ask about topics that are not listed in the FAQ, the chat solution must identify the issue and escalate to a staff member.\"\nB. Escalation"
      },
      {
        "date": "2023-08-30T05:48:00.000Z",
        "voteCount": 1,
        "content": "wth.. sorry for the typo.\nABE are the right options"
      },
      {
        "date": "2023-08-30T05:27:00.000Z",
        "voteCount": 1,
        "content": "A. Variables\nB. Escalations\nC. Smart Match\n\nThe question mentions \"If a question does require a staff member's attention, the solution must determine which staff member is best to assist the customer with the question.\"\nThis can be achieved by capturing the key information like a department in a Variable\n\n\"The information in the FAQ on the legacy website must be used in the chat solution but retyping all the data from the website should not be required.\"\nThis is done by C. Smart Matching\n\n\"If quests ask about topics that are not listed in the FAQ, the chat solution must identify the issue and escalate to a staff member.\"\nB. Escalation"
      },
      {
        "date": "2023-08-30T05:31:00.000Z",
        "voteCount": 2,
        "content": "Excuse me.\nThe correct options are \nA. Variables\nB. Escalations\nE. Topics\n\"The information in the FAQ on the legacy website must be used in the chat solution but retyping all the data from the website should not be required.\"\nThis is done by Topics which has trigger phrases. No need to type everything"
      },
      {
        "date": "2023-08-29T16:56:00.000Z",
        "voteCount": 1,
        "content": "E. Create Topic and trigger phrases\nC. Smart match. Just in case someone just typed short names instead of full names. Possible options are Entities (to store city/region etc)\nA. Variables to store the city/ zip code etc\nCall and action should be selected if present in the option.\nRef: https://learn.microsoft.com/en-us/power-virtual-agents/advanced-use-flow"
      },
      {
        "date": "2023-05-01T11:40:00.000Z",
        "voteCount": 2,
        "content": "This question is awful. All answers can be part of the complete solutison.\n1. create topic.\n2. ask question. \n3. identity pre-built or custom-entity( via list of synonyms) in the response to question. use smart matching to better match response to entity.\n4. save response to variable.\n5. escalate if necessary\n\nall are correct"
      },
      {
        "date": "2023-04-13T04:48:00.000Z",
        "voteCount": 2,
        "content": "Why is Escalations?\nA. Variables: You can use variables to store information about the user's stay, such as their location and dates of stay. Each time Guest1 inquires about snow conditions, the bot can use these variables to provide up-to-date information about the weather conditions during their stay.\n\nC. Smart match: You can use smart matching to recognize patterns in Guest1's inquiries and extract relevant information such as the dates and location of their stay. The bot can then use this information to provide customized responses based on the specific dates and location of their stay.\n\nE. Topics: You can create a topic for snow conditions that includes information about the weather conditions in the user's location during their stay. Each time Guest1 asks about snow conditions, the bot can direct them to this topic and provide the most up-to-date information about the weather conditions during their stay."
      },
      {
        "date": "2023-03-21T06:49:00.000Z",
        "voteCount": 2,
        "content": "BCE as they are complete solution independently"
      },
      {
        "date": "2023-03-16T09:07:00.000Z",
        "voteCount": 2,
        "content": "A. Variables\nC. Smart match\nE. Topics"
      },
      {
        "date": "2022-11-11T06:15:00.000Z",
        "voteCount": 2,
        "content": "the question is asking a combination of 3 or each of them must be able to solve the situation by its own?"
      },
      {
        "date": "2022-08-27T16:17:00.000Z",
        "voteCount": 1,
        "content": "Took the exam in August 2022. This question was on it."
      },
      {
        "date": "2022-08-06T04:24:00.000Z",
        "voteCount": 4,
        "content": "As the question refers to each one should be complete hence These 3(Escalation , Smart matching, Topics ) independently will be the complete solution"
      },
      {
        "date": "2022-06-17T20:13:00.000Z",
        "voteCount": 1,
        "content": "A,B,E. Mainly because of \"Guest1 inquires about snow conditions several times during each day of their stay.\" Several times as in the chat bot needs to be escalated."
      },
      {
        "date": "2022-06-16T05:27:00.000Z",
        "voteCount": 1,
        "content": "Guest1 is asking for \"snow conditions\" which is not a key word and no additional key words are going to be added."
      }
    ],
    "examNameCode": "pl-200",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64138-exam-pl-200-topic-10-question-5-discussion/",
    "body": "You need to create the FAQ solution content.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAI Builder",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAutomate",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSuggest topics",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrigger phrases"
    ],
    "answer": "C",
    "answerDescription": "You need to make sure there are three main steps need to do while doing import FAQ and add the topic to your bot application.<br>1. Import Suggested Topics from FAQ webpage.<br>2. Add a topic.<br>3. Enable the topics<br>Reference:<br>https://social.technet.microsoft.com/wiki/contents/articles/53820.power-virtual-agents-faq-chatbot.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-10-15T00:55:00.000Z",
        "voteCount": 9,
        "content": "correct"
      },
      {
        "date": "2024-10-05T18:49:00.000Z",
        "voteCount": 1,
        "content": "C. Suggest topics.\n\nUsing the “Suggest topics” feature in Power Virtual Agents allows you to automatically generate topics from existing content, such as FAQs on your website1. This helps you quickly build a comprehensive set of topics for your chatbot without manually retyping all the data."
      },
      {
        "date": "2023-09-06T09:10:00.000Z",
        "voteCount": 3,
        "content": "This might be right for the test but Suggest Topics doesn't even exist anymore."
      },
      {
        "date": "2023-03-16T09:08:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2022-11-12T02:55:00.000Z",
        "voteCount": 2,
        "content": "why not trigger phrases? Shouldn't they be used first to recognize the user output?"
      },
      {
        "date": "2023-04-27T04:15:00.000Z",
        "voteCount": 1,
        "content": "cause they are asking for the content..."
      },
      {
        "date": "2024-02-11T03:44:00.000Z",
        "voteCount": 1,
        "content": "first create the topic, then add the trigger phrase"
      },
      {
        "date": "2022-08-27T16:17:00.000Z",
        "voteCount": 1,
        "content": "Took the exam in August 2022. This question was on it."
      },
      {
        "date": "2022-04-21T06:30:00.000Z",
        "voteCount": 2,
        "content": "Just passed with 791.\nSelected C. Suggest topics"
      },
      {
        "date": "2022-02-24T10:20:00.000Z",
        "voteCount": 1,
        "content": "correct"
      },
      {
        "date": "2022-02-02T10:37:00.000Z",
        "voteCount": 1,
        "content": "On exam 1 Feb, 2022."
      },
      {
        "date": "2021-11-24T01:31:00.000Z",
        "voteCount": 1,
        "content": "on exam 11/24/21"
      }
    ],
    "examNameCode": "pl-200",
    "topicNumber": "10"
  }
]