[
  {
    "topic": 17,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/104121-exam-mb-500-topic-17-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to add new fields to the standard form and organize the grid to meet the requirements.<br>In which order should you perform the actions? To answer, move all actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04327/0007400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04327/0007400002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Note: Munson's Pickles and Preserves Farm must change the Inventory Status form to include more columns. It plans to create a table to enter the data for the<br>Inventory Status form as a new data source. The company wants to add both the Product Name field and Batch ID field to this new table. The current form includes the item number, location, license plate, product inventory dimensions, and quantity.<br>Example:<br><br>Extend the FMVehicle Table -<br>1. In Solution Explorer, select the FleetManagement Discounts project.<br>2. In Visual studio, in Application Explorer, select View &gt; Application Explorer, and search for the table named FMVehicle. Type FMVehicle type:Table in the filter bar and press Enter.<br>3. Right-click FMVehicle, and then select Create extension.<br>An extension of the FMVehicle table is created in the FleetManagement Discounts project named FMVehicle.Extension.<br>Right-click Fields and add a new integer field. Change the name of the field to NumberOfCylinders.<br>4. In the Properties window, set the Label property of the new field to NumberofCylinders.<br>5. Drag-and-drop the NumberOfCylinders field into the AutoReport field group to extend the field group of the base table.<br>6. Save FMVehicle.Extension.<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/fin-ops-core/dev-itpro/extensibility/customize-model-elements-extensions",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-27T13:36:00.000Z",
        "voteCount": 2,
        "content": "I think the dump answer is correct"
      }
    ],
    "examNameCode": "mb-500",
    "topicNumber": "17"
  }
]