[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126871-exam-77-888-topic-1-question-1-discussion/",
    "body": "HOTSPOT -<br>You work as an Office Assistant for Blue Well Inc. The company has a Windows-based network. You want to insert a signature line that specifies the individual who must sign. Mark the option that you will choose to accomplish the task.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02577/0000200001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02577/0000200002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "The following figure shows the option used to insert a signature line that specifies the individual who must sign.<br><img src=\"/assets/media/exam-media/02577/0000300001.png\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:31:00.000Z",
        "voteCount": 1,
        "content": "Go to insert option there is add signature option to sign"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126872-exam-77-888-topic-1-question-2-discussion/",
    "body": "Rick works as an Office Assistant for Tech Perfect Inc. The company has a Windows-based network.<br>Rick wants to display data series, categories, data markers, and axes in the report. Which of the following actions will Rick take to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHe will use stand-alone slicers.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHe will create a PivotTable report.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHe will configure form controls.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHe will create a PivotChart report."
    ],
    "answer": "D",
    "answerDescription": "The PivotChart report is used to provide a graphical representation of data in a PivotTable report in an interactive way. Whenever a user creates the PivotChart report, PivotChart report filters are displayed in the chart area. These are used for sorting and filtering the underlying data of the PivotChart report. Changes made to the layout and data in the associated PivotTable report are immediately reflected in the layout and data in the PivotChart report. The PivotChart report shows data series, categories, data markers, and axes in the same way as the standard charts do. It is possible to change the chart type and other options such as titles, legend placement, data labels, and chart location.<br>Answer option A is incorrect. Stand-alone slicers are referenced from Online Analytical Processing (OLAP) Cube functions. These stand-alone slicers can be connected with any PivotTable in future.<br>They can be added by using the slicer button on the Ribbon. They need to be manually linked into grids as required.<br>Answer option C is incorrect. A form control is an original control that is compatible with old versions of Excel, beginning with Excel version 5. 0. It is designed for use on XLM macro sheets. It can be used when a user wants to simply interact with cell data without using VBA code and when he wants to add controls to chart sheets. By using form controls, the user can run macros. He can attach an existing macro to a control, or write or record a new macro. These controls cannot be added to UserForms, used to control events, or modified to run Web scripts on Web pages.<br>Answer option B is incorrect. A PivotTable report is used to summarize large amounts of data, to analyze numerical data, and to answer unexpected questions about data.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:32:00.000Z",
        "voteCount": 1,
        "content": "Option D : he will create pivot chart"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/122069-exam-77-888-topic-1-question-3-discussion/",
    "body": "Rick works as an Office Assistant for Tech Perfect Inc. The company has a Windows-based network.<br>Rick is creating a project through Microsoft Excel 2010. The project on which he is working has 98 project tasks and 57 team members. Rick wants to check the progress of his project quickly and easily. Which of the following will Rick use to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGantt Chart Template",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tForm control",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrust Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAccounting template"
    ],
    "answer": "A",
    "answerDescription": "The Gantt Chart Template Deluxe Edition for Excel is used to generate quick and easy Gantt charts that define the progress of a user's projects containing up to<br>100 project tasks and team members. Answer option B is incorrect. A form control is an original control that is compatible with old versions of Excel, beginning with<br>Excel version 5. 0. It is designed for use on XLM macro sheets. It can be used when a user wants to simply interact with cell data without using VBA code and when he wants to add controls to chart sheets. By using form controls, the user can run macros. He can attach an existing macro to a control, or write or record a new macro. These controls cannot be added to UserForms, used to control events, or modified to run Web scripts on Web pages. Answer option D is incorrect.<br>The accounting template is used for numbering months of a financial year to period numbering. It is used to compare month to month, actual v budget, quarter to quarter, year to year variances. It is the initial point for other reports that need the use of months. Answer option C is incorrect. Trust Center is where a user can find security and privacy settings for Microsoft Office 2010 programs.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:33:00.000Z",
        "voteCount": 1,
        "content": "Option A : Gaant chart to represent a project schedule and progress"
      },
      {
        "date": "2023-10-01T09:20:00.000Z",
        "voteCount": 1,
        "content": "A A Gantt Chart is a visual representation of a project's schedule and progress, making it a suitable choice for tracking project tasks and team members' progress. It allows him to see task timelines, dependencies, and the overall project schedule at a glance. Excel provides templates and tools for creating Gantt Charts to help manage and monitor project progress effectively."
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126873-exam-77-888-topic-1-question-4-discussion/",
    "body": "You work as an Office Assistant for Blue Well Inc. The company has a Windows-based network. You want to quickly filter data in a PivotTable report without opening drop-down lists to find the items that you want to filter. For this purpose, you are required to use a slicer. Which of the following are the ways that you can use to accomplish the task? Each correct answer represents a complete solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a copy of a slicer connected with the PivotTable.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a slicer connected with the PivotTable.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a slicer by disabling Macros associated with the PivotTable.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse an existing slicer connected with another PivotTable."
    ],
    "answer": "ABD",
    "answerDescription": "The various ways to use or create slicers to filter PivotTable data in an existing PivotTable are as follows:<br>1. Create a slicer connected with the PivotTable.<br>2. Create a copy of a slicer connected with the PivotTable.<br>3. Use an existing slicer connected with another PivotTable.<br>Answer option C is incorrect. This is an invalid answer option.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:34:00.000Z",
        "voteCount": 1,
        "content": "The various ways to use or create slicers to filter PivotTable data in an existing PivotTable are as follows:\n1. Create a slicer connected with the PivotTable.\n2. Create a copy of a slicer connected with the PivotTable.\n3. Use an existing slicer connected with another PivotTable.\n Answer : option abd"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126874-exam-77-888-topic-1-question-5-discussion/",
    "body": "You work as an Office Assistant for Tech Perfect Inc. You are working in the spreadsheet of the company's high selling products. You want to find out the matching values in the columns. While doing so, you get an unexpected error that when you attempt to look up or match a lookup_value within an array; Excel is not able to recognize the matching value. You want to store sets of values as text and convert sets of data to text by using Excel's Text To Columns tool. Which of the following steps will you take to accomplish the task?<br>Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Text to Columns option from the Data tab at the top of the Excel workbook.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect Text and click the Finish button in Column Data Formats.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Delimited option and click Next",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMake sure that all delimiter options are unselected, and then again click Next.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemove the unseen spaces at the start or end of the first Macro cell.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the cells to convert their data to text."
    ],
    "answer": "FACDB",
    "answerDescription": "In this situation, you will take the following steps:<br>1. Select the cells to convert their data to text.<br>2. Select the Text to Columns option from the Data tab at the top of your Excel workbook.<br>3. Select the Delimited option and click Next.<br>4. Make sure that all delimiter options are unselected, and then again click Next.<br>5. Select Text and click the Finish button in Column Data Formats.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:36:00.000Z",
        "voteCount": 1,
        "content": "1. Select the cells to convert their data to text.\n2. Select the Text to Columns option from the Data tab at the top of your Excel workbook.\n3. Select the Delimited option and click Next.\n4. Make sure that all delimiter options are unselected, and then again click Next.\n5. Select Text and click the Finish button in Column Data Formats.\nAnswer: option facdb"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126875-exam-77-888-topic-1-question-6-discussion/",
    "body": "You work as an Office Assistant for Tech Perfect Inc. You are working in a spreadsheet. You observe that while trying to look up or match a lookup_value within an array, Excel is not able to recognize the matching value. Which of the following are the reasons that are causing the above problem?<br>Each correct answer represents a complete solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe lookup_value or the array you are searching resides in a cell containing unseen spaces at the start or end of that cell.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe contents of the cells that are being compared may have different data types.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExcel is trying to reference an invalid cell.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou are inserting a new column, next to a column that is already formatted as text."
    ],
    "answer": "AB",
    "answerDescription": "The Failure to Look Up Values in Excel error occurs when a user gets an unexpected error while trying to look up or match a lookup_value within an array and<br>Excel is not able to recognize the matching value. If the lookup_value or the array the user is searching resides in a cell, the user can have unseen spaces at the start or end of that cell. This will create the situation where the contents of the two cells that the user is comparing look the same but extra spaces in one of the cells cause the cells to have slightly different content. The other reason is that the contents of the cells that are being compared may have different data types.<br>Answer option C is incorrect. The Lookup Function Won't Copy Down to Other Rows error occurs when a user uses a function in one cell and it works perfectly but when he attempts to copy the function down to other rows, he gets the #REF error. The #REF! error arises when Excel tries to reference an invalid cell. This error occurs if the user has referenced an entire worksheet by clicking on the grey square at the top left of the worksheet. For Excel, this reference range is 1 to<br>1048576. Since the references are Relative References, Excel automatically increases the row references when this cell is copied down to other rows in the spreadsheet.<br>Answer option D is incorrect. The Excel Won't Calculate My Function error occurs when a user types in a function and presses Enter, the cell shows the function as the user typed it, instead of returning the function's value. The reason that causes this problem is that the cells containing the formula are formatted as 'text' instead of the 'General' type. This happens when the user inserts a new column, next to a column that is already formatted as text due to which the new column inherits the formatting of the adjacent column.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:37:00.000Z",
        "voteCount": 1,
        "content": "The Failure to Look Up Values in Excel error occurs when a user gets an unexpected error while trying to look up or match a lookup_value within an array and\nExcel is not able to recognize the matching value. If the lookup_value or the array the user is searching resides in a cell, the user can have unseen spaces at the start or end of that cell.\nAnswer : option AB"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126876-exam-77-888-topic-1-question-7-discussion/",
    "body": "You work as an Office Assistant for Tech Tree Inc. You have created a report in a workbook in Microsoft Excel 2010. You have included various subtotals in a worksheet in the report to verify data accuracy. You want to remove all subtotals from the sheet before you send it to your manager.<br>Which of the following steps will you take to accomplish the task with the least administrative effort?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect all the subtotals. From the shortcut menu, click the Remove All Subtotals option.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHide the rows containing subtotals.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen the Subtotal dialog box by clicking the Subtotal option in the Outline group on the Data tab. Click the Remove All button.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete all the rows containing subtotals."
    ],
    "answer": "C",
    "answerDescription": "According to the question, you have to remove all subtotals from the worksheet with the least administrative effort. You can remove all subtotals from a worksheet at a time. For this, take the following steps: Open the Subtotal dialog box by clicking the Subtotal option in the Outline group on the Data tab.<br>Click the Remove All option.<br><img src=\"/assets/media/exam-media/02577/0000700001.jpg\" class=\"in-exam-image\"><br>Answer option A is incorrect. No such option is provided in Excel 2010.<br><img src=\"/assets/media/exam-media/02577/0000800001.png\" class=\"in-exam-image\"><br>Answer option B is incorrect. Although this will hide the rows containing the subtotals, the contents will remain there and can be made visible by using the Unhide row option. Moreover, the question specifically specifies to remove all subtotals from the sheet.<br>Answer option D is incorrect. Although this step will accomplish the task, it will involve a lot of administrative burden of selecting each row and deleting it manually.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:37:00.000Z",
        "voteCount": 1,
        "content": "Answer: option C"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126877-exam-77-888-topic-1-question-8-discussion/",
    "body": "You work as an Office Assistant for Tech Perfect Inc. You are working in the spreadsheet of the company's high selling products. You input a formula for calculating the monthly sell of a particular product but your Excel cell shows a string of # symbols instead of returning a value as shown below:<br><img src=\"/assets/media/exam-media/02577/0000800002.jpg\" class=\"in-exam-image\"><br>Which of the following are the reasons that are causing the above problem? Each correct answer represents a complete solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou are inserting a new column, next to a column that is already formatted as text.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe cell is not wide enough for displaying the calculated value.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe lookup_value or the array you are searching resides in a cell containing unseen spaces at the start or end of that cell.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExcel is trying to show the contents of the cell as a date or time stored as positive numeric values within Excel, but the cell contains a negative value."
    ],
    "answer": "BD",
    "answerDescription": "The Cell Shows ##### error occurs because the cell is not wide enough for displaying the calculated value. The other reason is that Excel is trying to show the contents of the cell as a date or time stored as positive numeric values within Excel, but the cell contains a negative value.<br>Answer option C is incorrect. The Failure to Look Up Values in Excel error occurs when a user gets an unexpected error while trying to look up or match a lookup_value within an array and Excel is not able to recognize the matching value. If the lookup_value or the array the user is searching resides in a cell, the user can have unseen spaces at the start or end of that cell. This will create the situation where the contents of the two cells that the user is comparing look the same but extra spaces in one of the cells cause the cells to have slightly different content. The other reason is that the contents of the cells that are being compared may have different data types. Answer option A is incorrect. The Excel Won't Calculate My Function error occurs when a user types in a function and presses Enter, the cell shows the function as the user typed it, instead of returning the function's value. The reason that causes this problem is that the cells containing the formula are formatted as 'text' instead of the 'General' type. This happens when the user inserts a new column, next to a column that is already formatted as text due to which the new column inherits the formatting of the adjacent column",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:38:00.000Z",
        "voteCount": 1,
        "content": "The Cell Shows ##### error occurs because the cell is not wide enough for displaying the calculated value. The other reason is that Excel is trying to show the contents of the cell as a date or time stored as positive numeric values within Excel, but the cell contains a negative value.\nAnswer : BD"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126878-exam-77-888-topic-1-question-9-discussion/",
    "body": "You work as a Sales Manager for Maini Industries. Your company manufactures and sells construction equipment. You have to create a report that will show the highest selling items of each month. The report will be in the following format:<br><img src=\"/assets/media/exam-media/02577/0001000001.jpg\" class=\"in-exam-image\"><br>In a workbook, you create a table named Item_table as shown below:<br><img src=\"/assets/media/exam-media/02577/0001000002.png\" class=\"in-exam-image\"><br>You fill in the required entries in the workbook.<br><img src=\"/assets/media/exam-media/02577/0001100001.png\" class=\"in-exam-image\"><br>For the third column of the sheet, you want to use formulas to fill in the values. You want the cells in the third column to get automatically filled with the names corresponding to ItemID in the second column. You want the exact values to be filled in the column. You select the C2 cell in the third column.<br>Which of the following formulas will you enter in order to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=VLOOKUP(B2,Item_table,2,FALSE)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=VLOOKUP(B2,Item_table,2,TRUE)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=VLOOKUP(2,Item_table,B2,FALSE)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=VLOOKUP(2,Item_table,B2,TRUE)"
    ],
    "answer": "A",
    "answerDescription": "In order to accomplish the task, you will use the following formula:<br>=VLOOKUP(B2,Item_table,2,FALSE)<br>Answer option B is incorrect. According to the question, you want the exact values in the column.<br>The TRUE value in the range_lookup argument provides the approximate match.<br>Answer options C and D are incorrect. The VLOOKUP functions used in the formulas have wrong syntaxes.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:39:00.000Z",
        "voteCount": 1,
        "content": "The TRUE value in the range_lookup argument provides the approximate match\nAnswer : option A"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126879-exam-77-888-topic-1-question-10-discussion/",
    "body": "You work as an Office Manager for Blue Well Inc. The company has a Windows-based network. You have two budget situations in which one is the worst case and the other is the best case. You want to create both situations on the same worksheet and then switch between them with the change in requirements. Which of the following will you use to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGoal Seek",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tData table",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tScenario",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSolver add-in"
    ],
    "answer": "C",
    "answerDescription": "A scenario is defined as a type of what-if analysis tools. It is a set of values saved by Excel and can be substituted automatically in cells on a worksheet. A user can create and save different groups of values on a worksheet and then switch to any of these new scenarios to view different results. Scenario reports are not automatically recalculated. If the user changes the values of a scenario, those changes will not be displayed in an existing summary report and he must create a new summary report to show the reflection of the changed report. Answer option A is incorrect.<br>Goal Seek is defined as a type of what-if analysis tools. It is used if a user knows the result that he wants from a formula, but he is not sure what input value the formula needs to get that result. It works with only one variable input value.<br>Answer option D is incorrect. The Solver add-in is used if a user knows the result that he wants from a formula, but he is not sure what input value the formula needs to get that result. It is used for more than one input value. It works with a group of cells related to the formula in the objective cell. Answer option B is incorrect. A data table is used to see all the outcomes in one place. It is defined as a type of what-if analysis tools. It is used if a user has a formula that uses one or two variables or multiple formulas that all use one common variable. It is used to examine a range of possibilities at a glance and since the user focuses on only one or two variables, results are easy to read and share in tabular form. If automatic recalculation is enabled, it is possible to recalculate the data in data tables immediately and as a result, the user always gets fresh data.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:40:00.000Z",
        "voteCount": 1,
        "content": "scenario is defined as a type of what-if analysis tools. It is a set of values saved by Excel and can be substituted automatically in cells on a worksheet.\nAnswer : option C"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126880-exam-77-888-topic-1-question-11-discussion/",
    "body": "Which of the following is used to display a trend based on adjacent data in a clear and compact graphical representation by taking up a small amount of space?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrendline",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLine chart",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSparkline",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBackstage view"
    ],
    "answer": "C",
    "answerDescription": "A sparkline is defined as a tiny chart in the background of a cell. Unlike charts on an Excel Worksheet, sparklines are not objects. It is used because data presented in a row or column is useful, but patterns can be hard to spot at a glance. It is used to display a trend based on adjacent data in a clear and compact graphical representation by taking up a small amount of space.<br>The benefit of using the sparklines is that these can be printed when a user prints a worksheet that contains them. This feature is not available in charts.<br>Answer option D is incorrect. The Microsoft Office Backstage view is used to replace the traditional file menu with a new approach that uses In and Out features for efficiency. The improved Ribbon enables users to access their preferred commands rapidly and create custom tabs to personalize the way they work.<br>Answer option A is incorrect. A trendline is defined in Excel 2010. It is a data visualization tool to display the trend of a particular data range.<br>It is used to show the slope of data points in a chart. There are various types of trendlines, such as linear trendlines, exponential trendlines, and linear forecast trendlines.<br>Answer option B is incorrect. Excel provides a column chart facility to display data that is arranged in columns or rows on a worksheet. Line charts are used to display continuous data over time, set against a common scale. In a line chart, category data is distributed along the horizontal axis, and all value data is distributed along the vertical axis. Line charts are ideal for showing trends in data at equal intervals.<br><img src=\"/assets/media/exam-media/02577/0001300001.jpg\" class=\"in-exam-image\"><br>A line chart should be used where category labels are text, and are representing evenly spaced Values such as months, quarters, or years.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:40:00.000Z",
        "voteCount": 1,
        "content": "sparkline is defined as a tiny chart in the background of a cell.\nAnswer : option C"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126881-exam-77-888-topic-1-question-12-discussion/",
    "body": "You work as a Sales Manager for Rainbow Inc. Your responsibility includes preparing sales report of the Sales department. You use Microsoft Excel 2010 to prepare sales reports. You have created a quarterly sales report of the department. After entering required data and inserting charts, you want to give a professional look to the document. You want to produce the document with soothing graphic effects, soft fonts, and light colors. Which of the following steps will you take to accomplish the task with least administrative burden?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the SmartArt option.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new workbook through a template. Copy all data and charts of the report to the new workbook.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tChoose one of the pre-built themes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect all the text of the document. Change font style to Verdana and font color to light gray. Use vibrant colors for charts."
    ],
    "answer": "C",
    "answerDescription": "In order to accomplish the task, you will have to choose one of the pre-built themes. Document themes work on the overall design of the entire document. It enables users to specify colors, fonts, and variety of graphic effects in a document. Themes change the look and feel of the document.<br><img src=\"/assets/media/exam-media/02577/0001400001.png\" class=\"in-exam-image\"><br>Microsoft Excel 2010 comes with a large collection of pre-built themes. Users can create their own themes for a document. Themes can be specified through Page<br>Layout &gt; Themes.<br>Answer option A is incorrect. The SmartArt option does not produce soothing graphic effects, soft fonts, and light colors.<br>Answer options B and D are incorrect. These options involve manual processing. Therefore, any formatting done manually will increase the administrative burden.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:41:00.000Z",
        "voteCount": 1,
        "content": "C. Choose one of the pre-built themes."
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126882-exam-77-888-topic-1-question-13-discussion/",
    "body": "You work as an Office Assistant for Blue Well Inc. The company has a Windows-based network. You want to filter data in a PivotTable report without opening drop-down lists to find the items that you want to filter. For this purpose, you are using a slicer. After filtering the data, you want to disconnect the slicer. You have clicked anywhere in the PivotTable report. Which of the following steps will you take next to accomplish the task?<br>Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClear the check box of any PivotTable fields for which you want to disconnect a slicer.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRight-click the slicer, and then click Remove &lt;Name of slicer&gt;.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick the Insert Slicer arrow, and then click Slicer Connections on the Options tab in the Sort &amp; Filter group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick the slicer, and then press Delete."
    ],
    "answer": "AC",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:43:00.000Z",
        "voteCount": 1,
        "content": "Option A and C"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126883-exam-77-888-topic-1-question-14-discussion/",
    "body": "You work as an Office Assistant for Tech Perfect Inc. You are working in a spreadsheet as shown below:<br><img src=\"/assets/media/exam-media/02577/0001600001.jpg\" class=\"in-exam-image\"><br>You want to use Excel Transpose Function for copying the contents of cells B1:B3 into cells A5:C5.<br>You simply type '=TRANSPOSE( B1:B3 )' into the cells A5:C5. It displays the Excel #VALUE! error message because the cells are working independently and the function will not work for each individual cell. Therefore, it is required to make the cells A5:C5 work together as an ARRAY. For this purpose, you are required to use an array formula. Which of the following steps will you take to input Excel array formulas in the spreadsheet?<br>Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tType the array formula into the first cell.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHighlight the range of cells that you want to use as an input in his array formula.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPress CTRL-SHIFT-Tab to remove the error message.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPress CTRL-SHIFT-Enter."
    ],
    "answer": "ABD",
    "answerDescription": "The following steps are taken to input Excel array formulas:<br>1. Highlight the range of cells that a user wants to use as an input in his array formula.<br>2. Type the array formula into the first cell or make this cell editable by pressing F2 or clicking in the formula bar if a user has already specified a value into the first cell.<br>3. Press CTRL-SHIFT-Enter.<br>Answer option C is incorrect. This is an invalid answer option.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:43:00.000Z",
        "voteCount": 1,
        "content": "Option : A B D"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126884-exam-77-888-topic-1-question-15-discussion/",
    "body": "HOTSPOT -<br>You work as a technician in Tech Perfect Inc. The Network Administrator of the company installs the Microsoft Excel 2010 application on the network. You open the application and see various changes in Excel 2010. You have to open an existing worksheet through the application. You are unable to find the Office button.<br>Mark the option that you will click to accomplish the task.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02577/0001700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02577/0001800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "You will have to click File button to accomplish the task. Clicking the File button will open the full- screen Backstage View of the sheet.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:44:00.000Z",
        "voteCount": 1,
        "content": "You will have to click File button to accomplish the task. Clicking the File button will open the full- screen Backstage View of the sheet."
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126885-exam-77-888-topic-1-question-16-discussion/",
    "body": "You work as an Office Assistant for Tech Tree Inc. You have created a report in a workbook in Microsoft Excel 2010. You have a number of PivotTables in a single report. You want to apply the same filter to all of those PivotTables. For this purpose, you are required to create a slicer in one PivotTable and share it with other<br>PivotTables. Which of the following steps will you take to accomplish the task?<br>Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Insert Slicers dialog box, select the check box of the PivotTable fields for which you want to create a slicer.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick Insert Slicer in the Sort &amp; Filter group on the Options tab.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHold down CTRL, and then click the items on which you want to filter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Macro enabled checkbox of the PivotTable fields for which you want to create a slicer in the Insert Security dialog box and then click OK.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick anywhere in the PivotTable report for which you want to create a slicer."
    ],
    "answer": "ABCE",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:44:00.000Z",
        "voteCount": 1,
        "content": "Option : ABCE"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126886-exam-77-888-topic-1-question-17-discussion/",
    "body": "Jack wants the rows containing the name Tom and product Jam. There are thousands of entries in the log. Plowing through all the records will be time taking.<br>Which option can be used to view only the relevant records?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAutofilter",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFind",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSort",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAll filter"
    ],
    "answer": "A",
    "answerDescription": "Autofilter is used to filter the record as per the condition by hiding the rest. Defining different filters, you can compare data in multiple ways, so you can glean vital information without wasting vital time.<br>Answer options B and D are incorrect. There are no such options defined in Excel to filter the records.<br>Answer options C is incorrect. The Sort function is used to arrange the records in ascending or descending order.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:45:00.000Z",
        "voteCount": 1,
        "content": "A. Autofilter"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126887-exam-77-888-topic-1-question-18-discussion/",
    "body": "Rick works as an Office Assistant for Tech Perfect Inc. The company has a Windows-based network. He is creating a form through Microsoft Excel 2010. He wants to enable worksheet forms to satisfy the flexible design requirements and to customize their appearance, behavior, fonts, and other characteristics. Which of the following will Rick use to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tForm control",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAccounting template",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrust Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tActiveX control"
    ],
    "answer": "D",
    "answerDescription": "ActiveX controls are used on worksheet forms, with or without the use of VBA code, and on VBA UserForms. They are used when a user needs more flexible design requirements than those provided by Form controls. They have extensive properties that can be used to customize their appearance, behavior, fonts, and other characteristics. The user can control different events that occur when an ActiveX control is interacted with. He can also write macros that respond to events associated with the ActiveX controls. When a user interacts with the control, the VBA code runs to process any events that occur for that control. The ActiveX controls cannot be added to chart sheets from the user interface or to XLM macro sheets. It is not possible to assign a macro to run directly from the ActiveX control.<br>Answer option A is incorrect. A form control is an original control that is compatible with old versions of Excel, beginning with Excel version 5. 0. It is designed for use on XLM macro sheets. It can be used when a user wants to simply interact with cell data without using VBA code and when he wants to add controls to chart sheets. By using form controls, the user can run macros.<br>He can attach an existing macro to a control, or write or record a new macro. These controls cannot be added to UserForms, used to control events, or modified to run Web scripts on Web pages.<br>Answer option B is incorrect. The accounting template is used for numbering months of a financial year to period numbering. It is used to compare month to month, actual v budget, quarter to quarter, year to year variances. It is the initial point for other reports that need the use of months. Answer option C is incorrect.<br>Trust Center is where a user can find security and privacy settings for Microsoft Office 2010 programs.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:45:00.000Z",
        "voteCount": 1,
        "content": "D. ActiveX control"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126888-exam-77-888-topic-1-question-19-discussion/",
    "body": "You work as a Finance Manager for Blue Well Inc. The company has a Windows-based network. You are using Excel spreadsheet for maintaining the financial budget and other financial calculations. You want to return the price per $100 face value of a security that pays interest at maturity. Which of the following financial functions will you use to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPRICE function",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPPMT function",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPRICEMAT function",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPRICEDISC function"
    ],
    "answer": "C",
    "answerDescription": "Various financial functions (reference) are as follows:<br>1. ACCRINT function: It is used to return the accrued interest for a security that pays periodic interest.<br>2. ACCRINTM function: It is used to return the accrued interest for a security that pays interest at maturity.<br>3. AMORDEGRC function: It is used to return the depreciation for each accounting period by using a depreciation coefficient.<br>4. COUPDAYBS function: It is used to return the number of days from the beginning of the coupon period to the settlement date.<br>5. AMORLINC function: It is used to return the depreciation for each accounting period.<br>6. COUPDAYS function: It is used to return the number of days in the coupon period containing the settlement date.<br>7. COUPDAYSNC function: It is used to return the number of days from the settlement date to the next coupon date.<br>8. COUPNCD function: It is used to return the next coupon date after the settlement date.<br>9. COUPNUM function: It is used to return the number of coupons payable between the settlement date and maturity date.<br>10. COUPPCD function: It is used to return the previous coupon date before the settlement date.<br>11. CUMIPMT function: It is used to return the cumulative interest paid between two periods.<br>12. CUMPRINC function: It is used to return the cumulative principal paid on a loan between two periods.<br>13. DB function: It is used to return the depreciation of an asset for a specified period by using the fixed-declining balance method.<br>14. DDB function: It is used to return the depreciation of an asset for a particular period by using the double-declining balance method.<br>15. DISC function: It is used to return the discount rate for a security.<br>16. DOLLARDE function: It is used to convert a dollar price that is expressed as a fraction into a dollar price that is expressed as a decimal number.<br>17. DOLLARFR function: It is used to convert a dollar price that is expressed as a decimal number into a dollar price that is expressed as a fraction.<br>18. DURATION function: It is used to return the annual duration of a security with periodic interest payments.<br>19. EFFECT function: It is used to return the effective annual interest rate.<br>20. FV function: It is used to return the future value of an investment.<br>21. FVSCHEDULE function: It is used to return the future value of a starting principal after applying a series of compound interest rates.<br>22. INTRATE function: It is used to return the interest rate for a fully invested security.<br>23. IPMT function: It is used to return the interest payment for an investment for a specified period.<br>24. IRR function: It is used to return the internal rate of return for a series of cash flows.<br>25. ISPMT function: It is used to calculate the interest paid during a particular period of an investment.<br>26. MDURATION function: It is used to return the Macauley modified duration for a security with an assumed par value of $100.<br>27. MIRR function: It is used to return the internal rate of return in which positive and negative cash flows are financed at different rates.<br>28. NOMINAL function: It is used to return the annual nominal interest rate.<br>29. NPER function: It is used to return the number of periods for an investment.<br>30. NPV function: It is used to return the net present value of an investment on the basis of a series of periodic cash flows and a discount rate.<br>31. ODDFPRICE function: It is used to return the price per $100 face value of a security with an odd first period.<br>32. ODDFYIELD function: It is used to return the yield of a security with an odd first period.<br>33. ODDLPRICE function: It is used to return the price per $100 face value of a security with an odd last period.<br>34. ODDLYIELD function: It is used to return the yield of a security with an odd last period.<br>35. PMT function: It is used to return the periodic payment for an annuity.<br>36. PPMT function: It is used to return the payment on the principal for an investment for a particular defined period.<br>37. PRICE function: It is used to return the price per $100 face value of a security that pays periodic interest.<br>38. PRICEDISC function: It is used to return the price per $100 face value of a discounted security.<br>39. PRICEMAT function: It is used to return the price per $100 face value of a security that pays interest at maturity.<br>40. PV function: It is used to return the current value of an investment.<br>41. RATE function: It is use d to return the interest rate per period of an annuity.<br>42. RECEIVED function: It is used to return the amount received at maturity for a fully invested security.<br>43. SLN function: It is used to return the straight-line depreciation of an asset for one period.<br>44. SYD function: It is used to return the sum-of-years' digits depreciation of an asset for a particular period.<br>45. TBILLEQ function: It is used to return the bond-equivalent yield for a Treasury bill.<br>46. TBILLPRICE function: It is used to return the price per $100 face value for a Treasury bill.<br>47. TBILLYIELD function: It is used to return the yield for a Treasury bill.<br>48. VDB function: It is used to return the depreciation of an asset for a specified or partial period by using a declining balance method.<br>49. XIRR function: It is used to return the internal rate of return for a schedule of cash flows that is not necessarily periodic.<br>50. XNPV function: It is used to return the net present value for a schedule of cash flows that is not necessarily periodic.<br>51. YIELD function: It is used to return the yield on a security that pays periodic interest.<br>52. YIELDDISC function: It is used to return the annual yield for a discounted security.<br>53. YIELDMAT function: It is used to return the annual yield of a security that pays interest at maturity.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:45:00.000Z",
        "voteCount": 1,
        "content": "C. PRICEMAT function"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126889-exam-77-888-topic-1-question-20-discussion/",
    "body": "Rick works as an Office Assistant for Tech Perfect Inc. He is creating a report through Microsoft Excel 2010. Rick wants to interact with cell data but his computer does not contain VBA code and few features of his computer are still Excel 5. 0 features. Which of the following will Rick use to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAccounting template",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTrust Center",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tForm control",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEvaluate Formula"
    ],
    "answer": "C",
    "answerDescription": "A form control is an original control that is compatible with old versions of Excel, beginning with Excel version 5. 0. It is designed for use on XLM macro sheets. It can be used when a user wants to simply interact with cell data without using VBA code and when he wants to add controls to chart sheets. By using form controls, the user can run macros. He can attach an existing macro to a control, or write or record a new macro. These controls cannot be added to UserForms, used to control events, or modified to run Web scripts on Web pages. Answer option A is incorrect. The accounting template is used for numbering months of a financial year to period numbering. It is used to compare month to month, actual v budget, quarter to quarter, year to year variances. It is the initial point for other reports that need the use of months.<br>Answer option D is incorrect. Evaluate Formula is the formula examination tool provided by Microsoft Excel. This tool is useful for examining formulas that do not produce any error but are not generating the expected result.Answer option B is incorrect. Trust Center is where a user can find security and privacy settings for<br>Microsoft Office 2010 programs.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:46:00.000Z",
        "voteCount": 1,
        "content": "C. Form control"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126890-exam-77-888-topic-1-question-21-discussion/",
    "body": "You work as an Office Assistant for Blue well Inc. The company has a Windows-based network. You want to create a VBA procedure for the open event of a workbook. You are at the step of adding the following lines of code to the procedure:<br>\"Private Sub Workbook_Open() MsgBox Time Worksheets(\"Sheet2\").Range(\"A2\").Value = Time End Sub\"<br>Which of the following are the next steps that you will take to accomplish the task? Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUnder Macro Settings in the Macro Settings category, click Enable all macros, and then click OK.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSwitch to Excel and save the workbook with the .xslm extension as a macro-enabled workbook and close it.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReopen the workbook.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick OK in the message box."
    ],
    "answer": "BCD",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:47:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer: BCD"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126891-exam-77-888-topic-1-question-22-discussion/",
    "body": "Which of the following steps will you take to merge copies of a shared workbook? Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Select Files to Merge into Current Workbook dialog box, click a copy of the workbook containing changes to be merged, and then click OK.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick Compare and Merge Workbooks on Quick Access Toolbar.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen the copy of the shared workbook to merge the changes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSave the workbook if prompted.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd Compare and Merge Workbooks.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick Compare and Merge Workbooks on Macro Enabled Access Toolbar."
    ],
    "answer": "ABCDE",
    "answerDescription": "Take the following steps to merge copies of a shared workbook:<br>1. Add Compare and Merge Workbooks.<br>2. Open the copy of the shared workbook to merge the changes.<br>3. Click Compare and Merge Workbooks on Quick Access Toolbar.<br>4. Save the workbook if prompted.<br>5. In the Select Files to Merge into Current Workbook dialog box, click a copy of the workbook containing changes to be merged, and then click OK.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:47:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer: ABCDE"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126892-exam-77-888-topic-1-question-23-discussion/",
    "body": "You work as an Office Assistant for Blue Well Inc. The company has a Windows-based network. Some employees have changed some data in the worksheet of the company. You want to identify changes that were made to the data in the workbook and then take a decision whether to accept or reject those changes. For this purpose, it is required to access and use the stored change history.<br>Which of the following will you use to accomplish the task?<br>Each correct answer represents a complete solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHistory tracking",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOnscreen highlighting",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSlicer-enabled highlighting",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tReviewing of changes"
    ],
    "answer": "BAD",
    "answerDescription": "The following ways are provided by Excel to access and use the stored change history:<br>1. Onscreen highlighting: It is used when a workbook does not contain many changes and a user wants to see all changes at a glance.<br>2. History tracking: It is used when a workbook has many changes and a user wants to investigate what occurred in a series of changes.<br>3. Reviewing of changes: It is used when a user is evaluating comments from other users. Answer option C is incorrect. This is an invalid answer option.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:47:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer: BAD"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126893-exam-77-888-topic-1-question-24-discussion/",
    "body": "You work as a Sales Manager for Tech Perfect Inc. You are creating a report for your sales team Using Microsoft Excel. You want the report to appear in the following format:<br><img src=\"/assets/media/exam-media/02577/0002400001.jpg\" class=\"in-exam-image\"><br>You want the Remark column to be filled through a conditional formula. The criteria to give the remark is as follows:<br>✑ If the sales of the First Quarter are greater than or equal to 1200, display \"Well Done\"<br>✑ If the sales of the First Quarter is less than 1200, display \"Improve in Next Quarter\"<br>You have done most of the entries in a workbook. You select the F2 cell as shown in the image given below:<br><img src=\"/assets/media/exam-media/02577/0002500001.jpg\" class=\"in-exam-image\"><br>Which of the following conditional formulas will you insert to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=IF(E2&gt;=1200,\"Improve in Next Quarter\",\"Well Done\")",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=IF(E2&lt;=1200,\"Well Done\",\"Improve in Next Quarter\")",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=IF(E2&gt;=1200,\"Well Done\",\"Improve in Next Quarter\")",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=IF(E2&gt;1200,\"Improve in Next Quarter\",\"Well Done\")"
    ],
    "answer": "C",
    "answerDescription": "In order to accomplish the task, you will have to insert the following formula in the F2 cell:<br>=IF(E2&gt;=1200,\"Well Done\",\"Improve in Next Quarter\")<br>Answer option A is incorrect. This will display the wrong messages for the given conditions. The first expression after the logical condition is returned by the IF function when the condition is TRUE.<br>Answer option B is incorrect. This formula will not accomplish the task as the logical condition is not correct. The specified condition in this formula is testing for values less than or equal to 1200. Whereas, the question's requirement is to evaluate values greater than or equal to 1200.<br>Answer option D is incorrect. This formula will not accomplish the task because of the two reasons.<br>First, the equal sign is missing in the condition. Second, the expressions are not in the correct order.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:47:00.000Z",
        "voteCount": 1,
        "content": "C. =IF(E2&gt;=1200,\"Well Done\",\"Improve in Next Quarter\")"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126894-exam-77-888-topic-1-question-25-discussion/",
    "body": "You work as an Office Assistant for Peach Tree Inc. Your responsibility includes creating sales incentive report of all sales managers for every quarter. You are using Microsoft Excel to create a worksheet for preparing the report. You have inserted the sales figures of all sales managers as shown in the image given below:<br><img src=\"/assets/media/exam-media/02577/0002600001.png\" class=\"in-exam-image\"><br>You have to calculate the first quarter incentives for all sales managers. The incentive percentage (provided in cell B3) is fixed for all sales managers. The incentive will be calculated on their total first quarter sales. You have to write a formula in the cell F8. Then you will drag the cell border to the cell F12 to copy the formula to all the cells from F8 to F12. In the first step, you select the F8 cell. Which of the following formulas will you insert to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=&amp;B&amp;3/100 * E8",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=B3/100 * E8",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=B3/100 * &amp;E&amp;8",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=$B$3/100 * E8",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t=B3/100 * $E$8"
    ],
    "answer": "D",
    "answerDescription": "In order to accomplish the task, you will have to insert the following formula:<br>=$B$3/100 * E8<br>According to the question, the formula will be inserted in cell F8 and then the cell's border will be dragged to the F12 cell. Furthermore, the incentive percentage is fixed for all sales managers and the value is provided in the cell B3. You will have to insert a formula that refers to the B3 cell as an absolute reference. For this you will have to type currency symbol ($) before the row name and column number. In order to accomplish the task, type the following formula in the cell F8:<br>=$B$3/100 * E8<br>When absolute reference is used for referencing a cell in a formula, dragging cell's border to another cell does not change the cell's reference.<br>Answer options B and E are incorrect. This formula references the B3 cell as a relative reference.<br>After inserting the formula, when the cell's border is dragged, it will change the cell reference relatively.<br>Answer options A and C are incorrect. Ampersand symbol (&amp;) is not used for referencing cells in Excel.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:49:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer: D"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126895-exam-77-888-topic-1-question-26-discussion/",
    "body": "You work as an Office Assistant for Dreams Unlimited Inc. You use Microsoft Excel 2010 for creating various types of reports. You have created a report in the format given below:<br><img src=\"/assets/media/exam-media/02577/0002700001.jpg\" class=\"in-exam-image\"><br>In the A7 cell, you are required to put a formula so that it can fulfill the description provided in the B7 cell.<br>Which of the following formulas will provide the required result?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCOUNTIF(B2:C5,\"=Yes\")",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCOUNTIFS(B2:C5,\"=Yes\")",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCOUNTIF(B2:B5,\"=Yes\",C2:C5,\"=Yes\")",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCOUNTIFS(B2:B5,\"=Yes\",C2:C5,\"=Yes\")"
    ],
    "answer": "D",
    "answerDescription": "In order to get the required result, you will have to insert the following formula in the B7 cell:<br>COUNTIFS(B2:B5,\"=Yes\",C2:C5,\"=Yes\")<br>Only Sarah and David have exceeded their January and February quotas, therefore the formula will provide 2 as the result.<br>Answer option C is incorrect. The COUNTIF function of Excel does not support multiple criteria.<br>Answer options A and B are incorrect. This formula will count all the cells that have the value \"Yes\" in the range B2:C5. As multiple criteria are not applied in the formula, it will provide 6 as the result.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:49:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer: D"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126896-exam-77-888-topic-1-question-27-discussion/",
    "body": "You work as an Office Assistant for Media Perfect Inc. You have created a spreadsheet in Excel 2010 and shared it with the other employees of the company. You want to protect the worksheet and locked cells by permitting or prohibiting other employees to select, format, insert, delete, sort, or edit areas of the spreadsheet.<br>Which of the following options will you use to accomplish the task?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMark as Final",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEncrypt with Password",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProtect Current Sheet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProtect Workbook Structure"
    ],
    "answer": "C",
    "answerDescription": "The various Protect Workbook options are as follows:<br>1. Mark as Final: This option is used to make the document read-only. When a spreadsheet is marked as final, various options such as typing, editing commands, and proofing marks are disabled or turned off and the spreadsheet becomes read-only. This command helps a user to communicate that he is sharing a completed version of a spreadsheet. This command also prevents reviewers or readers from making inadvertent modifications to the spreadsheet.<br>2. Encrypt with Password: When a user selects the Encrypt with Password option, the Encrypt Document dialog box appears. In the Password box, it is required to specify a password. Microsoft is not able to retrieve lost or forgotten passwords, so it is necessary for a user to keep a list of passwords and corresponding file names in a safe place.<br>3. Protect Current Sheet: This option is used to select password protection and permit or prohibit other users to select, format, insert, delete, sort, or edit areas of the spreadsheet. This option protects the worksheet and locked cells.<br>4. Protect Workbook Structure: This option is used to select password protection and select options to prevent users from changing, moving, and deleting important data. This feature enables a user to protect the structure of the worksheet.<br>5. Restrict Permission by People: This option works on the basis of Window Rights Management to restrict permissions. A user is required to use a Windows Live<br>ID or a Microsoft Windows account to restrict permissions. These permissions can be applied via a template that is used by the organization in which the user is working. These permissions can also be added by clicking Restrict Access.<br>6. Add a Digital Signature: This option is used to add a visible or invisible digital signature. It authenticates digital information such as documents, e-mail messages, and macros by using computer cryptography. These signatures are created by specifying a signature or by using an image of a signature for establishing authenticity, integrity, and non-repudiation.<br><img src=\"/assets/media/exam-media/02577/0002900001.jpg\" class=\"in-exam-image\">",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:49:00.000Z",
        "voteCount": 1,
        "content": "C. Protect Current Sheet"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/126897-exam-77-888-topic-1-question-28-discussion/",
    "body": "Rick works as an Office Assistant for Tech Perfect Inc. He is creating a user form through Microsoft Excel 2010. While creating forms for a number of users, he is required to repeat some of the actions multiple times. It is a very time consuming process. To resolve the issue, he has created a macro to record the sequence of actions to perform a certain task. Now, he wants to run the macro to play those exact actions back in the same order. Which of the following steps will Rick take to accomplish the task?<br>Each correct answer represents a part of the solution. Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClick on the 'Macros' icon in the 'Developer' tab under the 'Code' category to run a Macro.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Macro will be run in any worksheet of the Workbook.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPut the workbook in a trusted location.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tThe Macro dialogue box appears on the screen which contains a list of Macros in it. Select the Macro to run and click the Run button.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the created Macro by using the shortcut key specified while creating the Macro."
    ],
    "answer": "ABDE",
    "answerDescription": "Take the following steps to run a Macro:<br>1. Click on the 'Macros' icon in the 'Developer' tab under the 'Code' category to run a Macro.<br><img src=\"/assets/media/exam-media/02577/0003000001.jpg\" class=\"in-exam-image\"><br>2. The Macro dialogue box appears on the screen which contains a list of Macros in it. Select the Macro to run and click the Run button.<br><img src=\"/assets/media/exam-media/02577/0003100001.jpg\" class=\"in-exam-image\"><br>3. The Macro will be run in any worksheet of the Workbook.<br>4. A user can run the created Macro by using the shortcut key that he has specified while creating the Macro. The macro records the user's mouse clicks and keystrokes while he works and lets him play them back later. The macro can be used to record the sequence of commands that the user uses to perform a certain task. When the user runs the macro, it plays those exact commands back in the same order. Answer option C is incorrect. The benefit of connecting to external data from Microsoft Excel is that a user can automatically update Excel workbooks from the real data source whenever the data source is updated with new information. It is possible that the external data connection might be disabled on the computer. For connecting to the data source whenever a workbook is opened, it is required to enable data connections by using the Trust Center bar or by putting the workbook in a trusted location.",
    "votes": [],
    "comments": [
      {
        "date": "2023-11-22T03:50:00.000Z",
        "voteCount": 1,
        "content": "Correct Answer: ABDE"
      }
    ],
    "examNameCode": "77-888",
    "topicNumber": "1"
  }
]