[
  {
    "topic": 10,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/57535-exam-sc-300-topic-10-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to implement on-premises application and SharePoint Online restrictions to meet the authentication requirements and the access requirements.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04262/0012300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04262/0012300002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/sharepoint/app-enforced-restrictions https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/concept-conditional-access-session",
    "votes": [],
    "comments": [
      {
        "date": "2023-07-04T10:13:00.000Z",
        "voteCount": 3,
        "content": "On-premise: Publish the applications by using Azure AD Application Proxy\nSharePoint: Configure app-enforced restreictions"
      },
      {
        "date": "2022-07-09T12:27:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/azure/active-directory/app-proxy/application-proxy"
      },
      {
        "date": "2022-07-01T10:16:00.000Z",
        "voteCount": 2,
        "content": "now called Conditional Access App Control"
      },
      {
        "date": "2022-08-27T00:26:00.000Z",
        "voteCount": 4,
        "content": "App Enforce Restrictions (https://aka.ms/caapprestrictions)  are for supported apps only: Office 365, Exchange Online and Sharepoint Online.    Conditional access app Control (https://aka.ms/mcaslearnmore) supports various Cloud Apps not supported by App Enforced Restrictions."
      },
      {
        "date": "2022-06-28T21:30:00.000Z",
        "voteCount": 1,
        "content": "Given answers are correct"
      },
      {
        "date": "2022-03-21T05:41:00.000Z",
        "voteCount": 1,
        "content": "just pass the exam today. This came in the question."
      },
      {
        "date": "2022-03-10T11:44:00.000Z",
        "voteCount": 2,
        "content": "Super easy.  Given answers are correct."
      },
      {
        "date": "2022-01-24T17:55:00.000Z",
        "voteCount": 2,
        "content": "On the exam 1/20/2022"
      },
      {
        "date": "2021-07-09T06:35:00.000Z",
        "voteCount": 3,
        "content": "IMHO first boss option is wrong, second is right\n\nConfigure Cloud App Security polices\n\nConditional Access App Control enables user app access and sessions to be monitored and controlled in real time based on access and session policies. Access and session policies are used within the Cloud App Security portal to further refine filters and set actions to be taken on a user.\n\nConfigure app-enforced settings\nConditional Access App Control uses a reverse proxy architecture and integrates with your IdP. When integrating with Azure AD Conditional Access, you can configure apps to work with Conditional Access App Control with just a few clicks, allowing you to easily and selectively enforce access and session controls on your organization's apps based on any condition in Conditional Access..\n\nProtect apps with Microsoft Cloud App Security Conditional Access App Control\nhttps://docs.microsoft.com/en-us/cloud-app-security/proxy-intro-aad#featured-apps\nhttps://docs.microsoft.com/en-us/cloud-app-security/proxy-intro-aad#how-it-works"
      },
      {
        "date": "2021-08-14T00:57:00.000Z",
        "voteCount": 23,
        "content": "The requirement for on-premise applications is \"Enforce MFA when accessing ...\", as we have already\n* Implement MFA for all Litware users (via Azure AD)\n* Litware implements Azure AD Appliication Proxy\n\nwe just need to \"Publish the applications by using Azure AD Application Proxy\" - this will force users to use their Azure AD account (and MFA) to access the on-premise applications."
      },
      {
        "date": "2023-09-28T13:01:00.000Z",
        "voteCount": 2,
        "content": "Agreed. Originally I got hung up on \"Litware implements Azure AD Application Proxy\" and assumed that they are already publishing the apps because who would implement the proxy and do nothing with it? Litware! Apparently MS thinks (or knows?) there are some dummies out there who need an average IT guy to point out the obvious. \"Publish that app!\" LMAO :-D"
      }
    ],
    "examNameCode": "sc-300",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/56154-exam-sc-300-topic-10-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to configure app registration in Azure AD to meet the delegation requirements.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04262/0012400001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04262/0012500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/azure/active-directory/roles/delegate-app-roles",
    "votes": [],
    "comments": [
      {
        "date": "2022-01-09T08:15:00.000Z",
        "voteCount": 17,
        "content": "The answer is Correct! \n1: Requirements for delegation clearly says \" Prevent users to register applications\" \n2: User1 would need App Developer to register an app in tenant using \"principle of least privilege\""
      },
      {
        "date": "2022-12-27T05:29:00.000Z",
        "voteCount": 2,
        "content": "The answer is correct. \n\nApplication Developer\nUsers in this role can create application registrations when the \"Users can register applications\" setting is set to No. This role also grants permission to consent on one's own behalf when the \"Users can consent to apps accessing company data on their behalf\" setting is set to No. Users assigned to this role are added as owners when creating new application registrations.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/roles/permissions-reference#application-developer"
      },
      {
        "date": "2023-10-07T18:13:00.000Z",
        "voteCount": 4,
        "content": "Why would the first answer of \"Allow users to register application\" be correct when it is clearly stated \"Prevent nonprivileged users from registering applications in the litware.com Azure AD tenant.\" ?\n\nThe Application Developper role is correct for the second choice tho."
      },
      {
        "date": "2023-10-26T06:16:00.000Z",
        "voteCount": 4,
        "content": "It's asking which setting you would modify, not what you would set it to"
      },
      {
        "date": "2022-06-11T09:00:00.000Z",
        "voteCount": 8,
        "content": "Given answer is correct.\nFor both questions see URL provide in answer section of question;\nhttps://docs.microsoft.com/en-us/azure/active-directory/roles/delegate-app-roles#restrict-who-can-create-applications\n\nand extraction from URL's\n\n#1 \"On the User settings page for your organization, set the Users can register applications setting to No. This will disable the default ability for users to create application registrations.\"\n\n#2 \"By default in Azure AD, all users can register applications and manage all aspects of applications they create. Everyone also has the ability to consent to apps accessing company data on their behalf. You can choose to selectively grant those permissions by setting the global switches to 'No' and adding the selected users to the Application Developer role.\"\n\nThese meet question answers"
      },
      {
        "date": "2023-11-12T07:25:00.000Z",
        "voteCount": 1,
        "content": "Second answer is not correct.\nHere the case study delegation requirement:\n\"Ensure that User1 can create enterprise applications in Azure AD\"\nNow search for \"create enterprise application\" here: https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/delegate-by-task\nIt is the Cloud Application Administrator.\nApplication Developer can \"Create application registration when ability is disabled for all users\", indeed, but no mention on Enterprise Apps description.\nWell, you can start arguing here that he has the microsoft.directory/servicePrincipals/createAsOwner permission, and I'd reply \"where is the requirement for User1 to be automatically assigned owner?\" And what is the practical use of the whole dumb MSFT question? Such questions are a pure chicanery.\nIf you follow the instructions below, the prerequisites are on ALL steps to be Application Administrator.\nhttps://learn.microsoft.com/en-us/entra/identity/app-proxy/application-proxy-add-on-premises-application#prerequisites"
      },
      {
        "date": "2023-10-20T19:45:00.000Z",
        "voteCount": 1,
        "content": "#1: Users Can Register Apps\n#2:  Cloud Application Administrator\n\n\"Ensure that User1 can create enterprise applications in Azure AD.\"\nExternal Identities/B2C:\nTask/Least privileged role/Additional Roles\nCreate enterprise applications/Cloud Application Administrator/Application Administrator\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/roles/delegate-by-task"
      },
      {
        "date": "2023-10-22T18:03:00.000Z",
        "voteCount": 1,
        "content": "I'm changing my answer.  Given answer is correct.\n#1: Users Can Register Apps\nYou would configure this to \"NO\"\nThat solves this sentence:\nPrevent nonprivileged users from registering applications in the litware.com Azure AD tenant.\n\n#2: Application Developer\n\"Assign the Application Developer role to grant the ability to create application registrations when the Users can register applications setting is set to No.\"\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/roles/delegate-app-roles#grant-individual-permissions-to-create-and-consent-to-applications-when-the-default-ability-is-disabled"
      },
      {
        "date": "2023-10-22T18:24:00.000Z",
        "voteCount": 1,
        "content": "I don't know anymore.  Cloud App Admin and App Admin all talk about the ability to register ENTERPRISE apps, which is part of the question.  Application Developers apparently don't have that ability. \nhttps://learn.microsoft.com/en-us/answers/questions/270680/app-registration-vs-enterprise-applications\n\nMaybe it is Cloud App Admin afterall....."
      },
      {
        "date": "2023-10-02T21:04:00.000Z",
        "voteCount": 1,
        "content": "For the role to assign to User1:\nI'm still not sure about this. The question says:\n- Litware.com contains a user named User1 who oversees all application development.\nLitware implements Azure AD Application Proxy.\n- Ensure that User1 can create enterprise applications in Azure AD.\n\nWith enterprise apps, it has to be at least Cloud application administrator. But, if you have to also set up application proxy, then it should be Application administrator.\n\nI'll go with Cloud application admin, but I'm not 100% sure about it."
      },
      {
        "date": "2023-08-28T14:33:00.000Z",
        "voteCount": 2,
        "content": "1: Allow users to register application\n2: Application administrator. Requirement: Ensure that User1 can create \"enterprise applications\" in Azure AD. To add an enterprise application to your Azure AD tenant, you need one of the following roles: Global Administrator, or Application Administrator.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/manage-apps/add-application-portal"
      },
      {
        "date": "2023-07-24T12:23:00.000Z",
        "voteCount": 2,
        "content": "Weired. In the text they are talking about enterprise app. There you would need cloud application admin. In the question they are asking for app registration. There App Developer would be enough."
      },
      {
        "date": "2023-07-04T10:17:00.000Z",
        "voteCount": 2,
        "content": "Allow users to register application\nApplication developer"
      },
      {
        "date": "2023-07-04T21:22:00.000Z",
        "voteCount": 1,
        "content": "What you be able to back up your answer?"
      },
      {
        "date": "2023-06-20T21:53:00.000Z",
        "voteCount": 3,
        "content": "For second one, it clearly states: Ensure that User1 can create enterprise applications in Azure AD, not register application., two different things. The key word is Create Enterprise Applications. You need Cloud Application Administrator"
      },
      {
        "date": "2023-02-14T08:21:00.000Z",
        "voteCount": 2,
        "content": "1. A\n2.C\nFrom Microsoft link: \nhttps://learn.microsoft.com/en-us/azure/active-directory/roles/delegate-app-roles\nAssign the Application Developer role to grant the ability to create application registrations when the Users can register applications setting is set to No. This role also grants permission to consent on one's own behalf when the Users can consent to apps accessing company data on their behalf setting is set to No."
      },
      {
        "date": "2023-02-09T07:56:00.000Z",
        "voteCount": 1,
        "content": "note that in the deligation requirements it had been cleary mentioned that the user! had to be able to cretae enterpirse appliacations which can be done by CAA via least previlage. App developer doesnt have the ability to create enterprise apps. HBope this clears."
      },
      {
        "date": "2023-01-15T03:36:00.000Z",
        "voteCount": 1,
        "content": "The second answer should be CAA. App developer role can't create app via enterprise application"
      },
      {
        "date": "2023-01-13T22:16:00.000Z",
        "voteCount": 2,
        "content": "It 100% should be Cloud App Admin according to the least privileged roles documentation for \"Create Enterprise Application\" action: https://learn.microsoft.com/en-us/azure/active-directory/roles/delegate-by-task#groups"
      },
      {
        "date": "2023-01-29T17:43:00.000Z",
        "voteCount": 3,
        "content": "Not only does your link say Application Developer is the least privilege role for this (https://learn.microsoft.com/en-us/azure/active-directory/roles/delegate-by-task#application-proxy), but also you should know that Cloud Application *Administrator* is equal to Application Administrator except for App Proxy, both of which are much more privileged than Application Developer"
      },
      {
        "date": "2022-10-03T23:50:00.000Z",
        "voteCount": 3,
        "content": "There is a difference between application and creating an enterprise application. Application developer role cannot add an enterprise application in Azure AD\n\n\"To add an enterprise application to your Azure AD tenant, you need:\n\nAn Azure AD user account. If you don't already have one, you can Create an account for free.\nOne of the following roles: Global Administrator, Cloud Application Administrator, or Application Administrator.\"\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/manage-apps/add-application-portal"
      },
      {
        "date": "2022-10-03T23:51:00.000Z",
        "voteCount": 2,
        "content": "Typo: There is a difference between application registration and creating an enterprise application. Application developer role cannot add an enterprise application in Azure AD"
      },
      {
        "date": "2022-10-05T15:52:00.000Z",
        "voteCount": 5,
        "content": "I tested this and also found this,\n- One of the following roles: Global Administrator, Cloud Application Administrator, or Application Administrator.\nhttps://learn.microsoft.com/en-us/azure/active-directory/manage-apps/add-application-portal#add-an-enterprise-application\n\n1 - Allow Users to register applications\n2 - Cloud Application Administrator (You cannot register Enterprise Apps with APPLICATION DEVELOPER and Application Administrator gives you Application proxy access)"
      },
      {
        "date": "2023-02-23T16:37:00.000Z",
        "voteCount": 1,
        "content": "Correct. I am going with:\n1. Allow users to register application\n2. Cloud Administrator\n(https://learn.microsoft.com/en-us/azure/active-directory/roles/delegate-by-task#enterprise-applications)\nApplication Developer CANNOT create enterprise application. Requirements say Ensure that user1 can create enterprise applications in Azure AD"
      },
      {
        "date": "2022-05-17T13:15:00.000Z",
        "voteCount": 2,
        "content": "I don't think 1 answer is correct.\nWhat does \"Allow users to register app\" mean? To allow it you should go;\nAzure AD--&gt;User settings--&gt;App registrations --&gt; Users can register applications --&gt;yes\nIs it requirement? No."
      },
      {
        "date": "2022-03-21T05:41:00.000Z",
        "voteCount": 1,
        "content": "just pass the exam today. This came in the question."
      },
      {
        "date": "2022-03-10T11:58:00.000Z",
        "voteCount": 1,
        "content": "App developers can create app registrations, thereby also creating an associated Enterprise App instance."
      }
    ],
    "examNameCode": "sc-300",
    "topicNumber": "10"
  },
  {
    "topic": 10,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83658-exam-sc-300-topic-10-question-3-discussion/",
    "body": "HOTSPOT -<br>How should the access be setup to the on-premises applications?<br>Hot Area:<br><img src=\"/assets/media/exam-media/04262/0012600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04262/0012600002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Server2 -<br>Incorrect:<br>Not Server 1: If you've deployed Azure AD Password Protection Proxy, do not install Azure AD Application Proxy and Azure AD Password Protection Proxy together on the same machine. Azure AD Application Proxy and Azure AD Password Protection Proxy install different versions of the Azure AD Connect Agent<br>Updater service. These different versions are incompatible when installed together on the same machine.<br>Server1 runs the Azure AD application Proxy connector.<br>To use Application Proxy, you need a Windows server running Windows Server 2012 R2 or later. You'll install the Application Proxy connector on the server. This connector server needs to connect to the Application Proxy services in Azure, and the on-premises applications that you plan to publish.<br>Scenario:<br>Requirements. Authentication Requirements include:<br>Enforce MFA when accessing on-premises applications.<br>Existing Environment. On-premises Environment<br>The on-premises network contains the servers shown in the following table.<br><img src=\"/assets/media/exam-media/04262/0012700001.png\" class=\"in-exam-image\"><br>Existing Environment. Identity Environment<br>The network contains an Active Directory forest named litware.com that is linked to an Azure Active Directory (Azure AD) tenant named litware.com. Azure AD<br>Connect uses pass-through authentication and has password hash synchronization disabled.<br>Litware.com contains a user named User1 who oversees all application development.<br><br>Box 2: DC1 -<br>The Azure AD Password Protection proxy service is typically on a member server in your on-premises AD DS environment. Once installed, the Azure AD<br>Password Protection proxy service communicates with Azure AD to maintain a copy of the global and customer banned password lists for your Azure AD tenant.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-password-ban-bad-on-premises-deploy https://docs.microsoft.com/en-us/azure/active-directory/app-proxy/application-proxy-add-on-premises-application",
    "votes": [],
    "comments": [
      {
        "date": "2022-11-08T11:03:00.000Z",
        "voteCount": 20,
        "content": "Correct answer is Server 2, then Azure AD.  The password protection proxy is installed on a member server.  You enable the banned p/w list in Azure AD, the proxy downloads it and passes it to the DCs in the domain."
      },
      {
        "date": "2023-11-12T07:56:00.000Z",
        "voteCount": 3,
        "content": "Agree with the majority here: Custom banned password list is configured on Azure AD, now Entra ID portal\nBTW the first part is very suspect, because AD Connect also has the \"Microsoft Entra Connect Agent Updater\" service as part of its installation routine. In real life you'd prefer a separate, additional member server.\nhttps://learn.microsoft.com/en-us/entra/identity/hybrid/verify-sync-tool-version"
      },
      {
        "date": "2022-10-04T00:09:00.000Z",
        "voteCount": 9,
        "content": "Answer should be SERVER2 and Azure AD\nConfigure the password list in Azure AD, the password protection proxy makes it available on you on prem DC, refer to the diagram in the link: \nhttps://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-password-ban-bad-on-premises-deploy"
      },
      {
        "date": "2024-04-13T18:52:00.000Z",
        "voteCount": 3,
        "content": "Server 2\nAzure AD"
      },
      {
        "date": "2024-02-25T08:38:00.000Z",
        "voteCount": 1,
        "content": "The password lists is created in Azure AD and then copied to the sysvol on the Domain Controller.\n\nhttps://learn.microsoft.com/en-us/entra/identity/authentication/howto-password-ban-bad-on-premises-operations\n\nAnd... \"The DC Agent service is responsible for initiating the download of a new password policy from Microsoft Entra ID. \"\n\nhttps://learn.microsoft.com/en-us/entra/identity/authentication/concept-password-ban-bad-on-premises"
      },
      {
        "date": "2023-07-20T06:37:00.000Z",
        "voteCount": 1,
        "content": "Look at this page\nhttps://learn.microsoft.com/en-us/training/modules/manage-user-authentication/6-deploy-manage-password-protection\nFirst one should be server 2"
      },
      {
        "date": "2023-07-04T10:20:00.000Z",
        "voteCount": 1,
        "content": "AD password protection proxy service: Server 2\nConfigure the password list: on DC1"
      },
      {
        "date": "2023-06-21T08:06:00.000Z",
        "voteCount": 1,
        "content": "AD password protection cannot be on proxy server so it is = Server 2 \nand DC needs the list of banned passwords PTA so = on  DC1"
      },
      {
        "date": "2023-04-04T07:34:00.000Z",
        "voteCount": 2,
        "content": "It is a SERVER 2 answer ! Here is written very clear : \n!! Warning !!!\n\nAzure AD Password Protection proxy and Azure AD Application Proxy install different versions of the Microsoft Azure AD Connect Agent Updater service, which is why the instructions refer to Application Proxy content. These different versions are incompatible when installed side by side and doing so will prevent the Agent Updater service from contacting Azure for software updates, so you should never install Azure AD Password Protection Proxy and Application Proxy on the same machine.\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-password-ban-bad-on-premises-deploy"
      },
      {
        "date": "2023-03-29T05:46:00.000Z",
        "voteCount": 1,
        "content": "Reasons why we need Password protection service on Server 2:\nDC1: this usually doesnt have connectivity to internet, so not an viable option\nServer1: please keep in mind that AAD password protection service and AAD Application proxy uses different versions of AAD. Gives rise to compatiblity issue\nServer2: only possible option left"
      },
      {
        "date": "2022-12-27T05:33:00.000Z",
        "voteCount": 4,
        "content": "The correct answer is Server2 and Azure AD.\nhttps://learn.microsoft.com/en-us/azure/active-directory/authentication/tutorial-configure-custom-password-protection"
      },
      {
        "date": "2022-09-26T00:41:00.000Z",
        "voteCount": 8,
        "content": "password list should be configured on Azure AD not on DC !"
      },
      {
        "date": "2022-09-30T23:58:00.000Z",
        "voteCount": 2,
        "content": "No. It must be on DC. We have pass-through authentication."
      },
      {
        "date": "2022-10-03T06:14:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/azure/active-directory/authentication/tutorial-configure-custom-password-protection#configure-custom-banned-passwords . Point 1 Sign in to the Azure portal using an account with global administrator permissions."
      },
      {
        "date": "2022-10-05T00:35:00.000Z",
        "voteCount": 1,
        "content": "The question says: \"Connect uses pass-through authentication and has password hash synchronization disabled.\" \n\nIt means that ADDS is doing the authentication. How the Azure AD will be asked if the password is in banned list? Your link says nothing about hybrid environment as we have here. The link in the answer has the information."
      },
      {
        "date": "2023-02-14T08:29:00.000Z",
        "voteCount": 1,
        "content": "The password banned list is for SRRP, it is not for authentication."
      }
    ],
    "examNameCode": "sc-300",
    "topicNumber": "10"
  }
]