[
  {
    "topic": 6,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19472-exam-az-202-topic-6-question-1-discussion/",
    "body": "DRAG DROP -<br>You develop an IoT solution by using Node.js. The solution is ready to deploy to the production environment.<br>You must implement the device twin capabilities of Azure IoT Hub. You must register a sensor named Sensor00. The IoT Hub name is Hub01.<br>You need to register the endpoint with ContosoHub01 so that you can configure them from your solution.<br>Which four commands should you use to develop the solution? To answer, move the appropriate commands from the list of commands to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02522/0015300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02522/0015500001.png\" class=\"in-exam-image\">",
    "answerDescription": "Step 1: az extension add --name azure-cli-iot-ext<br>Run the following command in the command-line environment where you are using the Azure CLI to install the IoT extension: az extension add --name azure-cli-iot-ext<br>Step 2: az iot hub device-identity create<br>--hub-name {Hub01}<br>--device-id Sensor00<br>Create a new device identity called myDeviceId and retrieve the device connection string with these commands: az iot hub device-identity create --device-id myDeviceId --hub-name {Your IoT Hub name} az iot hub device-identity show-connection-string --device-id myDeviceId --hub-name {Your IoT Hub name} -o table<br>Step 3: az iot hub device-identity show-connection-string<br>--hub-name {Hub01}<br>--device-id Sensor00<br>--output table<br>Step 4:<br><br>Create the service app -<br>In this section, you create a Node.js console app that adds location metadata to the device twin. npm install azure-iothub --save<br>References:<br>https://docs.microsoft.com/en-us/azure/iot-hub/iot-hub-node-node-twin-getstarted",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-02T08:57:00.000Z",
        "voteCount": 1,
        "content": "Step 3 in the answer blocks diagram doesn't match with the explanation."
      }
    ],
    "examNameCode": "az-202",
    "topicNumber": "6"
  }
]