[
  {
    "topic": 7,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79484-exam-sc-100-topic-6-question-1-discussion/",
    "body": "HOTSPOT -<br>What should you create in Azure AD to meet the Contoso developer requirements?<br>Hot Area:<br><img src=\"/assets/media/exam-media/04228/0001600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04228/0001700001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: A synced user account -<br>Need to use a synched user account.<br>Incorrect:<br>* Not A user account in the fabrikam.onmicrosoft.com tenant<br>The Contoso developers must use their existing contoso.onmicrosoft.com credentials to access the resources in Sub1.<br>* Guest accounts would not meet the requirements.<br>Note: Developers at Contoso will connect to the resources of Fabrikam to test or update applications. The developers will be added to a security group named<br>ContosoDevelopers in fabrikam.onmicrosoft.com that will be assigned to roles in Sub1.<br>The ContosoDevelopers group is assigned the db_owner role for the ClaimsDB database.<br><br>Contoso Developers Requirements -<br>Fabrikam identifies the following requirements for the Contoso developers:<br>Every month, the membership of the ContosoDevelopers group must be verified.<br>The Contoso developers must use their existing contoso.onmicrosoft.com credentials to access the resources in Sub1.<br>The Contoso developers must be prevented from viewing the data in a column named MedicalHistory in the ClaimDetails table.<br><br>Box 2: An access review -<br>Scenario: Every month, the membership of the ContosoDevelopers group must be verified.<br>Azure Active Directory (Azure AD) access reviews enable organizations to efficiently manage group memberships, access to enterprise applications, and role assignments. User's access can be reviewed on a regular basis to make sure only the right people have continued access.<br>Access review is part of Azure AD Identity governance.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/active-directory-domain-services/synchronization https://docs.microsoft.com/en-us/azure/active-directory/governance/access-reviews-overview",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-04T22:54:00.000Z",
        "voteCount": 65,
        "content": "“The Contoso devlopers must use their existing contoso.onmicrosoft.com credentials…”, so I believe the Account type for developers has to be A guest account in the fabrikham.onmicrosoft.com tenant."
      },
      {
        "date": "2022-10-17T09:41:00.000Z",
        "voteCount": 7,
        "content": "yeah, its right there in the text. The must have a quest account, so this one is an easy one imho"
      },
      {
        "date": "2022-10-17T04:57:00.000Z",
        "voteCount": 19,
        "content": "* A guest account in the fabrikam.com Tenant;\n* An access review"
      },
      {
        "date": "2024-01-06T05:40:00.000Z",
        "voteCount": 1,
        "content": "This is a B2B question\nCollaborate with any partner using their identities\nWith Microsoft Entra B2B, the partner uses their own identity management solution, so there's no external administrative overhead for your organization. Guest users sign in to your apps and services with their own work, school, or social identities.\n\nThe partner uses their own identities and credentials, whether or not they have a Microsoft Entra account.\nYou don't need to manage external accounts or passwords.\nYou don't need to sync accounts or manage account lifecycles."
      },
      {
        "date": "2024-01-14T14:04:00.000Z",
        "voteCount": 1,
        "content": "No doubt this is  B2B related but we need to pick an answer with the given choices. It can be synced accts since there's no AD connect mentioned and these are two separate organizations,  so it has to be a guest acct in the Fabrikham AAD Tenanat. Sounds alright?"
      },
      {
        "date": "2024-01-14T14:04:00.000Z",
        "voteCount": 1,
        "content": "*** Sorry meant it can't be synced acct"
      },
      {
        "date": "2023-09-20T23:35:00.000Z",
        "voteCount": 6,
        "content": "Box1: A guest account in the fabrikham.onmicrosoft.com tenant\n\n  Requirements. Contoso Developers Requirements\n  Fabrikam identifies the following requirements for the Contoso developers:\n  The Contoso developers must use their existing contoso.onmicrosoft.com credentials to\n  access the resources in Sub1.\n\nBox2: An access review\n\n  Requirements. Contoso Developers Requirements\n  Fabrikam identifies the following requirements for the Contoso developers:\n  Every month, the membership of the ContosoDevelopers group must be verified."
      },
      {
        "date": "2023-09-20T23:41:00.000Z",
        "voteCount": 1,
        "content": "https://www.youtube.com/watch?v=r-P-2lGzPFQ&amp;list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&amp;index=9\nSC-100 Question 106"
      },
      {
        "date": "2023-07-18T02:22:00.000Z",
        "voteCount": 1,
        "content": "\"The developers will be added to a security group named\nContosoDevelopers in fabrikam.onmicrosoft.com that will be assigned to roles in Sub1.\" Q: why would Contoso developers need guest accounts on fabrikam.onmicrosoft.com tenant if they are already members of ContosoDevelopers on that tenant? I am a bit confused - does it mean that the developers will have the guest accounts added to the ContosoDevelopers in fabrikam.onmicrosoft.com?"
      },
      {
        "date": "2023-09-23T06:25:00.000Z",
        "voteCount": 1,
        "content": "exactly, first given guest accounts, then those guest accounts added as members of a security group for certain rights"
      },
      {
        "date": "2023-05-22T08:21:00.000Z",
        "voteCount": 3,
        "content": "1. Guest account in fabrikam.onmicrosoft.com tenant\n2. Access review\n\nhttps://learn.microsoft.com/en-us/azure/active-directory/external-identities/what-is-b2b\nAzure Active Directory (Azure AD) B2B collaboration is a feature within External Identities that lets you invite guest users to collaborate with your organization. With B2B collaboration, you can securely share your company's applications and services with external users, while maintaining control over your own corporate data. Work safely and securely with external partners, large or small, even if they don't have Azure AD or an IT department."
      },
      {
        "date": "2023-05-22T08:21:00.000Z",
        "voteCount": 3,
        "content": "https://learn.microsoft.com/en-us/azure/active-directory/governance/access-reviews-overview\nAccess reviews in Azure Active Directory (Azure AD), part of Microsoft Entra, enable organizations to efficiently manage group memberships, access to enterprise applications, and role assignments. User's access can be reviewed regularly to make sure only the right people have continued access."
      },
      {
        "date": "2023-03-20T13:30:00.000Z",
        "voteCount": 1,
        "content": "Identity Governance components include:\n\nA connected organization (option A)\nAn access package (option B)\nAn Azure AD role (option D)\nAn Azure resource role (option E)\nTherefore, option A or B would be a more appropriate answer for the second question."
      },
      {
        "date": "2024-05-16T22:06:00.000Z",
        "voteCount": 1,
        "content": "Access reviews are part on Identity Governance (identity lifecycle management)\nHence answer for second question is Access Review as per requirement\nhttps://learn.microsoft.com/en-us/entra/id-governance/identity-governance-overview"
      },
      {
        "date": "2022-10-17T19:07:00.000Z",
        "voteCount": 2,
        "content": "A guest account in the fabrikam.com Tenant -&gt; https://learn.microsoft.com/en-us/azure/active-directory/external-identities/b2b-quickstart-add-guest-users-portal"
      },
      {
        "date": "2022-10-01T18:30:00.000Z",
        "voteCount": 2,
        "content": "I would go with guest account in fabrikam not sync"
      },
      {
        "date": "2022-09-29T18:59:00.000Z",
        "voteCount": 6,
        "content": "The only answers that make sense, are \"a guest account in the fabrikam.onmicrosoft.com\" tenant and \"an access reviews\" from what I understand in order to meet all requirements."
      },
      {
        "date": "2022-09-06T11:42:00.000Z",
        "voteCount": 4,
        "content": "Contoso has their own AAD Tenant, thus their developers already in the Contoso tenant. An identity can't be homed in 2 different tenants, so how come to Sync developer accounts into Fabrikam? The first box should definitely be B2B Guest."
      },
      {
        "date": "2022-09-02T10:42:00.000Z",
        "voteCount": 1,
        "content": "these are good answers."
      }
    ],
    "examNameCode": "sc-100",
    "topicNumber": "6"
  },
  {
    "topic": 7,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80211-exam-sc-100-topic-6-question-2-discussion/",
    "body": "You need to recommend a solution to meet the security requirements for the InfraSec group.<br>What should you use to delegate the access?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta subscription",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta custom role-based access control (RBAC) role\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta resource group",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta management group"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 25,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-09-12T00:52:00.000Z",
        "voteCount": 21,
        "content": "a custom role-based access control (RBAC) role - can be used to delegate access"
      },
      {
        "date": "2022-09-06T07:17:00.000Z",
        "voteCount": 5,
        "content": "Given answer is correct: B. a custom role-based access control (RBAC) role - can be used to delegate access"
      },
      {
        "date": "2023-09-20T23:43:00.000Z",
        "voteCount": 1,
        "content": "Answer: B\nhttps://www.youtube.com/watch?v=r-P-2lGzPFQ&amp;list=PLQ2ktTy9rklhzzkSEZvDZT4QSIVUQZD-Y&amp;index=9\nSC-100 Question 107"
      },
      {
        "date": "2023-05-22T08:24:00.000Z",
        "voteCount": 2,
        "content": "B is the answer.\n\nhttps://learn.microsoft.com/en-us/azure/role-based-access-control/custom-roles\nIf the Azure built-in roles don't meet the specific needs of your organization, you can create your own custom roles. Just like built-in roles, you can assign custom roles to users, groups, and service principals at management group, subscription, and resource group scopes."
      },
      {
        "date": "2023-02-19T04:43:00.000Z",
        "voteCount": 2,
        "content": "The reason the RBAC is good it is because the other options do not offer the exact permission to manage the NSG, Firewall, Front door and etc. Therefore we would need a Custom role based access control."
      },
      {
        "date": "2022-09-11T04:45:00.000Z",
        "voteCount": 2,
        "content": "In my opinion, I would assign the network role to the subscription or use management groups.\nSince there is only one subscription, I'd go with option A, management groups will add more complexity unless you want to use PIM. But since PIM is not mentioned A should be the correct answer."
      },
      {
        "date": "2022-09-12T11:41:00.000Z",
        "voteCount": 6,
        "content": "My bad should it be B"
      },
      {
        "date": "2022-09-04T23:08:00.000Z",
        "voteCount": 3,
        "content": "I would go with “subscription” as the RBAC assignment would be made on the sub1 subscription. There doesn’t appear to be a need for a custom role. Network Contributor would be sufficient and appropriate given the requirements."
      },
      {
        "date": "2022-10-17T09:44:00.000Z",
        "voteCount": 2,
        "content": "nope that would be too much, one should always follow least priviledge, so custom RBAC is the way. You already say it, it would be sufficient, as in it has enough rights, but it also has too many rights."
      },
      {
        "date": "2023-02-06T00:40:00.000Z",
        "voteCount": 1,
        "content": "Indeed.\nNetwork would give the rights to add/remove Subnets, NICs and so on.\nNot on the list of the duties of the Infrasec group.\nThe question doesn't have the \"require the least amount of effort\" sentence"
      }
    ],
    "examNameCode": "sc-100",
    "topicNumber": "6"
  }
]