[
  {
    "topic": 19,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30578-exam-mb-500-topic-19-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to implement the reporting requirements for the Vendor exclusion list.<br>Which options you should use? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04327/0018000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04327/0018000002.png\" class=\"in-exam-image\">",
    "answerDescription": "Scenario: Provide functionality to periodically export the Vendor exclusion list to prepare reports by using standard reporting capabilities of Dynamics 365 Finance.<br><br>Box 1: Financial Reporting -<br>The financial reporting functions are available to users who have the appropriate privileges and duties assigned to them through their security roles.<br><br>Box 2: UIBuilder class -<br>Example:<br>Defining parameters defaulting using code<br>1. In Solution Explorer, double-click on the FMRentalsByCustUIBuilder class to open the designer.<br>2. Locate the class build method and update the initialization code.<br>The parameter initialization code sets the default values of the report execution relative to today's date. Use the classes UIBuilder to override the framework's default handling of report parameters. Additional extension scenarios supported include:<br>Automatically set query ranges based on session context using Controller classes<br>Reference:<br>https://docs.microsoft.com/en-us/dynamics365/fin-ops-core/dev-itpro/analytics/create-nextgen-reporting-solutions https://docs.microsoft.com/en-us/dynamics365/finance/general-ledger/financial-reporting-getting-started",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-21T22:06:00.000Z",
        "voteCount": 24,
        "content": "SSRS -&gt; Controller Class"
      },
      {
        "date": "2020-12-17T01:57:00.000Z",
        "voteCount": 3,
        "content": "You don't modify query in Controller class. It is done in DataProvider class.. So SSRS and RDP are correct."
      },
      {
        "date": "2021-08-20T07:12:00.000Z",
        "voteCount": 2,
        "content": "No, you can set parameters in controller. So correct anserws are SSRS and Controller class"
      },
      {
        "date": "2020-12-18T09:56:00.000Z",
        "voteCount": 9,
        "content": "correct answer is SSRS and Controller class\nAutomatically set query ranges based on session context using Controller classes\nSelect report designs at runtime using a shared menu item\nModify report data contract values using business logic\nReference:https://docs.microsoft.com/en-us/dynamics365/fin-ops-core/dev-itpro/analytics/create-nextgen-reporting-solutions"
      },
      {
        "date": "2020-12-22T03:18:00.000Z",
        "voteCount": 5,
        "content": "Based on your comment I did further research and in fact you are probably right.\nI may have misunderstood the question. I thought the query in question is the whole query for the report and by modifying ranges I automatically thought about the business logic itself, thus adding a \"Range\" to a Query object, which actually is done in RDP class.\n\nBut the question is prolly not about that, but about setting query ranges on the dialog before the report is run and this actually is done in Controller class, to be more precise in \"prePromptModifyContract()\" method.\n\nSo SSRS and Controller class are correct."
      },
      {
        "date": "2022-03-02T06:20:00.000Z",
        "voteCount": 2,
        "content": "\"standard reporting capabilities of Dynamics 365 Unified\" should be used do SSRS. Many people are referring to Data provider class to change the query, but Data provider class is used for RDP reports that are not query based ( data provider fills data to tmp table). Query based report are called RDL and they don't use Data provider class at all. So SSRS + controller are correct answers. Btw best place to place code modifying query on RDL report  is prePromptModifyContract() method."
      },
      {
        "date": "2022-01-05T08:02:00.000Z",
        "voteCount": 2,
        "content": "SSRS +  Controller Class"
      },
      {
        "date": "2020-09-04T06:06:00.000Z",
        "voteCount": 5,
        "content": "SSRS and ReportDataProvider class"
      },
      {
        "date": "2020-11-09T08:30:00.000Z",
        "voteCount": 2,
        "content": "Data Provider class is the correct answer"
      },
      {
        "date": "2021-01-01T08:53:00.000Z",
        "voteCount": 2,
        "content": "My bad , the answer would be controller class because it has prePromptModifyContract() method, in which we can modify query and ranges.."
      }
    ],
    "examNameCode": "mb-500",
    "topicNumber": "19"
  }
]