[
  {
    "topic": 21,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/122166-exam-pl-400-topic-21-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to synchronize pharmacy names and ensure that Dynamics 365 Sales data propagates correctly to the Cerner system.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04332/0040000006.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04332/0040100001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Use a Data Integration template in Power Apps.<br>Ensure that the names of the pharmacies are synced between the accounting and the customer management systems.<br>Note: The Data Integrator (for Admins) is a point-to-point integration service used to integrate data into Dataverse. It supports integrating data between Finance and Operations apps and Dataverse. It also supports integrating data into Finance and Operations apps and Dynamics 365 Sales.<br>The Data Integrator (for Admins) consists of the Data Integration platform, out-of-the-box templates provided by our application teams (for example, Finance and<br>Operations apps and Dynamics 365 Sales) and custom templates created by our customers and partners.<br>Box 2: Create a workflow in Dynamics 365 Sales.<br>Account numbers should be entered automatically into the pharmaceutical system that is in a Cerner database and kept in sync.<br>Note: Start When: Use the options in this section to specify when a workflow should start automatically. You can configure a real-time workflow to be run before certain events. This is a very powerful capability because the workflow can stop the action before it occurs. The options are:<br>✑ Record is created<br>✑ Record status changes<br>✑ Record is assigned<br><br>Record fields change -<br><img src=\"/assets/media/exam-media/04332/0040100005.png\" class=\"in-exam-image\"><br>✑ Record is deleted<br>Reference:<br>https://docs.microsoft.com/en-us/power-platform/admin/data-integrator",
    "votes": [],
    "comments": [
      {
        "date": "2023-10-02T09:01:00.000Z",
        "voteCount": 3,
        "content": "It looks like the first one is correct because it is said the company plans to implement d365 Sales and Finance. So data synchronization between those is possible with the help of data synchronization (data integrator).\nThe second one also looks ok. Potentially it could be a custom connector (it also fits), but we have some additional requirements, such as \"avoid using custom code and connectors as much as possible\"."
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "21"
  }
]