[
  {
    "topic": 12,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20811-exam-az-103-topic-12-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to meet the connection requirements for the New York office.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/03048/0029700007.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0029800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Create a virtual network gateway and a local network gateway.<br>Azure VPN gateway. The VPN gateway service enables you to connect the VNet to the on-premises network through a VPN appliance. For more information, see<br>Connect an on-premises network to a Microsoft Azure virtual network. The VPN gateway includes the following elements:<br>✑ Virtual network gateway. A resource that provides a virtual VPN appliance for the VNet. It is responsible for routing traffic from the on-premises network to the<br>VNet.<br>✑ Local network gateway. An abstraction of the on-premises VPN appliance. Network traffic from the cloud application to the on-premises network is routed through this gateway.<br>✑ Connection. The connection has properties that specify the connection type (IPSec) and the key shared with the on-premises VPN appliance to encrypt traffic.<br>✑ Gateway subnet. The virtual network gateway is held in its own subnet, which is subject to various requirements, described in the Recommendations section below.<br>Box 2: Configure a site-to-site VPN connection<br>On premises create a site-to-site connection for the virtual network gateway and the local network gateway.<br><img src=\"/assets/media/exam-media/03048/0029900001.png\" class=\"in-exam-image\"><br>Scenario: Connect the New York office to VNet1 over the Internet by using an encrypted connection.<br>Incorrect Answers:<br>Azure ExpressRoute: Established between your network and Azure, through an ExpressRoute partner. This connection is private. Traffic does not go over the internet.<br>Reference:<br>https://docs.microsoft.com/en-us/azure/architecture/reference-architectures/hybrid-networking/vpn<br>Configure and manage virtual networks",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-17T22:48:00.000Z",
        "voteCount": 13,
        "content": "Given answers are correct need to implement Site-to-site VPN connection"
      },
      {
        "date": "2020-06-05T04:45:00.000Z",
        "voteCount": 10,
        "content": "Must be over the internet, ExpressRoute is a direct connection.\nVPN is correct answer"
      },
      {
        "date": "2021-02-25T20:17:00.000Z",
        "voteCount": 1,
        "content": "in the requirement, NY office needs a encrypted connection, and ExpressRoute offers a dedicated and private connection, but not encrypted. so a S2S connection is the choice."
      },
      {
        "date": "2020-09-09T07:55:00.000Z",
        "voteCount": 3,
        "content": "Read careffully . It's New york Office. So answer is correct . Express Route is for Montreal Office"
      },
      {
        "date": "2020-08-06T17:19:00.000Z",
        "voteCount": 1,
        "content": "Why Site-to-site? Isnt it an expressroute?"
      },
      {
        "date": "2020-08-06T17:20:00.000Z",
        "voteCount": 1,
        "content": "oops. I missed that the question is to deploy at on prem. Expressroute isnt a choice"
      },
      {
        "date": "2020-06-01T06:24:00.000Z",
        "voteCount": 2,
        "content": "All the offices connect by using private links.  So I think it shall use ExpressRoute"
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "12"
  }
]