[
  {
    "topic": 9,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/83591-exam-pl-400-topic-9-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to select connectors for the app.<br>Which types of connectors should you use? To answer, drag the appropriate connectors to the correct requirements. Each connector may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04332/0000600001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04332/0000600002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Create a custom connector<br>A custom connector is a wrapper around a REST API (Logic Apps also supports SOAP APIs) that allows Logic Apps, Power Automate, or Power Apps to communicate with that REST or SOAP API.<br>Box 2: Use an AppSource connector<br>You can only retrieve the Customer, UnifiedActivity, and Segments entities through the Power Apps connector. Other entities are shown because the underlying connector supports them through triggers in Power Automate.<br>Scenario: Customer information is stored in the Accounts entity.<br>Box 3: Use a native application function<br>You must produce a report that details the number of registrations for a day and send the report as a PDF to the management team.<br>Reference:<br>https://docs.microsoft.com/en-us/connectors/custom-connectors/ https://docs.microsoft.com/en-us/dynamics365/customer-insights/audience-insights/export-power-apps",
    "votes": [],
    "comments": [
      {
        "date": "2022-12-18T08:37:00.000Z",
        "voteCount": 5,
        "content": "The case study is good, but there is some disconnect or limited information about the questions. Makes it tuff to answer with limited context."
      },
      {
        "date": "2024-09-07T23:19:00.000Z",
        "voteCount": 2,
        "content": "This case study was in my exam on the 6th of September 2024."
      },
      {
        "date": "2024-04-03T07:42:00.000Z",
        "voteCount": 1,
        "content": "I think all is Native. We create a new app and using dataverse tables, so why need custom connector. Pls correct me if I'm wrong"
      },
      {
        "date": "2023-07-15T17:04:00.000Z",
        "voteCount": 1,
        "content": "1. Data stored in Dataverse. Customers are in Account Entity. View full registration records - Native\n2. Customer uses a portal to register or view events. View Customer names - Native\n3. Daily registrations must send email as pdf. We may need to use power automate to create ppdf. View daily registrations -Appsource\n\nSo Native, Native, Appsource"
      },
      {
        "date": "2023-08-03T04:48:00.000Z",
        "voteCount": 2,
        "content": "i believe it should be Native, Native, Native. Appsource is needed when the system needs to connect to an external source like Dynamics. In this case, using a pdf and sending via email is native to powerautomate"
      },
      {
        "date": "2023-03-21T07:25:00.000Z",
        "voteCount": 2,
        "content": "I wouldve answered native,appsource,native."
      },
      {
        "date": "2023-01-17T07:15:00.000Z",
        "voteCount": 2,
        "content": "Why need a custom connector for viewing full registration records? registration data is saved in dataverse because it says need a registration form."
      },
      {
        "date": "2023-05-17T01:31:00.000Z",
        "voteCount": 2,
        "content": "maybe because \"The company uses a proprietary cloud-based accounting system.\" So confusing..."
      }
    ],
    "examNameCode": "pl-400",
    "topicNumber": "9"
  }
]