[
  {
    "topic": 9,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/15983-exam-az-103-topic-9-question-1-discussion/",
    "body": "DRAG DROP -<br>You need to prepare the environment to ensure that the web administrators can deploy the web apps as quickly as possible.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/03048/0013100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/03048/0013200001.png\" class=\"in-exam-image\">",
    "answerDescription": "Step 1:<br>First you create a storage account using the Azure portal.<br>Step 2:<br>Select Automation options at the bottom of the screen. The portal shows the template on the Template tab.<br>Add the storage account to the library.<br>Step 3:<br>Share the template.<br>Scenario: Web administrators will deploy Azure web apps for the marketing department. Each web app will be added to a separate resource group. The initial configuration of the web apps will be identical. The web administrators have permission to deploy web apps to resource groups.<br>References:<br>https://docs.microsoft.com/en-us/azure/azure-resource-manager/resource-manager-quickstart-create-templates-use-the-portal<br>Deploy and manage virtual machines (VMs)",
    "votes": [],
    "comments": [
      {
        "date": "2020-03-09T16:45:00.000Z",
        "voteCount": 52,
        "content": "1) Create RG , and then deploy a web app to the RG 2) From the Automation script blade of the RG , click \"Add to Library\" 3) From the Templates service, select the template, and then share the template to the web admins\n\nhttps://www.examtopics.com/exams/microsoft/az-300/view/37/"
      },
      {
        "date": "2020-03-26T09:46:00.000Z",
        "voteCount": 2,
        "content": "corect"
      },
      {
        "date": "2020-05-15T00:37:00.000Z",
        "voteCount": 1,
        "content": "RG doesn't have Automation blade. It has Export Template blade?"
      },
      {
        "date": "2020-08-09T10:53:00.000Z",
        "voteCount": 1,
        "content": "Azure is a fluid service. I only see the Export Template option as well, and it seems to fit in perfectly with msftfan's solution, which I also agree is the answer."
      },
      {
        "date": "2020-06-11T11:04:00.000Z",
        "voteCount": 20,
        "content": "1) Create RG , and then deploy a web app to the RG\n2) From the Automation script blade of the RG , click \"Add to Library\"\n3) From the Templates service, select the template, and then share the template to the web admins\nIf anyones wondering where it is, it is in RG -&gt; Settings blade -&gt; Export Template -&gt; Add to library"
      },
      {
        "date": "2020-07-04T18:43:00.000Z",
        "voteCount": 5,
        "content": "Agree with  macco455.\nCorrect answer is below. I have verified it in my tenant. 1. Create a resource group, and then deploy a webapp to the resource group. 2. From the Automation Script blade of the resource group, click Add to Library. (Automation Script blade is not available now in Resource Group. New option is Export Template blade in Resource Group). 3. From the Templates service, select the template and then share the template to the web administrators."
      },
      {
        "date": "2024-03-14T02:31:00.000Z",
        "voteCount": 1,
        "content": "1) Create RG , and then deploy a web app to the RG \n\n2) From the Automation script blade of the RG , click \"Add to Library\" \n\n3) From the Templates service, select the template, and then share the template to the web admins"
      },
      {
        "date": "2020-11-02T02:55:00.000Z",
        "voteCount": 1,
        "content": "I will select this as explained many members\n1. Create a resource group, and then deploy a webapp to the resource group.\n2. From the Automation Script blade of the resource group, click Add to Library. (Automation Script blade is not available now in Resource Group. New option is Export Template blade in Resource Group).\n3. From the Templates service, select the template and then share the template to the web administrators."
      },
      {
        "date": "2020-08-10T09:12:00.000Z",
        "voteCount": 2,
        "content": "At the moment (Aug 11) the only thing I can see is RG &gt; Export Template &gt; Save to Library. But this is a Preview feature so it wn't be used in the exam."
      },
      {
        "date": "2020-03-09T11:02:00.000Z",
        "voteCount": 3,
        "content": "I think that the drag and drop image isn't right, First awnser Automation Account should be Storage Account."
      }
    ],
    "examNameCode": "az-103",
    "topicNumber": "9"
  }
]