[
  {
    "topic": 3,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/23109-exam-70-765-topic-3-question-1-discussion/",
    "body": "A company has an on-premises Microsoft SQL Server 2014 environment. The company has a main office in Seattle, and remote offices in Amsterdam and Tokyo.<br>You plan to deploy a Microsoft Azure SQL Database instance to support a new application. You expect to have 100 users from each office.<br>In the past, users at remote sites reported issues when they used applications hosted at the Seattle office.<br>You need to optimize performance for users running reports while minimizing costs.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement an elastic pool.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement a standard database with readable secondaries in Asia and Europe, and then migrate the application.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement replication from an on-premises SQL Server database to the Azure SQL Database instance.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDeploy a database from the Premium service tier."
    ],
    "answer": "B",
    "answerDescription": "References:<br>https://docs.microsoft.com/en-us/azure/sql-database/sql-database-geo-replication-transact-sql#add-secondary-database",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-14T01:06:00.000Z",
        "voteCount": 3,
        "content": "How to set it up: http://www.nikoport.com/2018/11/01/azure-sql-db-readable-secondary/"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/21141-exam-70-765-topic-3-question-5-discussion/",
    "body": "HOTSPOT -<br><br>Background -<br>You manage the Microsoft SQL Server environment for a company that manufactures and sells automobile parts.<br>The environment includes the following servers: SRV1 and SRV2. SRV1 has 16 logical cores and hosts a SQL Server instance that supports a mission-critical application. The application has approximately 30,000 concurrent users and relies heavily on the use of temporary tables.<br>The environment also includes the following databases: DB1, DB2, and Reporting. The Reporting database is protected with Transparent Data Encryption<br>(TDE). You plan to migrate this database to a new server. You detach the database and copy it to the new server.<br>You are performing tuning on a SQL Server database instance. The application which uses the database was written using an object relationship mapping (ORM) tool which maps tables as objects within the application code. There are 30 stored procedures that are regularly used by the application.<br><br>Exhibit -<br><img src=\"/assets/media/exam-media/02202/0004200001.jpg\" class=\"in-exam-image\"><br>You need to optimize SRV1.<br>What configuration changes should you implement? To answer, select the appropriate option from each list in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0004300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0004400001.png\" class=\"in-exam-image\">",
    "answerDescription": "From the scenario: SRV1 has 16 logical cores and hosts a SQL Server instance that supports a mission-critical application. The application has approximately<br>30,000 concurrent users and relies heavily on the use of temporary tables.<br>Box 1: Change the sisze of the tempdb log file.<br>The size and physical placement of the tempdb database can affect the performance of a system. For example, if the size that is defined for tempdb is too small, part of the system-processing load may be taken up with autogrowing tempdb to the size required to support the workload every time you restart the instance of<br>SQL Server. You can avoid this overhead by increasing the sizes of the tempdb data and log file.<br>Box 2: Add additional tempdb files.<br>Create as many files as needed to maximize disk bandwidth. Using multiple files reduces tempdb storage contention and yields significantly better scalability.<br>However, do not create too many files because this can reduce performance and increase management overhead. As a general guideline, create one data file for each CPU on the server (accounting for any affinity mask settings) and then adjust the number of files up or down as necessary.<br>Incorrect Answers:<br>Not MAXDOP:<br>The MAXDOP setting is fine. From the exhibit we see that MAXDOP is set to 0. This is the default setting, which enables the server to determine the maximum degree of parallelism.<br>Note: When an instance of SQL Server runs on a computer that has more than one microprocessor or CPU, it detects the best degree of parallelism, that is, the number of processors employed to run a single statement, for each parallel plan execution. You can use the max degree of parallelism option to limit the number of processors to use in parallel plan execution.<br>References:<br>https://technet.microsoft.com/en-us/library/ms175527(v=sql.105).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-22T06:59:00.000Z",
        "voteCount": 1,
        "content": "Change maxdop setting to 8 (the server has maxdop to 0 it means it uses all 16 cores)"
      },
      {
        "date": "2020-07-29T10:28:00.000Z",
        "voteCount": 2,
        "content": "I think MAXDOP option is here to confuse. It has nothing to do with tempdb and the question is \"How should you reconfigure the tempdb database?\". Only adding additional tempdb files make sense here."
      },
      {
        "date": "2020-09-23T10:35:00.000Z",
        "voteCount": 5,
        "content": "Am i missing anything cause it doesn't say anything about configuration of tempdb"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/23236-exam-70-765-topic-3-question-7-discussion/",
    "body": "HOTSPOT -<br><br>Background -<br>You are the database administrator for Contoso, Ltd. The company has 200 offices around the world. The company has corporate executives that are located in offices in London, New York, Toronto, Sydney, and Tokyo.<br>Contoso, Ltd. has a Microsoft Azure SQL Database environment. You plan to deploy a new Azure SQL Database to support a variety of mobile applications and public websites.<br>The company is deploying a multi-tenant environment. The environment will host Azure SQL Database instances. The company plans to make the instances available to internal departments and partner companies. Contoso is in the final stages of setting up networking and communications for the environment.<br>Existing Contoso and Customer instances need to be migrated to Azure virtual machines (VM) according to the following requirements:<br>✑ Contoso instances  should use the method requiring the least administrative effort to migrate instances to Azure Vms.<br>✑ Customer instances  should use a method that allows customers to bring their own licenses to Azure VMs. Customers have approved down time for the migration.<br>The company plans to deploy a new order entry application and a new business intelligence and analysis application. Each application will be supported by a new database. Contoso creates a new Azure SQL database named Reporting. The database will be used to support the company's financial reporting requirements.<br>You associate the database with the Contoso Azure Active Directory domain.<br>Each location database for the data entry application may have an unpredictable amount of activity. Data must be replicated to secondary databases in Azure datacenters in different regions.<br>To support the application, you need to create a database named contosodb1 in the existing environment.<br><br>Objects -<br><img src=\"/assets/media/exam-media/02202/0004900003.png\" class=\"in-exam-image\"><br><br>Database -<br>The contosodb1 database must support the following requirements:<br>✑ a size of at least 200 gigabytes (GB)<br>✑ 1,000 concurrent sessions<br>✑ point-in-time restore to any point in the two weeks prior to a failure<br>✑ minimize costs<br><br>Application -<br>For the business intelligence application, corporate executives must be able to view all data in near real-time with low network latency.<br>Contoso has the following security, networking, and communications requirements:<br>✑ Multi-Location Load Balancing  to ensure customers have access to their tenants at multiple Azure locations across the world.<br>✑ Secure Message/Data Flow  to securely support communication between Azure and on-premises applications and services.<br>✑ Accounts should support accessing external domain resources and be configured in the most secure and lowest-maintenance way possible, including meeting the company policy of regular service account password changes.<br>You need to configure the data entry and business intelligence databases.<br>In the table below, identify the option that you must use for each database.<br>NOTE: Make only one selection in each column.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0005000004.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0005100001.png\" class=\"in-exam-image\">",
    "answerDescription": "Data Entry: Geo-replicated database only<br>From Contoso scenario: Each location database for the data entry application may have an unpredictable amount of activity. Data must be replicated to secondary databases in Azure datacenters in different regions.<br>Business intelligence: Elastic database pools only<br>From Contoso scenario: For the business intelligence application, corporate executives must be able to view all data in near real-time with low network latency.<br>SQL DB elastic pools provide a simple cost effective solution to manage the performance goals for multiple databases that have widely varying and unpredictable usage patterns.<br>References:<br>https://docs.microsoft.com/en-us/azure/sql-database/sql-database-elastic-pool",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-16T00:39:00.000Z",
        "voteCount": 11,
        "content": "I think this answer is wrong. The elastic pools + geo replication seems to be the right answer for the data entry database, because it is unpredictable but needs lower cost. The BI database seems to need geo replication for load balancing across locations. But I'm not sure it needs the elastic function."
      },
      {
        "date": "2020-10-09T05:31:00.000Z",
        "voteCount": 3,
        "content": "You are correct.\nFor BI, it says view all data in near real time and with low letency which is only possible if you access that from nearest location.\nfor Data: Unpredictable usage and replicaiton, it shoudl be both, Geo replication and elastic pool"
      },
      {
        "date": "2020-10-21T08:31:00.000Z",
        "voteCount": 2,
        "content": "Data entry : Geo replicated data base only\nBusiness intelligence : Elastic database pools only\n\nFrom contoso scenario : Each location database for the data entry application may have an unpredictable amount of activity. Data must be replicated to secondary databases in Azure datacenters in different regions.\n\nFrom Contoso scenario: For the business intelligence application, corporate executives must be able to view all data in near real-time with low network latency."
      },
      {
        "date": "2020-06-24T00:46:00.000Z",
        "voteCount": 2,
        "content": "Data Entry: Geo- Replicated Only \nThis is because each location database for the data entry may have an unpredicted amount of activity thus data must be replicated to secondary databases in Azure datacentres in different regions.\nBusiness Intelligence: Elastic database pools only. This is because corporate executives must be able to view all data in near real-time with low network latency and the pools are used for multiple databases that have widely varying and unpredictable usage patterns."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18414-exam-70-765-topic-3-question-10-discussion/",
    "body": "HOTSPOT -<br><br>Background -<br>You manage a Microsoft SQL Server environment that includes the following databases: DB1, DB2, Reporting.<br>The environment also includes SQL Reporting Services (SSRS) and SQL Server Analysis Services (SSAS). All SSRS and SSAS servers use named instances.<br>You configure a firewall rule for SSAS.<br><br>Databases -<br>Database Name:<br><br>DB1 -<br>Notes:<br>This database was migrated from SQL Server 2012 to SQL Server 2016. Thousands of records are inserted into DB1 or updated each second. Inserts are made by many different external applications that your company's developers do not control. You observe that transaction log write latency is a bottleneck in performance. Because of the transient nature of all the data in this database, the business can tolerate some data loss in the event of a server shutdown.<br>Database Name:<br><br>DB2 -<br>Notes:<br>This database was migrated from SQL Server 2012 to SQL Server 2016. Thousands of records are updated or inserted per second. You observe that the<br>WRITELOG wait type is the highest aggregated wait type. Most writes must have no tolerance for data loss in the event of a server shutdown. The business has identified certain write queries where data loss is tolerable in the event of a server shutdown.<br>Database Name:<br><br>Reporting -<br>Notes:<br>You create a SQL Server-authenticated login named BIAppUser on the SQL Server instance to support users of the Reporting database. The BIAppUser login is not a member of the sysadmin role.<br>You plan to configure performance-monitoring alerts for this instance by using SQL Agent Alerts.<br>You need to open the firewall ports for use with SQL Server environment.<br>In table below, identify the firewall port that you must use for each service.<br>NOTE: Make only one selection in each column.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0006000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0006100001.png\" class=\"in-exam-image\">",
    "answerDescription": "Report Server: 80 -<br>By default, the report server listens for HTTP requests on port 80.<br>Incorrect Answers:<br>Not 1433: If you are accessing SQL Server relational databases on external computers, or if the report server database is on an external SQL Server instance, you must open port 1433 and 1434 on the external computer. In this scenario there is no mention of an external server.<br>SQL Server Browser service for SSAS: 1433<br><br>How SQL Server Browser Works -<br>When an instance of SQL Server starts, if the TCP/IP protocol is enabled for SQL Server, the server is assigned a TCP/IP port. If the named pipes protocol is enabled, SQL Server listens on a specific named pipe. This port, or \"pipe,\" is used by that specific instance to exchange data with client applications. During installation, TCP port 1433 and pipe \\sql\\query are assigned to the default instance,<br>References:<br><br>https://msdn.microsoft.com/en-us/library/bb934283.aspx<br>https://technet.microsoft.com/en-us/library/ms181087(v=sql.130).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-14T05:30:00.000Z",
        "voteCount": 9,
        "content": "2382 is needed for SSAS"
      },
      {
        "date": "2020-06-21T10:11:00.000Z",
        "voteCount": 3,
        "content": "I think I agree based on this: \nhttps://docs.microsoft.com/en-us/analysis-services/instances/configure-the-windows-firewall-to-allow-analysis-services-access?view=asallproducts-allversions"
      },
      {
        "date": "2020-08-21T00:54:00.000Z",
        "voteCount": 2,
        "content": "Open TCP port 2382 when installing a named instance. Named instances use dynamic port assignments. As the discovery service for Analysis Services, SQL Server Browser service listens on TCP port 2382 and redirects the connection request to the port currently used by Analysis Services"
      },
      {
        "date": "2020-05-22T07:08:00.000Z",
        "voteCount": 2,
        "content": "As the discovery service for Analysis Services, SQL Server Browser service listens on TCP port 2382 and redirects the connection request to the port currently used by Analysis Services."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4827-exam-70-765-topic-3-question-11-discussion/",
    "body": "HOTSPOT -<br><br>Background -<br>You manage a Microsoft SQL Server environment that includes the following databases: DB1, DB2, Reporting.<br>The environment also includes SQL Reporting Services (SSRS) and SQL Server Analysis Services (SSAS). All SSRS and SSAS servers use named instances.<br>You configure a firewall rule for SSAS.<br><br>Databases -<br>Database Name:<br><br>DB1 -<br>Notes:<br>This database was migrated from SQL Server 2012 to SQL Server 2016. Thousands of records are inserted into DB1 or updated each second. Inserts are made by many different external applications that your company's developers do not control. You observe that transaction log write latency is a bottleneck in performance. Because of the transient nature of all the data in this database, the business can tolerate some data loss in the event of a server shutdown.<br>Database Name:<br><br>DB2 -<br>Notes:<br>This database was migrated from SQL Server 2012 to SQL Server 2016. Thousands of records are updated or inserted per second. You observe that the<br>WRITELOG wait type is the highest aggregated wait type. Most writes must have no tolerance for data loss in the event of a server shutdown. The business has identified certain write queries where data loss is tolerable in the event of a server shutdown.<br>Database Name:<br><br>Reporting -<br>Notes:<br>You create a SQL Server-authenticated login named BIAppUser on the SQL Server instance to support users of the Reporting database. The BIAppUser login is not a member of the sysadmin role.<br>You plan to configure performance-monitoring alerts for this instance by using SQL Agent Alerts.<br>You need to maximize performance of writes to each database without requiring changes to existing database tables.<br>In the table below, identify the database setting that you must configure for each database.<br>NOTE: Make only one selection in each column. Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0006300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0006400001.png\" class=\"in-exam-image\">",
    "answerDescription": "DB1: DELAYED_DURABILITY=FORCED -<br>From scenario: Thousands of records are inserted into DB1 or updated each second. Inserts are made by many different external applications that your company's developers do not control. You observe that transaction log write latency is a bottleneck in performance. Because of the transient nature of all the data in this database, the business can tolerate some data loss in the event of a server shutdown.<br>With the DELAYED_DURABILITY=FORCED setting, every transaction that commits on the database is delayed durable.<br>With the DELAYED_DURABILITY= ALLOWED setting, each transactions durability is determined at the transaction level.<br>Note: Delayed transaction durability reduces both latency and contention within the system because:<br>* The transaction commit processing does not wait for log IO to finish and return control to the client.<br>* Concurrent transactions are less likely to contend for log IO; instead, the log buffer can be flushed to disk in larger chunks, reducing contention, and increasing throughput.<br>DB2: ALLOW_SNAPSHOT_ISOLATION ON and READ_COMMITTED_SNAPSHOT ON<br>Snapshot isolation enhances concurrency for OLTP applications.<br>Snapshot isolation must be enabled by setting the ALLOW_SNAPSHOT_ISOLATION ON database option before it is used in transactions.<br>The following statements activate snapshot isolation and replace the default READ COMMITTED behavior with SNAPSHOT:<br><br>ALTER DATABASE MyDatabase -<br><br>SET ALLOW_SNAPSHOT_ISOLATION ON -<br><br>ALTER DATABASE MyDatabase -<br><br>SET READ_COMMITTED_SNAPSHOT ON -<br>Setting the READ_COMMITTED_SNAPSHOT ON option allows access to versioned rows under the default READ COMMITTED isolation level.<br>From scenario: The DB2 database was migrated from SQL Server 2012 to SQL Server 2016. Thousands of records are updated or inserted per second. You observe that the WRITELOG wait type is the highest aggregated wait type. Most writes must have no tolerance for data loss in the event of a server shutdown.<br>The business has identified certain write queries where data loss is tolerable in the event of a server shutdown.<br>References:<br>https://msdn.microsoft.com/en-us/library/dn449490.aspx<br>https://msdn.microsoft.com/en-us/library/tcbchxcb(v=vs.110).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-06T13:38:00.000Z",
        "voteCount": 9,
        "content": "After https://www.sqlshack.com/how-to-handle-the-sql-server-writelog-wait-type/, the right way to fight WRITELOG wait type is by using DELAYED_DURABILITY.\n\nSo the answers are :\n- DB1 -&gt; DELAYED_DURABILITY = FORCED\n- DB2 -&gt; DELAYED_DURABILITY = ALLOWED"
      },
      {
        "date": "2020-06-16T01:49:00.000Z",
        "voteCount": 2,
        "content": "Agreed. Snapshot isolation is intended to reduce contention for readers during writes. Reading isn't the issue though. Snapshot Isolation will not prevent writers from blocking/slowing other writers. So with WRITELOG being the issue, snapshot isolation will not ease the burden of writes."
      },
      {
        "date": "2020-06-24T01:00:00.000Z",
        "voteCount": 2,
        "content": "DB1: DELAYED_DURABILITY = FORCED\nDB2: ALLOW_SNAPSHOT_ISOLATION_ON and and READ_COMMITTED_SNAPSHOT ON"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/23241-exam-70-765-topic-3-question-12-discussion/",
    "body": "HOTSPOT -<br><br>Background -<br>You manage a Microsoft SQL Server environment that includes the following databases: DB1, DB2, Reporting.<br>The environment also includes SQL Reporting Services (SSRS) and SQL Server Analysis Services (SSAS). All SSRS and SSAS servers use named instances.<br>You configure a firewall rule for SSAS.<br><br>Databases -<br>Database Name:<br><br>DB1 -<br>Notes:<br>This database was migrated from SQL Server 2012 to SQL Server 2016. Thousands of records are inserted into DB1 or updated each second. Inserts are made by many different external applications that your company's developers do not control. You observe that transaction log write latency is a bottleneck in performance. Because of the transient nature of all the data in this database, the business can tolerate some data loss in the event of a server shutdown.<br>Database Name:<br><br>DB2 -<br>Notes:<br>This database was migrated from SQL Server 2012 to SQL Server 2016. Thousands of records are updated or inserted per second. You observe that the<br>WRITELOG wait type is the highest aggregated wait type. Most writes must have no tolerance for data loss in the event of a server shutdown. The business has identified certain write queries where data loss is tolerable in the event of a server shutdown.<br>Database Name:<br><br>Reporting -<br>Notes:<br>You create a SQL Server-authenticated login named BIAppUser on the SQL Server instance to support users of the Reporting database. The BIAppUser login is not a member of the sysadmin role.<br>You plan to configure performance-monitoring alerts for this instance by using SQL Agent Alerts.<br>You need to set up the service accounts that the database engine and SQL Server Agent services will use.<br>How should you design the solution? To answer, select the appropriate configuration options in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0006700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0006800001.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Domain Account -<br>The service startup account defines the Microsoft Windows account in which SQL Server Agent runs and its network permissions. SQL Server Agent runs as a specified user account. You select an account for the SQL Server Agent service by using SQL Server Configuration Manager, where you can choose from the following options:<br>* Built-in account. You can choose from a list of the following built-in Windows service accounts: Local System account.<br>* This account. Lets you specify the Windows domain account in which the SQL Server Agent service runs.<br><br>Box 2: Domain users -<br>Microsoft recommends choosing a Windows user account that is not a member of the Windows Administrators group.<br><br>Box 3: Managed Service Accounts -<br>When resources external to the SQL Server computer are needed, Microsoft recommends using a Managed Service Account (MSA), configured with the minimum privileges necessary.<br>Note: A Managed Service Account (MSA) can run services on a computer in a secure and easy to maintain manner, while maintaining the capability to connect to network resources as a specific user principal.<br>References:<br>https://msdn.microsoft.com/en-us/library/ms191543.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-16T01:59:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/sql/ssms/agent/select-an-account-for-the-sql-server-agent-service?view=sql-server-ver15"
      },
      {
        "date": "2020-06-16T02:03:00.000Z",
        "voteCount": 1,
        "content": "For the second part of the answer: \nhttps://www.mssqltips.com/sqlservertip/2317/running-sql-server-agent-with-a-least-privilege-service-account/"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/23243-exam-70-765-topic-3-question-13-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 database.<br>Users report that an application that accesses the database displays an error, but the error does not provide meaningful information. No entries are found in the<br>SQL Server log or Windows event logs related to the error.<br>You need to identify the root cause of the issue by retrieving the error message.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate an Extended Events session by using the sqlserver.error_reported event.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a SQL Profiler session to capture all ErrorLog and EventLog events.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFlag all stored procedures for recompilation by using sp_recompile.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExecute sp_who."
    ],
    "answer": "A",
    "answerDescription": "Event sqlserver.error_reported: This event gets fired every time that an error happens in the server.<br>References:<br>https://blogs.msdn.microsoft.com/extended_events/2010/04/14/introduction-to-extended-events/",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-16T02:11:00.000Z",
        "voteCount": 1,
        "content": "Why isn't the answer: Create a SQL Profiler session to capture all ErrorLog and EventLog events? Is it because that feature is deprecated?"
      },
      {
        "date": "2020-06-16T02:24:00.000Z",
        "voteCount": 1,
        "content": "I think it might also because technically a \"session\" isn't created with SQL Profiler..."
      },
      {
        "date": "2020-08-28T04:18:00.000Z",
        "voteCount": 1,
        "content": "I think because \"No entries are found in the\nSQL Server log or Windows event logs related to the error.\", so you can't capture them"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33187-exam-70-765-topic-3-question-14-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 server. One of the databases on the server supports a highly active OLTP application.<br>Users report abnormally long wait times when they submit data into the application.<br>You need to identify which queries are taking longer than 1 second to run over an extended period of time.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tuse SQL Profiler to trace all queries that are processing on the server. Filter queries that have a Duration value of more than 1,000.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse sp_configure to set a value for blocked process threshold. Create an extended event session.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Job Activity monitor to review all processes that are actively running. Review the Job History to find out the duration of each step.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the sp_who command from a query window.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the DBCC TRACEON 1222 command from a query window and review the SQL Server event log."
    ],
    "answer": "A",
    "answerDescription": "Incorrect Answers:<br>E: DBCC TRACEON 1222 is used to detect deadlocks, not to detect long running queries.<br>References:<br>http://www.mssqltips.com/sqlservertip/2130/finding-sql-server-deadlocks-using-trace-flag-1222/ http://msdn.microsoft.com/en-us/library/ms188396.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-15T12:22:00.000Z",
        "voteCount": 2,
        "content": "In other Tests the Anser A talks from a extend Events Session. Which is the best an correct Answer"
      },
      {
        "date": "2020-09-29T01:46:00.000Z",
        "voteCount": 1,
        "content": "B is applicable too, and its good to set blocked processes threshold to minimum to exclude waits on locks"
      },
      {
        "date": "2020-09-29T01:50:00.000Z",
        "voteCount": 1,
        "content": "because if there are locks issues almost any query can have long run and often there is no need to measure  that time"
      },
      {
        "date": "2020-10-08T05:07:00.000Z",
        "voteCount": 3,
        "content": "You cannot use blocked process threshold because its minimum value is 5. it wakes up every 5 seconds and checks for blocking. Question is asking about 1 second. So answer is A."
      },
      {
        "date": "2021-01-17T16:06:00.000Z",
        "voteCount": 1,
        "content": "It's not asking to detect blocked, but duration over 1 sec. You can have a long running query without blocking"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4088-exam-70-765-topic-3-question-15-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 database.<br>You need to ensure that the size of the transaction log file does not exceed 2 GB.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExecute sp_configure 'max log size', 2G.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tuse the ALTER DATABASE...SET LOGFILE command along with the maxsize parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn SQL Server Management Studio, right-click the instance and select Database Settings. Set the maximum size of the file for the transaction log.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tin SQL Server Management Studio, right-click the database, select Properties, and then click Files. Open the Transaction log Autogrowth window and set the"
    ],
    "answer": "B",
    "answerDescription": "You can use the ALTER DATABASE (Transact-SQL) statement to manage the growth of a transaction log file<br>To control the maximum the size of a log file in KB, MB, GB, and TB units or to set growth to UNLIMITED, use the MAXSIZE option. However, there is no SET<br>LOGFILE subcommand.<br>References: https://technet.microsoft.com/en-us/library/ms365418(v=sql.110).aspx#ControlGrowth",
    "votes": [],
    "comments": [
      {
        "date": "2019-08-26T00:01:00.000Z",
        "voteCount": 11,
        "content": "option d is correct"
      },
      {
        "date": "2019-09-05T03:43:00.000Z",
        "voteCount": 6,
        "content": "More than correct, the answer D is the only good option.\n\nBecause the correct syntax in T-SQL is :\nALTER DATABASE [DB] MODIFY FILE ( NAME = N'Log', MAXSIZE = 2048MB)\n\nSET LOGFILE does not exists at all"
      },
      {
        "date": "2020-06-16T02:31:00.000Z",
        "voteCount": 2,
        "content": "Agreed. https://anyonconsulting.com/business_intelligence/limit-the-database-size-on-sql/"
      },
      {
        "date": "2019-10-29T05:52:00.000Z",
        "voteCount": 6,
        "content": "I agree. Option D is correct. In ALTER DATABASE there is no \"SET LOGFILE\" Option."
      },
      {
        "date": "2021-01-22T00:34:00.000Z",
        "voteCount": 1,
        "content": "no \"SET LOGFILE\" command, but\n\nALTER DATABASE [AdventureWorks2012] MODIFY FILE ( NAME = N'AdventureWorks2012_log', MAXSIZE = 2147442688KB )\nGO"
      },
      {
        "date": "2020-09-22T14:35:00.000Z",
        "voteCount": 2,
        "content": "I think is D"
      },
      {
        "date": "2020-12-07T04:15:00.000Z",
        "voteCount": 1,
        "content": "It is correct"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30824-exam-70-765-topic-3-question-16-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 server. The MSSQLSERVER service uses a domain account named CONTOSO\\SQLService.<br>You plan to configure Instant File Initialization.<br>You need to ensure that Data File Autogrow operations use Instant File Initialization.<br>What should you do? Choose all that apply.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRestart the SQL Server Agent Service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable snapshot isolation.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRestart the SQL Server Service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd the CONTOSO\\SQLService account to the Perform Volume Maintenance Tasks local security policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd the CONTOSO\\SQLService account to the Server Operators fixed server role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable snapshot isolation."
    ],
    "answer": "CD",
    "answerDescription": "How To Enable Instant File Initialization<br>1. Open Local Security Policy and go to Local Policies --&gt; User Rights Assignment.<br>2. Double click Perform Volume Maintenance Tasks and add your SQL Server database engine service account.<br>3. Restart the SQL Server service using SQL Server Configuration Manager and this setting should now be enabled.<br>References:<br>http://msdn.microsoft.com/en-us/library/ms175935.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-07T16:10:00.000Z",
        "voteCount": 1,
        "content": "Is Correct C and D\nYou also needed to restart the SQL Server service in order for SQL Server to start using Instant File Initialization."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4828-exam-70-765-topic-3-question-18-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 database.<br>The database contains a Product table created by using the following definition:<br><img src=\"/assets/media/exam-media/02202/0007200001.png\" class=\"in-exam-image\"><br>You need to ensure that the minimum amount of disk space is used to store the data in the Product table.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConvert all indexes to Column Store indexes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement Unicode Compression.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement row-level compression.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement page-level compression."
    ],
    "answer": "D",
    "answerDescription": "Incorrect Answers:<br>A: Only a single index is used.<br>B: Unicode compression supports the fixed-length nchar(n) and nvarchar(n) data types.<br>C: Row-level compression does not affect VARCHAR och CHAR columns.<br>References:<br>https://docs.microsoft.com/en-us/sql/relational-databases/data-compression/data-compression https://docs.microsoft.com/en-us/sql/relational-databases/data-compression/page-compression-implementation https://docs.microsoft.com/en-us/sql/relational-databases/data-compression/row-compression-implementation",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-06T13:47:00.000Z",
        "voteCount": 3,
        "content": "That IS a tricky question, because a clustered columnstore index always leads to better table compression than page level.\nBut here, the PK is clustered, so the table cant be compressed as columnstore.\nNot all index can be columstored"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/14366-exam-70-765-topic-3-question-26-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 instance named SQL2012 that hosts an OLTP database of 1 terabyte in size.<br>The database is modified by users only from Monday through Friday from 09:00 hours to 17:00 hours. Users modify more than 30 percent of the data in the database during the week.<br>Backups are performed as shown in the following schedule:<br><img src=\"/assets/media/exam-media/02202/0008100001.png\" class=\"in-exam-image\"><br>The Finance department plans to execute a batch process every Saturday at 09:00 hours. This batch process will take a maximum of 8 hours to complete.<br>The batch process will update three tables that are 10 GB in size. The batch process will update these tables multiple times.<br>When the batch process completes, the Finance department runs a report to find out whether the batch process has completed correctly.<br>You need to ensure that if the Finance department disapproves the batch process, the batch operation can be rolled back in the minimum amount of time.<br>What should you do on Saturday?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform a differential backup at 08:59 hours.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecord the LSN of the transaction log at 08:59 hours. Perform a transaction log backup at 17:01 hours.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a database snapshot at 08:59 hours.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRecord the LSN of the transaction log at 08:59 hours. Perform a transaction log backup at 08:59 hours.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a marked transaction in the transaction log at 08:59 hours. Perform a transaction log backup at 17:01 hours.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a marked transaction in the transaction log at 08:59 hours. Perform a transaction log backup at 08:59 hours."
    ],
    "answer": "C",
    "answerDescription": "References:<br>https://docs.microsoft.com/en-us/sql/relational-databases/databases/database-snapshots-sql-server",
    "votes": [],
    "comments": [
      {
        "date": "2020-02-17T19:16:00.000Z",
        "voteCount": 3,
        "content": "Answer justification according to MS Document :\nIn the event of a user error on a source database, you can revert the source database to the state it was in when a given database snapshot was created. Data loss is confined to updates to the database since the snapshot's creation.\n\nFor example, before doing major updates, such as a bulk update or a schema change, create a database snapshot on the database protects data. If you make a mistake, you can use the snapshot to recover by reverting the database to the snapshot. Reverting is potentially much faster for this purpose than restoring from a backup; however, you cannot roll forward afterward."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6244-exam-70-765-topic-3-question-29-discussion/",
    "body": "You administer a Microsoft SQL Server database named Sales. The database is 3 terabytes in size.<br>The Sales database is configured as shown in the following table.<br><img src=\"/assets/media/exam-media/02202/0008300001.png\" class=\"in-exam-image\"><br>You discover that all files except Sales_2.ndf are corrupt.<br>You need to recover the corrupted data in the minimum amount of time.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform a file restore.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform a transaction log restore.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform a restore from a full backup.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform a filegroup restore."
    ],
    "answer": "A",
    "answerDescription": "In a file restore, the goal is to restore one or more damaged files without restoring the whole database.<br>References: https://docs.microsoft.com/en-us/sql/relational-databases/backup-restore/file-restores-simple-recovery-model",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-14T07:10:00.000Z",
        "voteCount": 1,
        "content": "correct answer is C : Perform a restore from a full backup"
      },
      {
        "date": "2020-01-04T00:57:00.000Z",
        "voteCount": 4,
        "content": "The file restore could be a valid answer here. Reason being that the database is of 3TB and we need to make it workable in minimum time possible.\nIt may be possible that the file that is corrupted is the smallest one. SInce this database has 2 Archive files, they might be taking up major portion of the 3TB. So logic says why waste time on restoring the entire DB when you can restore 1 file and get up and running. This is a situational question to which the right or wrong answer can be determined by the exact sizes of the individual files. But without them, just on the face file restore seems a better option."
      },
      {
        "date": "2020-03-31T02:07:00.000Z",
        "voteCount": 4,
        "content": "The correct answer should be restore from full backup. If a single file was lost then yes a file level restore makes sense however, the question states that all files except sales_2.ndf are corrupt which means only sales_2.ndf is good and in this scenario I would go for a restore from full backup as well"
      },
      {
        "date": "2019-10-29T06:15:00.000Z",
        "voteCount": 2,
        "content": "I agree. \"Option C. Perform a restore from a full backup.\" is th right answer"
      },
      {
        "date": "2019-10-08T00:49:00.000Z",
        "voteCount": 4,
        "content": "Correct Answer should be C.\nin the scenario all the files are corrupt except 1. Full backup restore will be beneficial in this case than file restore."
      },
      {
        "date": "2020-06-16T07:08:00.000Z",
        "voteCount": 1,
        "content": "Agreed. I don’t think a file backup is supported for a read/write db...  “Under the simple recovery model, file backups are supported only for read-only files. The primary filegroup and read/write secondary filegroups are always restored together, by restoring a database or partial backup.”"
      },
      {
        "date": "2020-06-16T07:09:00.000Z",
        "voteCount": 1,
        "content": "https://docs.microsoft.com/en-us/sql/relational-databases/backup-restore/file-restores-simple-recovery-model?view=sql-server-ver15"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/39334-exam-70-765-topic-3-question-31-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 database named Contoso on a server named Server01.<br>You need to write messages to the Application Log when users are added to or removed from a fixed server role in Server01.<br>What should you create?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Database Audit Specification",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAn Alert",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA SQL Profiler Trace",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Resource Pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAn Extended Event session",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Server Audit Specification"
    ],
    "answer": "G",
    "answerDescription": "The SQL Server Audit feature enables you to audit server-level and database-level groups of events and individual events.<br>Audits can have the following categories of actions:<br>✑ Server-level. These actions include server operations, such as management changes, such as in this question, and logon and logoff operations.<br>✑ Database-level. These actions encompass data manipulation languages (DML) and data definition language (DDL) operations.<br>✑ Audit-level. These actions include actions in the auditing process.<br>References: http://technet.microsoft.com/en-us/library/cc280663(v=sql.105).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-08T22:18:00.000Z",
        "voteCount": 1,
        "content": "I got this one wrong. The answer is Server Audit Specification, but you can also set up an Alert that kicks off a job that writes to the application log (but not an alert on its own)"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19259-exam-70-765-topic-3-question-33-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 database named Contoso on a server named Server01.<br>You need to diagnose deadlocks that happen when executing a specific set of stored procedures by recording events and playing them back on a different test server.<br>What should you create?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Database Audit Specification",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Policy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAn Alert",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA SQL Profiler Trace",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Resource Pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAn Extended Event session",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA Server Audit Specification"
    ],
    "answer": "D",
    "answerDescription": "Use SQL Server Profiler to identify the cause of a deadlock. A deadlock occurs when there is a cyclic dependency between two or more threads, or processes, for some set of resources within SQL Server. Using SQL Server Profiler, you can create a trace that records, replays, and displays deadlock events for analysis.<br>References: http://msdn.microsoft.com/en-us/library/ms188246.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-28T08:07:00.000Z",
        "voteCount": 2,
        "content": "Whenever possible Extended Events should be preferred ove SQL Server Profiler In the default System_Health-session there is already a deadlock detection configured: https://docs.microsoft.com/en-us/sql/relational-databases/extended-events/use-the-system-health-session?view=sql-server-ver15"
      },
      {
        "date": "2020-12-14T12:35:00.000Z",
        "voteCount": 1,
        "content": "But you cannot replay them."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4090-exam-70-765-topic-3-question-36-discussion/",
    "body": "You administer all the deployments of Microsoft SQL Server 2012 in your company. You have two servers in the same data center that hosts your production database.<br>You need to ensure that the database remains available if a catastrophic server failure or a disk failure occurs.<br>You also need to maintain transactional consistency of the data across both servers.<br>You need to achieve these goals without manual intervention.<br>Which configuration should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTwo servers configured in a Windows Failover Cluster in the same data center SQL Server configured as a clustered instance",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSQL Server that includes an application database configured to perform transactional replication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTwo servers configured in the same data center A primary server configured to perform log-shipping every 10 minutes A backup server configured as a warm standby",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTwo servers configured in different data centers SQL Server Availability Group configured in Synchronous-Commit Availability Mode One server configured as an Active Secondary",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTwo servers configured in the same data center SQL Server Availability Group configured in Asynchronous-Commit Availability Mode One server configured as an Active Secondary",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTwo servers configured in different data centers SQL Server Availability Group configured in Asynchronous-Commit Availability Mode",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSQL Server that includes an application database configured to perform snapshot replication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTwo servers configured on the same subnet"
    ],
    "answer": "H",
    "answerDescription": "Always On availability groups supports two availability modesasynchronous-commit mode and synchronous-commit mode<br>Synchronous-commit mode emphasizes high availability over performance, at the cost of increased transaction latency.<br>References:<br>https://docs.microsoft.com/en-us/sql/database-engine/availability-groups/windows/availability-modes-always-on-availability- groups#SyncCommitAvMode",
    "votes": [],
    "comments": [
      {
        "date": "2019-10-29T12:23:00.000Z",
        "voteCount": 7,
        "content": "H.\nTwo servers configured on the same subnet\nSQL Server Availability Group configured in Synchronous-Commit Availability Mode"
      },
      {
        "date": "2020-04-19T20:51:00.000Z",
        "voteCount": 2,
        "content": "How about option B with a peer-to-peer replication?"
      },
      {
        "date": "2021-01-17T16:43:00.000Z",
        "voteCount": 1,
        "content": "B, Replication does not meet the following requirement\n\"You need to ensure that the database remains available if a catastrophic server failure or a disk failure occurs\""
      },
      {
        "date": "2019-08-26T00:20:00.000Z",
        "voteCount": 4,
        "content": "h is the right answer but h is not complete written"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18916-exam-70-765-topic-3-question-39-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 instance that has several SQL Server Agent jobs configured.<br>When SQL Server Agent jobs fail, the error messages returned by the job steps do not provide the required detail.<br>The following error message is an example error message:<br>\"The job failed. The Job was invoked by User CONTOSO\\ServiceAccount. The last step to run was step 1 (Subplan_1).\"<br>You need to ensure that all available details of the job step failures for SQL Server Agent jobs are retained.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure output files.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExpand agent logging to include information from all events.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDisable the Limit size of job history log feature.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure event forwarding."
    ],
    "answer": "B",
    "answerDescription": "References: http://msdn.microsoft.com/en-us/library/ms175488.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-22T05:02:00.000Z",
        "voteCount": 9,
        "content": "This is configure output files."
      },
      {
        "date": "2020-12-08T22:41:00.000Z",
        "voteCount": 2,
        "content": "This is the correct link https://docs.microsoft.com/en-us/sql/ssms/agent/write-execution-trace-messages-to-sql-server-agent-log-ssms?view=sql-server-ver15"
      },
      {
        "date": "2020-05-02T11:15:00.000Z",
        "voteCount": 1,
        "content": "acredito que a resposta correta seria a A"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/31811-exam-70-765-topic-3-question-41-discussion/",
    "body": "You administer two instances of Microsoft SQL Server 2012. You deploy an application that uses a database on the named instance.<br>The application is unable to connect to the database on the named instance.<br>You need to ensure that the application can connect to the named instance.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the application as data-tiered.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen port 1433 on the Windows firewall on the server.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the named SQL Server instance to use an account that is a member of the Domain Admins group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart the SQL Server Browser Service."
    ],
    "answer": "D",
    "answerDescription": "The SQL Server Browser program runs as a Windows service. SQL Server Browser listens for incoming requests for Microsoft SQL Server resources and provides information about SQL Server instances installed on the computer. SQL Server Browser contributes to the following actions:<br>✑ Browsing a list of available servers<br>✑ Connecting to the correct server instance<br>✑ Connecting to dedicated administrator connection (DAC) endpoints<br>References:<br>https://technet.microsoft.com/en-us/library/ms181087(v=sql.105).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-21T04:10:00.000Z",
        "voteCount": 1,
        "content": "Why not B open port 1433. Application doesn't need SQL browser service to connect, connection string is usually written in config file."
      },
      {
        "date": "2021-01-22T01:46:00.000Z",
        "voteCount": 1,
        "content": "because of \"two instances\""
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/19261-exam-70-765-topic-3-question-42-discussion/",
    "body": "You use a contained database named ContosoDb within a domain.<br>You need to create a user who can log on to the ContosoDb database. You also need to ensure that you can port the database to different database servers within the domain without additional user account configurations.<br>Which type of user should you create?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSQL user without login",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUser mapped to an asymmetric key",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDomain user",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tlogin mapped to a virtual account"
    ],
    "answer": "C",
    "answerDescription": "If the service must interact with network services, access domain resources like file shares or if it uses linked server connections to other computers running SQL<br>Server, you might use a minimally-privileged domain account. Many server-to-server activities can be performed only with a domain user account.<br>References:<br>https://docs.microsoft.com/en-us/sql/database-engine/configure-windows/configure-windows-service-accounts-and-permissions",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-28T08:50:00.000Z",
        "voteCount": 1,
        "content": "The question asks for a new user login not the service account. To me Answer A: \"SQL user without Login\" would be valid as well. Nevertheless, a domain account should always be preferred over a SQL Account."
      },
      {
        "date": "2020-11-05T23:19:00.000Z",
        "voteCount": 1,
        "content": "\"If the service must interact with network services, access domain resources like file shares or if it uses linked server connections to other computers.....\""
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1186-exam-70-765-topic-3-question-45-discussion/",
    "body": "You administer a SQL Server 2012 server that contains a database named SalesDB. SalesDb contains a schema named Customers that has a table named<br>Regions. A user named UserA is a member of a role named Sales.<br>UserA is granted the Select permission on the Regions table. The Sales role is granted the Select permission on the Customers schema.<br>You need to ensure that UserA is disallowed to select from any of the tables in the Customers schema.<br>Which Transact-SQL statement should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tREVOKE SELECT ON Schema::Customers FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Object::Regions FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEXEC sp_addrolemember 'Sales', 'UserA'",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Object::Regions FROM Sales",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tREVOKE SELECT ON Object::Regions FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Schema::Customers FROM Sales",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Schema::Customers FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEXEC sp_droprolemember 'Sales', 'UserA'",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"I\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tI.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t REVOKE SELECT ON Object::Regions FROM Sales",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"J\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tJ.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tREVOKE SELECT ON Schema::Customers FROM Sales"
    ],
    "answer": "G",
    "answerDescription": "Use SQL Data Warehouse or Parallel Data WarehouseGRANT and DENY statements to grant or deny a permission (such as UPDATE) on a securable (such as a database, table, view, etc.) to a security principal (a login, a database user, or a database role).<br>References:<br>https://docs.microsoft.com/en-us/sql/t-sql/statements/permissions-grant-deny-revoke-azure-sql-data-warehouse-parallel-data-warehouse",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-10T21:37:00.000Z",
        "voteCount": 1,
        "content": "Assuming the way the question is worded (DISALLOWED) and the syntax in the answers is correct (FROM), the answer would be A. There is no DENY FROM. https://www.mssqltips.com/sqlservertip/2894/understanding-grant-deny-and-revoke-in-sql-server/"
      },
      {
        "date": "2020-04-10T21:31:00.000Z",
        "voteCount": 1,
        "content": "Assuming the way the question is worded (DISALLOWED) and the syntax in the answers is correct (FROM), the answer would be A. There is no DENY FROM"
      },
      {
        "date": "2020-03-30T14:28:00.000Z",
        "voteCount": 2,
        "content": "Agreed with @AlexandreVM the answer is OK but there's a syntax error.\nThe right answer is G.  DENY SELECT ON Schema::Customers FROM UserA\n(but replacing \"FROM\" by \"TO\")\nlike this : DENY SELECT ON Schema::Customers TO UserA"
      },
      {
        "date": "2020-08-05T11:46:00.000Z",
        "voteCount": 1,
        "content": "I agree. I believe \"FROM\" is a typo and the correct answer is G. All other options either incorrect or do not make sense."
      },
      {
        "date": "2019-09-06T14:08:00.000Z",
        "voteCount": 2,
        "content": "It is not asked to DENY definitively all SELECT autorisation to UserA but only to REVOKE those currently granted"
      },
      {
        "date": "2019-09-06T14:08:00.000Z",
        "voteCount": 3,
        "content": "So answer is A"
      },
      {
        "date": "2019-05-07T14:07:00.000Z",
        "voteCount": 2,
        "content": "TO principal [ ,...n ]\nOne or more principals being granted, denied, or revoked permissions. Principal is the name of a login, database user, or database role.\n\nFROM principal [ ,...n ]\nOne or more principals to revoke permissions from. Principal is the name of a login, database user, or database role. FROM can only be used with a REVOKE statement. TO can be used with GRANT, DENY, or REVOKE.\n\nhttps://docs.microsoft.com/pt-br/sql/t-sql/statements/deny-transact-sql?view=sql-server-2017\nhttps://docs.microsoft.com/en-us/sql/t-sql/statements/permissions-grant-deny-revoke-azure-sql-data-warehouse-parallel-data-warehouse?view=aps-pdw-2016-au7"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/36919-exam-70-765-topic-3-question-46-discussion/",
    "body": "You administer a SQL 2012 server that contains a database named SalesDB. SalesDb contains a schema named Customers that has a table named Regions. A user named UserA is a member of a role named Sales.<br>UserA is granted the Select permission on the Regions table. The Sales role is granted the Select permission on the Customers schema.<br>You need to remove the Select permission for UserA on the Regions table. You also need to ensure that UserA can still access all the tables in the Customers schema, including the Regions table, through the Sales role permissions.<br>Which Transact-SQL statement should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tREVOKE SELECT ON Schema::Customers FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Object::Regions FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEXEC sp_addrolemember 'Sales', 'UserA'",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Object::Regions FROM Sales",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tREVOKE SELECT ON Object::Regions FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Schema::Customers FROM Sales",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDENY SELECT ON Schema::Customers FROM UserA",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEXEC sp_droprolemember 'Sales', 'UserA'",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"I\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tI.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t REVOKE SELECT ON Object::Regions FROM Sales",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"J\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tJ.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tREVOKE SELECT ON Schema::Customers FROM Sales"
    ],
    "answer": "E",
    "answerDescription": "Use REVOKE to remove the grant or deny of a permission.<br>References:<br>https://docs.microsoft.com/en-us/sql/t-sql/statements/permissions-grant-deny-revoke-azure-sql-data-warehouse-parallel-data-warehouse",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-25T07:15:00.000Z",
        "voteCount": 1,
        "content": "E is correct because it asks to remove (REVOKE) the select permission, not disallow (DENY) selecting of data within that table."
      },
      {
        "date": "2020-12-09T13:45:00.000Z",
        "voteCount": 3,
        "content": "E is correct."
      },
      {
        "date": "2020-11-13T04:33:00.000Z",
        "voteCount": 1,
        "content": "E is WRONG\nD is correct! If have tested this with an example."
      },
      {
        "date": "2020-11-14T19:04:00.000Z",
        "voteCount": 4,
        "content": "there is no such thing as DENY ... FROM.., only DENY ... TO.. so, what've you tested?"
      },
      {
        "date": "2020-12-02T03:45:00.000Z",
        "voteCount": 3,
        "content": "Deny.. TO..\nRevoke... FROM.."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/460-exam-70-765-topic-3-question-48-discussion/",
    "body": "You administer a Windows 2008 server hosting an instance of Microsoft SQL Server 2012 Standard Edition. The server hosts a database named Orders.<br>Users report that a query that filters on OrderDate is taking an exceptionally long time. You discover that an index named IX_OrderDate on the CustomerOrder table is heavily fragmenteD.<br>You need to improve the performance of the IX_OrderDate index. The index should remain online during the operation.<br>Which Transact-SQL command should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tALTER INDEX IX_OrderDateON CustomerOrder DISABLE",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tALTER INDEX IX_OrderDateON CustomerOrder ENABLE",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tALTER INDEX IX_OrderDateON CustomerOrder REORGANIZE",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tALTER INDEX IX OrderDateON CustomerOrder REBUILD"
    ],
    "answer": "C",
    "answerDescription": "Reorganize: This option is more lightweight compared to rebuild. It runs through the leaf level of the index, and as it goes it fixes physical ordering of pages and also compacts pages to apply any previously set fillfactor settings. This operation is always online, and if you cancel it then its able to just stop where it is (it doesnt have a giant operation to rollback).<br>References:<br>https://www.brentozar.com/archive/2013/09/index-maintenance-sql-server-rebuild-reorganize/",
    "votes": [],
    "comments": [
      {
        "date": "2019-02-28T12:51:00.000Z",
        "voteCount": 1,
        "content": "If this is a heavily fragmented index, wouldn't the REBUILD option be a better choice?"
      },
      {
        "date": "2019-05-07T14:11:00.000Z",
        "voteCount": 2,
        "content": "Standard Edition... table needs to remain online..."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33199-exam-70-765-topic-3-question-49-discussion/",
    "body": "You administer a Windows Azure SQL Database database named Orders.<br>You need to create a copy of Orders named Orders_Reporting.<br>Which Transact-SQL command should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBACKUP DATABASE Orders TO DISK = 'D:\\Orders.bak'RESTORE DATABASE Orders_ReportingFROM DISK = 'D:\\Orders.bak",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBACKUP DATABASE Orders TO DISK = 'D:\\Orders.bak'CREATE DATABASE Orders_ReportingFROM DISK = 'D:\\Orders.bak",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE DATABASE Orders_Reporting AS COPY OF Orders",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBACKUP DATABASE Orders TO DISK = 'D:\\Orders.bak'MIRROR TO DISK = 'Orders_Reporting"
    ],
    "answer": "C",
    "answerDescription": "BACKUP DATABASE AS COPY OF [source_server_name.]source_database_name<br>Is used for copying a database to the same or a different SQL Database server.<br>References:<br>https://docs.microsoft.com/en-us/sql/t-sql/statements/create-database-azure-sql-database",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-08T06:22:00.000Z",
        "voteCount": 3,
        "content": "C is correct. Tested just now.\n\nhttps://www.mssqltips.com/sqlservertip/2235/creating-backups-and-copies-of-your-sql-azure-databases/#:~:text=To%20create%20a%20copy%2C%20use,DatabaseName."
      },
      {
        "date": "2020-12-02T03:52:00.000Z",
        "voteCount": 1,
        "content": "Agreed. Connected to Azure Database from ssms, tested the command."
      },
      {
        "date": "2020-09-29T04:16:00.000Z",
        "voteCount": 1,
        "content": "-\"CREATE DATABASE Orders_Reporting AS COPY OF Orders\" - doesnt work\n-the A seems correct"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/39891-exam-70-765-topic-3-question-52-discussion/",
    "body": "You administer a Windows Azure SQL Database database named Inventory that contains a stored procedure named p_AddInventory.<br>Users need to be able to SELECT from all tables in the database and execute the stored procedure.<br>You need to grant only the necessary permissions.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGrant EXECUTE permission on p_AddInventory to all users. Grant VIEW DEFINITION to all users.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGrant EXECUTE permission on p_AddInventory to all users. Add all users to the db_datawriter role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAdd all users to the db_owner role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tGrant EXECUTE permission on p_AddInventory to all users. Add all users to the db_datareader role."
    ],
    "answer": "D",
    "answerDescription": "Members of the db_datareader fixed database role can run a SELECT statement against any table or view in the database.<br>References:<br>https://technet.microsoft.com/en-us/library/ms188629(v=sql.90).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-12T17:03:00.000Z",
        "voteCount": 1,
        "content": "The D is correct, just test in my enviroment:\nhttps://ibb.co/LZnQx2H"
      },
      {
        "date": "2021-01-12T17:06:00.000Z",
        "voteCount": 1,
        "content": "Wrong link, this is the correct one:\nhttps://ibb.co/Fm0Z56h"
      },
      {
        "date": "2020-12-15T02:15:00.000Z",
        "voteCount": 2,
        "content": "db_datareader role don't execute store procedures. The A is correct"
      },
      {
        "date": "2020-12-31T22:31:00.000Z",
        "voteCount": 1,
        "content": "If you simply excute SELECT statements, the db_datareader role should fit for executing your stored procedures. The db_datawriter is the role, that is eligible to create them.\nhttps://stackoverflow.com/questions/13142114/roles-needed-for-executing-stored-procedure-in-sql-server-authentication#:~:text=It%20depends%20on%20the%20action,is%20eligible%20to%20create%20them."
      },
      {
        "date": "2020-12-31T22:34:00.000Z",
        "voteCount": 1,
        "content": "https://stackoverflow.com/questions/13142114/roles-needed-for-executing-stored-procedure-in-sql-server-authentication"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/27248-exam-70-765-topic-3-question-54-discussion/",
    "body": "You administer a Windows Azure SQL Database database named Human_Resources. The database contains 2 tables named Employees and SalaryDetails. You add two Windows groups as logins for the server:<br>✑ CORP\\Employees - All company employees<br>✑ CORP\\HRAdmins - HR administrators only<br>✑ HR Administrators are also company employees.<br>You need to grant users access according to the following requirements:<br>CORP\\Employees should have SELECT access to the Employees table. Only users in CORP\\HRAdmins should have SELECT access to the SalaryDetails<br><img src=\"/assets/media/exam-media/02202/0010300004.png\" class=\"in-exam-image\"> table.<br>✑ Logins are based only on Windows security groups.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a database role called Employees. Add CORP\\Employees to the db_datareader role. Add all company employees except HR administrators to the Employees role. Deny SELECT access to the SalaryDetails table to the Employees role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a database role called HRAdmins. Add all company employees except HR administrators to the db_datareader role. Add all HR administrators to the HRAdmins role. Grant SELECT access to the SalaryDetails table to the HRAdmins role. Deny SELECT access to the SalaryDetails table to the db_datareader role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate two database roles: Employees and HRAdmins. Add all company employees to the Employees role. Add HR administrators to the HRAdmins role. Grant SELECT access to all tables except SalaryDetails to the Employees role. Grant SELECT access to the SalaryDetails table to the HRAdmins role. Deny SELECT access to the SalaryDetails table to the Employees role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a database role called Employees. Add all HR administrators to the db_datareader role. Add all company employees to the Employees role. Grant SELECT access to all tables except the SalaryDetails table to the Employees role."
    ],
    "answer": "D",
    "answerDescription": "Members of the db_datareader fixed database role can run a SELECT statement against any table or view in the database.<br>References:<br>https://technet.microsoft.com/en-us/library/ms188629(v=sql.90).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-08-03T13:31:00.000Z",
        "voteCount": 4,
        "content": "Agree. D is correct.\nA. Does not give any access to administrators.\nB. Is trying to modify fixed db_datareader role.\nC. \"Deny\" will remove access from administrators as they are also members of the Employees role."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32805-exam-70-765-topic-3-question-56-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 database named Orders.<br>Orders contains a table named OrderShip that is defined as follows:<br><img src=\"/assets/media/exam-media/02202/0010500001.png\" class=\"in-exam-image\"><br>A NULL value represents a domestic order. Ninety percent of the values in CountryCode are NULL.<br>Customers require a procedure that will return orders for all customers from a specified country.<br>You create a new procedure:<br><img src=\"/assets/media/exam-media/02202/0010600001.png\" class=\"in-exam-image\"><br>Performance on this procedure is slow.<br>You need to alter the schema to optimize this query. Objects created must use a minimum amount of resources.<br>Which Transact-SQL statement should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE NONCLUSTERED INDEX IX_CountryCode ON Ordership (CountryCode) WHERE CountryCode IS NOT NULL",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE STATISTICS ST_CountryCode ON OrderShip (CountryCode) WHERE CountryCode IS NOT NULL",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE CLUSTERED INDEX IX_CountryCode ON OrderShip (CountryCode)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE INDEX IX_CountryCode ON OrderShip (CustomerID) WHERE CountryCode IS NOT NULL"
    ],
    "answer": "B",
    "answerDescription": "Here creating statistics is relevant. The CREATE STATISTICS command creates query optimization statistics on one or more columns of a table, an indexed view, or an external table. For most queries, the query optimizer already generates the necessary statistics for a high-quality query plan; in a few cases, you need to create additional statistics with CREATE STATISTICS or modify the query design to improve query performance.<br>References:<br>https://docs.microsoft.com/en-us/sql/t-sql/statements/create-statistics-transact-sql",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-29T16:17:00.000Z",
        "voteCount": 1,
        "content": "I think the answer is C, create a clustered index because the question asks you to use minimum resources.\n\nCreating stats won't help because there are no indexes for SQL to use to actually speed up the query.\n\nCreating a clustered index uses less space than a regular index as the clustered index doesn't need the leaf level, it just reorganises the table itself."
      },
      {
        "date": "2020-12-19T17:59:00.000Z",
        "voteCount": 3,
        "content": "Looking at the question again, if you only have *one* T-SQL statement to use, then the answer would be A because the existing PK on the table will already be clustered and you would have to alter that before you could apply a new clustered index.\n\nA not B because you still need an index to speed up the query, and this one has a where clause that means only 10% of the rows are indexed."
      },
      {
        "date": "2020-09-25T23:46:00.000Z",
        "voteCount": 2,
        "content": "I think correct answer is A"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20357-exam-70-765-topic-3-question-67-discussion/",
    "body": "You plan to install Microsoft SQL Server 2012 for a web hosting company.<br>The company plans to host multiple web sites, each supported by a SQL Server database.<br>You need to select an edition of SQL Server that features backup compression of databases, basic data integration features, and low total cost of ownership.<br>Which edition should you choose?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExpress Edition with Tools",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStandard Edition",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWeb Edition",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tExpress Edition with Advanced Services"
    ],
    "answer": "B",
    "answerDescription": "Incorrect Answers:<br>A, D: Express edition has severe limitations.<br>C: SQL Server 2012 Web edition is a low total-cost-of-ownership option for Web hosters and Web VAPs to provide scalability, affordability, and manageability capabilities for small to large scale Web properties.<br>References: https://msdn.microsoft.com/en-us/library/ms144275(v=sql.110).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-12T00:58:00.000Z",
        "voteCount": 5,
        "content": "The question would suggest that Web Edition (C) is correct but this does not have backup compression. So this leaves us with Standard"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1220-exam-70-765-topic-3-question-69-discussion/",
    "body": "You administer a Microsoft SQL Server 2012 instance named SQL2012. You are in the process of migrating a database from a SQL Server 2008 instance named<br>SQL2008 to the SQL2012 instance.<br>You have upgraded a database from the SQL2008 instance by using the side-by-side migration technique.<br>You need to migrate the SQL Server logins from the SQL2008 instance to the SQL2012 instance.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBack up the master database on the SQL2008 instance. Restore the master database on the SQL2012 instance",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Transfer Logins task in a Microsoft SQL Server Integrated Services package",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse sp_grantlogin",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse xp_logininfo."
    ],
    "answer": "C",
    "answerDescription": "sp_grantlogin creates a SQL Server login.<br>Incorrect Answers:<br>D: xp_logininfo returns information about Windows users and Windows groups.<br>References:<br>https://technet.microsoft.com/en-us/library/ms173449(v=sql.110).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-05-09T06:15:00.000Z",
        "voteCount": 11,
        "content": "B!!!!!!!"
      },
      {
        "date": "2020-06-18T03:42:00.000Z",
        "voteCount": 1,
        "content": "Yup: https://www.sqlshack.com/migrate-logins-database-different-server/"
      },
      {
        "date": "2019-10-08T21:14:00.000Z",
        "voteCount": 5,
        "content": "Answer is B"
      },
      {
        "date": "2020-10-12T11:16:00.000Z",
        "voteCount": 1,
        "content": "Should be B"
      },
      {
        "date": "2019-10-29T07:52:00.000Z",
        "voteCount": 5,
        "content": "Yes. It should be B"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18346-exam-70-765-topic-3-question-72-discussion/",
    "body": "You have been hired as a Database Consultant by ABC.com to design a SQL Server 2012 database solution.<br>You are tasked with designing a scale-out and high-availability SQL Server 2012 Online Transaction Processing (OLTP) database solution that will maintain copies of data across two server instances.<br>Your solution must provide scale-out of read operations by distributing the reads from clients across two SQL Server 2012 nodes. The data in both SQL Server nodes needs to be indexed.<br>What should you include in your solution?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should include a primary database with scheduled log shipping to the secondary database configured.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should include two servers configured in an Active-Passive SQL Server 2012 Cluster.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should include a primary SQL Server 2012 database that uses transactional replication to replicate data to the secondary database.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should include two servers in an Asynchronous-Commit Availability Mode Availability Group.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYou should include two servers in a Synchronous-Commit Availability Mode Availability Group."
    ],
    "answer": "C",
    "answerDescription": "Peer-to-peer replication provides a scale-out and high-availability solution by maintaining copies of data across multiple server instances, also referred to as nodes.<br>Built on the foundation of transactional replication, peer-to-peer replication propagates transactionally consistent changes in near real-time. This enables applications that require scale-out of read operations to distribute the reads from clients across multiple nodes. Because data is maintained across the nodes in near real-time, peer-to-peer replication provides data redundancy, which increases the availability of data.<br>References:<br>https://msdn.microsoft.com/en-us/library/ms151196(v=sql.110)",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-26T00:41:00.000Z",
        "voteCount": 1,
        "content": "I think the answer is E, as\n-solution must provide scale-out of read operations by distributing the reads from clients across two SQL Server 2012 nodes\n-secondary replicas in AG use the same indexes as primary, you just can not add them"
      },
      {
        "date": "2020-04-13T06:02:00.000Z",
        "voteCount": 1,
        "content": "\"In no Availability Groups configuration can you create indexes on the secondaries, since the secondaries are essentially read only\"\nhttps://dba.stackexchange.com/questions/101224/secondary-replica-indexing"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/471-exam-70-765-topic-3-question-73-discussion/",
    "body": "You are a database developer of a Microsoft SQL Server 2012 database. You are designing a table that will store Customer data from different sources. The table will include a column that contains the CustomerID from the source system and a column that contains the SourceID. A sample of this data is as shown in the following table.<br><img src=\"/assets/media/exam-media/02202/0011900001.jpg\" class=\"in-exam-image\"><br>You need to ensure that the table has no duplicate CustomerID within a SourceID. You also need to ensure that the data in the table is in the order of SourceID and then CustomerID. Which Transact- SQL statement should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE TABLE Customer (SourceID int NOT NULL IDENTITY, CustomerID int NOT NULL IDENTITY, CustomerName varchar(255) NOT NULL);",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE TABLE Customer (SourceID int NOT NULL, CustomerID int NOT NULL PRIMARY KEY CLUSTERED, CustomerName varchar(255) NOT NULL);",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE TABLE Customer (SourceID int NOT NULL PRIMARY KEY CLUSTERED, CustomerID int NOT NULL UNIQUE, CustomerName varchar(255) NOT NULL);",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCREATE TABLE Customer (SourceID int NOT NULL, CustomerID int NOT NULL, CustomerName varchar(255) NOT NULL, CONSTRAINT PK_Customer PRIMARY KEY CLUSTERED"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2019-10-29T08:10:00.000Z",
        "voteCount": 12,
        "content": "D is correct. But it is with incomplete code. the entire code should be like this:\n  CREATE TABLE Customer \n(SourceID int NOT NULL, CustomerID int NOT NULL, CustomerName varchar(255) NOT NULL, CONSTRAINT PK_Customer PRIMARY KEY CLUSTERED (SourceID,CustomerID))\ngo"
      },
      {
        "date": "2019-03-01T08:54:00.000Z",
        "voteCount": 1,
        "content": "If you are just setting up the table, wouldn't you need to define the customer id column as a primary key column then set the primary key constraint?"
      },
      {
        "date": "2019-09-07T07:11:00.000Z",
        "voteCount": 1,
        "content": "No because that would be incomplète.\nThe question ask to ensure the unicity of  CustomerID for each SourceID and clustered thé table for those two columns.\nSo you need to define a PRIMARY KEY CLUSTERED on both SourceID and CustomerID (on that ordre).\nYou cant define a PRIMARY KEY on two columns without the CONSTRAINT statement at the end of the CREATE TABLE"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32833-exam-70-765-topic-3-question-81-discussion/",
    "body": "You develop a Microsoft SQL Server 2012 database that contains a heap named OrdersHistorical.<br>You write the following Transact-SQL query:<br><br>INSERT INTO OrdersHistorical -<br><br>SELECT * FROM CompletedOrders -<br>You need to optimize transaction logging and locking for the statement.<br>Which table hint should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tHOLDLOCK",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tROWLOCK",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tXLOCK",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUPDLOCK",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTABLOCK"
    ],
    "answer": "E",
    "answerDescription": "When importing data into a heap by using the INSERT INTO SELECT &lt;columns&gt; FROM statement, you can enable optimized logging and locking for the statement by specifying the TABLOCK hint for the target table.<br>References:<br>https://docs.microsoft.com/en-us/sql/t-sql/queries/hints-transact-sql-table",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-26T08:14:00.000Z",
        "voteCount": 1,
        "content": "Difficult question, I think it may be not E as\n-\"you can enable minimal logging and optimized locking for the statement by specifying the TABLOCK hint for the target table. In addition, the recovery model of the database must be set to simple or bulk-logged.\" (https://docs.microsoft.com/en-us/sql/t-sql/queries/hints-transact-sql-table?view=sql-server-ver15) \nSo if we have SIMPLE or BULK recovery model when obviously we will get minimum logging from TABLOCK, but the question doesn't state we have  SIMPLE or BULK recovery model \n-if we use TABLOCK its quite strange to say that its an optimized locking as the whole table is locked, so from one side we don't apply many locks during the transaction and can save time, from the other side we block all the other transactions that are using that table\n-if, for example, one order is totally in one row I would choose B (ROWLOCK) as the answer"
      },
      {
        "date": "2021-01-27T05:53:00.000Z",
        "voteCount": 1,
        "content": "TABLOCK acquires a shared lock on the table, not an exclusive lock. Also from the page you referenced and it's just before your quote for TABLOCK: \"When importing data into a heap by using the INSERT INTO &lt;target_table&gt; SELECT &lt;columns&gt; FROM &lt;source_table&gt; statement, you can enable minimal logging [...]\""
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7455-exam-70-765-topic-3-question-82-discussion/",
    "body": "Your database contains a table named Purchases. The table includes a DATETIME column named PurchaseTime that stores the date and time each purchase is made. There is a non- clustered index on the PurchaseTime column. The business team wants a report that displays the total number of purchases made on the current day. You need to write a query that will return the correct results in the most efficient manner.<br>Which Transact-SQL query should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSELECT COUNT(*) FROM Purchases WHERE PurchaseTime = CONVERT(DATE, GETDATE())",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSELECT COUNT(*) FROM Purchases WHERE PurchaseTime = GETDATE()",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSELECT COUNT(*) FROM Purchases WHERE CONVERT(VARCHAR, PurchaseTime, 112) = CONVERT(VARCHAR, GETDATE(), 112)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSELECT COUNT(*) FROM Purchases WHERE PurchaseTime &gt;= CONVERT(DATE, GETDATE())"
    ],
    "answer": "D",
    "answerDescription": "To compare a time with date we must use &gt;= and &gt; operators, and not the = operator.<br>Incorrect Answers:<br>A: The in WHERE clause there is an incorrect comparison between time and a date, as equality (=) is used.<br>References:<br>http://technet.microsoft.com/en-us/library/ms181034.aspx",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-09T14:46:00.000Z",
        "voteCount": 2,
        "content": "C is correct, because with converting to format 112 we are on both sides on the current day. D is wrong, because D also includes orders from the days after today. A and B are obviously wrong."
      },
      {
        "date": "2020-04-13T08:19:00.000Z",
        "voteCount": 1,
        "content": "I ran the code: SELECT COUNT(*)\nFROM Purchases\nWHERE PurchaseTime &gt;= CONVERT(DATE, GETDATE())\nIt does only return results when used with &gt;="
      },
      {
        "date": "2020-04-11T08:02:00.000Z",
        "voteCount": 1,
        "content": "\"To compare a time with date we must use &gt;= and &gt; operators, and not the = operator.\" is 100% wrong. lol"
      },
      {
        "date": "2020-07-30T13:05:00.000Z",
        "voteCount": 2,
        "content": "Datetime has a time part so it equals to a date field only at 00:00:00.000 and it make sense to use &gt;= and &gt;."
      },
      {
        "date": "2020-03-25T09:46:00.000Z",
        "voteCount": 3,
        "content": "C.\n12\t112\t yyyymmdd\tISO  Refer convert function"
      },
      {
        "date": "2021-01-19T13:04:00.000Z",
        "voteCount": 1,
        "content": "This is face from efficient for 2 reasons\n1. If you use a function on the indexed column, the optimiser can’t use that index.\n2. CPU overhead of the function \\ data type conversion\nThe answer is D, if they displayed the whole answer"
      },
      {
        "date": "2019-10-29T13:03:00.000Z",
        "voteCount": 2,
        "content": "D.\nSELECT COUNT(*)\nFROM Purchases\nWHERE PurchaseTime &gt;= CONVERT(DATE, GETDATE())\nAND PurchaseTime &lt; DATEADD(DAY, 1, CONVERT(DATE, GETDATE()))"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4912-exam-70-765-topic-3-question-83-discussion/",
    "body": "HOTSPOT -<br>You are building the database platform for a multi-tenant application. The application will have one database per tenant and will have at least 30 tenants. Each tenant will have a separate resource group for billing purposes.<br>The application will require at least 10 GB of clustered columnstore indexes for each database.<br>You need to implement the database platform for the application. The solution must minimize costs.<br>What should you configure? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0013300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0013400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "The Standard tier service allows for 1TB of data. Here 30 x 10 GB, 0.3 TB, is required.<br>Incorrect Answers:<br>References: https://docs.microsoft.com/en-us/azure/sql-database/sql-database-service-tiers",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-14T23:36:00.000Z",
        "voteCount": 1,
        "content": "Standard S3 and above support column store indexes (https://docs.microsoft.com/en-us/azure/sql-database/sql-database-in-memory#in-memory-columnstore). Premium RS is deprecated."
      },
      {
        "date": "2019-09-08T10:31:00.000Z",
        "voteCount": 3,
        "content": "I thought the first answer was wrong, but it seems Standard tiers supports columnstore indexes since  last year."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30878-exam-70-765-topic-3-question-84-discussion/",
    "body": "DRAG DROP -<br>You have on-premises database server.<br>The database files for a user database are configured as shown in the following table:<br><img src=\"/assets/media/exam-media/02202/0013500001.png\" class=\"in-exam-image\"><br>You plan to migrate the on-premises database server to Microsoft SQL Server on a Microsoft Azure virtual machine.<br>You need to provision storage for the virtual machine to meet the following requirements:<br>✑ Support the same configurations as the on-premises database server.<br>✑ Provide a Service Level Agreement (SLA) for performance.<br>✑ Minimize costs.<br>Which type of storage should you provision for each file type? To answer, drag the appropriate storage types to the correct file types. Each storage type may be used once, more than once or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br><img src=\"/assets/media/exam-media/02202/0013500005.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0013600001.png\" class=\"in-exam-image\">",
    "answerDescription": "Standard Storage has varying latencies and bandwidth and is only recommended for dev/test workloads. Production workloads should use Premium Storage.<br>References: https://docs.microsoft.com/en-us/azure/virtual-machines/windows/sql/virtual-machines-windows-sql-performance",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-09T16:16:00.000Z",
        "voteCount": 1,
        "content": "i agree"
      },
      {
        "date": "2020-09-08T11:39:00.000Z",
        "voteCount": 3,
        "content": "There is no service level agreement (SLA) for standard storage, for this reason it must be Premium"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2605-exam-70-765-topic-3-question-85-discussion/",
    "body": "HOTSPOT -<br>A company has an on-premises Microsoft SQL Server environment with a SQL-Server named SQL01.<br>You need to create a local sysadmin account on SQL01 named Admin1.<br>How should you complete the Transact-SQL statements? To answer, select the appropriate Transact-SQL segments in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0013700001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0013800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Expalantion:<br>B: First we create a login with the CREATE LOGIN command.<br>E: Then we add it to the sysadmin role.<br>1. To add a member to a fixed server role<br>2. In Object Explorer, connect to an instance of Database Engine.<br>3. On the Standard bar, click New Query.<br>Copy and paste the following example into the query window and click Execute.<br>ALTER SERVER ROLE diskadmin ADD [Domain\\Juan] ;<br><br>GO -<br>G: Finally we add a database user for the login we created.<br>References: https://technet.microsoft.com/en-us/library/aa337562(v=sql.110).aspx",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-18T04:51:00.000Z",
        "voteCount": 19,
        "content": "The last statement should be \n CREATE USER [Admin] FOR LOGIN [Admin]"
      },
      {
        "date": "2019-10-09T01:17:00.000Z",
        "voteCount": 9,
        "content": "Last option seems incorrect. Once a login is sysadmin you don’t have to add a user for it in a particular database. Login has access on every database anyway. Question doesn’t make sense giving that 3rd option."
      },
      {
        "date": "2020-06-23T14:23:00.000Z",
        "voteCount": 1,
        "content": "The answer is correct. You need to use GRANT to allow the the server permissions. The question is more concerned with those server permissions than the database permissions. https://docs.microsoft.com/en-us/sql/t-sql/statements/create-login-transact-sql?view=sql-server-ver15"
      },
      {
        "date": "2020-08-05T12:47:00.000Z",
        "voteCount": 3,
        "content": "The command would have looked differently then https://docs.microsoft.com/en-us/sql/t-sql/statements/grant-server-principal-permissions-transact-sql?view=sql-server-ver15. Only CREATE USER is right here."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 36,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2606-exam-70-765-topic-3-question-87-discussion/",
    "body": "HOTSPOT -<br>You have an on-premises database.<br>You plan to migrate the database to Microsoft SQL Server on a Microsoft Azure virtual machine.<br>You move the database files to Azure.<br>You need to attach the database files to the SQL Server instance on the virtual machine. The solution must ensure that you can run file snapshot backups.<br>How should you complete the statement? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0014100001.png\" class=\"in-exam-image\">",
    "answerDescription": "References: https://docs.microsoft.com/en-us/sql/t-sql/statements/create-database-sql-server-transact-sql",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-18T05:09:00.000Z",
        "voteCount": 11,
        "content": "The question is incomplete, It misses the part of selecting answer.  \nThe correct answer should be\nUSE master\nGO\nCREATE DATABASE Production_DB\n( FILENAME = N'https://proddbstorage-contoso.blog.core.windows.net/datafiles/prodb.mdf')\nFOR ATTACH;\nGO"
      },
      {
        "date": "2020-12-25T14:10:00.000Z",
        "voteCount": 1,
        "content": "1.Filename 2. ON Primary"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 37,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2607-exam-70-765-topic-3-question-89-discussion/",
    "body": "You use Microsoft Azure Resource Manager to deploy two new Microsoft SQL Server instances in an Azure virtual machine (VM). VM has 28 gigabytes (GB) of memory. The instances are named Instance1 and Instance2, respectively.<br>The various databases on the instances have the following characteristics:<br><img src=\"/assets/media/exam-media/02202/0014500001.png\" class=\"in-exam-image\"><br>You run the following Transact-SQL statements:<br><img src=\"/assets/media/exam-media/02202/0014500002.png\" class=\"in-exam-image\"><br>You need to configure each SQL Server instance to correctly allocate memory.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Instance1, run the following Transact-SQL code: <img src=\"/assets/media/exam-media/02202/0014600001.png\" class=\"in-exam-image\"> On Instance2, run the following Transact-SQL code: <img src=\"/assets/media/exam-media/02202/0014600002.png\" class=\"in-exam-image\">",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tA. On Instance1, run the following Transact-SQL code: <img src=\"/assets/media/exam-media/02202/0014600003.png\" class=\"in-exam-image\"> On Instance2, run the following Transact-SQL code: <img src=\"/assets/media/exam-media/02202/0014700001.png\" class=\"in-exam-image\">",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Instance1, run the following Transact-SQL code: <img src=\"/assets/media/exam-media/02202/0014700002.png\" class=\"in-exam-image\"> On Instance2, run the following Transact-SQL code: <img src=\"/assets/media/exam-media/02202/0014700003.png\" class=\"in-exam-image\">",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Instance1, run the following Transact-SQL code: <img src=\"/assets/media/exam-media/02202/0014700004.png\" class=\"in-exam-image\"> On Instance2, run the following Transact-SQL code:"
    ],
    "answer": "D",
    "answerDescription": "Incorrect Answers:<br>A, C: The awefeature will be removed in newer version of Microsoft SQL Server. Do not use this feature in new development work, and modify applications that currently use this feature as soon as possible.<br>B: Automatic soft-NUMA is disabled by default, and this setting is not relevant here.<br>References: https://docs.microsoft.com/en-us/sql/database-engine/configure-windows/server-configuration-options-sql-server",
    "votes": [],
    "comments": [
      {
        "date": "2019-10-29T10:29:00.000Z",
        "voteCount": 6,
        "content": "D. \nOn Instance1, run the following Transact-SQL code:\n   \tsp_configure 'max server memory', 18432\n\tRECONFIGURE\nOn Instance2, run the following Transact-SQL code:\n   \tsp_configure 'min server memory', 6144\n\tRECONFIGURE"
      },
      {
        "date": "2019-07-18T05:17:00.000Z",
        "voteCount": 2,
        "content": "Option D in incomplete"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 38,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30885-exam-70-765-topic-3-question-90-discussion/",
    "body": "You manage a Microsoft SQL Server environment in a Microsoft Azure virtual machine.<br>You must enable Always Encrypted for columns in a database.<br>You need to configure the key store provider.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Randomized encryption type",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tModify the connection string for applications.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAuto-generate a column master key.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Azure Key Vault."
    ],
    "answer": "D",
    "answerDescription": "Expalantion:<br>There are two high-level categories of key stores to consider - Local Key Stores, and Centralized Key Stores.<br>✑ Centralized Key Stores - serve applications on multiple computers. An example of a centralized key store is Azure Key Vault.<br>✑ Local Key Stores<br>References: https://docs.microsoft.com/en-us/sql/relational-databases/security/encryption/create-and-store-column-master-keys-always-encrypted",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-08T15:42:00.000Z",
        "voteCount": 3,
        "content": "Is Correct: D\nFor select the key store provider exists:\n- Windows certificate store\n- Azure Key Vault"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 39,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32930-exam-70-765-topic-3-question-91-discussion/",
    "body": "You manage a Microsoft SQL Server instance named SQL1 that has 32 gigabytes (GB) of total memory. The instance supports an app named App1 that only uses a single thread. App1 frequently queries the database using the same index. The operating system and App1 combined require 8 GB of memory to function.<br>You need to ensure that the SQL Server does not limit the performance of App1.<br>What configuration option should you set?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmin memory per query to 4 GB",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tindex create memory to 16 GB",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmax worker threads to 1",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tmax server memory to 16 GB"
    ],
    "answer": "B",
    "answerDescription": "Expalantion:<br>The index creates memory option controls the maximum amount of memory initially allocated for sort operations when creating indexes. The default value for this option is 0 (self-configuring). If more memory is later needed for index creation and the memory is available, the server will use it; thereby, exceeding the setting of this option. If additional memory is not available, the index creation will continue using the memory already allocated.<br>References: https://docs.microsoft.com/en-us/sql/database-engine/configure-windows/configure-the-index-create-memory-server-configuration-option",
    "votes": [],
    "comments": [
      {
        "date": "2021-01-19T13:24:00.000Z",
        "voteCount": 1,
        "content": "The answer is D\nRegarding B, from the manual we have “ If more memory is later needed for index creation and the memory is available, the server will use it; thereby, exceeding the setting of this option”. The option in B is not a limit so the amount of memory used by SQL could still grow to impact the App.\n\nOnly D constrains the amount of RAM SQL will use. But I would aim a little low in real life"
      },
      {
        "date": "2021-01-17T12:06:00.000Z",
        "voteCount": 1,
        "content": "This question its a trap. On question, says... \"use the index\" not \"Create a index\". Im wrong??"
      },
      {
        "date": "2020-09-27T00:11:00.000Z",
        "voteCount": 3,
        "content": "I think its D"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 40,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4913-exam-70-765-topic-3-question-92-discussion/",
    "body": "HOTSPOT -<br>You plan to deploy two new Microsoft Azure SQL Database instances. Once instance will support a data entry application. The other instance will support the companys business intelligence efforts. The databases will be accessed by mobile applications from public IP addresses.<br>You need to ensure that the database instances meet the following requirements:<br>✑ The database administration team must receive alerts for any suspicious activity in the data entry database, including potential SQL injection attacks.<br>✑ Executives around the world must have access to the business intelligence application.<br>✑ Sensitive data must never be transmitted. Sensitive data must not be stored in plain text in the database.<br>In the table below, identify the feature that you must implement for each database.<br>NOTE: Make only one selection in each column. Each correct selection is work one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0015000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0015100001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Data entry: Threat Detection -<br>SQL Threat Detection provides a new layer of security, which enables customers to detect and respond to potential threats as they occur by providing security alerts on anomalous activities. Users receive an alert upon suspicious database activities, potential vulnerabilities, and SQL injection attacks, as well as anomalous database access patterns.<br>Business intelligence: Dynamic Data Masking<br>Dynamic data masking limits (DDM) sensitive data exposure by masking it to non-privileged users. It can be used to greatly simplify the design and coding of security in your application.<br>References:<br>https://docs.microsoft.com/en-us/azure/sql-database/sql-database-threat-detection https://docs.microsoft.com/en-us/sql/relational-databases/security/dynamic-data-masking",
    "votes": [],
    "comments": [
      {
        "date": "2019-09-08T10:45:00.000Z",
        "voteCount": 15,
        "content": "The Business Intelligence database needs Always Encrypted.\nData masking only masks the query results and stores the data on plain text.\nAlways Encrypted is the only option that ensures data is never provided to an untrusted user"
      },
      {
        "date": "2020-06-21T11:57:00.000Z",
        "voteCount": 1,
        "content": "Altho I agree that Always Encrypted is the better option, the question did not use the work encrypt once. I think DDM for BI database could be the right answer unless I missed something!"
      },
      {
        "date": "2020-08-05T16:27:00.000Z",
        "voteCount": 2,
        "content": "\"Sensitive data must not be stored in plain text in the database\""
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 41,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4914-exam-70-765-topic-3-question-93-discussion/",
    "body": "Note: This question is part of a series of questions that use the same or similar answer choices. An answer choice may be correct for more than one question in the series. Each question is independent of the other questions in this series. Information and details provided in a question apply only to that question.<br>You have deployed several GS-series virtual machines (VMs) in Microsoft Azure. You plan to deploy Microsoft SQL Server in an Always On Availability Group.<br>You expect to have less than 1 million IO transaction per month.<br>You need to recommend a storage solution for the SQL Servers. The solution must minimize costs.<br>Which storage option should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPremium P10 disk storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPremium P20 disk storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPremium P30 disk storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStandard locally redundant disk storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStandard geo-redundant disk storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStandard zone redundant blob storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStandard locally redundant blob storage",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStandard geo-redundant blob storage"
    ],
    "answer": "A",
    "answerDescription": "Expalantion:<br>P10 has 500 IOPS per disk, which provides for more than 1 million IOPS per month.<br>Note: 3600*30* 500 is 54 million IOPS/month.<br>References: https://azure.microsoft.com/en-us/pricing/details/managed-disks/",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-16T05:36:00.000Z",
        "voteCount": 1,
        "content": "The question also says: Solution must minimize costs. I thought the answer would be -\nE. Standard geo-redundant disk storage"
      },
      {
        "date": "2020-12-01T19:21:00.000Z",
        "voteCount": 1,
        "content": "I think even D, locally redundant disk storage.\n\nThere's no requirement in the question for geo-redundancy and that could be achieved anyway if one of the VMs used in the AG was placed in a different region."
      },
      {
        "date": "2020-09-27T00:31:00.000Z",
        "voteCount": 1,
        "content": "also there is AG, so 1 mln transactions/month will be at least doubled"
      },
      {
        "date": "2020-09-27T00:36:00.000Z",
        "voteCount": 1,
        "content": "sorry, nevermind that comment, please"
      },
      {
        "date": "2020-05-18T04:45:00.000Z",
        "voteCount": 1,
        "content": "It gets even cheaper if the databases are stored in \"Standard locally redundant blob storage\". So G might be right as well."
      },
      {
        "date": "2020-06-24T09:29:00.000Z",
        "voteCount": 1,
        "content": "I think that’s not an option, because the question specifies that these are Azure VM that will be used for SQL Server. So locally redundant would not be applicable."
      },
      {
        "date": "2020-06-24T09:31:00.000Z",
        "voteCount": 1,
        "content": "Nevermind. I guess I misunderstood the locally redundant option."
      },
      {
        "date": "2019-09-08T10:52:00.000Z",
        "voteCount": 2,
        "content": "The answer is good, but not the maths...\nThere is 3600 seconds in an hour and around 30 days in a month, but the formula forgot the 24 hours by day... So there is 3600 * 24 * 30 * 500 that are 1296 millions IO per month"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 42,
    "url": "https://www.examtopics.com/discussions/microsoft/view/4915-exam-70-765-topic-3-question-95-discussion/",
    "body": "You plan to create an AlwaysOn availability group that will have two replicas in Microsoft Azure and two on-premises replicas.<br>You need to configure the network to support the availability group listener.<br>Which cmdlet should you run first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmAvailabilitySet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmLoadBalancer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlDatabaseSecondary",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlElasticPool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmVM",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlServer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlDatabaseCopy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlServerCommunicationLink"
    ],
    "answer": "B",
    "answerDescription": "Expalantion:<br>An availability group listener is a virtual network name that clients connect to for database access. On Azure virtual machines, a load balancer holds the IP address for the listener. The load balancer routes traffic to the instance of SQL Server that is listening on the probe port. Usually, an availability group uses an internal load balancer.<br>References: https://docs.microsoft.com/en-us/azure/virtual-machines/windows/sql/virtual-machines-windows-portal-sql-ps-alwayson-int-listener",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-11T09:38:00.000Z",
        "voteCount": 2,
        "content": "B is the best answer given the choices. \nHere is what should be listed:\nPowershell: New-SqlAvailabilityGroupListener\nAZ CLI: az sql vm group ag-listener create -n &lt;listener name&gt;"
      },
      {
        "date": "2020-09-08T16:43:00.000Z",
        "voteCount": 1,
        "content": "Is correct B\nhttps://docs.microsoft.com/en-us/azure/azure-sql/virtual-machines/windows/availability-group-listener-powershell-configure"
      },
      {
        "date": "2019-10-09T01:36:00.000Z",
        "voteCount": 4,
        "content": "Below comment is wrong. Question is about network not secondary node."
      },
      {
        "date": "2019-09-08T10:56:00.000Z",
        "voteCount": 1,
        "content": "A Load balancer is not the purpose of the question.\nTo install nodes for an Availability Groupe you need the to use the command New-AzureRmSqlDatabaseSecondary"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 43,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2608-exam-70-765-topic-3-question-96-discussion/",
    "body": "You have a Microsoft Azure SQL database in the US West region.<br>You need to create a replica in the US East region.<br>Which cmdlet should you run first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmAvailabilitySet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmLoadBalancer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlDatabaseSecondary",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlElasticPool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmVM",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlServer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlDatabaseCopy",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNew-AzureRmSqlServerCommunicationLink"
    ],
    "answer": "G",
    "answerDescription": "Expalantion:<br>The New-AzureRmSqlDatabaseCopy command creates a copy of a SQL Database that uses the snapshot at the current time.<br>References: https://docs.microsoft.com/en-us/powershell/module/azurerm.sql/new-azurermsqldatabasecopy?view=azurermps-5.1.1",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-18T06:26:00.000Z",
        "voteCount": 5,
        "content": "Answer C:\nThe New-AzureRMSqlDatabaseSecondary cmdlet replaces the Start-AzureSqlDatabaseCopy cmdlet when used for setting up geo-replication for a database.\nIt returns the geo-replication link object from the primary to the secondary database"
      },
      {
        "date": "2020-05-18T06:02:00.000Z",
        "voteCount": 1,
        "content": "The questions does not state that there will be a permanent replication between the two databases so I would prefer G"
      },
      {
        "date": "2020-06-24T13:41:00.000Z",
        "voteCount": 1,
        "content": "In the context of the question, isn’t a replica used specifically for continued replication? Otherwise, they’d have used the term “copy”."
      },
      {
        "date": "2020-10-15T23:26:00.000Z",
        "voteCount": 2,
        "content": "C. New-AzureRmSqlDatabaseSecondary is the right answer"
      },
      {
        "date": "2020-10-08T08:39:00.000Z",
        "voteCount": 1,
        "content": "C is correct. https://docs.microsoft.com/en-us/powershell/module/az.sql/new-azsqldatabasesecondary?view=azps-4.7.0"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 44,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7457-exam-70-765-topic-3-question-97-discussion/",
    "body": "HOTSPOT -<br>You have Microsoft SQL Server on a Microsoft Azure virtual machine. The virtual machine has a database named DB1. DB1 contains a table named Table1 that has 4 billion rows.<br>Users report that a query using Table1 takes longer than expected to execute.<br>You review the execution plan for the query and discover that the expected number of returned rows is one, while the actual number of returned rows is 1 million.<br>You need to reduce the amount of time it takes for the query to execute. The solution must prevent additional performance issues from being introduced.<br>Hot Area:<br><img src=\"/assets/media/exam-media/02202/0015600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0015800001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "When you set the AUTO_CREATE_STATISTICS option on, the Query Optimizer creates statistics on individual columns used in a predicate, if these statistics are not already available. These statistics are necessary to generate the query plan.<br>References: https://www.mssqltips.com/sqlservertip/2766/sql-server-auto-update-and-auto-create-statistics-options/",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-01T20:03:00.000Z",
        "voteCount": 1,
        "content": "Not sure auto update stats is right as it says you must prevent additional performance issues, which can happen if auto update statistics is on because SQL determines if it needs to update the statistics just before it executes the query, and if it decides it does it can take a long time to complete - especially on large tables.\n\nI think disabling parameter sniffing is the best answer here. The query plan could be estimating the wrong number of rows because it is using a cached query plan generated for a different (initial) set of query parameters."
      },
      {
        "date": "2020-09-12T12:26:00.000Z",
        "voteCount": 1,
        "content": "MAXDOP should be modified as well"
      },
      {
        "date": "2019-10-29T13:19:00.000Z",
        "voteCount": 3,
        "content": "set the AUTO_UPDATE_STATISTICS option ON"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 45,
    "url": "https://www.examtopics.com/discussions/microsoft/view/753-exam-70-765-topic-3-question-98-discussion/",
    "body": "You have a database named DB1 that uses simple recovery mode.<br>Full backups of DB1 are taken daily and DB1 is checked for corruption before each backup.<br>There was no corruption when the last backup was complete.<br>You run the sys.columns catalog view and discover corrupt pages.<br>You need to recover the database. The solution must minimize data loss.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun RESTORE DATABASE WITH RECOVERY.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun RESTORE DATABASE WITH PAGE.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun DBCC CHECKDB and specify the REPAIR_ALLOW_DATA_LOSS parameter.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun DBCC CHECKDB and specify the REPAIT_REBUILD parameter."
    ],
    "answer": "B",
    "answerDescription": "Expalantion:<br>A page restore is intended for repairing isolated damaged pages. Restoring and recovering a few individual pages might be faster than a file restore, reducing the amount of data that is offline during a restore operation.<br><br>RESTORE DATABASE WITH PAGE -<br>Restores individual pages. Page restore is available only under the full and bulk-logged recovery models.<br>References: https://docs.microsoft.com/en-us/sql/t-sql/statements/restore-statements-transact-sql",
    "votes": [],
    "comments": [
      {
        "date": "2019-10-29T11:03:00.000Z",
        "voteCount": 6,
        "content": "Answer should be \"D\" . https://docs.microsoft.com/en-us/sql/t-sql/database-console-commands/dbcc-checkdb-transact-sql?view=sql-server-ver15"
      },
      {
        "date": "2021-01-25T11:17:00.000Z",
        "voteCount": 1,
        "content": "Since when do you see corrupt pages within the sys.columns catalog? This question is so wrong ...\nA. restore database with recovery puts a database into a recovered state and is redundant for a full backup restore because it is implied by the full restore;\nB. will not work because of simple rec model\nC. last option ever, all it does is remove corrupt pages\nD. rarely ever fixes corruption\n\nNormally you would go like this: checkdb to see extend of corruption, estimate how much data was added from the last backup, try a checkdb with repair_rebuild in an uncommitted transaction, pray for nothing, do the restore from full backup. :))"
      },
      {
        "date": "2020-10-15T11:54:00.000Z",
        "voteCount": 1,
        "content": "i think, it should be D as well."
      },
      {
        "date": "2020-06-29T10:39:00.000Z",
        "voteCount": 4,
        "content": "I think the answer is restore with recovery. The last backup had no corruption, so it would be most straightforward solution. Since it’s a simple recovery model, I don’t think the transaction log would be used for recovery anyway. It doesn’t appear that Microsoft recommends repair options, unless the backups are also corrupt."
      },
      {
        "date": "2020-10-08T08:44:00.000Z",
        "voteCount": 1,
        "content": "That is why D option is correct as it does not cause data loss."
      },
      {
        "date": "2021-01-21T07:45:00.000Z",
        "voteCount": 1,
        "content": "I agree with this.  If the database is in simple backup the Admin is accepting that there may be data loss in the event of a recovery.  Microsoft recommends using DBCC repair/rebuild only if backups are corrupted as well."
      },
      {
        "date": "2020-02-13T03:01:00.000Z",
        "voteCount": 2,
        "content": "hi, page restore really does not work with simple rec. model.. and in general all you read is - restore bevore repair! --&gt; so, why not with recovery (which only means --&gt; put in useable state..)"
      },
      {
        "date": "2019-10-29T11:05:00.000Z",
        "voteCount": 1,
        "content": "Using REPAIR_ALLOW_DATA_LOSS parameter. there is a possibility of losing more data"
      },
      {
        "date": "2019-03-28T10:00:00.000Z",
        "voteCount": 2,
        "content": "if page restore is only available under full or bulk logged recovery and this database is set to simple, how is this the correct answer?"
      },
      {
        "date": "2019-09-08T11:15:00.000Z",
        "voteCount": 2,
        "content": "Since REPAIR_REBUILD does not lead to data loss it could be the prefered option. But it also could be inefficient.\nThe RESTORE full database operation will works in any case but also can leads to data loss, so it should be use in case of REPAIR is not enough"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 46,
    "url": "https://www.examtopics.com/discussions/microsoft/view/1231-exam-70-765-topic-3-question-99-discussion/",
    "body": "You have a database named DB1.<br>You discover that DB1 is corrupt.<br>You run DBCC CHECKDB and receive an error message within a few seconds. No pages are listed in the error message.<br>You need to repair the database corruption as quickly as possible. The solution must minimize data loss.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun DBCC CHECKDB (‘db1’, REPAIR_ALLOW_DATA_LOSS).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun DBCC CHECKDB (‘db1’, REPAIR_FAST).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tDelete the transaction logs and restart the Microsoft SQL Server instance.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun DBCC CHECKDB (‘db1’, REPAIR_REBUILD).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRestore the database from a backup."
    ],
    "answer": "C",
    "answerDescription": "Expalantion:<br><br>REPAIR_REBUILD -<br>Performs repairs that have no possibility of data loss. This can include quick repairs, such as repairing missing rows in non-clustered indexes, and more time- consuming repairs, such as rebuilding an index.<br>Incorrect Answers:<br>A: The REPAIR_ALLOW_DATA_LOSS option is a supported feature but it may not always be the best option for bringing a database to a physically consistent state. If successful, the REPAIR_ALLOW_DATA_LOSS option may result in some data loss. In fact, it may result in more data lost than if a user were to restore the database from the last known good backup.<br><br>B: REPAIR_FAST -<br>Maintains syntax for backward compatibility only. No repair actions are performed.<br>E: Restoring from backup is not the fastest solution.<br>References: https://docs.microsoft.com/en-us/sql/t-sql/database-console-commands/dbcc-checkdb-transact-sql",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-18T06:53:00.000Z",
        "voteCount": 6,
        "content": "If DBCC command finishes after a couple of seconds then DBCC command itself runs into an error and no repair is possible. Therefore,  \"Restore from Backup\" is the only possible solution."
      },
      {
        "date": "2021-01-17T12:15:00.000Z",
        "voteCount": 1,
        "content": "Unbelievable, and I bought access for 365 days in this test, lol.\nThe answer is clearly D, because it does not inform if it has a backup, and even if it does, the time is not known due to the size of the base (which it does not inform in the question)"
      },
      {
        "date": "2020-12-01T20:15:00.000Z",
        "voteCount": 1,
        "content": "I pretty sure the answer is E, restore from backup, official line is you're only supposed to use DBCC Repairs as a last resort when you *don't* have a backup.\n\nhttps://docs.microsoft.com/en-us/sql/t-sql/database-console-commands/dbcc-checkdb-transact-sql?view=sql-server-ver15#resolving-errors"
      },
      {
        "date": "2020-11-18T08:42:00.000Z",
        "voteCount": 2,
        "content": "I believe its D. \n\nREPAIR_REBUILD\nPerforms repairs that have no possibility of data loss. This can include quick repairs, such as repairing missing rows in non-clustered indexes, and more time \nconsuming repairs, such as rebuilding an index."
      },
      {
        "date": "2020-11-06T22:24:00.000Z",
        "voteCount": 2,
        "content": "Resolving Errors\nIf any errors are reported by DBCC CHECKDB, we recommend restoring the database from the database backup instead of running REPAIR with one of the REPAIR options. \n\nhttps://docs.microsoft.com/en-us/sql/t-sql/database-console-commands/dbcc-checkdb-transact-sql?view=sql-server-ver15"
      },
      {
        "date": "2020-04-12T06:13:00.000Z",
        "voteCount": 1,
        "content": "I don't understand why answer C is chosen instead of D?"
      },
      {
        "date": "2019-05-09T14:33:00.000Z",
        "voteCount": 3,
        "content": "Really?"
      },
      {
        "date": "2019-09-08T11:20:00.000Z",
        "voteCount": 6,
        "content": "Woaw.\nSuch an ugly option xD\n\nI guess since with REPAIR_FAST no repair actions are performed (according to msdn doc), the only solution is REPAIR_REBUILD"
      },
      {
        "date": "2020-06-29T10:42:00.000Z",
        "voteCount": 1,
        "content": "There’s no way C is correct"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 47,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20857-exam-70-765-topic-3-question-100-discussion/",
    "body": "You manage an on-premises Microsoft SQL server that has a database named DB1.<br>An application named App1 retrieves customer information for DB1.<br>Users report that App1 takes an unacceptably long time to retrieve customer records.<br>You need to find queries that take longer than 400 ms to run.<br>Which statement should you execute?<br><img src=\"/assets/media/exam-media/02202/0016100001.png\" class=\"in-exam-image\"><br>A.<br><img src=\"/assets/media/exam-media/02202/0016100002.png\" class=\"in-exam-image\"><br>B.<br><img src=\"/assets/media/exam-media/02202/0016200001.png\" class=\"in-exam-image\"><br>C.<br><img src=\"/assets/media/exam-media/02202/0016200002.png\" class=\"in-exam-image\"><br>D.<br>",
    "options": [],
    "answer": "B",
    "answerDescription": "Total_worker_time: Total amount of CPU time, reported in microseconds (but only accurate to milliseconds), that was consumed by executions of this plan since it was compiled.<br>Incorrect Answers:<br>A: Qs.max_worker_time: Maximum CPU time, reported in microseconds (but only accurate to milliseconds), that this plan has ever consumed during a single execution.<br>References: https://docs.microsoft.com/en-us/sql/relational-databases/system-dynamic-management-views/sys-dm-exec-query-stats-transact-sql",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-18T07:03:00.000Z",
        "voteCount": 9,
        "content": "A ist correct. We need to find queries which run longer than 400 ms in a single execution, not in total. As the runtime does not need to be 100% CPU \"elapsed_time\" needs to be queried."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 48,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20866-exam-70-765-topic-3-question-103-discussion/",
    "body": "You have an on-premises Microsoft SQL server that has a database named DB1. DB1 contains several tables that are stretched to Microsoft Azure.<br>From SQL Server Management Studio (SSMS), a junior database administrator accidentally deletes several rows from the Azure SQL database and breaks the connection to Azure.<br>You need to resume Stretch Database operations.<br>Which two stored procedures should you use? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.sp_rda_reconcile_batch",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.sp_rda_reconcile_indexes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.sp_rda_reauthorize_db",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.sp_rda_reconcile_columns",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.sp_rda_set_rpo_duration"
    ],
    "answer": "CD",
    "answerDescription": "sys.sp_rda_reauthorize_db restores the authenticated connection between a local database enabled for Stretch and the remote database.<br>If you have accidentally deleted columns from the remote table, run sp_rda_reconcile_columns to add columns to the remote table that exist in the Stretch-enabled<br>SQL Server table but not in the remote table.<br>Incorrect Answers:<br>A: sys.sp_rda_reconcile_batch reconciles the batch ID stored in the Stretch-enabled SQL Server table with the batch ID stored in the remote Azure table.<br>Typically you only have to run sp_rda_reconcile_batch if you have manually deleted the most recently migrated data from the remote table. When you manually delete remote data that includes the most recent batch, the batch IDs are out of sync and migration stops.<br>References:<br>https://docs.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sys-sp-rda-reconcile-batch-transact-sql https://docs.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/sys-sp-rda-reauthorize-db-transact-sql",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-18T07:31:00.000Z",
        "voteCount": 8,
        "content": "D is wrong: \"When sp_rda_reconcile_columns recreates columns that you accidentally deleted from the remote table, it does not restore the data that was previously in the deleted columns.\" We have to restore deleted rows and not columns. The Azure-Database has to be restored from a previous snapshot and the migration has to be synced with the stretch-enabled DB. Therefore, A (use sys.sp_rda_reconcile_batch) is correct instead of D."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 49,
    "url": "https://www.examtopics.com/discussions/microsoft/view/32946-exam-70-765-topic-3-question-104-discussion/",
    "body": "You plan to deploy Microsoft SQL Server on a Microsoft Azure Virtual machine. The virtual machine will have a 30-TB database and will have 10 1-TB VHDs for the database.<br>You need to configure the storage to meet the following requirements:<br>✑ Evenly distribute read and write operations across the VHDs.<br>✑ Minimize the read and write time.<br>Which storage configuration should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta parity storage pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta simple storage pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta mirrored storage pool",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta striped volume",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\ta RAID-5 volume"
    ],
    "answer": "D",
    "answerDescription": "Expalantion:<br>Data that is written to a striped volume is interleaved to all disks at the same time instead of sequentially. Therefore, disk performance is the fastest on a RAID 0 volume as compared to any other type of disk configuration.<br>Reference: https://support.microsoft.com/en-us/help/323433/how-to-establish-a-striped-volume-raid-0-in-windows-server-2003",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-27T02:45:00.000Z",
        "voteCount": 1,
        "content": "I think the answer is B"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 50,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20867-exam-70-765-topic-3-question-105-discussion/",
    "body": "You have a database named DB1 that contains a table named Table1. Table1 has 1 billion rows.<br>You import 10 million rows of data into Table1.<br>After the import, users report that queries take longer than usual to execute.<br>You need to identify whether an out-of-date execution plan is causing the performance issue.<br>Which dynamic management view should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.dm_xtp_transaction_stats",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.dm_exec_input_buffer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.dm_db_index_operational_stats",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tsys.dm_db_stats_properties"
    ],
    "answer": "C",
    "answerDescription": "Expalantion:<br>sys.dm_db_index_operational_stats dynamic management function provides us the current low-level I/O, locking, latching, and access method for each partition of the table. This information is really useful to troubleshoot SQL Server performance issues.<br>Reference: https://basitaalishan.com/2013/03/19/using-sys-dm_db_index_operational_stats-to-analyse-how-indexes-are-utilised/",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-18T07:40:00.000Z",
        "voteCount": 5,
        "content": "Answer D (sys.dm_db_stats_properties) is better to find out if execution plan is built on current information, e.g. statistics."
      },
      {
        "date": "2020-06-29T12:45:00.000Z",
        "voteCount": 1,
        "content": "Agreed. stats_properties gives specific information relevant to the statistics being current or out of date by showing the last_updated information."
      },
      {
        "date": "2021-01-01T05:48:00.000Z",
        "voteCount": 1,
        "content": "You can use sys.dm_db_index_operational_stats to track the length of time that users must wait to read or write to a table, index, or partition, and identify the tables or indexes that are encountering significant I/O activity or hot spots.\nhttps://docs.microsoft.com/en-us/sql/relational-databases/system-dynamic-management-views/sys-dm-db-index-operational-stats-transact-sql?view=sql-server-ver15"
      },
      {
        "date": "2021-01-26T00:56:00.000Z",
        "voteCount": 1,
        "content": "True, but that dm is used to check, as you said, bottlenecks for I/O activity while the question mentions out-of-date exec plans... answer for this has to be sys.dm_db_stats_properties."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 51,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2620-exam-70-765-topic-3-question-106-discussion/",
    "body": "DRAG DROP -<br>You have database that contains a 400-GB table that is read-only.<br>You need to enable the Stretch Database feature.<br>How should you complete the statement? To answer, drag the appropriate values to the correct targets. Each value may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>NOTE: Each correct selection is worth one point.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0016900001.png\" class=\"in-exam-image\">",
    "answerDescription": "To configure an existing table for Stretch Database, run the ALTER TABLE command.<br>Here's an example that migrates the entire table and begins data migration immediately.<br>USE &lt;Stretch-enabled database name&gt;;<br><br>GO -<br>ALTER TABLE &lt;table name&gt;<br>SET ( REMOTE_DATA_ARCHIVE = ON ( MIGRATION_STATE = OUTBOUND ) ) ;<br><br>GO -<br>References: https://docs.microsoft.com/en-us/sql/sql-server/stretch-database/enable-stretch-database-for-a-table",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-18T16:58:00.000Z",
        "voteCount": 8,
        "content": "Answer: \nALTER TABLE table1 SET (REMOTE_DATA_ARCHIVE = ON (FILTER_PREDEICATE = dbo.fn_stretchpredicate(order_date), MIGRATION_STATE=\nOUTBOUND ))"
      },
      {
        "date": "2021-01-01T05:50:00.000Z",
        "voteCount": 3,
        "content": "1.REMOTE_DATA_ARCHIVE\n2.OUTBOUND"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 52,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18259-exam-70-765-topic-3-question-110-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this sections, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You are tuning the performance of a virtual machines that hosts a Microsoft SQL Server instance.<br>The virtual machine originally had four CPU cores and now has 32 CPU cores.<br>The SQL Server instance uses the default settings and has an OLTP database named db1. The largest table in db1 is a key value store table named table1.<br>Several reports use the PIVOT statement and access more than 100 million rows in table1.<br>You discover that when the reports run, there are PAGELATCH_IO waits on PFS pages 2:1:1, 2:2:1, 2:3:1, and 2:4:1 within the tempdb database.<br>You need to prevent the PAGELATCH_IO waits from occurring.<br>Solution: You add more tempdb databases.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "From SQL Servers perspective, you can measure the I/O latency from sys.dm_os_wait_stats. If you consistently see high waiting for PAGELATCH_IO, you can benefit from a faster I/O subsystem for SQL Server.<br>A cause can be poor design of your database - you may wish to split out data located on 'hot pages', which are accessed frequently and which you might identify as the causes of your latch contention. For example, if you have a currency table with a data page containing 100 rows, of which 1 is updated per transaction and you have a transaction rate of 200/sec, you could see page latch queues of 100 or more. If each page latch wait costs just 5ms before clearing, this represents a full half-second delay for each update. In this case, splitting out the currency rows into different tables might prove more performant (if less normalized and logically structured).<br>References: https://www.mssqltips.com/sqlservertip/3088/explanation-of-sql-server-io-and-latches/",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-11T23:36:00.000Z",
        "voteCount": 6,
        "content": "I just reread the question. It is not possible to add more tempdb DATABASES. If this is the solution, then of course the answer is B. If it is FILES, then this would reduce the pagelatch_IO issues."
      },
      {
        "date": "2020-06-30T08:42:00.000Z",
        "voteCount": 2,
        "content": "Agree,  more tempdb files might help. \nhttps://support.microsoft.com/en-us/help/2154845/recommendations-to-reduce-allocation-contention-in-sql-server-tempdb-d"
      },
      {
        "date": "2020-10-08T19:59:00.000Z",
        "voteCount": 2,
        "content": "well, you can only have one tempdb. so B"
      },
      {
        "date": "2020-09-27T03:18:00.000Z",
        "voteCount": 2,
        "content": "if place additional tempdb file on a new drive I would choose A, but the question doesnt say that, so I think I rather choose B"
      },
      {
        "date": "2020-04-12T01:52:00.000Z",
        "voteCount": 3,
        "content": "Going with B, I don't see any PAGELATCH_UP. to fix this issue would be to upgrade th disksubsystem.\n\"page IO latch waits indicate slow IO response times; page latch update waits indicate incorrect file layout.\" https://docs.microsoft.com/en-us/sql/relational-databases/system-dynamic-management-views/sys-dm-os-wait-stats-transact-sql?view=sql-server-2017"
      },
      {
        "date": "2020-04-11T23:24:00.000Z",
        "voteCount": 1,
        "content": "Answer is A \"originally had four CPUs\" , now has 32. PAGELATCH_IO waits on PFS pages show only 4 entries.... They are screaming that there are only max 4 files for tempdb. Increase to 8 and monitor, increasing by multiples of 4. https://support.microsoft.com/en-us/help/2154845/recommendations-to-reduce-allocation-contention-in-sql-server-tempdb-d"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 53,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18260-exam-70-765-topic-3-question-111-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this sections, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You are tuning the performance of a virtual machines that hosts a Microsoft SQL Server instance.<br>The virtual machine originally had four CPU cores and now has 32 CPU cores.<br>The SQL Server instance uses the default settings and has an OLTP database named db1. The largest table in db1 is a key value store table named table1.<br>Several reports use the PIVOT statement and access more than 100 million rows in table1.<br>You discover that when the reports run, there are PAGELATCH_IO waits on PFS pages 2:1:1, 2:2:1, 2:3:1, and 2:4:1 within the tempdb database.<br>You need to prevent the PAGELATCH_IO waits from occurring.<br>Solution: You add more files to db1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "From SQL Servers perspective, you can measure the I/O latency from sys.dm_os_wait_stats. If you consistently see high waiting for PAGELATCH_IO, you can benefit from a faster I/O subsystem for SQL Server.<br>A cause can be poor design of your database - you may wish to split out data located on 'hot pages', which are accessed frequently and which you might identify as the causes of your latch contention. For example, if you have a currency table with a data page containing 100 rows, of which 1 is updated per transaction and you have a transaction rate of 200/sec, you could see page latch queues of 100 or more. If each page latch wait costs just 5ms before clearing, this represents a full half-second delay for each update. In this case, splitting out the currency rows into different tables might prove more performant (if less normalized and logically structured).<br>References: https://www.mssqltips.com/sqlservertip/3088/explanation-of-sql-server-io-and-latches/",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-11T23:32:00.000Z",
        "voteCount": 3,
        "content": "Answer is B. the solution does not specify striping those new files across different drive. Additionally it specfically states the waits are \"within the tempdb database.\" https://docs.microsoft.com/en-us/sql/relational-databases/databases/database-files-and-filegroups?view=sql-server-ver15"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 54,
    "url": "https://www.examtopics.com/discussions/microsoft/view/24455-exam-70-765-topic-3-question-112-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this sections, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You are migrating an on-premises Microsoft SQL Server instance to SQL Server on a Microsoft Azure virtual machine. The instance has 30 databased that consume a total of 2 TB of disk space. The instance sustains more than 30,000 transactions per second.<br>You need to provision storage for the virtual machine. The storage must be able to support the same load as the on-premises deployment.<br>Solution: You create one storage account that has 30 containers. You create a VHD in each container.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "B",
    "answerDescription": "Expalantion:<br>Each Storage Account handles up to 20.000 IOPS, and 500TB of data.<br>References: https://www.tech-coffee.net/understand-microsoft-azure-storage-for-virtual-machines/",
    "votes": [],
    "comments": [
      {
        "date": "2020-06-30T08:56:00.000Z",
        "voteCount": 1,
        "content": "It's interesting that the question doesn't specify premium or standard storage. I think one premium storage account could handle this. https://docs.microsoft.com/en-us/azure/virtual-machines/windows/disk-scalability-targets"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 55,
    "url": "https://www.examtopics.com/discussions/microsoft/view/18354-exam-70-765-topic-3-question-115-discussion/",
    "body": "DRAG DROP -<br><br>Background -<br>You manage the Microsoft SQL Server environment for a company that manufactures and sells automobile parts.<br>The environment includes the following servers: SRV1 and SRV2. SRV1 has 16 logical cores and hosts a SQL Server instance that supports a mission-critical application. The application has approximately 30,000 concurrent users and relies heavily on the use of temporary tables.<br>The environment also includes the following databases: DB1, DB2, and Reporting. The Reporting database is protected with Transparent Data Encryption (TDE).<br>You plan to migrate this database to a new server. You detach the database and copy it to the new server.<br>You are performing tuning on a SQL Server database instance. The application which uses the database was written using an object relationship mapping (ORM) tool which maps tables as objects within the application code. There are 30 stored procedures that are regularly used by the application.<br>After reviewing the plan cache you have identified that a large number of simple queries are using parallelism, and that execution plans are not being kept in the plan cache for very long.<br>You review the properties of the instance (Click the Exhibit button).<br>Exhibit:<br><img src=\"/assets/media/exam-media/02202/0017800001.jpg\" class=\"in-exam-image\"><br>You need to restore the Reporting database to SRV2. What should you do? To answer, drag the appropriate options to the correct locations. Each option may be used once, more than once, or not at all. You may need to drag the split bar between panes or scroll to view content.<br>Select and Place:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0017900001.png\" class=\"in-exam-image\">",
    "answerDescription": "Step 2: Create: server certificate<br>Recreate the server certificate by using the original server certificate backup file.<br>Note: The password must be the same as the password that was used when the backup was created.<br>Step 3: Restore: Reporting database .mdf file.<br>-- Attach the database that is being moved.<br>-- The path of the database files must be the location where you have stored the database files.<br>Example:<br>CREATE DATABASE [CustRecords] ON<br>( FILENAME = N'C:\\Program Files\\Microsoft SQL Server\\MSSQL13.MSSQLSERVER\\MSSQL\\DATA\\CustRecords.mdf' ),<br>( FILENAME = N'C:\\Program Files\\Microsoft SQL Server\\MSSQL13.MSSQLSERVER\\MSSQL\\DATA\\CustRecords_log.LDF' )<br>FOR ATTACH ;<br><br>GO -<br>From scenario: The Reporting database is protected with Transparent Data Encryption (TDE). You plan to migrate this database to a new server. You detach the database and copy it to the new server.<br>References: https://docs.microsoft.com/en-us/sql/relational-databases/security/encryption/move-a-tde-protected-database-to-another-sql-server",
    "votes": [],
    "comments": [
      {
        "date": "2020-04-13T10:06:00.000Z",
        "voteCount": 7,
        "content": "I think the drag and drop is missing something.\n1.  Copy the backup file and the private key file to the server where you are going to restore the Transparent data encryption (TDE) enabled database backup.\n2, Check if you have a master key on the master database already, create one if you do not have it.\n3. Once the master key is created, restore the certificate using backup file and the private key. \n4. Restore the database. \nhttps://www.sqlshack.com/restoring-transparent-data-encryption-tde-enabled-databases-on-a-different-server/"
      },
      {
        "date": "2020-06-30T09:24:00.000Z",
        "voteCount": 3,
        "content": "Earlier on in the question, it states you've already copied the backup. I think the drag and drop is just skipping the initial steps, since the question mentions the process has already started."
      },
      {
        "date": "2020-09-27T08:24:00.000Z",
        "voteCount": 1,
        "content": "2 create SMK from backup (TDE use SMK - https://docs.microsoft.com/ru-ru/sql/relational-databases/security/encryption/transparent-data-encryption?view=sql-server-ver15)\n3 restore the database"
      },
      {
        "date": "2020-11-06T23:42:00.000Z",
        "voteCount": 3,
        "content": "2 - SMK\n3 - Server Certificate\n4 - Atttach DB\n\nGive this page a read: https://docs.microsoft.com/en-us/sql/relational-databases/security/encryption/move-a-tde-protected-database-to-another-sql-server?view=sql-server-ver15\n\n.... Create a database master key on the destination instance of SQL Server. \nRecreate the server certificate by using the original server certificate backup file.\nIn Object Explorer in SQL Server Management Studio, right-click the Databases folder and select Attach...."
      },
      {
        "date": "2020-11-27T21:42:00.000Z",
        "voteCount": 3,
        "content": "oops, sorry guys, should be like this:\n2 - master DB key\n3 - Certificate\n\nSMK is being created automatically when the instance started the first time (more global thing)"
      },
      {
        "date": "2021-01-26T01:59:00.000Z",
        "voteCount": 1,
        "content": "I agree with you here.\n1. copy certificate and private key\n2. create DMK (database master key)\n3. restore certificate (aka create certificate from file)\n4. attach database (it was specified in the text that \"You plan to migrate this database to a new server. You detach the database and copy it to the new server.\")"
      },
      {
        "date": "2021-01-26T01:55:00.000Z",
        "voteCount": 1,
        "content": "so, according to the questions and your answers, it should be:\n1. copy the certificate [...]\n2. create SMK from backup (TDE uses DEK, not SMK ;) )\n3. restore the database\n4. attach the Reporting database"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 56,
    "url": "https://www.examtopics.com/discussions/microsoft/view/30954-exam-70-765-topic-3-question-116-discussion/",
    "body": "HOTSPOT -<br><br>Background -<br>You manage the Microsoft SQL Server environment for a company that manufactures and sells automobile parts.<br>The environment includes the following servers: SRV1 and SRV2. SRV1 has 16 logical cores and hosts a SQL Server instance that supports a mission-critical application. The application has approximately 30,000 concurrent users and relies heavily on the use of temporary tables.<br>The environment also includes the following databases: DB1, DB2, and Reporting. The Reporting database is protected with Transparent Data Encryption (TDE).<br>You plan to migrate this database to a new server. You detach the database and copy it to the new server.<br>You are performing tuning on a SQL Server database instance. The application which uses the database was written using an object relationship mapping (ORM) tool which maps tables as objects within the application code. There are 30 stored procedures that are regularly used by the application.<br>After reviewing the plan cache you have identified that a large number of simple queries are using parallelism, and that execution plans are not being kept in the plan cache for very long.<br>You review the properties of the instance (Click the Exhibit button).<br>Exhibit:<br><img src=\"/assets/media/exam-media/02202/0018200001.jpg\" class=\"in-exam-image\"><br>You need to set the size of the log files for the tempdb database on SRV1.<br>How should you complete the Transact-SQL statement? To answer, select the appropriate Transact-SQL segments in the answer area.<br>Hot Area:<br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/02202/0018300001.png\" class=\"in-exam-image\">",
    "answerDescription": "Expalantion:<br>The ALTER DATABASE with MODIFY FILE command can make a file size bigger (but not smaller).<br>Example:<br>ALTER DATABASE AdventureWorks2012<br><br>MODIFY FILE -<br>(NAME = test1dat3,<br>SIZE = 200MB);<br><br>Note: MODIFY FILE -<br>Specifies the file that should be modified. Only one &lt;filespec&gt; property can be changed at a time. NAME must always be specified in the &lt;filespec&gt; to identify the file to be modified. If SIZE is specified, the new size must be larger than the current file size.<br>References: https://docs.microsoft.com/en-us/sql/relational-databases/security/encryption/move-a-tde-protected-database-to-another-sql-server",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-09T13:47:00.000Z",
        "voteCount": 2,
        "content": "The ALTER DATABASE with MODIFY FILE command"
      },
      {
        "date": "2020-12-11T16:56:00.000Z",
        "voteCount": 1,
        "content": "ALTER DATABASE [tempdb] MODIFY FILE ( NAME = N'templog', SIZE = xxxxxxKB )"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 57,
    "url": "https://www.examtopics.com/discussions/microsoft/view/31341-exam-70-765-topic-3-question-118-discussion/",
    "body": "You are the database administrator for your company. Your company has one main office and two branch offices. You plan to create three databases named DB1,<br>DB2, and DB3 that will be hosted on one Azure SQL Database server. You have the following requirements:<br>✑ The main office must be able to connect to all three databases.<br>✑ The branch offices must be able to connect to DB2 and DB3.<br>✑ The branch offices must not be able to access DB1.<br>You need to configure transparent data encryption (TDE) for DB1. Which two actions should you perform? Each correct answer presents part of the solution.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun CREATE CERTIFICATE certl WITH Subject = TDE Cert1 on DB1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConnect to DB1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun ALTER DATABASE DB1 SET ENCRYPTION ON;.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConnect to the master database.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun CREATE MASTER KEY on the master database."
    ],
    "answer": "BC",
    "answerDescription": "You should connect to DB1. To encrypt DB1, you connect directly to DB1. When you connect to DB1.<br>You use your dbmanager or administrative credentials.<br>You should run ALTER DATABASE DB1 SET ENCRYPTION ON.<br>You use the ALTER DATABASE DB1 SET ENCRYPTION ON statement to encrypt the database. This is the statement that turns on TDE for Azure SQL<br>Database.<br>Incorrect Answers:<br>A: You should not run CREATE CERTIFICATE certl WITH Subject = TDE Cert' on DB1.  You do not need to create a certificate to encrypt an Azure SQL database.  This would be a part of the solution when you encrypt an on-premises database. You should not connect to the master database.  To encrypt DB1, you need to connect directly to DB1. not to the master database.<br>E: You should not run CREATE MASTER KEY on the master database.<br>You would execute CREATE MASTER KEY when you have to encrypt an on-premises database.<br>References: https://docs.microsoft.com/en-us/sql/relational-databases/security/encryption/transparent-data-encryption",
    "votes": [],
    "comments": [
      {
        "date": "2020-09-15T08:23:00.000Z",
        "voteCount": 7,
        "content": "Enable TDE on SQL Database by Using Transact-SQL\n\nConnect to the master database\nALTER DATABASE DBname  SET ENCRYPTION ON ;\n\nhttps://www.sqlshack.com/configure-tde-database-alwayson-using-azure-key-vault-sql-server-2016/"
      },
      {
        "date": "2020-11-06T23:57:00.000Z",
        "voteCount": 1,
        "content": "You're creating a Master Key in master DB but then you need to connect (USE) to the DB you want the TDE encryption to be enabled on"
      },
      {
        "date": "2020-11-29T23:10:00.000Z",
        "voteCount": 1,
        "content": "Sorry, I was wrong, jolsca is right."
      },
      {
        "date": "2020-12-11T20:13:00.000Z",
        "voteCount": 1,
        "content": "Tested\nAfter running below query against Azure SQL database , then checked in Azure, the encryption status is 'Encrypted'\n\nuse master\nAlter database DatabaseName set encryption on"
      },
      {
        "date": "2021-01-01T06:36:00.000Z",
        "voteCount": 1,
        "content": "1.Connet to the master database\n2.Run ALTER DATABASE DB1 SET ENCRYPTION ON"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 58,
    "url": "https://www.examtopics.com/discussions/microsoft/view/20916-exam-70-765-topic-3-question-122-discussion/",
    "body": "You are designing a Windows Azure SQL Database for an order fulfillment system.  You create a table named Sales.Orders with the following script.<br><img src=\"/assets/media/exam-media/02202/0018900001.png\" class=\"in-exam-image\"><br>Each order is tracked by using one of the following statuses:<br>✑ Fulfilled<br>✑ Shipped<br>✑ Ordered<br><br>Received -<br><img src=\"/assets/media/exam-media/02202/0018900005.png\" class=\"in-exam-image\"><br>You need to design the database to ensure that that you can retrieve the following information:<br>✑ The current status of an order<br>✑ The previous status of an order.<br>✑ The date when the status changed.<br>✑ The solution must minimize storage.<br>More than one answer choice may achieve the goal. Select the BEST answer.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTo the Sales.Orders table, add three columns named Status, PreviousStatus and ChangeDate.  Update rows as the order status changes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new table named Sales.OrderStatus that contains three columns named OrderID,  StatusDate, and Status. Insert new rows into the table as the order status changes.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImplement change data capture on the Sales.Orders table.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTo the Sales.Orders table, add three columns named FulfilledDate, ShippedDate, and ReceivedDate.  Update the value of each column from null to the"
    ],
    "answer": "A",
    "answerDescription": "Expalantion:<br>This stores only the minimal information required.<br>Incorrect Answers:<br>B: We do not need to keep the complete history.",
    "votes": [],
    "comments": [
      {
        "date": "2020-05-19T01:43:00.000Z",
        "voteCount": 5,
        "content": "Correct is B.\nWe need to keep history, because we need to know when status has changed and also previous status of an order."
      },
      {
        "date": "2020-05-28T12:13:00.000Z",
        "voteCount": 6,
        "content": "I was wrong, option A is enough and doesnt take too much space. So it's A."
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  },
  {
    "topic": 3,
    "index": 59,
    "url": "https://www.examtopics.com/discussions/microsoft/view/2627-exam-70-765-topic-3-question-124-discussion/",
    "body": "You are the administrator for a SQL Server 2016 instance that stores the data for an online transaction processing sales system. The company takes full backups every week; differential backups on the days with no full backups; and hourly transaction backups.<br>These backups are stored on a backup server in the company's data center.<br>Every week, the company places the full backup on a tape and sends it to a third-party backup storage system.<br>The company is worried that a disaster might occur that could destroy their computer center and cause them to lose orders.<br>You need to determine the best method for providing the smallest amount of data loss and downtime without leasing or purchasing additional physical locations.<br>What should you do? More than one answer choice may achieve the goal. Select the BEST answer.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet up SQL Server Always On with a SQL Azure database as a replica.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet up SQL Server Always On by using a SQL Server on a Windows Azure Virtual Machine.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPut the differential backup on tape and send it to the third-party backup storage system.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUse the Microsoft SQL Server Backup to Microsoft Windows Azure Tool to direct all backups to a different geographical location."
    ],
    "answer": "D",
    "answerDescription": "Expalantion:<br>Microsoft SQL Server Backup to Microsoft Azure Tool enables backup to Azure Blob Storage and encrypts and compresses SQL Server backups stored locally or in the cloud.<br>References: https://www.microsoft.com/en-us/download/details.aspx?id=40740",
    "votes": [],
    "comments": [
      {
        "date": "2019-07-19T02:34:00.000Z",
        "voteCount": 7,
        "content": "D may not be the best answer because the question request the smallest amount of downtime . Restore the database will take a long time.\n\nB. Set up SQL Server Always On by using a SQL Server on a Windows Azure Virtual Machine\nshould be the right answer because it can take tasks if the primary server down.\n\nAnswer A is incorrect because we must have a Azure SQL server to replicate databases.  \nAnswer C is incorrect because the question requests not to use physical location."
      },
      {
        "date": "2020-05-19T19:13:00.000Z",
        "voteCount": 3,
        "content": "I think C is the best option, as the question says solution should be \"without leasing or purchasing additional physical locations\". The full backups are already being sent to the existing location, by sending differentials too will reduce the time to recover if the data center goes down"
      },
      {
        "date": "2020-11-07T00:19:00.000Z",
        "voteCount": 1,
        "content": "They are already doing this... and want to get rid of it"
      }
    ],
    "examNameCode": "70-765",
    "topicNumber": "3"
  }
]