[
  {
    "topic": 4,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7761-exam-md-100-topic-4-question-1-discussion/",
    "body": "You have an Azure Active Directory (Azure AD) tenant that contains a user named user1@contoso.com.<br>You have a computer named Computer1 that runs Windows 10.<br>You join Computer1 to Azure AD. You enable Remote Desktop on Computer1.<br>User1@contoso.com attempts to connect to Computer1 by using Remote Desktop and receives the following error message: `The logon attempt failed.`<br>You need to ensure that the user can connect to Computer1 by using Remote Desktop.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn Azure AD, assign user1@contoso.com the Cloud device administrator role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the local Group Policy, modify the Allow log on through Remote Desktop Services user right.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn Azure AD, assign user1@contoso.com the Security administrator role.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, create a local user and add the new user to the Remote Desktop Users group."
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/allow-log-on-through-remote-desktop-services",
    "votes": [
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": false
      },
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2019-12-11T12:38:00.000Z",
        "voteCount": 12,
        "content": "B is correct"
      },
      {
        "date": "2020-05-08T06:08:00.000Z",
        "voteCount": 3,
        "content": "You can't add Azure AD accounts to local group policy"
      },
      {
        "date": "2022-08-14T13:35:00.000Z",
        "voteCount": 4,
        "content": "you can !\nlike this:\ncantoso.com\\user1@cantoso.com"
      },
      {
        "date": "2022-12-15T12:35:00.000Z",
        "voteCount": 1,
        "content": "Starting with Windows 10 version 20H2, you can use Azure AD groups to manage administrator privileges on Azure AD joined devices with the Local Users and Groups MDM policy. This policy allows you to assign individual users or Azure AD groups to the local administrators group on an Azure AD joined device, providing you the granularity to configure distinct administrators for different groups of devices.\nSource: https://learn.microsoft.com/en-us/azure/active-directory/devices/assign-local-admin"
      },
      {
        "date": "2022-12-15T13:08:00.000Z",
        "voteCount": 1,
        "content": "Here's the proof you can add and azure AD user.\n\nnet localgroup \"Remote Desktop Users\" /add \"AzureAD\\the-UPN-attribute-of-your-user\"\n\nSource: https://learn.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc"
      },
      {
        "date": "2023-07-08T10:20:00.000Z",
        "voteCount": 1,
        "content": "Yes you can . I actualy done it today in my job. But computer must be also in domain."
      },
      {
        "date": "2020-10-08T04:44:00.000Z",
        "voteCount": 8,
        "content": "I agree that the answer is D. \n\nIn the link suggested by the moderator (https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/allow-log-on-through-remote-desktop-services) in the Counter Measure section near the bottom it actually states \"For domain controllers, assign the Allow log on through Remote Desktop Services user right only to the Administrators group. For other server roles and devices, add the Remote Desktop Users group.\" Which is the exact explaination of the differences between B and D"
      },
      {
        "date": "2020-11-02T08:37:00.000Z",
        "voteCount": 1,
        "content": "Adding to the above, I've had time to test this on a normal domain, I don't have an AzureAD to use. The only time I can reproduce the error explained is if you enter credentials that aren't recognised, this could only be because the Azure User account isn't recognised on the Computer1 (I'm probably wrong on that but it's the answer I came to)\n\nI created two GPOs one to add a Standard User into the RDP group for a domain computer. The other to enable \"Allow log on through Remote Desktop Services\". The only time I was able to login using RDP was when the first GPO was present, it made no difference if the second GPO was active or not. So, I'm sticking with D. \n\nAzureAD may work differently with RDP settings, but I don't know, so I can only work with what I've seen."
      },
      {
        "date": "2023-07-03T11:32:00.000Z",
        "voteCount": 1,
        "content": "B. From the local Group Policy, modify the Allow log on through Remote Desktop Services user right.\n\nExplanation:\nBy modifying the local Group Policy on Computer1 and adding user1@contoso.com to the \"Allow log on through Remote Desktop Services\" user right, you grant the user the necessary permission to connect to Computer1 using Remote Desktop. This allows the user to establish a Remote Desktop session to the computer.\n\nOption D, creating a local user account and adding it to the Remote Desktop Users group, is not the most appropriate solution in an Azure AD joined scenario. While it could potentially work, modifying the Group Policy is the recommended method to manage Remote Desktop access permissions on Windows 10 computers joined to Azure AD."
      },
      {
        "date": "2023-06-20T02:48:00.000Z",
        "voteCount": 2,
        "content": "Deez nuts"
      },
      {
        "date": "2023-05-02T13:55:00.000Z",
        "voteCount": 1,
        "content": "B cannot be correct you can not add an AzureAD user to a policy. However you can add an AzureAD account to the Remote Desktop Groups, which should be the preffered method see https://learn.microsoft.com/en-us/windows/client-management/client-tools/connect-to-remote-aadj-pc#add-users-to-remote-desktop-users-group\n\nThis should be the correct answer for D instead of creating an additional account. If I get this question on my exam against my will I'll go for D..."
      },
      {
        "date": "2023-02-23T04:25:00.000Z",
        "voteCount": 1,
        "content": "CHATGPT\ngroup.\n\nExplanation:\nBy default, Azure AD users do not have the necessary permissions to log on to a Windows 10 computer using Remote Desktop. To enable remote desktop access for a user in Azure AD, you must first create a local user account on the Windows 10 computer and add that user to the Remote Desktop Users group."
      },
      {
        "date": "2023-02-23T04:25:00.000Z",
        "voteCount": 1,
        "content": "D. On Computer1, create a local user and add the new user to the Remote Desktop Users group."
      },
      {
        "date": "2022-03-18T00:42:00.000Z",
        "voteCount": 1,
        "content": "I would go with D. I can't assume that the user has been added to the remote desktop group because the question does not state this. Therefore the first thing I would do is to add the user to the RD group. My next step would be to then modify the user right to allow remote desktop login through local group policy.\nI tried so hard to find some type of material to back this up but failed greatly. I simply can't assume the user has already been added.. can someone PLEASE give a solid answer. Article included perhaps? This is killing me."
      },
      {
        "date": "2022-01-19T13:59:00.000Z",
        "voteCount": 3,
        "content": "The answer is correct. Allow log on through Remote Desktop Services user right is assigned to Administrators and Remote Desktop Users group by Default.\n\"To use Remote Desktop Services to successfully log on to a remote device, the user or group must be a member of the Remote Desktop Users or Administrators group and be granted the Allow log on through Remote Desktop Services right.\" (https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/allow-log-on-through-remote-desktop-services).\nIf you open gpedit.msc and go to Computer Configuration -&gt; Windows Settings -&gt; Security Settings -&gt; Local Policies -&gt; User Rights Assignment, you can add user or group directly in that policy. In this case you would add cantoso.com/user1@cantoso.com (domain/username)"
      },
      {
        "date": "2021-12-26T17:10:00.000Z",
        "voteCount": 2,
        "content": "B is correct, it ok to add an Azure AD account to Allow log on through Remote Desktop Services user right from local group policy as I tested."
      },
      {
        "date": "2021-10-05T04:35:00.000Z",
        "voteCount": 1,
        "content": "Added a user to \"Allow log...\" and in the RDP allowed users it does not show up.\nAdded same user to RD users group and in the RDP allowed users it does show up.\nAccording to this, the answer is D."
      },
      {
        "date": "2022-08-14T13:31:00.000Z",
        "voteCount": 1,
        "content": "cantoso.com/user1@cantoso.com"
      },
      {
        "date": "2021-08-29T07:38:00.000Z",
        "voteCount": 2,
        "content": "What would be the final answer and justification?"
      },
      {
        "date": "2021-05-03T11:51:00.000Z",
        "voteCount": 5,
        "content": "Answer is D : User1 didn't join the computer1 to Azure AD . 'You' did it. Si User1 is not a member of admin Group (rights given if he joined the computer to Azure AD). SO you have to add his Account to Remote Desktop user manually to allow him to use RDP."
      },
      {
        "date": "2021-04-04T09:29:00.000Z",
        "voteCount": 2,
        "content": "Since D is the closest to net localgroup \"Remote Desktop Users\" /add \"AzureAD\\the-UPN-attribute-of-your-user\", that would be my choice."
      },
      {
        "date": "2021-03-20T23:25:00.000Z",
        "voteCount": 3,
        "content": "None of these answers seem right, the user needs to be a member of the RD users group and it doesnt say if they are or not, adding a local user makes no sense. Modifying the log on through Remote Desktop Services shouldnt be needed either, that could mess things up for ADmins and RD users and I see no need to modify it anyway. Anyone got any more news on how this question is answered?"
      },
      {
        "date": "2021-01-31T07:22:00.000Z",
        "voteCount": 1,
        "content": "It's written that \"You join Computer1 to Azure AD. You enable Remote Desktop on Computer1\" meaning that 1. it's not user1 who join the computer but \"you\" and 2. that Remote Desktop has been enabled.\nFor it to work, the RDP user must have rights. You do that by adding him to the Remote Desktop Users group (D). You MUST NOT \"modify the Allow log on through Remote Desktop Services user right\" since it contains already administrators and the Remote Desktop User group.\nYou also do not have to create a new user (typo in the answer D) because the user is already created in AzureAD (first sentence). So you only have to add it to the group. Something like : net localgroup \"Remote Desktop Users\" /add \"AzureAD\\user1@contoso.com\".\nIt worked for me in a test lab. But I could not find any way to do the same using graphical tools like Computer Manager / groups...\nSo the best (not the good) answer is \"D\" for me."
      },
      {
        "date": "2021-02-03T05:12:00.000Z",
        "voteCount": 1,
        "content": "It says RD has been enabled. It says nothing about which users are on the allowed list. By default, only Admins and RD Users group can do this. So, since we do not know what group User1 is in (sorta implies User1 did not join the computer to AAD, this user would need to be added) so they would need to be added so I think it is B."
      },
      {
        "date": "2020-12-19T22:25:00.000Z",
        "voteCount": 1,
        "content": "B is correct as you can simply modify the Local group policy to add the user and allow RDP on the machine for the user."
      },
      {
        "date": "2020-12-14T05:07:00.000Z",
        "voteCount": 1,
        "content": "B is the answer."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34021-exam-md-100-topic-4-question-2-discussion/",
    "body": "DRAG DROP -<br>You enable Windows PowerShell remoting on a computer that runs Windows 10.<br>You need to limit which PowerShell cmdlets can be used in a remote session.<br>Which three actions should you perform in sequence? To answer, move the appropriate actions from the list of actions to the answer area and arrange them in the correct order.<br>Select and Place:<br><img src=\"/assets/media/exam-media/04292/0029700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0029700002.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://www.petri.com/powershell-remoting-restricting-user-commands",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-08T09:25:00.000Z",
        "voteCount": 27,
        "content": "New-PSSessionConfigurationfile Cmdlets\nRun the Register-PSSessionconfiguration cmdlets\nRn the Enter-PSSession comdlets"
      },
      {
        "date": "2021-12-05T04:25:00.000Z",
        "voteCount": 1,
        "content": "Dat is jammer"
      },
      {
        "date": "2021-12-07T12:49:00.000Z",
        "voteCount": 1,
        "content": "Waarom?"
      },
      {
        "date": "2022-04-05T10:32:00.000Z",
        "voteCount": 2,
        "content": "Omdat alles in het Engels is. Stel dat Nederlands de wereldtaal was. Start RamenKrachtSchelp, Nieuwe-KrachtSessieConfiguratieBestand. Betreedt-KrachtSessie."
      },
      {
        "date": "2022-04-10T02:47:00.000Z",
        "voteCount": 4,
        "content": "ik heb een braadworst"
      },
      {
        "date": "2020-11-25T19:29:00.000Z",
        "voteCount": 23,
        "content": "Notes :\n1.Create a new configuration file.  (New-PSSessionConfigurationfile)\n2. Register the configuration. (Register-PSSessionconfiguration )\n3. Create a new session that uses the configuration.(Enter-PSSession)"
      },
      {
        "date": "2021-12-19T04:44:00.000Z",
        "voteCount": 5,
        "content": "Why Enter-PSSession instead of New-PSSession ?"
      },
      {
        "date": "2023-03-25T08:13:00.000Z",
        "voteCount": 1,
        "content": "Chat-GPT says\n\n    Create a new session configuration file:\n        Use the New-PSSessionConfigurationFile cmdlet to create a new session configuration file, which is a XML file that contains the settings for the session configuration.\n\n    Edit the session configuration file to limit the cmdlets:\n        Use a text editor to open the configuration file created in the previous step.\n        In the &lt;CmdletsToRestrict&gt; section of the file, add the names of the cmdlets that you want to restrict in the remote session.\n\n    Register the new session configuration:\n        Use the Register-PSSessionConfiguration cmdlet to register the new session configuration on the remote computer.\n        Specify the name of the new configuration file using the -FilePath parameter.\n        Specify a name for the new session configuration using the -Name parameter.\n\nAfter performing these three actions, you can then use the new session configuration when creating new PowerShell remote sessions by specifying the -ConfigurationName parameter with the name you specified in step 3."
      },
      {
        "date": "2022-09-27T17:52:00.000Z",
        "voteCount": 2,
        "content": "New-PSSessionConfiguration\nRegister-PSSessionConfiguration -\nNew-PSSession\nhttps://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/new-pssessionconfigurationfile?view=powershell-7.2&amp;viewFallbackFrom=powershell-7.1"
      },
      {
        "date": "2021-05-15T19:28:00.000Z",
        "voteCount": 2,
        "content": "I don't think you need to run  Enter-PSSession or New-PSSession, you would use Enter-PSSession from another PC to test the settings. New-PSSession is to create connections that can be used and reused an a script it's not relevant"
      },
      {
        "date": "2021-04-04T09:37:00.000Z",
        "voteCount": 2,
        "content": "Correct - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/new-pssessionconfigurationfile?view=powershell-7.1"
      },
      {
        "date": "2020-10-08T04:51:00.000Z",
        "voteCount": 9,
        "content": "I don't believe the last step is New-PSSession but Enter-PSSession\n\nhttps://petri.com/powershell-remoting-restricting-user-commands"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37354-exam-md-100-topic-4-question-3-discussion/",
    "body": "You have a VPN server that accepts PPTP and L2TP connections and is configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0029800001.jpg\" class=\"in-exam-image\"><br>A user named User1 has a computer that runs Windows 10 and has a VPN connection configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0029900001.jpg\" class=\"in-exam-image\"><br>User1 fails to establish a VPN connection when connected to a home network.<br>You need to identify which VPN client setting must be modified.<br>What should you identify?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServerAddress",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTunnelType",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAuthenticationMethod",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tL2tpIPsecAuth",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEncryptionLevel"
    ],
    "answer": "A",
    "answerDescription": "The server address is a private IP address.  This needs to be the public IP address of the VPN server.",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-23T08:38:00.000Z",
        "voteCount": 5,
        "content": "A is the correct answer"
      },
      {
        "date": "2021-02-08T19:21:00.000Z",
        "voteCount": 2,
        "content": "So is A the correct answer?"
      },
      {
        "date": "2020-11-19T18:30:00.000Z",
        "voteCount": 3,
        "content": "192. is private"
      },
      {
        "date": "2021-01-03T13:08:00.000Z",
        "voteCount": 5,
        "content": "192 isnt but 192.168.x.x is priavte."
      },
      {
        "date": "2021-01-03T13:08:00.000Z",
        "voteCount": 2,
        "content": "private*"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/36233-exam-md-100-topic-4-question-4-discussion/",
    "body": "HOTSPOT -<br>You have a computer named Computer1 that runs Windows 10.<br>On Computer1, you create a VPN connection as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0030000001.jpg\" class=\"in-exam-image\"><br>The corporate network contains a single IP subnet.<br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0030100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0030100002.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-03T22:02:00.000Z",
        "voteCount": 16,
        "content": "VPN1 Protocols\n1.Answer has to be revolve around what Tunnels support Mschapv2 authentication methods\nTunnelling is automatic but the choice of using PAP, CHAP, or MSCHAPv2 applies only to PPTP, L2TP/IPsec, and SSTP tunnels; IKEv2 tunnels can only use EAP-MSCHAPv2 or certificates from my research.\nMicrosoft PPTP VPN is using a weak algorithm (MS-CHAP v2)\nL2TP decides between PAP, CHAP, or MS-CHAPv2 authentication for users.\nSSTP accepts MSchapV2 on Microsoft win 10 vpns.\nOption 1 and 2 appear to be correct, therefore I would choose all 4 protocols but I cannot find anything to suggest that Microsoft vpns on win 10 machines can use Mschapv2 for an iEKv2 tunnel\nAccept option 4 (all protocols)\n\n2.Only traffic for the corporate network\nSplit-tunnelling is true. Corporate network goes through the vpn and internet access is routed from the local host."
      },
      {
        "date": "2020-12-07T15:27:00.000Z",
        "voteCount": 4,
        "content": "Additionally on another sites sample  questions :\nThe TunnelType parameter is set to Automatic. The Automatic option means that the device will try each of the built-in tunneling protocols until one succeeds. It will attempt from most secure to least secure.\nI would accept all 4 protocols for part 1."
      },
      {
        "date": "2021-01-31T08:07:00.000Z",
        "voteCount": 2,
        "content": "IKE-V2 requires EAP with MSCHAPv2. So only PPTP-L2TP/IPSEC-SSTP. From my lab:\n....\nAuthenticationMethod : {EAP}\n....\n+ref: https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/ff687731(v=ws.10)"
      },
      {
        "date": "2021-01-31T08:10:00.000Z",
        "voteCount": 1,
        "content": "But there is only answer 1 and 2 without IKEv2. So I don't know here. You obviously cannot choose 3 or 4, and choosing 1 or 2 is wrong since all 3 protocols would work."
      },
      {
        "date": "2021-03-19T07:38:00.000Z",
        "voteCount": 1,
        "content": "See mllerena's comment"
      },
      {
        "date": "2020-11-11T13:00:00.000Z",
        "voteCount": 9,
        "content": "Disagree with first answer since Tunnel Type is set to: Automatic – this should allow the host as being able to support all protocols for connection since the connection protocol was not predefined.\nSecond answer is correct since the split tunnel: true means VPN traffic is split to the remote network (remote files, remote printers, RDP, etc.) while internet traffic will remain routed through the local host (opposite of full tunnel where all traffic tunnels through the remote connection, including internet)"
      },
      {
        "date": "2021-01-12T18:12:00.000Z",
        "voteCount": 1,
        "content": "Opposite would be false since its boolean\nhttps://docs.microsoft.com/en-us/powershell/module/vpnclient/set-vpnconnection?view=win10-ps"
      },
      {
        "date": "2022-07-11T18:56:00.000Z",
        "voteCount": 1,
        "content": "all are supported:\nhttps://docs.microsoft.com/en-us/windows/security/identity-protection/vpn/vpn-connection-type"
      },
      {
        "date": "2022-07-08T21:45:00.000Z",
        "voteCount": 1,
        "content": "The Automatic option means that the device will try each of the built-in tunneling protocols until one succeeds. It will attempt from most secure to least secure"
      },
      {
        "date": "2022-07-08T15:17:00.000Z",
        "voteCount": 1,
        "content": "I just tested this on Win10 v1809. Here are my results:\nAll tunnel types (PPTP, L2TP with Machine Cert, L2TP with Pre-Shared Key, SSTP, IKEv2, and Auto) ALL support EAP. They also all support MS-CHAPv2, EXCEPT IKEv2 does NOT support it. Incidentally, you can only select MS-CHAPv2 if the user authentication type (\"Type of sign-in info\") is set to \"User name and password\".\n\nSo IKEv2 is the only one that does NOT support MS-CHAPv2."
      },
      {
        "date": "2022-07-08T15:20:00.000Z",
        "voteCount": 1,
        "content": "This question must be older because you CAN choose MsChapv2 for PPTP, both types of L2TP, and SSTP in Win10 v1809."
      },
      {
        "date": "2021-08-29T07:53:00.000Z",
        "voteCount": 2,
        "content": "What would be the final answer and justification?"
      },
      {
        "date": "2021-05-03T12:25:00.000Z",
        "voteCount": 4,
        "content": "Q1 : All Protocol tested (from best to  least secure : IKev2 - L2TP - SSPT -PPTP) because on Automatic (https://docs.microsoft.com/fr-fr/windows/security/identity-protection/vpn/vpn-connection-type)\nQ2  :Only intranet traffic"
      },
      {
        "date": "2021-02-11T07:39:00.000Z",
        "voteCount": 8,
        "content": "SSTP-&gt; SSL Certifcate\nIKE-V2 -&gt; Certificate \nBox 1 PPTP, L2TP/IPsec"
      },
      {
        "date": "2021-02-03T05:41:00.000Z",
        "voteCount": 2,
        "content": "I suspect they are going for all four since TunnelType it is set to Automatic (vs a specific tunnel type)\nhttps://docs.microsoft.com/en-us/powershell/module/vpnclient/add-vpnconnection?view=win10-ps"
      },
      {
        "date": "2020-11-06T02:13:00.000Z",
        "voteCount": 6,
        "content": "can someone explain how to find the answer on this one?"
      },
      {
        "date": "2020-11-11T09:24:00.000Z",
        "voteCount": 3,
        "content": "I believe you look at the previous question. That question specifies the answer for this question on the first line. Bit of a shame that they don't mention this is a multipart question (unless I'm also missing something)"
      },
      {
        "date": "2022-04-14T04:48:00.000Z",
        "voteCount": 1,
        "content": "Looks like different connections. Q4-3 says conn. Name is 'Contoso VPN' and SplitTunneling is False.  This question (4-4) says Name 'VPN1' and SplitTunneling is True."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43632-exam-md-100-topic-4-question-5-discussion/",
    "body": "You have an Azure Active Directory (Azure AD) tenant named contoso.com that contains a user named UserA.<br>You have two computers named Computer1 and Computer2 that run Windows 10 and are joined to contoso.com.<br>You need to ensure that UserA can connect to Computer2 from Computer1 by using Remote Desktop.<br>Which three actions should you perform? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, modify the registry.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer2, modify the registry.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, modify the properties of UserA.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, enable Remote Desktop.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer2, modify the properties of UserA.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer 2, enable Remote Desktop.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"G\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tG.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer2, add the Everyone group to the Remote Desktop Users group.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"H\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tH.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, add the Everyone group to the Remote Desktop Users group."
    ],
    "answer": "EFG",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc",
    "votes": [
      {
        "answer": "AFG",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-01-31T08:27:00.000Z",
        "voteCount": 17,
        "content": "F+G is all you have to do in order to have it work (tested OK).\nThat eliminates D+H.\nYou cannot modify properties of an user account on ComputerX since the account is in AzureAD. This eliminates C+E.\nSo to get a third action, lets take A. That would be a viable alternate option to enable RD. ( HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server. In the right pane, double-click the DWORD fDenyTSConnections and change its value from 1 to 0). That eliminates B.\nSo A+F+G for me."
      },
      {
        "date": "2021-03-24T08:37:00.000Z",
        "voteCount": 6,
        "content": "AFG is right!\nEnsure Remote Credential Guard, a new feature in Windows 10, version 1607, is turned off on the client PC you are using to connect to the remote PC.\n\nhttps://docs.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc"
      },
      {
        "date": "2021-09-14T07:14:00.000Z",
        "voteCount": 2,
        "content": "This could be it, but I'm not yet sure. Your source does say that Credential Guard needs to be disabled, but it doesn't state if it's enabled by default. Credential Guard can be enabled/disabled through a registry key and GPO.\n\nAs far as I could find, Windows Defender Credential Guard is part of the Virtualization-based security features. I've checked my AzureAD joined work laptop and this is enabled there. But again, I can't find if this is enabled by default.\n\nIf the question doesn't mention a specific feature or setting, we can only assume the default. So if anyone can confirm the Virtualization-based Security features and/or Credential Guard are enabled by default for AzureAD joined Windows 10 devices, I'd say AFG could be the right answer.\n\nI do agree that E doesn't make sense. You can't edit the properties of a domain user locally on a computer. I'd understand it if they had ment to add the userA to the Remote Desktop users group, but this is covered by G."
      },
      {
        "date": "2022-03-09T05:44:00.000Z",
        "voteCount": 1,
        "content": "Also can view this document\nhttps://docs.microsoft.com/en-us/windows/security/identity-protection/remote-credential-guard"
      },
      {
        "date": "2022-04-06T11:02:00.000Z",
        "voteCount": 1,
        "content": "Why would you change fDenyTSConnections on ComputerA? I'm sure you mean ComputerB. You change this for the computer you need to connect to (destination)."
      },
      {
        "date": "2022-07-08T15:58:00.000Z",
        "voteCount": 1,
        "content": "The choice A registry setting would be to disable Remote Credential Guard, not enable RDP, which you're already doing with choice F."
      },
      {
        "date": "2022-07-08T15:54:00.000Z",
        "voteCount": 1,
        "content": "No, you disable Remote Credential Guard on the CLIENT, not the server:\n\"Ensure Remote Credential Guard, a new feature in Windows 10, version 1607, is turned off on the client PC you're using to connect to the remote PC.\"\nSeems counterintuitive, but there you have it.\n\n- https://docs.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc"
      },
      {
        "date": "2021-01-31T08:30:00.000Z",
        "voteCount": 7,
        "content": "Sorry (typo), B not A! You enable RD on Computer 2.\nSO B+F+G."
      },
      {
        "date": "2021-02-17T03:36:00.000Z",
        "voteCount": 3,
        "content": "Agreed with BFG.\n\nFor B, maybe another idea, could be related to Remote Credential Guard: https://docs.microsoft.com/en-gb/windows/security/identity-protection/remote-credential-guard :\n\n1. Open Registry Editor on the remote host.\n2. Enable Restricted Admin and Windows Defender Remote Credential Guard:\n- Go to HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Lsa.\n- Add a new DWORD value named DisableRestrictedAdmin.\n- To turn on Restricted Admin and Windows Defender Remote Credential Guard, set the value of this registry setting to 0 to turn on Windows Defender Remote Credential Guard."
      },
      {
        "date": "2021-05-27T17:50:00.000Z",
        "voteCount": 1,
        "content": "If the registry key was mentioned in the answer, I would totally agree with you, but it simply says modify the registry. But what registry? So if I add a registry key called Fred Flintstones, would that help? The problem is that the other options are all wrong, so we are left with BFG only hoping that Microsoft intends what you wrote above"
      },
      {
        "date": "2023-07-11T12:54:00.000Z",
        "voteCount": 1,
        "content": "AFG coorect"
      },
      {
        "date": "2023-03-30T12:11:00.000Z",
        "voteCount": 1,
        "content": "I go for AFG"
      },
      {
        "date": "2023-03-25T08:22:00.000Z",
        "voteCount": 1,
        "content": "Chat-GPT\n\nThe three actions that you should perform to enable UserA to connect to Computer2 from Computer1 using Remote Desktop are:\n\n    On Computer2, enable Remote Desktop (F).\n    On Computer2, add UserA to the Remote Desktop Users group or modify the properties of UserA to allow Remote Desktop connections (E).\n    On Computer1, connect to Computer2 using Remote Desktop after entering the appropriate credentials (either UserA's credentials or the credentials of an account that is a member of the Remote Desktop Users group on Computer2).\n\nTherefore, the correct options are F, E, and the appropriate credentials to connect. There is no need to modify the registry or add the Everyone group to the Remote Desktop Users group on either Computer1 or Computer2."
      },
      {
        "date": "2023-02-23T04:30:00.000Z",
        "voteCount": 1,
        "content": "CHATGPT:\nB. On Computer2, modify the registry.\nD. On Computer1, enable Remote Desktop.\nF. On Computer2, enable Remote Desktop."
      },
      {
        "date": "2022-02-04T01:13:00.000Z",
        "voteCount": 2,
        "content": "I don't get G. I couldn't find anywhere in Microsoft documentation anything about adding Everyone to the Remote Desktop Group. If I'm remote connecting only UserA why open the doors to Everyone? Can someone reply to me with a link to this information?"
      },
      {
        "date": "2022-01-24T13:57:00.000Z",
        "voteCount": 2,
        "content": "Could be AFG or BFG.\n\nCase for AFG is when you need to turn off remote credential guard on the source computer:\nhttps://docs.microsoft.com/en-us/windows/security/identity-protection/remote-credential-guard#enable-windows-defender-remote-credential-guard\n\nCase for BFG is when you need to enable Network Level Authentication (NLA):\nhttps://www.kapilarya.com/how-to-configure-network-level-authentication-for-remote-desktop-connections-windows-10\n\nRemote Credential Guard is enabled by default but should be turned off, making the first case a necessity.\nNLA however is enabled by default and can easily be toggled from the GUI instead of through the registry.\n\nSo I believe the correct answer is AFG"
      },
      {
        "date": "2022-01-19T21:30:00.000Z",
        "voteCount": 2,
        "content": "I originally said BFG but now I'm doing EFG\nafter reviewing the link mentioned by others:\nhttps://docs.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc\nand I quote from it:\n\nIf the user who joined the PC to Azure AD is the only one who is going to connect remotely, no additional configuration is needed. To allow additional users or groups to connect to the PC, you must allow remote connections for the specified users or groups. Users can be added either manually or through MDM policies:\n\n    Adding users manually\n\n    You can specify individual Azure AD accounts for remote connections by running the following PowerShell cmdlet:\n\nyou are not the one connecting to the remote computer in this case.  UserA is.\ntherefore you would need to modify the user settings on computer2."
      },
      {
        "date": "2021-11-07T06:49:00.000Z",
        "voteCount": 3,
        "content": "AFG would be right. You need to disable the remote credential guard on the client pc."
      },
      {
        "date": "2021-08-29T08:10:00.000Z",
        "voteCount": 2,
        "content": "What would be the final answer and justification?"
      },
      {
        "date": "2021-08-27T00:44:00.000Z",
        "voteCount": 1,
        "content": "B+F+G But the question or the solutions are very stupid."
      },
      {
        "date": "2021-05-07T00:42:00.000Z",
        "voteCount": 2,
        "content": "B+F+G\n\nSet up\n- Both PCs (local and remote) must be running Windows 10, version 1607 or later. Remote connections to an Azure AD-joined PC running earlier versions of Windows 10 are not supported.\n- Your local PC (where you are connecting from) must be either Azure AD-joined or Hybrid Azure AD-joined if using Windows 10, version 1607 and above, or Azure AD registered if using Windows 10, version 2004 and above. Remote connections to an Azure AD-joined PC from an unjoined device or a non-Windows 10 device are not supported.\n-The local PC and remote PC must be in the same Azure AD tenant. Azure AD B2B guests are not supported for Remote desktop.\n-Ensure Remote Credential Guard, a new feature in Windows 10, version 1607, is turned off on the client PC you are using to connect to the remote PC.\n\nhttps://docs.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc\n\nhttps://docs.microsoft.com/en-us/windows/security/identity-protection/remote-credential-guard"
      },
      {
        "date": "2021-05-01T15:18:00.000Z",
        "voteCount": 1,
        "content": "great!"
      },
      {
        "date": "2021-04-04T10:04:00.000Z",
        "voteCount": 3,
        "content": "B+F+G."
      },
      {
        "date": "2021-03-21T00:36:00.000Z",
        "voteCount": 2,
        "content": "I dont see any need to modify a registry, only F and G seem required, this question doesnt make any sense"
      },
      {
        "date": "2021-03-24T08:38:00.000Z",
        "voteCount": 3,
        "content": "AFG is right!\nEnsure Remote Credential Guard, a new feature in Windows 10, version 1607, is turned off on the client PC you are using to connect to the remote PC.\n\nhttps://docs.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc\nI had issue with RDP connection at work some time ago... It was Remote Credential Guard..."
      },
      {
        "date": "2021-03-18T07:09:00.000Z",
        "voteCount": 3,
        "content": "the right answer is AFG"
      },
      {
        "date": "2021-03-18T07:08:00.000Z",
        "voteCount": 4,
        "content": "ok check the link added on the question :https://docs.microsoft.com/en-us/windows/client-management/connect-to-remote-aadj-pc\n1. disable remote credential guard on source pc, that be down by registry\n2.activate RDP on the destination pc\n3. add user to remote desktop user group"
      },
      {
        "date": "2021-03-22T06:01:00.000Z",
        "voteCount": 2,
        "content": "I think B-F-G is the right one (we're facing AADJ computers)\nFrom the referenced article -&gt; On the PC you want to connect to:\nOpen system properties for the remote PC.\nEnable Allow remote connections to this computer and select Allow connections only from computers running Remote Desktop with Network Level Authentication."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/43946-exam-md-100-topic-4-question-6-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain. The domain contains a computer named Computer1 that runs Windows 10.<br>You need to ensure that Computer1 will respond to ping requests.<br>How should you configure Windows Defender Firewall on Computer1? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0030300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0030400001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-03T13:23:00.000Z",
        "voteCount": 21,
        "content": "If only all questions are this easy! haha"
      },
      {
        "date": "2023-05-03T10:27:00.000Z",
        "voteCount": 1,
        "content": "It's ICMPv4 and not IGMP. Note the G instead of C\nIGMP is a protocol used by hosts to communicate with multicast routers in order to join or leave multicast groups on a network. It is used to manage multicast traffic on a network, which is traffic that is sent to a group of hosts rather than just one specific destination host."
      },
      {
        "date": "2022-10-14T17:07:00.000Z",
        "voteCount": 1,
        "content": "It's a little confusing, I know.\n\nOnce and for all, imagine flabezerra and examtopics. flabezerra wants to ping examtopics.\n\nflabezerra will send packets and receive response.\n\nFrom this perspective, examtopics was able to RESPOND to flabezerra’s REQUEST because of examtopics own firewall configuration INBOUND Rule &gt; File and Printer Sharing (Echo Request - ICMPv4-IN).\n\nNow replace the statement: examtopics needs to ensure that they will RESPOND to ping REQUESTS.\n\nRegardless of the default setting for inbound rule for ICMPv4, you need to create, you need to ensure, a rule as the question statement. And the rule to be created must be inbound."
      },
      {
        "date": "2022-10-13T14:53:00.000Z",
        "voteCount": 1,
        "content": "Regras de entrada\nQuando você instala o sistema operacional Windows pela primeira vez, o Windows Defender Firewall bloqueia todo o tráfego de entrada não solicitado. Para permitir um certo tipo de tráfego de entrada não solicitado, você deve criar uma regra de entrada que descreva esse tráfego. \n\nRegras de saída\nO Windows Defender Firewall permite todo o tráfego de saída, a menos que uma regra o bloqueie. As regras de saída permitem ou negam explicitamente o tráfego originário de um computador que corresponda aos critérios de uma regra.\n\n\nhttps://learn.microsoft.com/pt-br/training/modules/explore-microsoft-defender/6-explain-windows-defender-firewall-advanced-security"
      },
      {
        "date": "2021-10-11T06:02:00.000Z",
        "voteCount": 3,
        "content": "ICMP Inbound is the correct answer! :)"
      },
      {
        "date": "2021-11-17T09:04:00.000Z",
        "voteCount": 1,
        "content": "Is It ICMPV$ or ICMP ?"
      },
      {
        "date": "2022-02-08T02:02:00.000Z",
        "voteCount": 1,
        "content": "There is only one ICMP and that is v4. The other is IGMP which isnt correct"
      },
      {
        "date": "2021-02-24T13:07:00.000Z",
        "voteCount": 3,
        "content": "I first thought its outbound role to response to ping requests but i was wrong. Given ans is correct. See here - https://kb.iu.edu/d/aopy or https://www.howtogeek.com/howto/windows-vista/allow-pings-icmp-echo-request-through-your-windows-vista-firewall/"
      },
      {
        "date": "2021-03-03T17:35:00.000Z",
        "voteCount": 2,
        "content": "You are not alone!"
      },
      {
        "date": "2021-03-24T12:27:00.000Z",
        "voteCount": 2,
        "content": "ICMP is always open for outbound traffic, if you specially didn't close it."
      },
      {
        "date": "2021-11-17T09:05:00.000Z",
        "voteCount": 1,
        "content": "Is it icmpv4 or icmp ?"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35271-exam-md-100-topic-4-question-7-discussion/",
    "body": "HOTSPOT -<br>You have a computer named Computer1 that runs Windows 10. Computer1 has an IP address of 10.10.1.200 and a subnet mask of 255.255.255.0.<br>You configure the proxy settings on Computer1 as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0030500001.png\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0030600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0030600002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://www.howtogeek.com/tips/how-to-set-your-proxy-settings-in-windows-8.1/",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-26T19:29:00.000Z",
        "voteCount": 8,
        "content": "I believe that \"bypass the proxy for all applications\" should read \"bypass the proxy for all browsers.\" Then the answer makes sense."
      },
      {
        "date": "2020-10-29T09:08:00.000Z",
        "voteCount": 19,
        "content": "There are tons of Applications that need to access the internet, but when you're using a proxy their traffic will be directed across the proxy too. So, no, it's not 'all browsers'. The answer is fine as it is."
      },
      {
        "date": "2020-12-26T09:22:00.000Z",
        "voteCount": 7,
        "content": "sass forum"
      },
      {
        "date": "2021-03-07T06:51:00.000Z",
        "voteCount": 2,
        "content": "There're tons of apps that DOES NOT respect this proxy setting. You should try cmd.exe and see if the traffic gets through the proxy."
      },
      {
        "date": "2022-07-08T16:36:00.000Z",
        "voteCount": 1,
        "content": "Of course cmd.exe will not use a proxy for things like ICMP and DNS lookups. However, cmd.exe DOES respect the proxy IF you make a request to the port that the proxy is configured to use. I just tried it on my Win10 v1809 machine. I set the proxy to my home router (default gateway) IP port 80. I then added *.neverssl.com to the exceptions. I then opened a command prompt and entered: telnet neverssl.com 80, then pressed Enter. The command prompt remained blank as the webserver expected a GET request. I then typed GET / and pressed Enter. The command prompt window displayed the HTML for the home page."
      },
      {
        "date": "2022-07-08T16:51:00.000Z",
        "voteCount": 1,
        "content": "On the other hand, nmap definitely went around the proxy unless I used the --proxies option."
      },
      {
        "date": "2021-08-29T08:13:00.000Z",
        "voteCount": 4,
        "content": "What would be the final answer and justification?"
      },
      {
        "date": "2021-06-06T09:36:00.000Z",
        "voteCount": 1,
        "content": "Could you please explain why store.microsoft.com will be bypass in the second question ?"
      },
      {
        "date": "2021-06-12T12:03:00.000Z",
        "voteCount": 5,
        "content": "*.microsoft.com will be bypassed. See the provided info"
      },
      {
        "date": "2021-04-28T07:07:00.000Z",
        "voteCount": 4,
        "content": "Second question might also be confusing. The setting 'Don't use the proxy server for local (intranet) addresses' is ticked, but it is NOT https://10.10.0.100 because the network on the computer is set to IP: 10.10.1.200 with a subnet mask 255.255.255.0. Only traffic to 10.10.1.x will be bypassed"
      },
      {
        "date": "2021-05-27T17:57:00.000Z",
        "voteCount": 1,
        "content": "There is an option: DON'T USE PROXY SERVER FOR LOCAL INTRANET, and https://10.10.0.100 is a local intranet, so proxy bypass"
      },
      {
        "date": "2021-07-27T08:47:00.000Z",
        "voteCount": 2,
        "content": "As Lairyy pointed out, the local intranet address is 10.10.1.x , (Mask of 255.255.255.0). So 10.10.0.100 is NOT on the local Intranet. (10.10.0.x and 10.10.0.x are different networks.)"
      },
      {
        "date": "2021-07-27T06:58:00.000Z",
        "voteCount": 5,
        "content": "Look at the information more closely, lairyy is correct. 10.10.1.xxx subnet is \"local\". 10.10.0.xxx must go through a gateway and a router and so is subject to the proxy rule."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33416-exam-md-100-topic-4-question-8-discussion/",
    "body": "You have a computer that is configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0030700001.png\" class=\"in-exam-image\"><br>What can the computer connect to?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tall the local computers and the remote computers within your corporate network only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tall the local computers and the remote computers, including Internet hosts",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tonly other computers on the same network segment that have automatic private IP addressing (APIPA)\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tonly other computers on the same network segment that have an address from a class A network ID"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-10-02T01:36:00.000Z",
        "voteCount": 25,
        "content": "This should be C."
      },
      {
        "date": "2020-10-04T12:02:00.000Z",
        "voteCount": 17,
        "content": "Yes C, 169.x.x.x is an automated APIPA adress."
      },
      {
        "date": "2022-08-17T07:50:00.000Z",
        "voteCount": 2,
        "content": "the address 169.x.x.x. is an apipa address"
      },
      {
        "date": "2022-07-08T17:03:00.000Z",
        "voteCount": 2,
        "content": "Yes it's C. There is no default gateway listed for either IPv4 or IPv6 (there's also no IPv6 global address). One could expand on C and say \"any other node on the same segment that either uses IPv6 or has an IPv4 APIPA address\"."
      },
      {
        "date": "2022-06-25T04:19:00.000Z",
        "voteCount": 2,
        "content": "apipa all the way"
      },
      {
        "date": "2022-04-20T20:03:00.000Z",
        "voteCount": 1,
        "content": "I vote C"
      },
      {
        "date": "2021-10-11T06:12:00.000Z",
        "voteCount": 5,
        "content": "C. APIPA"
      },
      {
        "date": "2021-09-13T12:03:00.000Z",
        "voteCount": 1,
        "content": "Why answer this question changes?"
      },
      {
        "date": "2021-08-25T03:07:00.000Z",
        "voteCount": 2,
        "content": "Last week, the answer was letter C, the page admin changed it to letter B and didn't put an explanation of why.\n\nI still believe it's letter C, as we don't have a gateway to connect to internet computers. Although we have defined DNS in IPv6, I believe that the only computers that would communicate would be those that were on the same track and with APIPA"
      },
      {
        "date": "2021-08-02T13:02:00.000Z",
        "voteCount": 1,
        "content": "It's C, but it's not as straightforward as people think:\nDNS is configured to use the local ipv6 address, which may indicate that it is serving as the gateway for the network.  \nHowever, in such a scenario, it would involve multiple network adapters and since we only see the one, we cannot assume outside of the data given which is why it's still C."
      },
      {
        "date": "2022-06-15T01:43:00.000Z",
        "voteCount": 1,
        "content": "an FE80 address is the ipv6 equivelant of a 169.254 address isnt it?"
      },
      {
        "date": "2021-07-22T00:54:00.000Z",
        "voteCount": 3,
        "content": "Clearly C"
      },
      {
        "date": "2021-07-17T07:29:00.000Z",
        "voteCount": 3,
        "content": "why won't the website content creators update the answers, or provide feedback as to why they believe their answer is correct.\nHow reliable are these questions when going for the exams geez"
      },
      {
        "date": "2021-04-05T08:53:00.000Z",
        "voteCount": 3,
        "content": "Easily, C."
      },
      {
        "date": "2021-03-26T13:33:00.000Z",
        "voteCount": 3,
        "content": "c.\n\n\"After the network adapter has been assigned an IP address, the computer can use TCP/IP to communicate with any other computer that is connected to the same LAN and that is also configured for APIPA or has the IP address manually set to the 169.254.x.y (where x.y is the client's unique identifier) address range with a subnet mask of 255.255.0.0. Note that the computer cannot communicate with computers on other subnets, or with computers that do not use automatic private IP addressing. Automatic private IP addressing is enabled by default.\"\n\nhttps://docs.microsoft.com/en-us/windows-server/troubleshoot/how-to-use-automatic-tcpip-addressing-without-a-dh"
      },
      {
        "date": "2021-03-24T12:42:00.000Z",
        "voteCount": 5,
        "content": "C is correct. With Automatic Private IP Addressing (APIPA), DHCP clients automatically configure an IP address and subnet mask when a DHCP server is not available. The device chooses its own IP address in the range 169.254."
      },
      {
        "date": "2021-01-27T17:17:00.000Z",
        "voteCount": 3,
        "content": "I believe, it is C as well but could the \"internet host\" be referred to as an internal server"
      },
      {
        "date": "2021-01-16T12:04:00.000Z",
        "voteCount": 2,
        "content": "This must be C because the address is an APIPA (169.254.0.0 /16) making it unable to access the internet but can able to access other computers in the same network"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6799-exam-md-100-topic-4-question-9-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com.<br>A user named User1 has a personal computer named Computer1 that runs Windows 10 Pro. User1 has a VPN connection to the corporate network.<br>You need to ensure that when User1 connects to the VPN, network traffic uses a proxy server located in the corporate network. The solution must ensure that<br>User1 can access the Internet when disconnected from the VPN.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Control Panel, modify the Windows Defender Firewall settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Settings app, modify the Proxy settings for the local computer",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Control Panel, modify the properties of the VPN connection",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Settings app, modify the properties of the VPN connection\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "In the Properties of the VPN you can add a proxy setting. The proxy setting will only be active when the user connects to the VPN.",
    "votes": [
      {
        "answer": "D",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2019-11-19T12:56:00.000Z",
        "voteCount": 33,
        "content": "D is the correct answer.\nIn the Properties of the VPN you can add a proxy setting. The proxy setting will only be active when the user connects to the VPN."
      },
      {
        "date": "2019-10-19T09:32:00.000Z",
        "voteCount": 15,
        "content": "Why not D?\nwe need to ensure that user can connect to Internet without VPN connection"
      },
      {
        "date": "2019-10-21T04:34:00.000Z",
        "voteCount": 1,
        "content": "\"The solution must ensure that User1 can access the Internet when disconnected from the VPN\" My guess is that he should not be able to access the internet because network traffic should go trough proxy server located in corporate network? Otherwise you are right."
      },
      {
        "date": "2022-10-14T19:57:00.000Z",
        "voteCount": 1,
        "content": "This question is one of the most true controversial question and I believe everybody gets wrong in this.\n\nIf you need to make sure that User1 can access the Internet when disconnected from the VPN, then you will do all the settings through Internet Option inside Control Panel.\n\nFrom out there, inside the VPN settings, you will find VPN, Proxy and Internet configuration as the question is asking us.\n\nLetter C would be a far possible answer but I would mark D knowing that I could be blindly wrong."
      },
      {
        "date": "2022-10-14T20:07:00.000Z",
        "voteCount": 1,
        "content": "The User1 has a personal computer. You would find a Dial up issue to deal inside the Internet Options and this ensures everything the question is asking us.\n\nI changed my mind about this question. I will mark C with sang-froid :)"
      },
      {
        "date": "2022-07-22T00:11:00.000Z",
        "voteCount": 1,
        "content": "D is correct"
      },
      {
        "date": "2022-07-08T17:20:00.000Z",
        "voteCount": 1,
        "content": "D is correct. In the Settings app, select a VPN and click Advanced options. VPN proxy settings is there."
      },
      {
        "date": "2021-07-15T07:59:00.000Z",
        "voteCount": 1,
        "content": "There is no doubt,  B is the correct answer. configure a proxy script is a commen way."
      },
      {
        "date": "2022-01-08T10:25:00.000Z",
        "voteCount": 2,
        "content": "No, in that case the computer ALWAYS uses a proxy(setting). But that is not what the question wants."
      },
      {
        "date": "2021-04-19T12:56:00.000Z",
        "voteCount": 8,
        "content": "D. is correct. We have this problem at my shop. If you set the proxy for the machine, it will still be on when you disconnect from the vpn. Result is \"Page can not be displayed\" :)"
      },
      {
        "date": "2020-12-08T03:22:00.000Z",
        "voteCount": 3,
        "content": "Why are there so many incorrect answers? Are they deliberately giving us the wrong ones so we'll fail the exam? I bought a practice test before I discovered this website and that practice test also have the exact same questions and and answers. It's starting to confuse me now."
      },
      {
        "date": "2020-12-15T22:40:00.000Z",
        "voteCount": 1,
        "content": "Where did you buy the practice test @pd3vlin ?"
      },
      {
        "date": "2021-03-09T16:35:00.000Z",
        "voteCount": 2,
        "content": "There is an opinion, that MS specifically spread incorrect answers, to detect cheaters, who use exam dumps."
      },
      {
        "date": "2020-12-14T21:30:00.000Z",
        "voteCount": 15,
        "content": "That is why the discussions are so important"
      },
      {
        "date": "2022-07-29T17:43:00.000Z",
        "voteCount": 2,
        "content": "It's because the people dumping the questions and answers are people taking the test - not insiders or something at Microsoft. Since the test doesn't tell you which questions you got right or wrong, you have to just take the information and run with it. So the answers posted with the question dump may just be poorly researched by the original \"dumper.\""
      },
      {
        "date": "2020-11-23T16:13:00.000Z",
        "voteCount": 11,
        "content": "Agree with D.\nIn the Properties of the VPN you can add a proxy setting. The proxy setting will only be active when the user connects to the VPN. The question is asking for a proxy server which is only operational in the vpn. When disconnected the computer will use the default gateway."
      },
      {
        "date": "2020-10-07T04:44:00.000Z",
        "voteCount": 12,
        "content": "I agree with D, at first, I thought it was B like others. However, this was because I didn't know about the Proxy you can setup specifically for a VPN connection and ONLY works for the VPN connection. If you still disagree, setup a test VPN in the settings app, go to the Advanced Options and you'll see the VPN proxy settings right there."
      },
      {
        "date": "2020-10-24T02:48:00.000Z",
        "voteCount": 1,
        "content": "Thank you!  I was confused until I read your post and tried it myself like you suggested :)"
      },
      {
        "date": "2021-03-24T12:59:00.000Z",
        "voteCount": 1,
        "content": "It is very tricky question, maybe if we read more carefully we can solve it.\n\"the solution must ensure that User1 can access the Internet when disconnected from the VPN.\"\nProbably if you configure proxy setting through Settings, it may caused some issues with logic pledged by organization."
      },
      {
        "date": "2020-09-27T18:56:00.000Z",
        "voteCount": 6,
        "content": "Answer D:\nUser1 has a PERSONAL computer, therefore he cannot change the proxy settings on the machine and must change the settings on VPN connection.\n\nIf this was corporate device answer could be B."
      },
      {
        "date": "2020-07-14T12:57:00.000Z",
        "voteCount": 5,
        "content": "If you go to the Settings app in Windows 10, then Network and Internet and then to Proxy it says that the proxyserver doesn't affect VPN connections, so it has to be answer D."
      },
      {
        "date": "2020-06-30T13:11:00.000Z",
        "voteCount": 3,
        "content": "D is correct."
      },
      {
        "date": "2020-06-03T06:20:00.000Z",
        "voteCount": 5,
        "content": "The answer is D. B is only for WiFi/Lan connections and it even says it is not for VPN connections.  https://www.dummies.com/computers/operating-systems/windows-10/how-to-set-up-a-proxy-in-windows-10/"
      },
      {
        "date": "2020-05-17T23:59:00.000Z",
        "voteCount": 4,
        "content": "If you change anything in computer's proxy setting it will keep on looking for that proxy even after VPN disconnects hence D is the correct answer."
      },
      {
        "date": "2020-03-06T14:37:00.000Z",
        "voteCount": 1,
        "content": "[  ] A This has nothing to do with firewall settings.\n[X] B The only place to configure the Windows proxy is from the settings app. \n[  ] C There is no proxy setting available in the advanced adapter options in the control panel.\n[  ] D If the proxy is required to get internet access you can't make a VPN connection either."
      },
      {
        "date": "2020-03-09T13:10:00.000Z",
        "voteCount": 1,
        "content": "happyantlerman is correct, its answer D not B"
      },
      {
        "date": "2020-02-27T09:38:00.000Z",
        "voteCount": 5,
        "content": "I agree with D."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/25396-exam-md-100-topic-4-question-10-discussion/",
    "body": "You deploy 100 computers that run Windows 10. Each computer has a cellular connection and a Wi-Fi connection.<br>You need to prevent the computers from using the cellular connection unless a user manually connects to the cellular network.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Use cellular instead of Wi-Fi setting for the cellular connection to Never",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the netsh wlan set hostednetwork mode=disallow command",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tClear the Let Windows manage this connection check box for the cellular connection\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSelect the Let Windows manage this connection check box for the Wi-Fi connection"
    ],
    "answer": "C",
    "answerDescription": "Reference:<br>https://support.microsoft.com/en-za/help/10739/windows-10-cellular-settings",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-07-10T20:34:00.000Z",
        "voteCount": 14,
        "content": "C is correct"
      },
      {
        "date": "2021-03-24T13:47:00.000Z",
        "voteCount": 10,
        "content": "Let Windows manage this connection\nDetermines if your Windows 10 device will automatically connect to the cellular data network when it’s available. Clear the check box if you want to manually connect each time you want to use your cellular data connection. Select it if you want Windows to manage the connection for you. When selected, you’ll connect to cellular data automatically when you’re not connected to another kind of network"
      },
      {
        "date": "2022-04-20T20:08:00.000Z",
        "voteCount": 1,
        "content": "I vote C too"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6510-exam-md-100-topic-4-question-11-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have a laptop named Computer1 that runs Windows 10.<br>When in range, Computer1 connects automatically to a Wi-Fi network named Wireless1.<br>You need to prevent Computer1 from automatically connecting to Wireless1.<br>Solution: From a command prompt, you run netsh wlan delete profile name=\"Wireless1\".<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 6,
        "isMostVoted": true
      },
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2022-01-12T13:39:00.000Z",
        "voteCount": 54,
        "content": "\"You smash the computer with a hammer... does it meet the goal?\""
      },
      {
        "date": "2022-06-23T06:01:00.000Z",
        "voteCount": 4,
        "content": "Hahaha, Thanks for the smile on my face."
      },
      {
        "date": "2021-05-03T13:01:00.000Z",
        "voteCount": 12,
        "content": "answer is A  : if yourPc connect automatically to Wifi,then if type d the command, he will not be able to connect  :it's the goal of the question . Why so much discussion ?"
      },
      {
        "date": "2023-05-03T10:35:00.000Z",
        "voteCount": 1,
        "content": "It will do the job but also delete the connection password, which will give difficulties when you want to reconnect manually. Therefor B is right."
      },
      {
        "date": "2023-02-23T04:46:00.000Z",
        "voteCount": 2,
        "content": "CHATGPT:\nA. Yes, running the command \"netsh wlan delete profile name=\"Wireless1\"\" will delete the stored profile for the Wi-Fi network named \"Wireless1\" on Computer1, preventing it from automatically connecting to that network. Therefore, this solution meets the goal of preventing Computer1 from automatically connecting to Wireless1."
      },
      {
        "date": "2022-10-19T01:31:00.000Z",
        "voteCount": 2,
        "content": "Prevent automatically connection is needed, not prevent any connection anymore."
      },
      {
        "date": "2022-08-20T11:56:00.000Z",
        "voteCount": 2,
        "content": "netsh wlan delete profile name=\"PROFILE NAME\"\nQual a dúvida?\nFaço o teste rápido e simples, resposta correta."
      },
      {
        "date": "2022-08-01T21:15:00.000Z",
        "voteCount": 2,
        "content": "Answer is A. Tested it and I was not able to auto connect."
      },
      {
        "date": "2022-07-26T14:57:00.000Z",
        "voteCount": 1,
        "content": "Execute o comando para verifiar os perfis disponíveis \nnetsh wlan show all\n\nDepois exclua a wlan desejada:\nnetsh wlan delete profile name=\"Wireless1\"\n\nResposta: A - Correta!"
      },
      {
        "date": "2022-07-08T22:29:00.000Z",
        "voteCount": 1,
        "content": "\"...from automatically connecting to Wireless1.\"\nby deleting the wireless profile  via netsh this would technically prevent you from automatically connecting to that network"
      },
      {
        "date": "2022-04-20T20:11:00.000Z",
        "voteCount": 2,
        "content": "I thank the answer is A"
      },
      {
        "date": "2022-03-18T05:47:00.000Z",
        "voteCount": 2,
        "content": "B is the correct\nI tasted it."
      },
      {
        "date": "2022-11-10T07:33:00.000Z",
        "voteCount": 5,
        "content": "Did it taste good?"
      },
      {
        "date": "2022-03-13T05:42:00.000Z",
        "voteCount": 1,
        "content": "I would lean toward answer B as the method mention in the question is prevent to connect wireless after deletion instead of automatically connect. The Microsoft way is to uncheck automatically connect checkbox."
      },
      {
        "date": "2022-03-28T10:12:00.000Z",
        "voteCount": 2,
        "content": "They’re not asking for the best method. The asking if the answer meets the requirements"
      },
      {
        "date": "2021-07-22T02:07:00.000Z",
        "voteCount": 3,
        "content": "A is correct even if is not the best choice"
      },
      {
        "date": "2021-05-27T18:10:00.000Z",
        "voteCount": 4,
        "content": "The question wants: [You need to prevent Computer1 from automatically connecting to Wireless1]\n\nYes sure, if you delete the connection, the it will become an unknows connection to you and if you try to connect, it will ask you for credentials. But this doesn't solve the issue because if the WiFi is configured with a certificate and your computer does have the certificate, then it might connect automatically.\n\nYou simply click on the wireless icon near the time/date bring the wireless available, click the desired wireless and simply disconnect. When you do that you will see a check box to automatically connect, just leave it blank. This way it doesn't automatically connect, and you keep all the configuration so when you need it, simply connect!"
      },
      {
        "date": "2021-04-18T02:02:00.000Z",
        "voteCount": 4,
        "content": "Answer is A, C:\\WINDOWS\\system32&gt;netsh wlan delete profile name=\"llex\"\nProfile \"llex\" is deleted from interface \"Wi-Fi\". Extreme but the goal is met"
      },
      {
        "date": "2021-04-05T09:02:00.000Z",
        "voteCount": 3,
        "content": "Does this meat the goal? Yes, for sure. Regardless of the other options which come to mind, it definitely won't automatically connect."
      },
      {
        "date": "2021-03-26T17:15:00.000Z",
        "voteCount": 1,
        "content": "This is a tough one, deleting it would stop it connecting automatically but certainly a sledge hammer approach. setting connection mode to manual seems a fair better choice but technically deleting it would achieve the goal. I hate how Microsoft puts these questions. I think the automatically implies it still is to be used so it must not be deleted. So answer is No I think."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/49221-exam-md-100-topic-4-question-12-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have a laptop named Computer1 that runs Windows 10.<br>When in range, Computer1 connects automatically to a Wi-Fi network named Wireless1.<br>You need to prevent Computer1 from automatically connecting to Wireless1.<br>Solution: From the Services console, you disable the Link-Layer Topology Discovery Mapper service.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-04-05T09:05:00.000Z",
        "voteCount": 7,
        "content": "No for sure."
      },
      {
        "date": "2022-12-15T13:18:00.000Z",
        "voteCount": 1,
        "content": "No.\nThe LLTD protocol enables applications to quickly discover devices at the data-link layer, and it enables a central, graphical view of everything that is connected to the network."
      },
      {
        "date": "2022-04-20T20:13:00.000Z",
        "voteCount": 1,
        "content": "I think the answer is B"
      },
      {
        "date": "2022-03-15T00:17:00.000Z",
        "voteCount": 1,
        "content": "Correct answer."
      },
      {
        "date": "2021-11-24T14:13:00.000Z",
        "voteCount": 2,
        "content": "I think it´s good answer"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/50244-exam-md-100-topic-4-question-13-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have a laptop named Computer1 that runs Windows 10.<br>When in range, Computer1 connects automatically to a Wi-Fi network named Wireless1.<br>You need to prevent Computer1 from automatically connecting to Wireless1.<br>Solution: From the properties of the Wi-Fi adapter, you disable Link-Layer Topology Discovery Responder.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "Link-Layer Topology Discovery is used by their Network Map feature to display a graphical representation of the local area network (LAN) or wireless LAN<br>(WLAN), to which the computer is connected.<br>Reference:<br>https://en.wikipedia.org/wiki/Link_Layer_Topology_Discovery",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-04-20T20:14:00.000Z",
        "voteCount": 1,
        "content": "I think the answer is B."
      },
      {
        "date": "2022-03-15T00:17:00.000Z",
        "voteCount": 1,
        "content": "Correct answer given."
      },
      {
        "date": "2021-08-18T11:36:00.000Z",
        "voteCount": 4,
        "content": "No 100%."
      },
      {
        "date": "2021-04-16T01:22:00.000Z",
        "voteCount": 2,
        "content": "Seems No."
      },
      {
        "date": "2021-07-17T17:56:00.000Z",
        "voteCount": 2,
        "content": "It's plain no. You're just thinking too much on a simple straight forward question"
      },
      {
        "date": "2023-06-26T17:33:00.000Z",
        "voteCount": 1,
        "content": "Nothing wrong with this, maybe yours simple is not others simple.\nThanks!"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/25397-exam-md-100-topic-4-question-14-discussion/",
    "body": "Your network contains an Active Directory domain named contoso.com. The domain contains two computers named Computer1 and Computer2 that run Windows<br>10.<br>On Computer1, you need to run the Invoke-Command cmdlet to execute several PowerShell commands on Computer2.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer2, run the Enable-PSRemoting cmdlet\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Active Directory, configure the Trusted for Delegation setting for the computer account of Computer2",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, run the New-PSSession cmdlet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer2, add Computer1 to the Remote Management Users group"
    ],
    "answer": "A",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/enable-psremoting?view=powershell-6",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-10-13T19:27:00.000Z",
        "voteCount": 42,
        "content": "The Enable-PSRemoting cmdlet configures the computer to receive PowerShell remote commands that are sent by using the WS-Management technology. WS-Management based PowerShell remoting is currently supported only on Windows platform.\n\nPowerShell remoting is enabled by default on Windows Server platforms. You can use Enable-PSRemoting to enable PowerShell remoting on other supported versions of Windows and to re-enable remoting if it becomes disabled.\n\nYou have to run this command only one time on each computer that will receive commands. You do not have to run it on computers that only send commands. Because the configuration starts listeners to accept remote connections, it is prudent to run it only where it is needed."
      },
      {
        "date": "2021-03-25T01:10:00.000Z",
        "voteCount": 3,
        "content": "Thanks :)"
      },
      {
        "date": "2020-07-10T20:41:00.000Z",
        "voteCount": 10,
        "content": "A is correct"
      },
      {
        "date": "2022-04-20T20:17:00.000Z",
        "voteCount": 1,
        "content": "I think the answer is A."
      },
      {
        "date": "2022-03-15T00:48:00.000Z",
        "voteCount": 1,
        "content": "A is correct."
      },
      {
        "date": "2020-11-12T04:46:00.000Z",
        "voteCount": 6,
        "content": "If like me you're like \"what is invoke-command?\" you can find a good intro at https://docs.microsoft.com/en-us/powershell/scripting/learn/remoting/running-remote-commands?view=powershell-7.1"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/17989-exam-md-100-topic-4-question-15-discussion/",
    "body": "You have a computer named Computer1 that runs Windows 10.<br>You are troubleshooting connectivity issues on Computer1.<br>You need to view the remote addresses to which Computer1 has active TCP connections.<br>Which tool should you use?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerformance Monitor",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTask Manager",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tResource Monitor\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWindows Defender Firewall with Advanced Security"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-04-06T09:22:00.000Z",
        "voteCount": 16,
        "content": "Resource Monitor &gt; Network &gt; TCP Connections\n\nhttps://www.techrepublic.com/blog/the-enterprise-cloud/use-resource-monitor-to-monitor-network-performance/"
      },
      {
        "date": "2022-03-15T00:48:00.000Z",
        "voteCount": 1,
        "content": "C is correct"
      },
      {
        "date": "2021-10-22T12:31:00.000Z",
        "voteCount": 2,
        "content": "Correto!"
      },
      {
        "date": "2021-05-03T13:06:00.000Z",
        "voteCount": 4,
        "content": "C is correct"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/48150-exam-md-100-topic-4-question-16-discussion/",
    "body": "HOTSPOT -<br>Your office has a dedicated wireless network for guests.<br>You plan to provide access cards that will have a QR code for guests. The QR code will link to a network configuration file stored on a publicly accessible website and provide the wireless network settings for Windows 10 devices.<br>Which tool should you use to create the configuration file and which file type should you use for the configuration file? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0031300001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0031400001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/windows/configuration/provisioning-packages/provisioning-packages",
    "votes": [],
    "comments": [
      {
        "date": "2021-03-25T01:26:00.000Z",
        "voteCount": 7,
        "content": "Answer is right. \nhttps://docs.microsoft.com/en-us/windows-hardware/manufacture/iot/add-a-provisioning-package-to-an-image"
      },
      {
        "date": "2021-04-05T00:04:00.000Z",
        "voteCount": 3,
        "content": "So, you can use Windows Configuration Designer to configure non-domain / non-Azure domain joined PC of guests??"
      },
      {
        "date": "2021-08-08T05:46:00.000Z",
        "voteCount": 2,
        "content": "Yes, you use Windows Configuration Designer to create package that any computer join or not join to a domain can use to automatically make configuration to your computer"
      },
      {
        "date": "2021-05-03T13:12:00.000Z",
        "voteCount": 1,
        "content": "great link, thx"
      },
      {
        "date": "2021-05-28T08:50:00.000Z",
        "voteCount": 1,
        "content": "That link is about creating an image.  What does that have to do with giving guests access to the network???"
      },
      {
        "date": "2021-12-03T00:04:00.000Z",
        "voteCount": 3,
        "content": "https://docs.microsoft.com/en-us/windows/configuration/provisioning-packages/provisioning-packages"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/47564-exam-md-100-topic-4-question-17-discussion/",
    "body": "HOTSPOT -<br>Your network contains the segments shown in the following table.<br><img src=\"/assets/media/exam-media/04292/0031500001.png\" class=\"in-exam-image\"><br>You have a computer that runs Windows 10.<br>The network interface of the computer is configured as shown in the exhibit. (Click the Exhibit tab.)<br><img src=\"/assets/media/exam-media/04292/0031500002.png\" class=\"in-exam-image\"><br>You need to identify which IP address the computer will have on the network when the computer connects to the segments.<br>Which IP address should you identify for each segment? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0031600001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0031700001.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-04-05T07:06:00.000Z",
        "voteCount": 38,
        "content": "Solution is correct.\nAlternate configuration is shown. These (alternate-)settings only apply if no DHCP is provided.\nIn segment 1: DHCP is enabled, so IP is assigned, 172.16.0.58\nIn segment 2: No DHCP is found, so alternate settings are applied, 172.16.0.10"
      },
      {
        "date": "2021-05-03T13:15:00.000Z",
        "voteCount": 6,
        "content": "exactly !!! can't say better."
      },
      {
        "date": "2022-01-02T00:52:00.000Z",
        "voteCount": 2,
        "content": "I did some quick research which seems to back up this answer. It sais: As @uSlackr has said, it is the configuration that Windows will use when DHCP is unavailable. This seems to imply that alternative configuration only applies, when the interface is set to automatic (dhcp) but a dhcp server is not found in the network."
      },
      {
        "date": "2021-03-25T01:35:00.000Z",
        "voteCount": 15,
        "content": "I think it will 172.16.0.10 for both answers, because computer has static IP address already applied."
      },
      {
        "date": "2021-04-17T08:32:00.000Z",
        "voteCount": 2,
        "content": "I agree with you"
      },
      {
        "date": "2021-05-22T08:47:00.000Z",
        "voteCount": 4,
        "content": "It's not a static IP address. That's what i thought at first aswell. It's alternate address meaning it will only be used if DHCP is unavailable for some reason. See Perycles comment"
      },
      {
        "date": "2022-08-26T04:57:00.000Z",
        "voteCount": 1,
        "content": "This is not correct, if you assign a static IP to a host that hasnt been set to automatically detect and IP address from DHCP the static IP wont change.\nI think the answer is 172.16.0.10 for both."
      },
      {
        "date": "2023-04-14T05:31:00.000Z",
        "voteCount": 1,
        "content": "The image show the \"Altenate\" tab."
      },
      {
        "date": "2023-10-05T03:25:00.000Z",
        "voteCount": 1,
        "content": "Both 172.16.0.10  because the address is a manually static address and will stay on that computer when you connect on segment1 or segment2.  Its not getting an by DHCP provided IP"
      },
      {
        "date": "2022-10-15T20:14:00.000Z",
        "voteCount": 1,
        "content": "Alternate Configuration has two important informations that kill at least the Segment2 statement:\n\nAutomatic private IP address which means APIPA\nUser configured which means Alternate Configuration\n\nSo, User configured will be used and you will have 172.16.0.10 for that Segment2."
      },
      {
        "date": "2022-07-26T20:56:00.000Z",
        "voteCount": 1,
        "content": "The Ipaddress is static so both answer are 172.16.0.10"
      },
      {
        "date": "2021-10-30T10:04:00.000Z",
        "voteCount": 1,
        "content": "Segment2 should be 169.254??\n172.16.0.10 is not available in segment2"
      },
      {
        "date": "2022-04-12T02:09:00.000Z",
        "voteCount": 1,
        "content": "There is no dhcp so the address cant be 169. This address appears only when the dhcp cant be reached"
      },
      {
        "date": "2021-05-03T13:27:00.000Z",
        "voteCount": 9,
        "content": "Alternative configuration is possible Only when IP adress is configured as automatic (DHCP).\nIf  you configure an IP amnually, \"alternitave Configuration \" tab doesn't appear. In our Case, we have an automatic configuration , so computer whill first try to contact a DHCP server. If these is no DHCP on the segment, or if DHCP not responding, alternative configuration will take place. SO answer are correct."
      },
      {
        "date": "2021-03-20T01:43:00.000Z",
        "voteCount": 2,
        "content": "question is asking which IP address should be identified when connecting to the segment. If segment also means subnet then I would say 172.16.0.58 would need to be the identity to be able to connect to 172.16.0.0 subnet.\n\nAlso to be able to connect to the 192.168.1.0 subnet, the identity would need to be a 192.168.1.X address"
      },
      {
        "date": "2021-03-25T01:40:00.000Z",
        "voteCount": 2,
        "content": "But there was said that computer already has static IP address(172.16.0.10)."
      },
      {
        "date": "2021-03-19T05:44:00.000Z",
        "voteCount": 5,
        "content": "You get an apipa adres on segment 1 because of duplicate ip.\nSegment 2 just gets the IP 172.16.0.10 as it is static assigned."
      },
      {
        "date": "2021-03-25T01:33:00.000Z",
        "voteCount": 1,
        "content": "Why? Where you see that 172.16.0.10 is already used?"
      },
      {
        "date": "2021-03-25T08:17:00.000Z",
        "voteCount": 3,
        "content": "In the first segment, the first free address is .58 which suggests .10 is already in use."
      },
      {
        "date": "2021-04-17T08:30:00.000Z",
        "voteCount": 1,
        "content": "it doesn't say 10 is already in use. if it is already in use, the PC can not have any IP address because it's duplicated. but in Answer, we don't have option like `can not have network` something like this. therefore it will be assigning 10"
      },
      {
        "date": "2021-04-17T11:15:00.000Z",
        "voteCount": 1,
        "content": "adding to my comment, if you give static IP and IP is already assigned for something else, it will be CONFLICTING and we should give it either another static IP or change to DHCP client or you should exclude the IP from DHCP.\nhttps://support.microsoft.com/en-us/topic/fix-duplicate-ip-address-conflicts-on-a-dhcp-network-d68499da-69a3-da3b-4630-d17e502adf50"
      },
      {
        "date": "2021-06-20T11:09:00.000Z",
        "voteCount": 2,
        "content": "I was wrong. It is not static IP. It is alternate IP\nAnswer is correct"
      },
      {
        "date": "2021-03-17T09:50:00.000Z",
        "voteCount": 1,
        "content": "that is not correct for the first\nis take a 169.254 address"
      },
      {
        "date": "2021-03-25T01:37:00.000Z",
        "voteCount": 3,
        "content": "Why? Maybe second? Second segment don't have DHCP."
      },
      {
        "date": "2021-10-31T04:57:00.000Z",
        "voteCount": 1,
        "content": "Second segment gives 169.254! 172.16.0.10 can't be enforced in a 192.168.1.0/24 VLAN."
      },
      {
        "date": "2021-05-03T13:21:00.000Z",
        "voteCount": 3,
        "content": "no, if you have an alternative configuration, it will be applied if  :\n - DHCP not reponded\n- No DHCP configured"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/50245-exam-md-100-topic-4-question-18-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain named adatum.com, a workgroup, and computers that run Windows 10. The computers are configured as shown in the following table.<br><img src=\"/assets/media/exam-media/04292/0031800001.png\" class=\"in-exam-image\"><br>The local Administrator accounts on Computer1, Computer2, and Computer3 have the same user name and password.<br>On Computer1, Windows Defender Firewall is configured as shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0031800002.jpg\" class=\"in-exam-image\"><br>The services on Computer1 have the following states.<br><img src=\"/assets/media/exam-media/04292/0031900001.png\" class=\"in-exam-image\"><br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0031900002.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0032000001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: No -<br>Because the firewall is blocking Remote Volume Management.<br><br>Box 2: No -<br>Because the Remote Registry Service is stopped.<br><br>Box 3: No -<br>Because the Remote Registry Service is stopped.  Perfmon needs both the RPC service and the Remote Registry service to be running.",
    "votes": [],
    "comments": [
      {
        "date": "2021-04-16T01:25:00.000Z",
        "voteCount": 9,
        "content": "Seems right."
      },
      {
        "date": "2023-08-20T11:38:00.000Z",
        "voteCount": 1,
        "content": "Couldn't you make an argument for remote registry as yes? The remote service management is enabled over domain, so you could start the service"
      },
      {
        "date": "2022-07-08T17:45:00.000Z",
        "voteCount": 1,
        "content": "Agreed. I read a SolarWinds blog where the poster said that if they were unable to obtain perfmon counters from a remote machine, restarting the remote registry service was the fix."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/36282-exam-md-100-topic-4-question-19-discussion/",
    "body": "Your company has a Remote Desktop Gateway (RD Gateway).<br>You have a server named Server1 that is accessible by using Remote Desktop Services (RDS) through the RD Gateway.<br>You need to configure a Remote Desktop connection to connect through the gateway.<br>Which setting should you configure?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConnection settings",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tServer authentication",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tLocal devices and resources",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConnect from anywhere"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-06T11:17:00.000Z",
        "voteCount": 24,
        "content": "In the Remote Desktop Connection dialog box, click Options to expand the dialog box and view settings.\nOn the Advanced tab, under \"Connect from anywhere\", click Settings to access."
      },
      {
        "date": "2021-03-01T12:00:00.000Z",
        "voteCount": 4,
        "content": "shouldn't it be \"Connection settings\"?\n\nyou can access it here: mstsc.exe &gt; advanced &gt; Connect from anywhere &gt; Click Connect &gt; Connection settings &gt; (select RD gateway settings)"
      },
      {
        "date": "2021-03-25T02:14:00.000Z",
        "voteCount": 10,
        "content": "Connection settings is under Connect from anywhere..."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33905-exam-md-100-topic-4-question-20-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>You have a laptop named Computer1 that runs Windows 10.<br>When in range, Computer1 connects automatically to a Wi-Fi network named Wireless1.<br>You need to prevent Computer1 from automatically connecting to Wireless1.<br>Solution: From the Settings app, you modify the properties of the Wireless1 known Wi-Fi network.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo"
    ],
    "answer": "A",
    "answerDescription": "Removing Wireless1 as a known Wi-Fi network on Computer1 will prevent it from automatically connecting.<br>Note: You can also type netsh wlan show profiles in the Command Prompt to manage and delete wireless network profiles.<br>Reference:<br>https://kb.netgear.com/29889/How-to-delete-a-wireless-network-profile-in-Windows-10",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-13T19:44:00.000Z",
        "voteCount": 22,
        "content": "You could simply uncheck the \"connect automatically\" checkbox. The laptop would still see the wireless network but it would not connect to it"
      },
      {
        "date": "2020-10-30T08:13:00.000Z",
        "voteCount": 6,
        "content": "Looking at this again, I agree, that would count as \"modify\""
      },
      {
        "date": "2023-02-23T05:07:00.000Z",
        "voteCount": 1,
        "content": "A. Yes, modifying the properties of the Wireless1 Wi-Fi network from the Settings app can potentially meet the goal of preventing Computer1 from automatically connecting to that network. Depending on the specific modifications made to the properties, it may be possible to disable automatic connection to the network. For example, if the \"Connect automatically when in range\" option is unchecked, Computer1 will no longer automatically connect to the network. Therefore, this solution may meet the goal of preventing Computer1 from automatically connecting to Wireless1."
      },
      {
        "date": "2021-01-17T16:09:00.000Z",
        "voteCount": 1,
        "content": "I does solve the issue but i adds more steps. to make it simple : Settings &gt; WiFi &gt; WiFi name &gt; slide to disable that says connect automatically when in range\""
      },
      {
        "date": "2020-12-12T13:22:00.000Z",
        "voteCount": 2,
        "content": "disable \"connect automatically when in range\" should do the job"
      },
      {
        "date": "2020-10-07T05:10:00.000Z",
        "voteCount": 4,
        "content": "Not entirely sold on this answer. If you simply modified the connection properties, you'd still connect to it when in range, you just wouldn't get internet service. Unless you changed the passkey to prevent the connection being authenticated. \n\nI think it's badly worded."
      },
      {
        "date": "2020-10-12T11:11:00.000Z",
        "voteCount": 4,
        "content": "Agreed. The word \"modified\" is very vague."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33933-exam-md-100-topic-4-question-21-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0032300001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 10921597 -<br><img src=\"/assets/media/exam-media/04292/0032400001.jpg\" class=\"in-exam-image\"><br>You need to connect to your company's network and create a VPN connection on Client2 named VPN1 that meets the following requirements:<br>✑ VPN1 must connect to a server named vpn.contoso.com.<br>✑ Only traffic to your company's network must be routed through VPN1.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. On Client2, click on the Start button and go to settings.<br>2. Select Network &amp; Internet.<br>3. Select VPN on the left-hand side<br>4. Click on the Add a VPN connection button.<br>5. Next, select the VPN providerג€\"This will almost always be Windows (built-in).<br>6. Name your connection and enter the server name as provided by your IT technician. (VPN1 and vpn.contoso.com).<br>7. Add in your username and password as provided by your IT technician.<br>8. Click Save when done.<br>9. Closeout the PC settings windows.<br>Reference:<br>https://www.themillergroup.com/vpn-windows-10/",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-30T08:24:00.000Z",
        "voteCount": 36,
        "content": "You can turn off sending all data over the VPN from the Network Connections option of Control Panel. Open the properties of the VPN, got to the Networking tab, Internet Protocol (TCP/IP4/6), open Properties, go to Advanced, untick Use default gateway on remote network. \n\nThen you will only use the VPN when you need to access a resource on the company's network."
      },
      {
        "date": "2020-12-08T18:39:00.000Z",
        "voteCount": 5,
        "content": "Yes it is best to uncheck this setting, otherwise internet traffic will use the default gateway and hence be routed over the vpn."
      },
      {
        "date": "2021-03-25T02:37:00.000Z",
        "voteCount": 1,
        "content": "Yes and no, sometimes you should connect to the client environment, but they allow connection only from white-list. You'll still can connect to corp. resources, but you lost possibility always hide your home IP. \nBut in most cases, yes. It will help to reduce load on corp. internet channel and your internet surfing/video calls speed and latency will be much better."
      },
      {
        "date": "2021-08-24T12:49:00.000Z",
        "voteCount": 10,
        "content": "\"To complete this task, sign in to the required computer or computers.\"  I love this part.  All I have to do to complete the task is sign into the right computer and I'm done."
      },
      {
        "date": "2023-06-05T04:06:00.000Z",
        "voteCount": 1,
        "content": "Another article\n https://help.uis.cam.ac.uk/service/network-services/remote-access/uis-vpn/windows10#:~:text=Choose%20the%20Networking%20tab%2C%20then,OK%20and%20close%20the%20window."
      },
      {
        "date": "2022-01-11T13:21:00.000Z",
        "voteCount": 2,
        "content": "http://woshub.com/vpn-blocks-internet-connection-on-windows/"
      },
      {
        "date": "2022-01-20T02:17:00.000Z",
        "voteCount": 1,
        "content": "Excellent article. I've tried the 3 methods (GUI, edit file and Power Shell) and I confirm that they all work."
      },
      {
        "date": "2021-10-28T01:18:00.000Z",
        "voteCount": 3,
        "content": "split tunnel\nSet-VPNconnection -name YourVPNconnection -SplitTunneling $true"
      },
      {
        "date": "2021-11-01T06:54:00.000Z",
        "voteCount": 1,
        "content": "Get-VPNconnection | Set-VPNconnection -SplitTunneling $true"
      },
      {
        "date": "2021-09-07T03:42:00.000Z",
        "voteCount": 1,
        "content": "The username and password to be configured on client 2 is Username: Contoso/Administrator - Password: Passw0rd! ?"
      },
      {
        "date": "2020-10-26T20:59:00.000Z",
        "voteCount": 2,
        "content": "A proxy server acts as a gateway between you and the internet.\nTherefore in this question all internet traffic must not be routed through the vpn.\nCreate the vpn\nAdvanced options…VPN Proxy Settings (Automatically detect settings)"
      },
      {
        "date": "2020-12-08T18:36:00.000Z",
        "voteCount": 2,
        "content": "Should be set to None. This way no proxy server is setup for the vpn which means  that internet traffic would be diverted elsewhere which is what you want."
      },
      {
        "date": "2020-12-08T18:39:00.000Z",
        "voteCount": 2,
        "content": "And additionally see Forummj's comments below"
      },
      {
        "date": "2020-10-24T03:41:00.000Z",
        "voteCount": 4,
        "content": "\"Only traffic to your company's network must be routed through this VPN\"\nI believe this would require that you edit the Advanced Settings of the VPN (after you create it) and input the default gateway address into the \"Use the proxy server except for the addresses that start with the following entries\" field at the bottom.  Since that isn't provided, you would need to run the ipconfig command to discover it."
      },
      {
        "date": "2020-10-07T09:21:00.000Z",
        "voteCount": 1,
        "content": "The explanation is missing the VPN proxy settings."
      },
      {
        "date": "2020-10-13T05:42:00.000Z",
        "voteCount": 1,
        "content": "\"only companies traffic\" I think this is achieved when you connect to VPN itself (Without vpn Proxy setup) . You would configure VPN proxy settings if you want to re-route All the traffic, if I am not wrong."
      },
      {
        "date": "2021-03-25T02:38:00.000Z",
        "voteCount": 1,
        "content": "No, by default all traffic goes through VPN."
      },
      {
        "date": "2021-03-25T02:40:00.000Z",
        "voteCount": 1,
        "content": "Sorry, my bad. I was wrong. Just read forummj comment."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 22,
    "url": "https://www.examtopics.com/discussions/microsoft/view/34392-exam-md-100-topic-4-question-22-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0032600001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 10921597 -<br><img src=\"/assets/media/exam-media/04292/0032700001.jpg\" class=\"in-exam-image\"><br>You need to ensure that you can successfully ping DC1 from Client3 by using the IP4 address of DC1.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "✑ On Client3, press Windows+R to access Run.<br>✑ Type cmd and click OK to access the command prompt.<br>Type ipconfig and press Enter to check that you have a valid IP address.<br><img src=\"/assets/media/exam-media/04292/0032700004.png\" class=\"in-exam-image\"><br>✑ On Client3, press Windows+R to access Run.<br>✑ Type cmd and click OK to access the command prompt.<br>✑ Type \"ping\" and the IP address of the Domain Controller (e.g. \"ping 172.16.1.43\").<br>Reference:<br>http://www.turn-n-burn.com/DestinyNetworks/Downloads/WebHelp3-1-1/Ping_the_Domain_Controller.htm",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-10T04:06:00.000Z",
        "voteCount": 13,
        "content": "This one looks pretty easy. I'm assuming you may need to check ICMP on DC1's firewall to allow it to respond to ping requests. Just keep that in mind in case it doesn't respond to ping."
      },
      {
        "date": "2021-01-04T09:19:00.000Z",
        "voteCount": 3,
        "content": "https://www.howtogeek.com/howto/windows-vista/allow-pings-icmp-echo-request-through-your-windows-vista-firewall/"
      },
      {
        "date": "2020-12-19T19:16:00.000Z",
        "voteCount": 13,
        "content": "I think the first step would be:\nGo to DC1\nGo to CMD\ntype ipconfig\ncheck the ip address, remember it\nexit\n\nNow the next step would be:\nGo to Client3,\nGo to CMD\ntype ipconfig\nenter\nping the ip address of DC1 by using ping xxx.xxx.x.x\nexit\n\nIs this correct? I'm assuming it is. The answer provided didn't show you how you would know the ip address of DC1."
      },
      {
        "date": "2020-12-27T08:50:00.000Z",
        "voteCount": 2,
        "content": "ipconfig chief"
      },
      {
        "date": "2022-10-27T00:59:00.000Z",
        "voteCount": 1,
        "content": "I think you should enable Echo Request - ICMPv4-In on DC first :\nSearch for Windows Firewall , and click to open it.\nClick Advanced Settings on the left.\nFrom the left pane of the resulting window, click Inbound Rules.\nIn the right pane, find the rules titled File and Printer Sharing (Echo Request - ICMPv4-In).\nRight-click each rule and choose Enable Rule."
      },
      {
        "date": "2022-10-17T21:21:00.000Z",
        "voteCount": 1,
        "content": "I wouldn't waste my time on this question. So my fastest way would be\n\nping -4 DC1\n\nIf I get the answer with the IP address in hand, then I ping back with that IPv4."
      },
      {
        "date": "2022-08-05T08:04:00.000Z",
        "voteCount": 1,
        "content": "1. Check on both DC1 and Client3 Firewall settings for Echo Request - ICMPv4-In.\n2. On Client 3 ping DC1 to get it's IP.\n3. Ping DC1's IP again from Client 3...\nVoila !"
      },
      {
        "date": "2021-11-22T11:32:00.000Z",
        "voteCount": 2,
        "content": "You don't necessarily need to ipconfig on both, just DC. Then go into Client 3&gt;Open CMD&gt;Ping DC1 IP, no?"
      },
      {
        "date": "2021-09-07T03:57:00.000Z",
        "voteCount": 2,
        "content": "Will the other computers (Clent1, 2, DC1 and others) find themselves without passwords provided in the question or will they be informed in the question as only the administrator appears?"
      },
      {
        "date": "2021-07-22T02:40:00.000Z",
        "voteCount": 3,
        "content": "I needed to add an Inbound Rule in my Server VM allowing ICMPv4 Echo Requests"
      },
      {
        "date": "2022-01-11T13:25:00.000Z",
        "voteCount": 2,
        "content": "I figured that would've been the answer to the question indeed"
      },
      {
        "date": "2021-03-23T12:52:00.000Z",
        "voteCount": 1,
        "content": "systeminfo in powershell or command prompt from client3 will show logon severs by host name.\n\nget-dnsclientcache will show ip address of logon servers from host record\n\nclear-dnsclientcache will clear dns\n\nIf pings still fail. Then I would check firewall rules on both machines"
      },
      {
        "date": "2021-03-15T08:27:00.000Z",
        "voteCount": 2,
        "content": "On client3, open command prompt. ping -a DC1 will show the IP address of DC1, then ping that address."
      },
      {
        "date": "2021-02-25T10:13:00.000Z",
        "voteCount": 2,
        "content": "There are also File &amp; Printer Sharing (Echo Request - ICMPv4-In) too.\nThe question doesn't ask you to ping the DC, it simply asks you to \"ensure\" that you can. The devices could be on different subnets and still ping each other if the route is known to the network. But if PING is blocked, as it is on many Servers, you may need to allow it through the firewall first."
      },
      {
        "date": "2020-12-12T13:33:00.000Z",
        "voteCount": 1,
        "content": "use ping -4 &lt;IP Address of DC1&gt; to ensure your ping uses IPv4 instead of IPv6"
      },
      {
        "date": "2021-04-06T02:21:00.000Z",
        "voteCount": 1,
        "content": "No, that is not true. When you use PING and enter a ipv4 address, it will never ping over ipv6. So -4 or -6 is not needed because we are pinging on 172.x.x.x. You could use -4 or -6 if you ping on hostname, but that's not the question here."
      },
      {
        "date": "2020-12-05T04:22:00.000Z",
        "voteCount": 2,
        "content": "Is the right answer /ping DC1  ?"
      },
      {
        "date": "2021-01-04T09:17:00.000Z",
        "voteCount": 1,
        "content": "without the forward slash. go to the DC1 type ipconfig in. get the ip. go to the client then type:\nping 10.0.0.1\n(whatever the ip of DC1 would be)"
      },
      {
        "date": "2020-10-26T21:05:00.000Z",
        "voteCount": 8,
        "content": "I would be running ipconfig on both machines first and then pinging the DC1"
      },
      {
        "date": "2021-03-25T04:14:00.000Z",
        "voteCount": 2,
        "content": "mb we should open ICMPv4 inbound rules for both of them?"
      },
      {
        "date": "2020-10-13T05:47:00.000Z",
        "voteCount": 3,
        "content": "where was IPv4 picked up from? I thought I would need to do nslookup dc01 and then ping based on the results."
      },
      {
        "date": "2020-10-13T05:48:00.000Z",
        "voteCount": 2,
        "content": "or can I connect to dc01 as well to check its ipv4? I haven't done any of the labs yet"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 23,
    "url": "https://www.examtopics.com/discussions/microsoft/view/40340-exam-md-100-topic-4-question-23-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0032900001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 10921597 -<br><img src=\"/assets/media/exam-media/04292/0033000001.jpg\" class=\"in-exam-image\"><br>You need to ensure that a local user named User1 can establish a Remote Desktop connection to Client2.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "Add User to Remote Desktop Users Group via Settings App<br>1. Open the Settings app on Client2 and go to System -&gt; Remote Desktop. Click on the Select users that can remotely access this PC link on the right side.<br>2. When the Remote Desktop Users dialog opens, click on Add.<br>3. Click on Advanced.<br>4. Click on Find Now and then select any user account you want to add to the ג€Remote Desktop Usersג€ group, and click OK.<br>5. Click OK and you're done.<br>Reference:<br>https://www.top-password.com/blog/add-user-to-remote-desktop-users-group-in-windows-10/",
    "votes": [],
    "comments": [
      {
        "date": "2022-10-18T08:37:00.000Z",
        "voteCount": 5,
        "content": "When you add a user to have remote access inside Settings &gt; System &gt; Remote Desktop, you are actually adding a user to the Remote Desktop Users group.\n\nSo the easiest way to do it is to\n\nRight-click Start menu &gt; Computer Management &gt; Local Users and Groups &gt; Groups &gt; Remote Desktop Users"
      },
      {
        "date": "2020-12-19T07:26:00.000Z",
        "voteCount": 2,
        "content": "They say \"You need to ensure\"...Shouldn't you also go to Client1 to actually try to connect to Client2 by using Remote Desktop?"
      },
      {
        "date": "2021-02-07T15:16:00.000Z",
        "voteCount": 1,
        "content": "This question mentions nothing about Client1."
      },
      {
        "date": "2021-03-25T04:16:00.000Z",
        "voteCount": 1,
        "content": "outbound traffic is open by default."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 24,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35273-exam-md-100-topic-4-question-24-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0033200001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 11145882 -<br><img src=\"/assets/media/exam-media/04292/0033300001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/04292/0033400001.jpg\" class=\"in-exam-image\"><br>You need to prevent user names and passwords from being filled in on forms automatically when a user browses to websites from Client2.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. Open the Local Group Policy Editor.<br>2. In the left pane of Local Group Policy Editor, navigate to Computer Configuration\\Administrative Templates\\Windows Components\\Microsoft Edge<br>3. In the right pane of Microsoft Edge in Local Group Policy Editor, double click/tap on the Configure Autofill policy to edit it.<br>4. Select Disabled, click/tap on OK.<br>5. In the right pane of Microsoft Edge in Local Group Policy Editor, double click/tap on the<br>6. Configure Password Manager policy to edit it.<br>7. Select Disabled, click/tap on OK.<br>8. You can now close the Local Group Policy Editor.<br>Reference:<br>https://docs.microsoft.com/en-us/microsoft-edge/deploy/available-policies https://www.tenforums.com/tutorials/115069-enable-disable-autofill-microsoft-edge-windows-10-a.html",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-27T06:22:00.000Z",
        "voteCount": 5,
        "content": "local group policy on client 2. Either Computer or User config will apply to all users on that \nclient. The User Configuration - Admin Templates - Windows Components - has options to disabled Autofill for both \"Internet Explorer\" and \"Microsoft Edge\" so just disable for both.\n\"Microsoft Edge\" = Configure Autofill (Disable it)\n\"Internet Explorer\" = Disable Autocomplete on Forms (Enable it) + Turn on the Auto-complete feature for user names and passwords on forms (Disable it)"
      },
      {
        "date": "2021-03-01T09:43:00.000Z",
        "voteCount": 2,
        "content": "It looks like the behaviour changes with different versions. looks like pre–Chromium Edge might have used: \"Configure Password Manager\". The new Edge seems to need an updated policy file downloaded for the ADMX template. Then you get the 'Password manager and protection' sub folder with 'Enable saving passwords to the password manager'. It looks like passwords already saved might still be usable. This would need more lab testing to check."
      },
      {
        "date": "2022-01-23T09:03:00.000Z",
        "voteCount": 3,
        "content": "i think we need to do same configuration but on dc as domain policy always overwrite local policy"
      },
      {
        "date": "2021-09-07T04:42:00.000Z",
        "voteCount": 1,
        "content": "The test changed on August 5th. IE came out of content, just Edge. Configure AutoFill and Configure Password Manager, I just tested and were the names shown to me. Does it look like the build of Win 10 is 1809 with the change from just recent still the same or what would it be?"
      },
      {
        "date": "2021-02-12T03:44:00.000Z",
        "voteCount": 1,
        "content": "Do you have any working final solution for ths question? I have tried the \"Solution\", but it didn't work at all. Not even after restarting or gpupdating. When I try to log on a page it will offer to save the username and password, despite the group policy change. So I don't know what are the effects of these options. If I changed the browser settings in Edge and IE manually than I can prevent the websites to offer the passwords to be saved. But it can't be the solution because it would be applied on the account I did the change. So I should log into each account and modify the browser settings. I hope I won't see this question on the exam, or the instructions will be more clear. :)"
      },
      {
        "date": "2021-01-17T16:19:00.000Z",
        "voteCount": 1,
        "content": "Let's assume that this is MS Edge since IE has been deprecated. The procedure seems correct."
      },
      {
        "date": "2020-11-02T03:06:00.000Z",
        "voteCount": 4,
        "content": "This is a tad misleading. No browser information is given, so, we can be forgiven for thinking that it's Internet Explorer or Edge. Anthony_2770 has one option, however, you can simply open up the Internet Options from IE and disable Autofill of Usernames and Passwords there, which may be easier. Edge doesn't have an Autofill section anymore since the update but the previous version of Edge did have a section titled Autofill settings in the right-hand-side fly-out menu where you could turn off Save passwords option. This is still available to do in the Password area of Edge. It might be an idea to do both of these for the fullest answer, but I don't know."
      },
      {
        "date": "2021-03-25T04:28:00.000Z",
        "voteCount": 2,
        "content": "I think answer must include all Users in this PC. When you change browser settings it works only for this current user."
      },
      {
        "date": "2020-12-03T08:38:00.000Z",
        "voteCount": 3,
        "content": "I thought the same about doing it in the browser, however (I believe) that would only apply to the signed in user. The question asks to apply it to client 2 so don't think doing it in the browser would work. It definitely should specify to use Edge as I presumed you would use Internet Explorer."
      },
      {
        "date": "2020-10-26T21:37:00.000Z",
        "voteCount": 4,
        "content": "How about :\nGpedit.msc \nUser Configuration &gt; Administrative Templates &gt; Windows Components &gt; Internet Explorer &gt; \n&gt; Disable AutoComplete for Forms."
      },
      {
        "date": "2020-12-09T15:01:00.000Z",
        "voteCount": 7,
        "content": "This is an error . Computer Configuration in Group Policy is applied to computers, regardless of who logs on to the computers. User Configuration in Group Policy is applied to users, regardless of which computer they log on to.\nTherefore for this question use Computer Configuration"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 25,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35274-exam-md-100-topic-4-question-25-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0033600001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 11145882 -<br><img src=\"/assets/media/exam-media/04292/0033700001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/04292/0033800001.jpg\" class=\"in-exam-image\"><br>You need to ensure that all the current and future users in the Active Directory domain can establish Remote Desktop connections to Client1. The solution must use the principle of least privilege.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "Step 1. Add Remote Desktop Users to the Remote Desktop Users Group.<br>1. Open Server Manager.<br>2. From Tools menu, select Active Directory Users and Computers<br>3. Double click at your domain on the left and then select Builtin.<br>4. Open Remote Desktop Users on the right pane.<br>5. At Members tab, click Add.<br>6. Type the AD users that you want to give Remote access to the RDS Server and click OK.<br>7. After selecting the remote desktop users, click OK again to close the window.<br>Step 2. Allow the log on through remote desktop Services.<br>1. Open Group Policy Editor. To do that:<br><img src=\"/assets/media/exam-media/04292/0033900001.png\" class=\"in-exam-image\"> a. Simultaneously press the Windows<br>+ R keys to open run command box.<br>b. Type gpedit.msc and press Enter.<br>2. In Group Policy Editor navigate to: Computer Configuration &gt; Windows Settings &gt; Security Settings &gt; Local Policies &gt; User Rights Assignment.<br>3. At the right Pane: double click at Allow log on through Remote Desktop Services.<br>4. Click Add User or Group.<br>5. Type remote and then click Check Names.<br>6. Select the Remote Desktop Users and click OK.<br>7. Click OK at 'Select users, computersג€¦' window.<br>8. Finally click OK again and close Group Policy Editor.<br>Reference:<br>https://www.wintips.org/fix-to-sign-in-remotely-you-need-the-right-to-sign-in-through-remote-desktop-services-server-2016/",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-27T18:44:00.000Z",
        "voteCount": 35,
        "content": "The question asks:\n\n[the current and future users in the Active Directory domain can establish Remote Desktop connections to Client1]\n\nlet me say it again slowly... TO CLIENT1... not to the whole world and all computers of the domain.\n\nBy default, Administrators have remote access even if they are not specified explicitly. So it is sufficient to connect to Client1, and add DOMAIN USERS to the local group of client1 called [Remote Desktop Users]. End of the story"
      },
      {
        "date": "2023-04-01T02:04:00.000Z",
        "voteCount": 1,
        "content": "can we do this using Computer Management ?"
      },
      {
        "date": "2020-12-12T13:53:00.000Z",
        "voteCount": 6,
        "content": "STEP1 in the Solution must be done on CLIENT1 not DC. Add domain users to Remote Desktop Users Security Group"
      },
      {
        "date": "2020-12-31T08:26:00.000Z",
        "voteCount": 1,
        "content": "yes I agree, this has to be done on client1 not the domain controller"
      },
      {
        "date": "2021-03-30T05:19:00.000Z",
        "voteCount": 2,
        "content": "Why do you guys think it has to be done on Client1? \nit is editing permissions for domain users(groups). it doesn't really matter where it has done"
      },
      {
        "date": "2023-04-05T10:12:00.000Z",
        "voteCount": 1,
        "content": "Domain Users need to be added to the local Remove Desktop Users group. Adding Domain Users to the locale policy \"Allow log on through Remote Desktop Services\" is not enough, because the \"Remote Desktop Users\" group will also provide policy right \"Access this computer from the network\"."
      },
      {
        "date": "2022-10-18T14:36:00.000Z",
        "voteCount": 2,
        "content": "Client1 &gt; Computer Management &gt; Local Users and Groups &gt; Groups &gt; Remote Desktop Users\nThis is exactly the principle of least privilege.\n\nDomain &gt; Active Directory Users and Groups &gt; Builtin &gt; Remote Desktop Users\nThis could not be the principle of least privilege because it would involve all computers of the domain.\n\nLGPO &gt; Computer Configuration &gt; Allow log on through Remote Desktop Services\nYou won't need to touch anything there, because the Remote Desktop Users group is already allowed inside there."
      },
      {
        "date": "2022-09-12T02:30:00.000Z",
        "voteCount": 1,
        "content": "1. Connect to Client1\n2. Open Settings\n3. Enable Remote Desktop\n4. Open “Select Users that can remotely access this PC”\n5. Add “Domain Users”\nNote: Remote Desktop Users is already added to “Allow log on through Remote Desktop Services” by default."
      },
      {
        "date": "2022-07-15T02:02:00.000Z",
        "voteCount": 1,
        "content": "You need to ensure that all the current and future users in the Active Directory domain can establish Remote Desktop connections to Client1. The solution must use the principle of least privilege.\nTo complete this task, sign in to the required computer or computers."
      },
      {
        "date": "2022-06-25T04:26:00.000Z",
        "voteCount": 1,
        "content": "add domain user to client1 remote desktop users"
      },
      {
        "date": "2022-02-17T02:07:00.000Z",
        "voteCount": 2,
        "content": "Guys this question states \"all the current and future users in the Active Directory domain\"  we are dealing with users in active directory domain who can remote to client 2 , we need to configure in the domain and also on client 2 computer."
      },
      {
        "date": "2021-09-06T09:13:00.000Z",
        "voteCount": 3,
        "content": "The solution must be applied only Client1 guys! The Correct is connect in Client1 and Add Domain Users (default domain group that have all users of domain) in Remote Desktop Users (default local group of Client1 that enable users to connect remotly in this PC).\nIt's very easy and simple. If you configure like the explanation, you will are enabling access remote for all users in all computers of domain and the principle of least privilege will be forgoted."
      },
      {
        "date": "2021-08-15T05:33:00.000Z",
        "voteCount": 1,
        "content": "So it seems the group policy OR the settings app routes are fine (according to comments)... I think the principle of least privilege is key and addressed by not going for Domain Users (Which was my feeling too) in the Remote Desktop Users group but rather selecting the Domain's Remote Desktop Users group.\nThe RDP config part though pretty much depends on if the Lab marking is clever enough to know the various ways to skin this cat?"
      },
      {
        "date": "2021-05-07T07:03:00.000Z",
        "voteCount": 1,
        "content": "Settings/System/Remote Desktop/User Accounts/Select users/Add Domain Users\n\nOR\n\ngpedit/computer configuration/windows settings/security settings/local policies/user rights assignment/allow log on through remote desktop services/add user or group/add domain users\n\nWhich is right?"
      },
      {
        "date": "2021-01-02T13:14:00.000Z",
        "voteCount": 1,
        "content": "do you also need to put domain administrators in too?"
      },
      {
        "date": "2020-10-26T21:58:00.000Z",
        "voteCount": 2,
        "content": "The solution does not address future users as well. It appears that the whole users group needs to be added to Remote Desktop Users in ADUC."
      },
      {
        "date": "2020-12-09T15:15:00.000Z",
        "voteCount": 3,
        "content": "I meant add  in domain users to the Remote Desktop Users in ADUC. This addresses the issue  of all current users and future users  being able to access Remote Desktop"
      },
      {
        "date": "2021-05-04T00:16:00.000Z",
        "voteCount": 1,
        "content": "...and don't forget to active Remote Desktop on computer 2 , not only add Domain Users in Remote Desktop Group."
      },
      {
        "date": "2020-11-02T03:16:00.000Z",
        "voteCount": 20,
        "content": "Settings – System – Remote Desktop – User Accounts – Select users… – Add Domain Users\n\nThis will be all users current or future as long as they are on the Domain."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 26,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35275-exam-md-100-topic-4-question-26-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0034000001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 11145882 -<br><img src=\"/assets/media/exam-media/04292/0034100001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/04292/0034200001.jpg\" class=\"in-exam-image\"><br>A web service installed on Client1 is used for testing.<br>You discover that users cannot connect to the web service by using HTTP.<br>You need to allow inbound HTTP connections to Client1.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "To create an inbound port rule -<br>1. Open the Group Policy Management Console to Windows Defender Firewall with Advanced Security.<br>2. In the navigation pane, click Inbound Rules.<br>3. Click Action, and then click New rule.<br>4. On the Rule Type page of the New Inbound Rule Wizard, click Custom, and then click Next.<br>5. On the Program page, click All programs, and then click Next.<br>6. On the Protocol and Ports page, select the protocol type that you want to allow. To restrict the rule to a specified port number, you must select either TCP or<br>UDP. Because this is an incoming rule, you typically configure only the local port number. TCP port 80. When you have configured the protocols and ports, click Next.<br>7. On the Scope page, you can specify that the rule applies only to network traffic to or from the IP addresses entered on this page. Configure as appropriate for your design, and then click Next.<br>8. On the Action page, select Allow the connection, and then click Next.<br>9. On the Profile page, select the network location types to which this rule applies, and then click Next.<br>10.On the Name page, type a name and description for your rule, and then click Finish.<br>Reference:<br>https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-firewall/create-an-inbound-port-rule https://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers",
    "votes": [],
    "comments": [
      {
        "date": "2021-02-10T21:33:00.000Z",
        "voteCount": 6,
        "content": "Why do we have to use a custom rule when it's easier to use a port rule?"
      },
      {
        "date": "2021-03-25T08:26:00.000Z",
        "voteCount": 1,
        "content": "I think author just copy paste from another site and change text a little bit. Because text has very misunderstand able phrases."
      },
      {
        "date": "2021-11-01T07:16:00.000Z",
        "voteCount": 6,
        "content": "Open Port 80 in the firewall on Computer1"
      },
      {
        "date": "2023-06-15T04:53:00.000Z",
        "voteCount": 1,
        "content": "How do I enable HTTP on Windows 10?\\11\nIf you are running Windows 10, this can be found via Programs and Features, then Turn Windows features on or off, then enabling Internet Information Services checkbox"
      },
      {
        "date": "2022-10-27T01:30:00.000Z",
        "voteCount": 1,
        "content": "just open port 80in the firewall"
      },
      {
        "date": "2021-03-25T08:16:00.000Z",
        "voteCount": 1,
        "content": "1. Open the Group Policy Management Console to Windows Defender Firewall with Advanced Security.\nThis point is very frustrating, cos Local Group Policy Management Editor has Windows Defender Firewall with Advanced Security under Computer configuration &gt; Windows Settings &gt; Security Settings, but Group Policy Management Console don't have it, you need to add new GPO before it."
      },
      {
        "date": "2021-03-25T08:23:00.000Z",
        "voteCount": 2,
        "content": "Is it right, do I need to add local group rule to PC with Web Service? \nMaybe we can just configure Windows Defender Firewall with Advanced Security through control panel?"
      },
      {
        "date": "2021-09-06T09:16:00.000Z",
        "voteCount": 2,
        "content": "Do you can configure firewall direct via control panel, the effect will be same."
      },
      {
        "date": "2021-08-15T05:40:00.000Z",
        "voteCount": 1,
        "content": "Agreed, the persistent route in using gpedit for everything is kinda annoying - since it forces us to remember the location of all the policy rules. Much easier to use the targeted tools to achieve the same. I've been allowing ports for years and years and have never done this using group policy..."
      },
      {
        "date": "2020-12-27T09:28:00.000Z",
        "voteCount": 2,
        "content": "7. On the Scope page, you can specify that the rule applies only to network traffic to or from the IP addresses entered on this page. Configure as appropriate for your design, and then click Next.\n\nDoesnt specify what we need to do"
      },
      {
        "date": "2021-03-25T08:29:00.000Z",
        "voteCount": 1,
        "content": "I think we just need to login to server and client and try to reach 80 port by telnet. \"telnet Server 80\" or open by browser server web services from clients. And apply necessary rules to fix the issue."
      },
      {
        "date": "2021-03-25T08:31:00.000Z",
        "voteCount": 2,
        "content": "It can be done by Windows Defender Firewall with Advanced Security from Control Panel / Local Group policy / GPO, no matter."
      },
      {
        "date": "2020-10-26T22:14:00.000Z",
        "voteCount": 1,
        "content": "You need to run ipconfig /all on Client1 to isolate the address range to enter into the firewall rule."
      },
      {
        "date": "2020-11-02T03:23:00.000Z",
        "voteCount": 10,
        "content": "It's a web service, so it is unlikely to need anything to be isolated as you won't know the IPs traffic is coming from most of the time. Plus, if you create a Port rule for inbound 80 HTTP traffic there isn't a need or request to enter an IP address (unless you choose to add a Custom rule)"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 27,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35324-exam-md-100-topic-4-question-27-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0034400001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 11145882 -<br><img src=\"/assets/media/exam-media/04292/0034500001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/04292/0034600001.jpg\" class=\"in-exam-image\"><br>Administrators report that they cannot use Event Viewer to remotely view the event logs on Client3.<br>You need to ensure that the administrators can access the event logs remotely on Client3. The solution must ensure that Windows Firewall remains enabled.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. Go to Control Panel -&gt; System and Security -&gt; Windows Firewall.<br>2. Click on the Advanced settings link in the left-hand side.<br><img src=\"/assets/media/exam-media/04292/0034700001.jpg\" class=\"in-exam-image\"><br>3. Enable COM+ Network Access (DCOM-In).<br><img src=\"/assets/media/exam-media/04292/0034700002.jpg\" class=\"in-exam-image\"><br>4. Enable all the rules in the Remote Event Log Management group.<br><img src=\"/assets/media/exam-media/04292/0034700003.jpg\" class=\"in-exam-image\"><br>Reference:<br>https://www.zubairalexander.com/blog/unable-to-access-event-viewer-on-a-remote-computer/",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-02T06:42:00.000Z",
        "voteCount": 13,
        "content": "The actual rules that work now with Windows 10 are \nRemote Event Log Management (The entire group)\nWindows Management Infrastructure (WMI - The entire group)\n\nCreate two inbound rules using the Predefined option, select each of the above and then select all the possible sub-categories. I've tested it and it works."
      },
      {
        "date": "2020-12-01T18:28:00.000Z",
        "voteCount": 1,
        "content": "YES better answer, but I was able to connect to the event  logs without enabling WMI. It is  a win 10 client not a server. Anyone else ?"
      },
      {
        "date": "2020-12-01T18:29:00.000Z",
        "voteCount": 1,
        "content": "All WMI incoming firewall rules on the client were disabled"
      },
      {
        "date": "2022-03-15T01:56:00.000Z",
        "voteCount": 1,
        "content": "All WMI incoming firewall rules are enabled in my computer"
      },
      {
        "date": "2020-12-08T04:11:00.000Z",
        "voteCount": 2,
        "content": "Isn't it Windows Management Instrumentation (WMI)?"
      },
      {
        "date": "2020-10-27T15:15:00.000Z",
        "voteCount": 7,
        "content": "Solution appears to be based on Windows 7 \nWin 10 – Performance Logs and Alerts (DCom-In) – Enable\nWin 10 – Remote Event Log Management   (NP-in)  - Enable (Domain Rule)"
      },
      {
        "date": "2020-12-12T14:18:00.000Z",
        "voteCount": 1,
        "content": "WRONG Rule: Note Named Pipe, it should be RPC for the right Network Profile"
      },
      {
        "date": "2020-12-27T09:30:00.000Z",
        "voteCount": 2,
        "content": "WRONG: RPC for public, wrong port"
      },
      {
        "date": "2020-12-14T18:19:00.000Z",
        "voteCount": 1,
        "content": "Yes \nRemote Event Log Management (The entire group)\nWindows Management Infrastructure (WMI - The entire group)"
      },
      {
        "date": "2022-09-27T00:29:00.000Z",
        "voteCount": 1,
        "content": "I've tested on Win10 19044 with : \nPerformance Logs and Alerts disabled \nWMI disabled \nRPC enabled \nIt worked without any problem"
      },
      {
        "date": "2022-12-16T03:48:00.000Z",
        "voteCount": 1,
        "content": "Tested in Windows 11 21H2.\nEnabled event log management rules on and then could successfully view remote event log with admin account."
      },
      {
        "date": "2022-10-19T11:33:00.000Z",
        "voteCount": 1,
        "content": "There are two application possibilities to resolve this lab.\n\nThe first is more invasive, less secure and does not use the principle of least privilege. It is necessary to access a session with the other machine. The problem with doing this in a professional environment is when you lose access to the remote computer and end up losing log data. In practical terms you can open a lot of ports by creating many rules and it will work fine.\n\nThe other, less invasive scenario, with the possibility of maintaining the organization of the logs and even saving copies of the machine's logs. I'm talking about Windows Event Subscription. The stream of events from a source to a collector is called a&nbsp;subscription.\n\nBased on the statement, it is understood that it is necessary to maintain a level of security, the Firewall must be activated. The first solution would still work here as you will keep the Firewall enabled. It doesn't hurt to look at the other scenario and try to use that in the lab."
      },
      {
        "date": "2023-02-08T18:51:00.000Z",
        "voteCount": 1,
        "content": "If we gonna apply the settings to all administrators, we must use Group Policy via mmc to set up a new inbound rule Firewall."
      },
      {
        "date": "2022-09-27T00:25:00.000Z",
        "voteCount": 3,
        "content": "It's not necessary to allow WMI, only the RPC is enough\nI've tested on Win10 19044"
      },
      {
        "date": "2022-08-31T04:47:00.000Z",
        "voteCount": 1,
        "content": "I would only enable Remote Event Log Management for the domain profile. Why enable the rest?"
      },
      {
        "date": "2022-08-24T02:24:00.000Z",
        "voteCount": 1,
        "content": "Only enabling FW rules Remote Event Log management worked in my environment."
      },
      {
        "date": "2022-07-08T19:09:00.000Z",
        "voteCount": 1,
        "content": "I tried it with Win10 v 1809. Only had to enable the group of Remote Event Log Management rules."
      },
      {
        "date": "2022-05-27T01:09:00.000Z",
        "voteCount": 1,
        "content": "Would enabling all inbound rules work? lol"
      },
      {
        "date": "2021-11-05T03:19:00.000Z",
        "voteCount": 5,
        "content": "Simply on source PC you need to have the WINRM enabled \nOn collector PC you need to have Event collector service started \n\nI got this info from the MD-100 Exam book and using the below link\nhttps://www.loggly.com/ultimate-guide/centralizing-windows-logs/"
      },
      {
        "date": "2021-10-28T03:48:00.000Z",
        "voteCount": 2,
        "content": "Open firewall inbound  --&gt; Remote Event log management (RPC)\nThat's all\n1. Open event viewer \n2. Connect to other computer --&gt; Another computer\n3. Connect as another user --&gt; administrator"
      },
      {
        "date": "2021-05-04T01:13:00.000Z",
        "voteCount": 2,
        "content": "For Remote Event Viewer :\n1  - configure 2 firewall exceptions : (Windows Remote Management (HTTP-in)  and (Romte Event Logs (RPC)\n2 - ensure that Service \"Windows Remote Manager\" is on \"Automatic\""
      },
      {
        "date": "2021-03-16T00:37:00.000Z",
        "voteCount": 2,
        "content": "Elevated command prompt on Client3: type \"winRM qc\" would this work?"
      },
      {
        "date": "2021-04-15T08:01:00.000Z",
        "voteCount": 1,
        "content": "I thought this too."
      },
      {
        "date": "2021-04-15T08:03:00.000Z",
        "voteCount": 1,
        "content": "Looking at the below link, it says that winrm qc only configures this for the current profile, so we would have to do this for all admins and doesnt work. It would reach the goal if it was for one user however.\n\nhttps://docs.microsoft.com/en-us/windows/win32/winrm/installation-and-configuration-for-windows-remote-management"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 28,
    "url": "https://www.examtopics.com/discussions/microsoft/view/37018-exam-md-100-topic-4-question-28-discussion/",
    "body": "SIMULATION -<br>Please wait while the virtual machine loads. Once loaded, you may proceed to the lab section. This may take a few minutes, and the wait time will not be deducted from your overall test time.<br>When the Next button is available, click it to access the lab section. In this section, you will perform a set of tasks in a live environment. While most functionality will be available to you as it would be in a live environment, some functionality (e.g., copy and paste, ability to navigate to external websites) will not be possible by design.<br>Scoring is based on the outcome of performing the tasks stated in the lab. In other words, it doesn't matter how you accomplish the task, if you successfully perform it, you will earn credit for that task.<br>Labs are not timed separately, and this exam may more than one lab that you must complete. You can use as much time as you would like to complete each lab.<br>But, you should manage your time appropriately to ensure that you are able to complete the lab(s) and all other sections of the exam in the time provided.<br>Please note that once you submit your work by clicking the Next button within a lab, you will NOT be able to return to the lab.<br><br>Username and password -<br><img src=\"/assets/media/exam-media/04292/0034900001.jpg\" class=\"in-exam-image\"><br>Use the following login credentials as needed:<br>To enter your password, place your cursor in the Enter password box and click on the password below.<br><br>Username: Contoso/Administrator -<br>Password: Passw0rd!<br>The following information is for technical support purposes only:<br><br>Lab Instance: 11145882 -<br><img src=\"/assets/media/exam-media/04292/0035000001.png\" class=\"in-exam-image\"><br><img src=\"/assets/media/exam-media/04292/0035100001.jpg\" class=\"in-exam-image\"><br>You have already prepared Client1 for remote management.<br>You need to forward all events from the Application event log on Client1 to DC1.<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "Configuring the event source computer<br>1. Run the following command from an elevated privilege command prompt on the Windows Server domain controller to configure Windows Remote Management: winrm qc -q<br>2. Start group policy by running the following command:<br>%SYSTEMROOT%\\System32\\gpedit.msc<br>3. Under the Computer Configuration node, expand the Administrative Templates node, then expand the Windows Components node, then select the Event<br>Forwarding node.<br>4. Right-click the SubscriptionManager setting, and select Properties. Enable the SubscriptionManager setting, and click the Show button to add a server address to the setting. Add at least one setting that specifies the event collector computer. The SubscriptionManager Properties window contains an Explain tab that describes the syntax for the setting.<br>5. After the SubscriptionManager setting has been added, run the following command to ensure the policy is applied: gpupdate /force<br>Configuring the event collector computer<br>1. Run the following command from an elevated privilege command prompt on the Windows Server domain controller to configure Windows Remote Management: winrm qc -q<br>2. Run the following command to configure the Event Collector service: wecutil qc /q<br>3. Create a source initiated subscription. This can either be done programmatically, by using the Event Viewer, or by using Wecutil.exe. If you use Wecutil.exe, you must create an event subscription XML file and use the following command: wecutil cs configurationFile.xml<br>Reference:<br>https://docs.microsoft.com/en-us/windows/win32/wec/setting-up-a-source-initiated-subscription#forwarding-the-security-log",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-08T21:14:00.000Z",
        "voteCount": 7,
        "content": "The source computer is Client1 not the Domain controller. The answer has  specified the source computer and the collector computer as the same computer"
      },
      {
        "date": "2022-02-08T01:40:00.000Z",
        "voteCount": 1,
        "content": "I agree that the link provided is quite confusing because it has the anchor \"#forwarding-the-security-log\" wrong. Try this with the correct anchor:\n\nhttps://docs.microsoft.com/en-us/windows/win32/wec/setting-up-a-source-initiated-subscription#setting-up-a-source-initiated-subscription-where-the-event-sources-are-in-the-same-domain-as-the-event-collector-computer"
      },
      {
        "date": "2020-11-14T15:52:00.000Z",
        "voteCount": 7,
        "content": "A much better, less confusing set of instructions can be found at https://docs.microsoft.com/en-us/advanced-threat-analytics/configure-event-collection"
      },
      {
        "date": "2022-02-08T01:46:00.000Z",
        "voteCount": 1,
        "content": "Thanks for the link with nice instructions but those are specific for Security events. The lab asks for Application events."
      },
      {
        "date": "2022-03-14T13:37:00.000Z",
        "voteCount": 3,
        "content": "The only difference is to step \nd. Click Select Events.\ni. Click By log and select Application."
      },
      {
        "date": "2022-10-19T15:51:00.000Z",
        "voteCount": 1,
        "content": "Follow these two articles in order and you will be fine. \n\nFirst article\nhttps://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/cc748890(v=ws.11)\n\nSecond article\nhttps://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/cc722010(v=ws.10)\n\nWhen you click to select the events you will see the Applications and Services logs. After that, do the folowing:\n\n1 - Right-click&nbsp;Forwarded Events in the left pane, and then select&nbsp;Create Custom View.\n2 - In the&nbsp;Create Custom View&nbsp;dialog box, leave it as it is and then select&nbsp;OK.\n3 - In the&nbsp;Save Filter to Custom View&nbsp;dialog box, in the&nbsp;Name&nbsp;box, type&nbsp;Application logs from Client1, and then select&nbsp;OK."
      },
      {
        "date": "2022-10-19T15:54:00.000Z",
        "voteCount": 1,
        "content": "When you click to select the events you will see the Windows Logs &gt; Application."
      },
      {
        "date": "2023-06-11T23:47:00.000Z",
        "voteCount": 1,
        "content": "Can we complete tasks by only following the steps provided in 2nd Article?"
      },
      {
        "date": "2020-12-12T14:29:00.000Z",
        "voteCount": 6,
        "content": "In a real live scenario, we should forward the Servers (Source/Forwarding) Eventlogs to Technician Computer (Client or Collector)"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 29,
    "url": "https://www.examtopics.com/discussions/microsoft/view/3571-exam-md-100-topic-4-question-29-discussion/",
    "body": "Your company has a wireless access point that uses WPA2-Enterprise.<br>You need to configure a computer to connect to the wireless access point.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a provisioning package in Windows Configuration Designer.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRequest a passphrase.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRequest and install a certificate.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Connection Manager Administration Kit (CMAK) package."
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://support.microsoft.com/en-za/help/17137/windows-setting-up-wireless-network",
    "votes": [
      {
        "answer": "C",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2019-09-06T15:27:00.000Z",
        "voteCount": 20,
        "content": "WPA2-Enterprise requires a server certificate validation, agreed with C"
      },
      {
        "date": "2019-08-14T01:57:00.000Z",
        "voteCount": 15,
        "content": "I would go with C"
      },
      {
        "date": "2020-05-21T06:33:00.000Z",
        "voteCount": 3,
        "content": "B is correct\nThe most common is that authentication is done by combining a password and a digital certificate, which can be stored on the hard drive itself (less secure) as well as on an external device, such as a flash drive or smart card.\n\ncarrying a certificate is something advanced. pass phrase is the first option"
      },
      {
        "date": "2022-10-23T07:06:00.000Z",
        "voteCount": 1,
        "content": "WPA2 Enterprise needs certificate"
      },
      {
        "date": "2022-03-03T08:14:00.000Z",
        "voteCount": 1,
        "content": "I will go for C"
      },
      {
        "date": "2022-02-14T01:54:00.000Z",
        "voteCount": 1,
        "content": "C is right"
      },
      {
        "date": "2021-08-08T06:20:00.000Z",
        "voteCount": 1,
        "content": "The key in the question is \"WPA2-Enterprise\"\n\nWPA2 Personal uses pre-shared keys (PSK) and is designed for home use. However, WPA2 Enterprise is specifically designed for use in organizations.\n\nhttp://www.summitdata.com/blog/wpa2-enterprise-vs-wpa2-personal/"
      },
      {
        "date": "2021-03-02T23:55:00.000Z",
        "voteCount": 3,
        "content": "I think B and C both are right answers. \nWPA2 Enterprise Mode can use Password, Certificate, Smart card or Biometric to authenticate."
      },
      {
        "date": "2020-11-14T16:32:00.000Z",
        "voteCount": 11,
        "content": "This question appeared in the official practice exam and the answer there was C"
      },
      {
        "date": "2021-05-04T02:41:00.000Z",
        "voteCount": 2,
        "content": "C is the recommanded method by MS (more secure than password)."
      },
      {
        "date": "2020-11-05T16:19:00.000Z",
        "voteCount": 3,
        "content": "C appears to be the better answer.\nNo user is mentioned in the question only a device (computer). \nUsers are assigned login credentials to enter when connecting to the network in WPA2-Enterprise\nUsers do not request a passphrase in WPA2-Enterprise, only in WPA2-Personal."
      },
      {
        "date": "2020-10-23T08:14:00.000Z",
        "voteCount": 1,
        "content": "It's definitely C. It's not a PSK."
      },
      {
        "date": "2020-10-08T03:43:00.000Z",
        "voteCount": 4,
        "content": "My take on this is that Enterprise normally uses RADIUS servers for authentication, so your username/password would already be setup and instituted, it would be the certificate that is left to install for the connection to work. So, C."
      },
      {
        "date": "2020-06-12T22:44:00.000Z",
        "voteCount": 6,
        "content": "The key phrase here is \"What should you do FIRST?\" I'd get the password first, then cert. \nAnswer B"
      },
      {
        "date": "2020-05-17T05:33:00.000Z",
        "voteCount": 2,
        "content": "C makes more sense"
      },
      {
        "date": "2020-04-30T06:06:00.000Z",
        "voteCount": 2,
        "content": "Answer is 'C'."
      },
      {
        "date": "2020-02-29T23:31:00.000Z",
        "voteCount": 2,
        "content": "B and C are likely. But the questions asks 'what should you do first?' So I'll settle for C"
      },
      {
        "date": "2020-02-26T03:06:00.000Z",
        "voteCount": 10,
        "content": "I'd go with B. First you get a passphrase and then you get the Certificate"
      },
      {
        "date": "2020-01-28T19:39:00.000Z",
        "voteCount": 2,
        "content": "A or C possibly.  I just checked Windows Configuration Designer and it allows certificates to be imported.  WCD does also create WiFi connections but only Open or WPA-personal"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 30,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6151-exam-md-100-topic-4-question-30-discussion/",
    "body": "A user named User1 has a computer named Computer1 that runs Windows 10.<br>User1 connects to a Microsoft Azure virtual machine named VM1 by using Remote Desktop.<br>User1 creates a VPN connection named VPN1 to connect to a partner organization.<br>When the VPN1 connection is established, User1 cannot connect to VM1. When User1 disconnects from VPN1, the user can connect to VM1.<br>You need to ensure that User1 can connect to VM1 while connected to VPN1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the proxy settings, add the IP address of VM1 to the bypass list to bypass the proxy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of VPN1, clear the Use default gateway on remote network check box.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of the Remote Desktop connection to VM1, specify a Remote Desktop Gateway (RD Gateway).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of VPN1, configure a static default gateway address."
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://www.stevejenkins.com/blog/2010/01/using-the-local-default-gateway-with-a-windows-vpn-connection/",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-04-25T15:08:00.000Z",
        "voteCount": 13,
        "content": "The answer is B. Google \"Split Tunneling\" - changing the default gateway to use a different one than the remote server (VPN) is one method of many to redirect certain traffic straight to the Internet while on VPN and other traffic to the internal network the VPN connects to. The VM1 is on Azure (cloud/internet) and the VPN firewall could be blocking access to the Internet. Split tunneling redirects all Internet traffic off the VPN and any internal network access through the VPN client connector."
      },
      {
        "date": "2022-03-12T11:30:00.000Z",
        "voteCount": 2,
        "content": "VPN Split Tunneling"
      },
      {
        "date": "2021-08-25T08:10:00.000Z",
        "voteCount": 1,
        "content": "The B answer mean that we need to clear the box, is it correct that ? I think that we need to set the box."
      },
      {
        "date": "2021-04-17T00:55:00.000Z",
        "voteCount": 2,
        "content": "I had to to think about this one for a second but I agree with B, when its connected to the VPN it is using the remote networks gateway and therefore cant communicate with VM1"
      },
      {
        "date": "2020-02-25T13:50:00.000Z",
        "voteCount": 1,
        "content": "I would like to understand better what this setting does :\n- the computer, when connected through a VPN, uses the VPN's gateway for routing ?"
      },
      {
        "date": "2020-03-05T04:13:00.000Z",
        "voteCount": 3,
        "content": "Yes, but not when option is unchecked."
      },
      {
        "date": "2020-01-02T09:44:00.000Z",
        "voteCount": 3,
        "content": "https://support.microsoft.com/en-za/help/317025/you-cannot-connect-to-the-internet-after-you-connect-to-a-vpn-server"
      },
      {
        "date": "2019-12-11T12:26:00.000Z",
        "voteCount": 1,
        "content": "Agreed @MD0000 - Every website I have searched says the answer is B. But why is the answer B?"
      },
      {
        "date": "2020-02-26T03:14:00.000Z",
        "voteCount": 2,
        "content": "Because the default gateway is on a different network"
      },
      {
        "date": "2019-10-06T07:25:00.000Z",
        "voteCount": 1,
        "content": "the question does not mention VPN1"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 31,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7754-exam-md-100-topic-4-question-31-discussion/",
    "body": "Your network contains an Active Directory domain. The domain contains a user named Admin1. All computers run Windows 10.<br>You enable Windows PowerShell remoting on the computers.<br>You need to ensure that Admin1 can establish remote PowerShell connections to the computers. The solution must use the principle of least privilege.<br>To which group should you add Admin1?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAccess Control Assistance Operators",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPower Users",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemote Desktop Users",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemote Management Users\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "Reference:<br>https://4sysops.com/wiki/enable-powershell-remoting/",
    "votes": [
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-10-08T03:55:00.000Z",
        "voteCount": 18,
        "content": "Remote Desktop Users group allows the use of Remote Desktop connections, not Remote Management, so the answer is most definitely D"
      },
      {
        "date": "2022-09-08T07:37:00.000Z",
        "voteCount": 1,
        "content": "The answer is D :\nPFA the link below\nhttp://woshub.com/powershell-remoting-via-winrm-for-non-admin-users/"
      },
      {
        "date": "2021-11-27T04:04:00.000Z",
        "voteCount": 2,
        "content": "D. Remote Management Users"
      },
      {
        "date": "2021-03-26T19:20:00.000Z",
        "voteCount": 4,
        "content": "Answer D : The built-in security group Remote Management Users is also allowed to use the default session configuration to create new PowerShell sessions."
      },
      {
        "date": "2021-03-24T07:22:00.000Z",
        "voteCount": 3,
        "content": "See the following technet info:\nhttp://technet.microsoft.com/en-us/library/dn579255.aspx#BKMK_WinRMRemoteWMIUsers_\n\n\"The WinRMRemoteWMIUsers_ group allows running Windows PowerShell commands remotely whereas the Remote Management Users group is generally used to allow users to manage servers by using the Server Manager console.\""
      },
      {
        "date": "2021-03-24T07:23:00.000Z",
        "voteCount": 2,
        "content": "Answer is correct."
      },
      {
        "date": "2020-09-04T17:25:00.000Z",
        "voteCount": 1,
        "content": "John,  if you couldn't find that  D is correct , did you find it about C!!!!!"
      },
      {
        "date": "2020-05-17T05:38:00.000Z",
        "voteCount": 4,
        "content": "D is the correct answer."
      },
      {
        "date": "2020-05-08T05:59:00.000Z",
        "voteCount": 2,
        "content": "Answer D is correct, use Google"
      },
      {
        "date": "2019-11-16T05:19:00.000Z",
        "voteCount": 4,
        "content": "https://4sysops.com/archives/powershell-remoting-without-administrator-rights/\n\nPowerShell Remoting without administrator rights\nWhen I said above that, by default, you have to be an administrator to work with PowerShell Remoting, I only told you half of the truth. Let’s check the default permissions:\n\n(Get-PSSessionConfiguration -Name Microsoft.PowerShell).Permission BUILTIN\\Administrators AccessAllowed, BUILTIN\\Remote Management Users AccessAllowed\n\nYou see the other half of the truth after the comma. The built-in security group Remote Management Users is also allowed to use the default session configuration to create new PowerShell sessions. (Note that the group was added with PowerShell 4.0.) Thus, all you have to do is add users to this security group.\n\n[...]\n\nThis also grants the user access to WMI resources over management protocols (such as WS-Management) on the machine where you added the user to Remote Management Users.\n\n[...]\n\nNote that the Remote Management Users group exists only on computers running Windows 8 (or Windows Server 2012) and above. If you are still running Windows 7 and Windows Server 2008, you have a problem (one of many)."
      },
      {
        "date": "2019-12-11T12:29:00.000Z",
        "voteCount": 2,
        "content": "So you are confirming that D is the correct answer?"
      },
      {
        "date": "2019-11-06T10:21:00.000Z",
        "voteCount": 2,
        "content": "Couldn't find anything referencing Remote Management Users group, only Remote Desktop Users. Answer should be C."
      },
      {
        "date": "2019-11-08T08:19:00.000Z",
        "voteCount": 1,
        "content": "Further clarification, the Remote Management Users group is not mentioned in the Sybex study material"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 32,
    "url": "https://www.examtopics.com/discussions/microsoft/view/3568-exam-md-100-topic-4-question-32-discussion/",
    "body": "You have 200 computers that run Windows 10 and are joined to an Active Directory domain.<br>You need to enable Windows Remote Management (WinRM) on all the computers by using Group Policy.<br>Which three actions should you perform? Each correct answer presents part of the solution.<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Startup Type of the Windows Remote Management (WS-Management) service to Automatic.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Windows Defender Firewall: Allow inbound Remote Desktop exceptions setting.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Allow remote server management through WinRM setting.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Windows Defender Firewall: Allow inbound remote administration exception setting.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Allow Remote Shell access setting.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet the Startup Type of the Remote Registry service to Automatic."
    ],
    "answer": "ACD",
    "answerDescription": "Reference:<br>http://www.mustbegeek.com/how-to-enable-winrm-via-group-policy/",
    "votes": [
      {
        "answer": "ACD",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2020-10-08T04:14:00.000Z",
        "voteCount": 34,
        "content": "If this question was asking for Remote Desktop access, I would agree with ABC, but because it's asking for WinRM access, ACD is correct.\n\nOption B would only allow access for RDP sessions, this would ignore things like Event Viewer connections, PowerShell and others."
      },
      {
        "date": "2021-03-24T07:43:00.000Z",
        "voteCount": 6,
        "content": "Yes, Answer is right. I don't understand why people always trying to guess the right answer - don't know, just google it.\nhttps://support.auvik.com/hc/en-us/articles/204424994-How-to-enable-WinRM-with-domain-controller-Group-Policy-for-WMI-monitoring"
      },
      {
        "date": "2019-08-14T00:42:00.000Z",
        "voteCount": 27,
        "content": "I think that ABC is correct."
      },
      {
        "date": "2021-03-24T07:44:00.000Z",
        "voteCount": 3,
        "content": "For example you can check here:\nhttps://support.auvik.com/hc/en-us/articles/204424994-How-to-enable-WinRM-with-domain-controller-Group-Policy-for-WMI-monitoring"
      },
      {
        "date": "2024-01-10T14:55:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2023-02-23T09:34:00.000Z",
        "voteCount": 1,
        "content": "Chatgpt:\nthe correct answers are A, C, and D. The other options (B, E, and F) are not necessary to enable WinRM through Group Policy."
      },
      {
        "date": "2023-02-08T21:42:00.000Z",
        "voteCount": 1,
        "content": "The answers are right. This question is so good that it must be used to solve the lab of question 27."
      },
      {
        "date": "2023-02-07T07:18:00.000Z",
        "voteCount": 1,
        "content": "A, B, C is correct. https://www.mustbegeek.com/how-to-enable-winrm-via-group-policy/\nStep by Step:\n1. Enable WinRM service (A)\n2. Enable the Allow remote server management through WinRM (C)\n3. Enable Firewall: Allow inbound remote administration exception (B)"
      },
      {
        "date": "2023-02-08T21:39:00.000Z",
        "voteCount": 1,
        "content": "D. Enable the Windows Defender Firewall: Allow inbound remote administration exception setting."
      },
      {
        "date": "2022-09-29T17:01:00.000Z",
        "voteCount": 1,
        "content": "Firewall do Windows: Permitir exceção à administração remota de entrada\n\n\nhttps://support.auvik.com/hc/en-us/articles/204424994-How-to-enable-WinRM-with-domain-controller-Group-Policy-for-WMI-monitoring"
      },
      {
        "date": "2021-11-27T04:08:00.000Z",
        "voteCount": 2,
        "content": "Think ACD is correct."
      },
      {
        "date": "2021-06-27T05:20:00.000Z",
        "voteCount": 4,
        "content": "Pleas dont guess, only good conclusions in the topic, you peaple makes this exam even harden than it is!"
      },
      {
        "date": "2021-05-04T03:07:00.000Z",
        "voteCount": 2,
        "content": "A C D : all is correct."
      },
      {
        "date": "2020-08-17T11:20:00.000Z",
        "voteCount": 1,
        "content": "ABC http://www.mustbegeek.com/how-to-enable-winrm-via-group-policy/"
      },
      {
        "date": "2020-10-08T04:17:00.000Z",
        "voteCount": 4,
        "content": "That link mentions nothing about Remote Desktop exceptions, so it can't be ABC, it has to be ACD going by the link you posted (which I believe is correct)"
      },
      {
        "date": "2021-03-24T07:47:00.000Z",
        "voteCount": 2,
        "content": "Please read provided article more carefully, there isn't info about inbound Remote DESKTOP extension."
      },
      {
        "date": "2020-04-30T06:07:00.000Z",
        "voteCount": 1,
        "content": "It is A, B, and C."
      },
      {
        "date": "2020-02-25T13:45:00.000Z",
        "voteCount": 3,
        "content": "It *is* ABC because D is concerning remote desktop settings, which is not related to WinRM"
      },
      {
        "date": "2019-09-06T15:48:00.000Z",
        "voteCount": 3,
        "content": "I think ACD is correct, the remote administration exception is a server option, it doesn't exist in the firewall predefined rules of Win10."
      },
      {
        "date": "2019-10-16T08:59:00.000Z",
        "voteCount": 1,
        "content": "\"D\" is a Remote Desktop (RDP as I understand) is it refers to wirm?"
      },
      {
        "date": "2019-08-30T05:07:00.000Z",
        "voteCount": 4,
        "content": "https://support.auvik.com/hc/en-us/articles/204424994-How-to-enable-WinRM-with-domain-controller-Group-Policy-for-WMI-monitoring"
      },
      {
        "date": "2020-11-17T04:55:00.000Z",
        "voteCount": 1,
        "content": "Whew that is a lot to take in, but a great tutorial!"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 33,
    "url": "https://www.examtopics.com/discussions/microsoft/view/55280-exam-md-100-topic-4-question-33-discussion/",
    "body": "Your network contains an Active Directory domain. The domain contains the objects shown in the following table.<br><img src=\"/assets/media/exam-media/04292/0035500001.png\" class=\"in-exam-image\"><br>The domain is configured to store BitLocker Drive Encryption (BitLocker) recovery passwords.<br>User1 encrypts an external disk on Computer1 by using BitLocker to Go.<br>User2 moves the external disk to Computer2 and unlocks the disk.<br>You need to view the BitLocker recovery password.<br>Which objects are used to store the recovery password?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tComputer1 and Computer2 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUser1 only\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tComputer1 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUser1 and Computer1 only",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tUser1 and User2 only"
    ],
    "answer": "C",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/windows/security/information-protection/bitlocker/bitlocker-and-adds-faq",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-07-27T06:54:00.000Z",
        "voteCount": 1,
        "content": "This is not a BitLocker question.\nThis is a BitLocker to Go question.\nWith BitLocker to Go encryption, the recovery key is not stored in the OU of the drive or AD. It must be saved by the user themselves when they encrypt.\n\nThe use of BitLocker to Go is officially deprecated.\nIn my opinion, it is unlikely that this question will be asked."
      },
      {
        "date": "2022-09-20T14:04:00.000Z",
        "voteCount": 2,
        "content": "RESPOSTA CORRETA: Quando um computador entra no modo de recuperação, o usuário deve digitar a senha de recuperação correta para continuar. A senha de recuperação está vinculada a um determinado TPM ou computador e não a um usuário individual.\nhttps://learn.microsoft.com/pt-br/training/modules/explore-device-encryption-features/4-recover-bitlocker-encrypted-drive"
      },
      {
        "date": "2022-04-04T16:55:00.000Z",
        "voteCount": 1,
        "content": "Answer seems correct\nWhen AD recovery passwords are backed up to AD, they can be accessed on the \"Bitlocker Recovery\" tab within the computer AD object\nhttps://docs.microsoft.com/en-us/windows/security/information-protection/bitlocker/bitlocker-use-bitlocker-recovery-password-viewer"
      },
      {
        "date": "2022-03-18T15:10:00.000Z",
        "voteCount": 1,
        "content": "You can store the recovery key on a file (hence computer 1) or on a usb or print the recovery key. DRA can be used as well. Would the answer not be user 1 and computer 1? Since user 1 is the one who ecrypted the drive?"
      },
      {
        "date": "2021-07-16T06:34:00.000Z",
        "voteCount": 1,
        "content": "You can backup recovery key on your computer 1 when you start to use BitLocker  Drive Encryption (BitLocker). so the answer is right."
      },
      {
        "date": "2021-07-01T12:09:00.000Z",
        "voteCount": 3,
        "content": "my last mabey if the key is stored in AD such as the question is telling. De key is importerd in AD and is in de Computer object. So answer is correct! Only computer 1"
      },
      {
        "date": "2021-06-27T05:51:00.000Z",
        "voteCount": 4,
        "content": "No, again the (only) mark is not correct in al options. \n\nYou can always do 'manage-bde -protectors D: -get' from all computers, and only user one must de crypt the drive first. \n\nTested on one USB with multiple computers"
      },
      {
        "date": "2021-06-13T21:57:00.000Z",
        "voteCount": 1,
        "content": "is the answer correct?"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 34,
    "url": "https://www.examtopics.com/discussions/microsoft/view/49127-exam-md-100-topic-4-question-34-discussion/",
    "body": "A user has a computer that runs Windows 10.<br>When the user connects the computer to the corporate network, the user cannot access the internal corporate servers. The user can access servers on the<br>Internet.<br>You run the ipconfig command and receive the following output.<br><img src=\"/assets/media/exam-media/04292/0035600001.png\" class=\"in-exam-image\"><br>You send a ping request and successfully ping the default gateway, the DNS servers, and the DHCP server.<br>Which configuration on the computer causes the issue?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe DNS servers",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe IPv4 address",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe subnet mask",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe default gateway address"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2021-04-04T23:41:00.000Z",
        "voteCount": 12,
        "content": "A - The first DNS the PC tries is an external DNS server."
      },
      {
        "date": "2022-04-26T04:40:00.000Z",
        "voteCount": 1,
        "content": "Check out the DHCP lease info, though.  It isn't one of the answers, but that was the first thing I saw."
      },
      {
        "date": "2022-04-26T04:41:00.000Z",
        "voteCount": 1,
        "content": "Hey moderator, delete both of mine on here.  I made a mistake in reading."
      },
      {
        "date": "2021-09-06T11:15:00.000Z",
        "voteCount": 7,
        "content": "it's ~always~ DNS!"
      },
      {
        "date": "2021-11-27T04:11:00.000Z",
        "voteCount": 1,
        "content": "A. the DNS servers"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 35,
    "url": "https://www.examtopics.com/discussions/microsoft/view/65387-exam-md-100-topic-4-question-35-discussion/",
    "body": "You have a computer named Computer1 that runs Windows 10. Computer1 is joined to an Active Directory domain named adatum.com. The domain contains two groups named Group1 and Group2.<br>Computer1 contains a folder named C:\\Folder1 that has the file permissions shown in the following table.<br><img src=\"/assets/media/exam-media/04292/0035700001.png\" class=\"in-exam-image\"><br>You need to share C:\\Folder1. The solution must ensure that the members of Group2 can access all the files in the share.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom File Explorer, use Network File and Folder Sharing. Assign the Read permission to Group2.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom File Explorer, use Advanced Sharing. Assign the Read share permission to Group2.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Control Panel, use Advanced sharing settings. Configure file and printer sharing for the network profile of the domain.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAt a command prompt, run the net share Share=C:\\Folder1 /grant:adatum\\group2,read command."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 13,
        "isMostVoted": true
      },
      {
        "answer": "D",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2023-03-27T12:09:00.000Z",
        "voteCount": 1,
        "content": "D is the only answer where Folder1 is mentioned. And the syntax does the job."
      },
      {
        "date": "2023-03-11T06:25:00.000Z",
        "voteCount": 1,
        "content": "share Share=C:\\Folder1 /grant:adatum\\group2,read command works. Only group2 will have read access via the share. NTFS permissions is default domein users read and execute"
      },
      {
        "date": "2023-02-23T09:43:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is B. From File Explorer, use Advanced Sharing. Assign the Read share permission to Group2.\n\nExplanation:\n\nTo share C:\\Folder1 with the members of Group2, you need to perform the following steps:\n\nRight-click on the C:\\Folder1 and select Properties.\nIn the Properties dialog box, click on the Sharing tab.\nClick on the Advanced Sharing button"
      },
      {
        "date": "2023-02-22T14:43:00.000Z",
        "voteCount": 1,
        "content": "Considering we have no info about inheritance, cant we assume that Folder1 has default NTFS permissions? In this case all Users would have the Read permission by default, so you only need to give Group 2 the Share Permissions, or am I thinking this wrong?"
      },
      {
        "date": "2023-04-30T19:20:00.000Z",
        "voteCount": 1,
        "content": "I think it would be best to assume that the permissions on Folder1 are the only permissions that are specifically outlined in the question. \n\nHence why I choose D"
      },
      {
        "date": "2023-04-30T19:22:00.000Z",
        "voteCount": 1,
        "content": "nvm I take my statement back on D being right"
      },
      {
        "date": "2022-10-22T18:40:00.000Z",
        "voteCount": 3,
        "content": "Correct answer A\n\nBe aware that Network File and Folder Sharing modifies file permissions and share permissions. However, the Advanced Sharing feature does not modify file permissions, and only sets share permissions."
      },
      {
        "date": "2022-10-22T19:56:00.000Z",
        "voteCount": 1,
        "content": "net share Share=C:\\Folder1 /GRANT:Contoso.com\\Group2,read\n\nThis command only sets up a share permission leaving NTFS permissions empty and Group2 won’t have access at all.\n\nI quote the statement: “The solution must ensure that the members of Group2 can access all the files in the share.”"
      },
      {
        "date": "2022-10-11T14:20:00.000Z",
        "voteCount": 1,
        "content": "Resposta Correta: D\nhttps://learn.microsoft.com/pt-br/training/modules/configure-manage-shared-folders/3-examine-methods-available-connecting-share-folders"
      },
      {
        "date": "2022-09-29T18:01:00.000Z",
        "voteCount": 1,
        "content": "Resposta Correta: D\nnet share DataShare=d:\\Data /grant:Computer1\\User1,read\n\n\n\nhttps://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh750728(v=ws.11)#examples"
      },
      {
        "date": "2022-04-04T16:35:00.000Z",
        "voteCount": 3,
        "content": "Just tesed D and it does not give NTFS permissions, only share permissions\nA gives both in one action"
      },
      {
        "date": "2022-03-25T08:34:00.000Z",
        "voteCount": 2,
        "content": "What happens on the exam in situations like this where answers are disputed between what is given and the community's consensus?  Is the given answer taken as the correct answer on the exam, or is the community's answer given?  Thank You!"
      },
      {
        "date": "2022-04-16T12:29:00.000Z",
        "voteCount": 1,
        "content": "Considering we have no idea where the answers are coming from, I would lean toward the consensus."
      },
      {
        "date": "2022-03-12T11:35:00.000Z",
        "voteCount": 4,
        "content": "Definitely A"
      },
      {
        "date": "2022-01-18T05:47:00.000Z",
        "voteCount": 3,
        "content": "A is the correct answer"
      },
      {
        "date": "2022-01-01T12:10:00.000Z",
        "voteCount": 2,
        "content": "D is incorrect. The correct Answer is A."
      },
      {
        "date": "2021-11-30T00:51:00.000Z",
        "voteCount": 3,
        "content": "A is using the simple sharing which will grant the share permission and NTFS permission at the same time."
      },
      {
        "date": "2021-11-27T04:20:00.000Z",
        "voteCount": 1,
        "content": "I dont get this one. :/"
      },
      {
        "date": "2022-09-17T01:50:00.000Z",
        "voteCount": 1,
        "content": "WTF :("
      },
      {
        "date": "2021-11-21T03:22:00.000Z",
        "voteCount": 1,
        "content": "Why is this D and not A or B? Is it simply because cmd is generally accepted as the \"quickest way\" to get things done?"
      },
      {
        "date": "2021-12-27T00:56:00.000Z",
        "voteCount": 3,
        "content": "advanced sharing can grant share permission, but can't grant NTFS permission. Normal Sharing will grant the share permission and NTFS permission at the same time."
      },
      {
        "date": "2021-11-13T03:47:00.000Z",
        "voteCount": 3,
        "content": "A i correct"
      },
      {
        "date": "2021-11-03T07:38:00.000Z",
        "voteCount": 2,
        "content": "I just tested this in Lab, none of the answers seem correct since you are missing NTFS rights.\nHowever if you select a user/group using the \"Network File and Folder Sharing\" option, it actually adds that user/group to the NTFS entry?\n\nSo A is correct in my opnion."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 36,
    "url": "https://www.examtopics.com/discussions/microsoft/view/65893-exam-md-100-topic-4-question-36-discussion/",
    "body": "You are troubleshooting the network connectivity of a computer that runs Windows 10. The computer is connected physically to the network but rejects network traffic from an external source.<br>You need to reinstall the TCP/IP stack on the computer.<br>What should you run?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe netsh int ip reset command",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe Reset-NetAdapterAdvancedProperty cmdlet",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe netcfg -d command",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tthe Debug-NetworkController cmdlet"
    ],
    "answer": "A",
    "answerDescription": "Reference:<br>https://howtofix.guide/reset-tcp-ip/",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-12T06:15:00.000Z",
        "voteCount": 5,
        "content": "Correct answer: https://support.microsoft.com/en-us/topic/how-to-reset-tcp-ip-by-using-the-netshell-utility-d954430c-9b11-43f0-6081-0fc9235a8b4a\n\nWhen you run the reset command, it overwrites the following registry keys, both of which are used by TCP/IP:\n\n\nSYSTEM\\CurrentControlSet\\Services\\Tcpip\\Parameters \nSYSTEM\\CurrentControlSet\\Services\\DHCP\\Parameters\n\nThis has the same effect as removing and reinstalling TCP/IP."
      },
      {
        "date": "2022-12-19T07:49:00.000Z",
        "voteCount": 1,
        "content": "Netsh int ip reset – restores the Internet Protocol Settings to the default value\nReset-NetAdapterAdvancedProperty - Resets the advanced properties of a network adapter to their factory default values. advanced property for the network adapter. The intention is that network adapter manufacturers can use this cmdlet to manage advanced properties that are not directly supported by Windows Server® 2012 and later. This cmdlet is the cmdlet in the network adapter family that creates a registry key. \nnetcfg  - Installs the Windows Preinstallation Environment (WinPE), a lightweight version of Windows used to deploy workstations. -d -no parametrs\nDebug-NetworkController cmdlet queries a Network Controller for detailed diagnostic information."
      },
      {
        "date": "2022-03-17T11:59:00.000Z",
        "voteCount": 1,
        "content": "Answer is A:  netsh int ip reset command \nhttps://www.microcenter.com/tech_center/article/11293/how-to-reset-tcp-ip-stack-in-windows-10"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 37,
    "url": "https://www.examtopics.com/discussions/microsoft/view/35783-exam-md-100-topic-4-question-37-discussion/",
    "body": "HOTSPOT -<br>You have a computer that runs Windows 10.<br>From the Settings app, you view the connection properties shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0035900001.png\" class=\"in-exam-image\"><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0036000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0036000002.png\" class=\"in-exam-image\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-12-06T19:13:00.000Z",
        "voteCount": 25,
        "content": "1.WinRM firewall exception rules also cannot be enabled on a public network. \n2. By default, Windows 10 will automatically pause sync when the device is on a&nbsp;metered Ethernet&nbsp;or&nbsp;metered wireless&nbsp;network."
      },
      {
        "date": "2021-03-20T03:25:00.000Z",
        "voteCount": 1,
        "content": "Yes, but on image this setting is already turned off..."
      },
      {
        "date": "2021-03-24T07:53:00.000Z",
        "voteCount": 3,
        "content": "nevermind, answer is correct."
      },
      {
        "date": "2023-04-30T19:27:00.000Z",
        "voteCount": 1,
        "content": "I had a double take as well.\n\nSo many questions require me to look at them three times to make sure I don't miss anything sometimes."
      },
      {
        "date": "2020-11-02T07:19:00.000Z",
        "voteCount": 14,
        "content": "For those of you who may not have known about the first option: http://www.hurryupandwait.io/blog/fixing-winrm-firewall-exception-rule-not-working-when-internet-connection-type-is-set-to-public"
      },
      {
        "date": "2020-11-19T18:11:00.000Z",
        "voteCount": 1,
        "content": "Thank you, I actually had no idea."
      },
      {
        "date": "2022-05-21T05:28:00.000Z",
        "voteCount": 1,
        "content": "2. Obviously depending on your settings in onedrive."
      },
      {
        "date": "2021-11-13T03:53:00.000Z",
        "voteCount": 2,
        "content": "Answer is correct"
      },
      {
        "date": "2021-08-29T07:27:00.000Z",
        "voteCount": 1,
        "content": "What would be the final answer and justification?"
      },
      {
        "date": "2021-07-26T07:07:00.000Z",
        "voteCount": 1,
        "content": "For me\n1. you must to run command WinRM qc at command prompt (https://docs.microsoft.com/en-us/troubleshoot/windows-server/remote/how-to-enable-windows-remote-shell).\nSecond answer is ok."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 38,
    "url": "https://www.examtopics.com/discussions/microsoft/view/6083-exam-md-100-topic-4-question-38-discussion/",
    "body": "You have 15 computers that run Windows 10. Each computer has two network interfaces named Interface1 and Interface2.<br>You need to ensure that network traffic uses Interface1, unless Interface1 is unavailable.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-NetIPInterface ג€\"InterfaceAlias Interface1 ג€\"InterfaceMetric 1 command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Set-NetAdapterBinding ג€\"Name Interface2 ג€\"Enabled $True ג€\"ComponentID ms_tcpip ג€\"ThrottleLimit 0 command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet a static IP address on Interface 1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Network Connections in Control Panel, modify the Provider Order."
    ],
    "answer": "A",
    "answerDescription": "Reference:<br>https://tradingtechnologies.atlassian.net/wiki/spaces/KB/pages/27439127/How+to+Change+Network+Adapter+Priorities+in+Windows+10 https://docs.microsoft.com/en-us/powershell/module/nettcpip/set-netipinterface?view=win10-ps",
    "votes": [],
    "comments": [
      {
        "date": "2021-09-24T03:58:00.000Z",
        "voteCount": 17,
        "content": "Literally nothing like this was covered in the course I used! :("
      },
      {
        "date": "2022-01-10T00:27:00.000Z",
        "voteCount": 13,
        "content": "Welcome to the inscrutable ways of Microsoft exams."
      },
      {
        "date": "2019-12-11T12:35:00.000Z",
        "voteCount": 12,
        "content": "A is correct"
      },
      {
        "date": "2021-02-21T09:45:00.000Z",
        "voteCount": 6,
        "content": "Set-NetIPInterface -InterfaceIndex \"13\" -InterfaceMetric \"10\"\nAdapters with a lower InterfaceMetric number are prioritized over adapters that have a higher number.\nUse the command Get-NetIPInterface to list the adapter information table again to verify the change."
      },
      {
        "date": "2020-07-12T09:51:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/nl-nl/windows-server/networking/technologies/network-subsystem/net-sub-interface-metric"
      },
      {
        "date": "2019-11-06T12:42:00.000Z",
        "voteCount": 1,
        "content": "A would be correct if the interfacemetric 1 happens to point to a different network. If not the answer would be D."
      },
      {
        "date": "2019-10-03T18:33:00.000Z",
        "voteCount": 1,
        "content": "https://tradingtechnologies.atlassian.net/wiki/spaces/KB/pages/27439127/How+to+Change+Network+Adapter+Priorities+in+Windows+10"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 39,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64514-exam-md-100-topic-4-question-39-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain. The domain contains the users shown in the following table.<br><img src=\"/assets/media/exam-media/04292/0036100001.png\" class=\"in-exam-image\"><br>You have a server named Server1 that runs Windows Server 2019 and has the Windows Deployment Services role installed. Server1 contains an x86 boot image and three Windows 10 install images. The install images are shown in the following table.<br><img src=\"/assets/media/exam-media/04292/0036200001.png\" class=\"in-exam-image\"><br>You purchase a computer named Computer1 that is compatible with the 64-bit version of Windows 10.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0036200002.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0036300001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://techdirectarchive.com/2020/09/14/error-0xc1510111-you-do-not-have-permissions-to-mount-and-modify-this-image/",
    "votes": [],
    "comments": [
      {
        "date": "2022-01-25T12:56:00.000Z",
        "voteCount": 9,
        "content": "My 2 cents...\nFirst answer:\nNo because user1 doesn't have read permissions on the install image\nSecond answer:\nNo because WDSServer doesn't have full control on the install image\nThird answer:\nNo because the machine is x64 meaning it's delivered with UEFI firmware and not legacy BIOS. X86 boot images can deploy x86/x64 install images only to systems with legacy BIOS."
      },
      {
        "date": "2023-03-11T06:57:00.000Z",
        "voteCount": 1,
        "content": "https://social.technet.microsoft.com/wiki/contents/articles/11827.securing-installation-images-in-windows-deployment-services-wds.aspx"
      },
      {
        "date": "2022-01-22T02:32:00.000Z",
        "voteCount": 6,
        "content": "https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/jj648426(v=ws.11)#prerequisites-for-installing-an-install-image\n\nThis article explains that \"A local user account must be a created on the Windows Deployment Services server\" and one of the steps is \"At the Connect to Your WDS Server authentication dialog, enter your local user account and password\".\n\nIn my opinion the answer is NO, NO, NO because User1 and User2 were not created on the Windows Deployment Services server, they are just in the Domain."
      },
      {
        "date": "2022-04-16T13:28:00.000Z",
        "voteCount": 1,
        "content": "The way question switches to User2 makes me think they are trying to get you on it being x86... WDSServer has full control, Group2 has read.. but the x86 would be incompatible. Based on that I agree with PiPE on the reasoning for the first two answers being No..  To your point about needing a local acct on the WDS Server.. I noticed the article linked is for 2012.. i dug a bit and found this how-to for 2019.. it seems to just be asking for a domain account (with appropriate permissions i guess).. Either way, NO, NO, NO looks ok to me"
      },
      {
        "date": "2022-04-16T13:31:00.000Z",
        "voteCount": 1,
        "content": "https://www.itechguides.com/install-windows-10-from-network/"
      },
      {
        "date": "2023-05-03T11:21:00.000Z",
        "voteCount": 1,
        "content": "It's simply no, no ,no because there is no x64 bit image on the WDS server only an x86 boot image and 3 W10 images. This makes all the permissions not relevant."
      },
      {
        "date": "2022-10-25T02:21:00.000Z",
        "voteCount": 2,
        "content": "Great question, but very difficult to solve if you don't have a way to set up a lab and test it yourself. I have spent hours building up the lab and testing the WDS with the user permissions.\n\nThis question has the exact answer from examtopics. No doubts. Now, a very important thing happens in the second statement: User2 can see the installation on the Windows installation screen, but he cannot install because he gets an error the exact momento he clicks next to install referring to the WDSServer group that does not have permission.\n\nWDS at the time I'm solving this question is being deprecated as it doesn't install Windows 11. Windows 10 can still be installed without any problem.\n\nhttps://learn.microsoft.com/en-us/windows/deployment/wds-boot-support"
      },
      {
        "date": "2022-10-25T02:23:00.000Z",
        "voteCount": 1,
        "content": "Just forget about Read-only. Read-only has nothing to do with this question. But it is good to know."
      },
      {
        "date": "2022-01-12T14:08:00.000Z",
        "voteCount": 1,
        "content": "No, Yes, No. Installing an image doesn't require write access"
      },
      {
        "date": "2021-11-23T04:25:00.000Z",
        "voteCount": 4,
        "content": "Answer is NO, NO, NO because mounting the images requires read and write permission. Since none of the users have both r+w, the answer is NO."
      },
      {
        "date": "2021-10-22T02:10:00.000Z",
        "voteCount": 1,
        "content": "Why would User1 not be able to install Image1 on Computer1 by using WDS? Aren't the architecture type of a boot image and install-image separate from each other? Or should the architecture type be equal to each other?"
      },
      {
        "date": "2021-11-15T03:23:00.000Z",
        "voteCount": 1,
        "content": "I think because Group 1 is missing from User permissions"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 40,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66073-exam-md-100-topic-4-question-40-discussion/",
    "body": "Your network contains an Active Directory domain. The domain contains 10 computers that run Windows 10. Users in the finance department use the computers.<br>You have a computer named Computer1 that runs Windows 10.<br>From Computer1, you plan to run a script that executes Windows PowerShell commands on the finance department computers.<br>You need to ensure that you can run the PowerShell commands on the finance department computers from Computer1.<br>What should you do on the finance department computers?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the local Group Policy, enable the Allow Remote Shell Access setting.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the local Group Policy, enable the Turn on Script Execution setting.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Windows PowerShell, run the Enable-MMAgent cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Windows PowerShell, run the Enable-PSRemoting cmdlet.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-11-28T05:50:00.000Z",
        "voteCount": 5,
        "content": "D. From the Windows PowerShell, run the Enable-PSRemoting cmdlet."
      },
      {
        "date": "2024-01-11T09:12:00.000Z",
        "voteCount": 1,
        "content": "Correct"
      },
      {
        "date": "2022-09-06T13:24:00.000Z",
        "voteCount": 1,
        "content": "D. Is correct\nhttps://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/enable-psremoting?view=powershell-6"
      },
      {
        "date": "2021-11-15T06:04:00.000Z",
        "voteCount": 1,
        "content": "Obviously correct answer."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 41,
    "url": "https://www.examtopics.com/discussions/microsoft/view/84082-exam-md-100-topic-4-question-41-discussion/",
    "body": "Your company has a branch office that contains 25 workgroup computers. The computers run Windows 10 Pro.<br>Users report that they cannot see other computers from Network in File Explorer.<br>What should you do to resolve the issue?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet Network profile to Private.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tTurn off random hardware addresses for the network connection.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tSet Network profile to Public.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure the network connection as a metered connection."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-12-17T04:16:00.000Z",
        "voteCount": 3,
        "content": "After testing in a lab environment I can conclude this is A.\nWhen the device profile was set to Private I could see my other client via File Explorer- &gt;Network. When it was on set to public, there was no client visible.\nPublic: your device is not discoverable. \nPrivate: your device is discoverable on the network"
      },
      {
        "date": "2022-10-01T23:46:00.000Z",
        "voteCount": 2,
        "content": "never mind me had an idiot moment"
      },
      {
        "date": "2022-09-29T23:51:00.000Z",
        "voteCount": 2,
        "content": "Shouldn't this be C? since you want to see the computer on the network?"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 42,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79082-exam-md-100-topic-4-question-42-discussion/",
    "body": "HOTSPOT -<br>You have the network shown in the following exhibit.<br><img src=\"/assets/media/exam-media/04292/0036500001.jpg\" class=\"in-exam-image\"><br>Computer1, Computer2, and Computer3 run Windows 10. Windows Defender Firewall is configured to allow ICMP traffic.<br>RTR1 is a router.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0036600001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0036600002.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Yes -<br>Through RTR1 which has been configured as the default gateway for Comptuer1.<br><br>Box 2: Yes -<br>Through RTR1 which has been configured as the default gateway for Comptuer1.<br><br>Box 3: No -<br>Computer3 has not been configured with a default gateway.",
    "votes": [],
    "comments": [
      {
        "date": "2022-09-01T09:49:00.000Z",
        "voteCount": 16,
        "content": "Yes, No, Yes for me.\n\nNo for tbe 2nd because computer 3 has no gateway."
      },
      {
        "date": "2022-09-08T20:06:00.000Z",
        "voteCount": 1,
        "content": "So why is the third question Yes?"
      },
      {
        "date": "2022-09-10T04:51:00.000Z",
        "voteCount": 8,
        "content": "Because it's the same network. you don't need a gateway.\nyes, no, yes for me too."
      },
      {
        "date": "2022-12-21T01:33:00.000Z",
        "voteCount": 1,
        "content": "They only need default gateway configured when the sender and receiver are separated by a router."
      },
      {
        "date": "2023-03-16T19:24:00.000Z",
        "voteCount": 1,
        "content": "YES, YES, YES.  I see people concerned about 3 not having gateway?  Doesn't need it unless it's trying to reach another computer and it has to be on another subnet.   Y,Y,Y is the correct answer (given that the router allows the ICMP packets)."
      },
      {
        "date": "2023-03-08T11:45:00.000Z",
        "voteCount": 1,
        "content": "Answer is Yes, No, Yes.\n1. Yes, because the router between the two indiffirent networks will build the routes, if your gateway points to your subnet gateway then you will get a reply\n2. No - because computer3 does not have a gateway it cannot allow the router to route the traffic\n3. Yes - because computer2 and 3 are on the same subnet - no gateway/router is required to translate routes."
      },
      {
        "date": "2022-12-21T01:32:00.000Z",
        "voteCount": 3,
        "content": "Y: From computer1 to computer2 via router1 and reply goes back through router1.\nN: From computer1 gets to computer3 via router1 but can't send reply since default gateway is not configured and sender is behind the router.\nY: From computer2 to computer3 works since they are not separated by a router, therefore default gateway must not be configured for this ping.\n\nAll my answers were tested in a lab environment, above statements are objective."
      },
      {
        "date": "2022-11-18T06:14:00.000Z",
        "voteCount": 1,
        "content": "whats the right answer here?"
      },
      {
        "date": "2022-11-11T13:21:00.000Z",
        "voteCount": 1,
        "content": "Networking is not my strongest. Now I am very confused, because there is no consensus in the discussion. Does anyone know the right answer for certain?"
      },
      {
        "date": "2023-04-30T19:45:00.000Z",
        "voteCount": 1,
        "content": "Trust me, you need a gateway to speak to other subnets. \nYes, No, Yes for me. Even if I see the question on the test this is what I am doing."
      },
      {
        "date": "2022-10-28T03:56:00.000Z",
        "voteCount": 3,
        "content": "Yes, No, No\ncomputer 3 has no gateway so 2 en 3 are No"
      },
      {
        "date": "2022-12-04T04:52:00.000Z",
        "voteCount": 2,
        "content": "A gateway is only needed to get passed the Router/ out of the broadcastdomain, so anything in one broadcastdomain (10.10.1.x) can ping eachother. Therefore Q3 is Yes. \n\nAlso Q2 is NO because comp1 and comp3 are NOT in the same broadcastdomain, thus need a Gateway to communicate, which comp3 doesn't have. \nSee a gateway like the front door of your house, anything internal you can go (bathroom, livingroom bedroom etc) but without a front door (gateway) you cant go to the mall, park etc."
      },
      {
        "date": "2022-12-04T05:06:00.000Z",
        "voteCount": 1,
        "content": "Also i believe for Q2, if it would have asked is comp3 able to receive the ping of comp1 then YES. The ping of comp 1 will reach comp3, but comp3 is unable to send an acknowledgement back that it has received the ping. A ping is like a shout \"who has?\" and comp3 hears it but cant shout back \"I have!\". I think a /traceroute would confirm this. This is all basic stuff covered in the CCNA course."
      },
      {
        "date": "2022-11-03T12:41:00.000Z",
        "voteCount": 1,
        "content": "I agree. Barrybobslee is contradicting himself."
      },
      {
        "date": "2023-07-04T08:27:00.000Z",
        "voteCount": 1,
        "content": "He has right. It the base of the networking."
      },
      {
        "date": "2023-07-04T08:27:00.000Z",
        "voteCount": 1,
        "content": "he is right*"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 43,
    "url": "https://www.examtopics.com/discussions/microsoft/view/81052-exam-md-100-topic-4-question-43-discussion/",
    "body": "HOTSPOT -<br>You have computers that run Windows 10 as shown in the following table.<br><img src=\"/assets/media/exam-media/04292/0036700001.jpg\" class=\"in-exam-image\"><br>CLIENT1 has the following IP configuration.<br><img src=\"/assets/media/exam-media/04292/0036700002.jpg\" class=\"in-exam-image\"><br>From CLIENT1, you ping CLIENT2 and CLIENT3 successfully, but when you ping CLIENT4, you get a Request timed out response. From CLIENT3, you ping<br>CLIENT4 successfully.<br>Which computer and setting are misconfigured? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0036800001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0036900001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Client4 -<br><br>Box 2: Subnet mask -<br>By exclusion.",
    "votes": [],
    "comments": [
      {
        "date": "2023-06-08T08:53:00.000Z",
        "voteCount": 1,
        "content": "Client 1 can reach client 4 as it's on the same subnet /24 (.1-254).  If client 4 has a /25 or more subnet mask, it thinks it's on a different subnet (maybe 128-254 with a /25).  client 3 can still reach client 4 as it has a .250 which is pretty close.  So, client 4 subnet mask is incorrect (not /24 or 255.255.255.0)"
      },
      {
        "date": "2023-04-05T11:04:00.000Z",
        "voteCount": 1,
        "content": "This question doesn't make any sense. That client1 can communicate is with the assumption that client2 is behind a router on a different subnet. The other clients are most likely on the same subnet, then gateway is not required. Leaving IP adres and subnet left. These seem to be valid because client3 can communicate with client4."
      },
      {
        "date": "2022-12-17T04:25:00.000Z",
        "voteCount": 1,
        "content": "In this question the given IP address and subnet mask(/24) gives this range: 192.168.0.1 - 192.168.0.254.\nClient2 has 192.168.1.x meanining he is not part of this subnet, therefore he is the wrong one due to the subnet mask. If we change the subnet mask we can extend the range until 192.168.1.x fits in."
      },
      {
        "date": "2022-12-17T04:26:00.000Z",
        "voteCount": 1,
        "content": "Or you can just change the IP address of client 2. :)"
      },
      {
        "date": "2022-11-30T14:22:00.000Z",
        "voteCount": 1,
        "content": "i dont get this. Client2 is the only one that isent in the same subnet as the rest. something is wrong here."
      },
      {
        "date": "2022-10-27T08:00:00.000Z",
        "voteCount": 3,
        "content": "I believe there is a typo in this question. It is impossible to CLIENT1 to communicate with CLIENT2 with that subnet mask of 255.255.255.0. CLIENT1 should has 255.255.0.0 to communicate with CLIENT2."
      },
      {
        "date": "2022-10-27T08:55:00.000Z",
        "voteCount": 3,
        "content": "Based on what I just said, I realized that CLIENT2 is the misconfigured because of subnet mask of 255.255.0.0.\n\nThe only possible way to CLIENT1 communicate with CLIENT2 is that if CLIENT2 has 255.255.0.0 (192.168.x.x).\n\nCLIENT4 won't communicate with CLIENT1 because of any other issue, Firewall, for example."
      },
      {
        "date": "2023-02-11T00:04:00.000Z",
        "voteCount": 2,
        "content": "After 3 months later, I think, I came up with a solution and examtopics is right.\n\nMisconfigured computer: CLIENT4\nAs CLIENT1 pings all other machines, so the wrong configuration is on CLIENT4.\n\nMisconfigured setting: Subnet mask\nThe only way for CLIENT1 not to see CLIENT4 is a mismatched subnet mask. Both have the same prefix, so only a mismatched subnet mask."
      },
      {
        "date": "2023-02-27T14:47:00.000Z",
        "voteCount": 1,
        "content": "Wouldn't CLIENT3 also fail in this case? \n\nIf CLIENT 1 can ping CLIENT3, I assume both have the correct subnet mask.\n\nBut if CLIENT4 has a different Subnet mask, CLIENT3 would also fail to ping it, wouldn't it?"
      },
      {
        "date": "2023-02-11T00:14:00.000Z",
        "voteCount": 1,
        "content": "or CLIENT1 won't ping CLIENT4 for other reasons. Said that, CLIENT2 and his IP address are misconfigured."
      },
      {
        "date": "2022-09-26T05:00:00.000Z",
        "voteCount": 3,
        "content": "Should be Subnet Mask. Client1 and Client4 are in the same network. It doesn't need the Default gateway to connect. But if the Subnet Mask is wrong, Client4 thinks Client1 is outside its network."
      },
      {
        "date": "2022-10-01T03:48:00.000Z",
        "voteCount": 4,
        "content": "Hello, I did a test in packet tracer, and I confirm what Wendy5902 says, if a \"host is in the same network segment\" you don't need a default Gateway, now let an extended ping from CL1 to CL4 with the /24 default mask or 255.255.255.0 and without Default Gateway and the ping works, but if you change the Subnet Mask the ping does not arrive.\nSo with the information they provide us, we come to the conclusion that it is the Subnet Mask that prevents the ping from arriving. They can do their lab on Cisco Packet Trackert. Correct answer Bad configuration: CLIENT4 and Bad Configuration: Subnet Mask."
      },
      {
        "date": "2022-09-15T22:24:00.000Z",
        "voteCount": 1,
        "content": "Client 4\nDefault gateway"
      },
      {
        "date": "2022-09-08T07:43:00.000Z",
        "voteCount": 1,
        "content": "Does anyone have an explanation for this answer? I am sorry I am really bad with this networking stuff."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 44,
    "url": "https://www.examtopics.com/discussions/microsoft/view/80608-exam-md-100-topic-4-question-44-discussion/",
    "body": "You have a computer named Client' that runs Windows 11.<br>You perform the following actions on Client1:<br>✑ Enable Hyper-V.<br>Create a virtual machine that runs Windows 11 Pro.<br><img src=\"/assets/media/exam-media/04292/0036900003.png\" class=\"in-exam-image\"><br>You need to connect to VM1 by using enhanced session mode.<br>What should you do first?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Remote Desktop on VM1.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Remote Assistance on Client1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Remote Assistance on VM1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable Remote Desktop on Client1."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2022-09-06T06:15:00.000Z",
        "voteCount": 9,
        "content": "Answer A should be correct :Enhanced Session Mode requires Remote Desktop to be enabled in the VM"
      },
      {
        "date": "2022-09-10T04:57:00.000Z",
        "voteCount": 1,
        "content": "yes, the explanation under the question says configure VM for Remote Desktop.\nWhy are so many questions and suggested answers wrong?"
      },
      {
        "date": "2023-02-23T09:59:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is A. Enable Remote Desktop on VM1.\n\nExplanation:\n\nTo connect to the virtual machine using enhanced session mode, you need to follow these steps:\n\nEnable Remote Desktop on VM1: Open VM1 in Hyper-V Manager, go to the VM Settings, select the Display option from the left pane, and then check the box for \"Enable enhanced session mode\" on the right pane."
      },
      {
        "date": "2023-02-20T10:20:00.000Z",
        "voteCount": 2,
        "content": "Answer is A, tested it"
      },
      {
        "date": "2023-02-18T16:14:00.000Z",
        "voteCount": 1,
        "content": "Answer is A. Tested in Lab. Just passed the exam. This is included. \n\nThe virtual machine must have Remote Desktop Services enabled.\n\nhttps://learn.microsoft.com/en-us/windows-server/virtualization/hyper-v/learn-more/use-local-resources-on-hyper-v-virtual-machine-with-vmconnect#requirements-for-using-local-resources"
      },
      {
        "date": "2022-12-27T10:35:00.000Z",
        "voteCount": 2,
        "content": "Enhanced Session Mode uses RDP, thus the answer should be A."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 45,
    "url": "https://www.examtopics.com/discussions/microsoft/view/79083-exam-md-100-topic-4-question-45-discussion/",
    "body": "You have 20 computers that run Windows 10. The computers are in a workgroup.<br>You need to create a local user named User1 on all the computers. User1 must be a member of the Administrators group.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a Group Policy object (GPO) that contains the Local Users Group Policy preference.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a script that runs the New-ADUser cmdlet and the Set-AdGroup cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom Windows Configuration Designer, create a provisioning package, and then run the provisioning package on each computer.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a script that runs the New-MsolUser cmdlet and the Add-ADComputerServiceAccount cmdlet."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-23T10:04:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is B. Create a script that runs the New-ADUser cmdlet and the Set-AdGroup cmdlet.\n\nExplanation:\n\nTo create a local user named User1 on all the computers and add it to the Administrators group, you need to follow these steps:\n\nCreate a PowerShell script that runs the following commands:\n\nNew-ADUser -Name \"User1\" -AccountPassword (ConvertTo-SecureString \"Password1234\" -AsPlainText -Force) -Enabled $true -PasswordNeverExpires $true\nSet-AdGroup -Identity \"Administrators\" -Add @{SamAccountName=\"User1\"}\nSave the script with a .ps1 file extension.\n\nCopy the script to each computer or a shared folder that all the computers can access.\n\nOpen PowerShell as an administrator on each computer and run the script using the following command:\n\n.\\scriptname.ps1\nThis will create a local use"
      },
      {
        "date": "2023-02-23T10:07:00.000Z",
        "voteCount": 2,
        "content": "never mind,  Correct answers is C."
      },
      {
        "date": "2023-06-29T15:27:00.000Z",
        "voteCount": 1,
        "content": "But it clearly says, we are working in the workgroup and NOT in the Active Directory."
      },
      {
        "date": "2022-12-17T04:29:00.000Z",
        "voteCount": 1,
        "content": "C is correct, no AD group policies in a workgroup so provisioning packages are the way."
      },
      {
        "date": "2022-09-01T09:52:00.000Z",
        "voteCount": 3,
        "content": "C is correct!"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 46,
    "url": "https://www.examtopics.com/discussions/microsoft/view/105400-exam-md-100-topic-4-question-46-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a computer named Computer1 that runs Windows 11. Computer1 has a single network interface and contains the Hyper-V virtual switches shown in the following exhibit.<br><br><img src=\"https://img.examtopics.com/md-100/image447.png\"><br><br>Use the drop-down menus to select the answer choice that completes each statement based on the information presented in the graphic.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/md-100/image448.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/md-100/image449.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-06T06:13:00.000Z",
        "voteCount": 1,
        "content": "The correct answer is:\n\n1. Private and internal virtual switches only\n2. VSwitch3 or Default Switch only\n\n1. This is because you can only create external switches on physical network adapters and you are only allowed to create one external switch per physical NIC.\n\n2. VSwitch3 is an external switch and therefor has a normal network connection. The default switch is a NAT switch and will also provide network access, but now it uses the NATted IP address of the host."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 47,
    "url": "https://www.examtopics.com/discussions/microsoft/view/95320-exam-md-100-topic-4-question-47-discussion/",
    "body": "HOTSPOT<br> -<br><br>Your network contains an on-premises Active Directory domain. The domain contains 500 Windows 10 devices and an Always On VPN infrastructure.<br><br>You need to perform the following tasks:<br><br>•\tConfigure the Always On VPN client in Windows 10.<br>•\tCreate a VPN configuration file.<br><br>What should you do? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/md-100/image450.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/md-100/image451.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-01-14T11:43:00.000Z",
        "voteCount": 2,
        "content": "I believe this answer is correct due to MS documentation\n\nhttps://learn.microsoft.com/en-us/windows-server/remote/remote-access/vpn/always-on-vpn/deploy/always-on-vpn-deploy-deployment#step-6-configure-windows-client-always-on-vpn-connections"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 48,
    "url": "https://www.examtopics.com/discussions/microsoft/view/94750-exam-md-100-topic-4-question-48-discussion/",
    "body": "You have a computer named Computer1 that runs Windows 11 and hosts two Hyper-V virtual machines named VM1 and VM2.<br><br>You need to ensure that VM1 can connect to the network shares on VM2. The solution must prevent Computer1 from establishing network connections to VM1 or VM2.<br><br>Which type of virtual switch should you use?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\texternal",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tprivate\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tinternal"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-02-12T00:59:00.000Z",
        "voteCount": 1,
        "content": "Private - Creates a virtual switch that can be used only by the virtual machines that run on this physical computer.\n\nAnd for the record. Internal - Creates a virtual switch that can be used only by the virtual machines that run on this physical computer, and between the virtual machines and the physical computer. An internal virtual switch does not provide connectivity to a physical network connection."
      },
      {
        "date": "2023-01-14T11:46:00.000Z",
        "voteCount": 1,
        "content": "Private switches are for privatizing the virtual network.\n\nhttps://learn.microsoft.com/en-us/windows-server/virtualization/hyper-v/plan/plan-hyper-v-networking-in-windows-server?source=recommendations#switch-and-network-adapter-choices"
      },
      {
        "date": "2023-01-10T18:09:00.000Z",
        "voteCount": 1,
        "content": "I think this is correct. \nPrivate switches are only used for virtual machines to communicate with each other. This type can be useful for specific types of traffic such as a cluster network only if you are using one host (as it can’t be used between hosts).\nhttps://www.nakivo.com/blog/hyper-v-networking-virtual-switches/"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 49,
    "url": "https://www.examtopics.com/discussions/microsoft/view/99602-exam-md-100-topic-4-question-49-discussion/",
    "body": "You have a Windows 10 device named Device1.<br><br>You plan purchase a wireless display device that will stream audio and video from Device1.<br><br>Which wireless feature or protocol should the display device support?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tWi-Fi sense",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMiracast\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tnear field communications (NFC)",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tBluetooth"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-04-30T19:57:00.000Z",
        "voteCount": 2,
        "content": "B\nDon't ask just remember"
      },
      {
        "date": "2023-04-15T05:34:00.000Z",
        "voteCount": 1,
        "content": "For me is B."
      },
      {
        "date": "2023-03-14T02:51:00.000Z",
        "voteCount": 1,
        "content": "Answer is B \nExplanation:\nTo stream audio and video wirelessly from a Windows 10 device to a display device, the display device should support the Miracast protocol. Miracast is a wireless display standard that allows you to stream audio and video from a Windows 10 device to a display device without the need for cables."
      },
      {
        "date": "2023-02-20T10:23:00.000Z",
        "voteCount": 2,
        "content": "Since when will bluetooth also stream video? Bluetooth is never the correct answer for video purposes. This should be Miracast"
      },
      {
        "date": "2023-03-06T12:33:00.000Z",
        "voteCount": 1,
        "content": "Agreed. Answer should be B. Miracast all the way."
      },
      {
        "date": "2023-02-17T03:57:00.000Z",
        "voteCount": 2,
        "content": "Correct answer is B:\nMiracast is a wireless display standard that allows Windows 10 devices to project audio and video to a compatible wireless display device, such as a Miracast-enabled TV or a Miracast adapter. It uses Wi-Fi Direct technology to establish a direct wireless connection between the two devices, and can stream high-definition audio and video with low latency."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 50,
    "url": "https://www.examtopics.com/discussions/microsoft/view/105663-exam-md-100-topic-4-question-50-discussion/",
    "body": "You have a computer named Computer1 that runs Windows 11.<br><br>You plan to create restore points on Computer1. The restore points must be prevented from using more than 10 percent of the system drive.<br><br>What should you do first?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a new disk volume.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable system protection.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure Storage Sense.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure a drive optimization schedule."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-06-08T08:29:00.000Z",
        "voteCount": 1,
        "content": "Same e635466"
      },
      {
        "date": "2023-04-30T19:58:00.000Z",
        "voteCount": 2,
        "content": "I agree, B\nAt the very least you have to set it up through System Protection first before even touching the space requirements."
      },
      {
        "date": "2023-04-25T08:54:00.000Z",
        "voteCount": 4,
        "content": "Correct answer is B.\n\n- A: There is no need for an extra volume.\n- B: Correct\n- C: Storage Sense can cleanup unwanted files (Recycle bin, tmp files, etc) on your drive to free up space. Nothing to do with Restore Points\n- D: Drive optimization schedule is a feature to perform a defragmentation of your disk."
      },
      {
        "date": "2023-04-09T08:36:00.000Z",
        "voteCount": 1,
        "content": "Correct answer is B. Enable System Protectoin first. Then you can set up the maximum storage limit for restore points"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 51,
    "url": "https://www.examtopics.com/discussions/microsoft/view/105664-exam-md-100-topic-4-question-51-discussion/",
    "body": "HOTSPOT<br> -<br><br>You have a computer named Computer1 that runs Windows 11.<br><br>You plan to create a storage space on Computer1 that will have the following configurations:<br><br>•\tName: Data<br>•\tDrive letter: F<br>•\tFile system: NTFS<br>•\tResiliency type: Three-way mirror<br><br>What is the minimum number of data disks required, and what is the maximum number of disks that can fail while maintaining data availability? To answer, select the appropriate options in the answer area.<br><br>NOTE: Each correct selection is worth one point.<br><br><img src=\"https://img.examtopics.com/md-100/image490.png\">",
    "options": [],
    "answer": "<img src=\"https://img.examtopics.com/md-100/image491.png\">",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2023-04-30T20:00:00.000Z",
        "voteCount": 1,
        "content": "Also,\n\nPool requires a quorum of 50% plus drives to be present to survive.\n\nwith 3 way mirror - we have a guarantee of surviving 2 disk failure.\n\nMaintaining the above requirements and providing the guarantee - mandates us to have minimum 5 disks in pool. As if we loose 2, we still have 3 in the pool (&gt;50%) for pool to maintain it's quorum."
      },
      {
        "date": "2023-04-09T08:38:00.000Z",
        "voteCount": 2,
        "content": "Correct.\n\nThe three-way mirror storage layout can only be created on no less than five physical drives. In such a space there are three copies of each slab stored on different pool member disks. A three-way mirrored space survives a failure of up to two physical drives."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  },
  {
    "topic": 4,
    "index": 52,
    "url": "https://www.examtopics.com/discussions/microsoft/view/119748-exam-md-100-topic-4-question-57-discussion/",
    "body": "You are troubleshooting the failed installation of a VPN application on a device. During the installation, the application displays a Stop error, and you must restart the device. After the restart, you discover that the device can no longer connect to the network.<br><br>What should you use to resolve the issue?",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork reset\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNetwork Adapter troubleshooter",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIncoming Connections troubleshooter",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRemote Assistance"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-10-06T01:46:00.000Z",
        "voteCount": 1,
        "content": "This is all about outgoing. So reset the complete network config, or trouble shoot the adapter would be my solution"
      },
      {
        "date": "2023-09-03T05:17:00.000Z",
        "voteCount": 1,
        "content": "Isnt the right answer A?"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "4"
  }
]