[
  {
    "topic": 13,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66022-exam-md-100-topic-13-question-2-discussion/",
    "body": "HOTSPOT -<br>Which Windows 10 computers can you ping successfully from Computer1 and Computer2? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0028500001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0028600001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Computer3 only.<br>Computer1 and Computer2 are domain joined so both will be using the Domain profile.  The firewall rules on Computer1 allow outbound ICMP on all profiles so outbound ICMP will be allowed on the Domain profile.<br>The firewall rules on Computer2 allow inbound ICMP on the Public profile only, so it will be blocked on the domain profile.  Therefore, Computer2 cannot be pinged.<br>The firewall rules on Computer3 allow inbound ICMP on all profiles.  Therefore, Computer3 will not block the inbound pings.<br>Box 2: No Windows 10 computers.<br>The firewall rules on Computer2 allow outbound ICMP on the Private profile only, so it will be blocked on the domain profile.  Therefore, Computer2 cannot ping any computers.",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-09T16:50:00.000Z",
        "voteCount": 2,
        "content": "Was pretty confident the answers were wrong before testing. Tested, and turns out I was correct. The outbound firewall rule is, by default, allowed on all network profile types. 99% of the time, the problem is with the inbound rule, which is NOT allowed on any profiles by default. The only time the outbound rule changes behavior is when it's set to a block rule and enabled. \n\nSo for the answers, it will depend upon if (1) the firewall rules match the network type of the device and (2) whether there are any explicit deny output ICMPv4 request block rules. We aren't told of any block rules and, given the firewall rules, it would SEEM to be safe to assume that the Inbound rules match the network type. If we do that, since computer one only accepts ICMPv4 requests from its private network and computer 2 accepts them from its public network, computer 3 can be pinged from both of them. So the answer should be, \n\nFirst box: Computer 2 and Computer 3\nSecond Box: Computer 1 and Computer 3\n\nThe problem with the question is that we aren't given enough information to make a decent informative decision."
      },
      {
        "date": "2021-12-01T13:53:00.000Z",
        "voteCount": 2,
        "content": "Computer2 can ping only Computer3 because the ICMPv4 rule is Allow in ALL\nComputer1 has ICMPv4 for Private only"
      },
      {
        "date": "2021-11-14T07:54:00.000Z",
        "voteCount": 3,
        "content": "answer and explanation is really weird and wrong."
      },
      {
        "date": "2021-12-18T08:06:00.000Z",
        "voteCount": 4,
        "content": "I've seen quite some weird and wrong answers, but this one seems to be correct.\nComputer 1 and computer 2 are domain-joined, so the domain firewall profile applies on these computers."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "13"
  },
  {
    "topic": 13,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64330-exam-md-100-topic-13-question-3-discussion/",
    "body": "HOTSPOT -<br>You implement the planned changes for Computer1.<br>For each of the following statements, select Yes if the statement is true. Otherwise, select No.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0028700001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0028700002.png\" class=\"in-exam-image\">",
    "answerDescription": "Box 1: Yes -<br>User1 already has full control access through membership of Group1. Therefore, User1 can write to the file.<br><br>Box 2: No -<br>The planned changes will grant User2 full control access to the file.  However, User2 is a member of Group2 which has Deny/Write access.  The Deny permission will always take precedence.  Therefore, User2 will not be able to write to the file.<br><br>Box 3: No -<br>The planned changes will grant User3 full control access to the folder.  That permission will be inherited by the file.  However, User3 is a member of Group2 which has Deny/Write access.  The Deny permission will always take precedence.  Therefore, User3 will not be able to write to the file.",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-09T09:17:00.000Z",
        "voteCount": 14,
        "content": "Yes, Yes, No\n\nUser1 has full access explicit permissions on file\nUser2 has full access explicit permissions on file. Explicit allow permissions wins over inherited deny permissions\nUser3 has full access inherited permissions on folder. Inherited deny permissions wins over inherited allow permissions, so user cannot write to file"
      },
      {
        "date": "2022-02-19T04:28:00.000Z",
        "voteCount": 1,
        "content": "I agree with your reasoning. Can anyone back this up?"
      },
      {
        "date": "2022-03-28T14:35:00.000Z",
        "voteCount": 2,
        "content": "I’m not sure User 2 is true. User 2 has explicit deny write permission which takes precedence"
      },
      {
        "date": "2022-04-05T08:23:00.000Z",
        "voteCount": 2,
        "content": "It doesn't seem like he has explicitly deny write permission to me. All of the \"old\" permissions say \"inherited from Folder1\", so none of them are explicit for the file. As such, User2 should have write permission now."
      },
      {
        "date": "2022-12-22T08:42:00.000Z",
        "voteCount": 3,
        "content": "It says inheritance is disabled. Aren't all of these permissions that are listed, explicit permissions?"
      },
      {
        "date": "2023-07-28T06:08:00.000Z",
        "voteCount": 1,
        "content": "Yes, No, No.\n\nWhat user lapobs says is key and he is right that as a result of disabling the inheritance the permissions are explicit.\n\nThe table provided in the questions speaks of inheritance and seems in contradiction but we must presume that this is how the permissions were set and that inheritance was disabled afterwards.  In that case a GUI asks if the permissions should be converted to explicit permissions on the object or removed altogether.  Again, we must presume they have been converted to explicit permissions.  \n\nSo for User2, there is an explicit Group2 Write Deny which prevails over any allows.  Similar reasoning for User3 which is a member of Group2.  The answer is therefore: Yes No No  \n\nThe proximity rule raised by user LArrikin27 (inherited versus explicit) is important to know but does not come into play here since the permissions have all been converted to explicit.\n\nRawizz 2023-07-28"
      },
      {
        "date": "2023-05-04T11:48:00.000Z",
        "voteCount": 1,
        "content": "Correction Y-Y-N is correct. User2 has Full control on the report file which will win over the inherited deny right"
      },
      {
        "date": "2023-05-04T11:42:00.000Z",
        "voteCount": 1,
        "content": "Y-N-N is correct"
      },
      {
        "date": "2022-10-08T14:47:00.000Z",
        "voteCount": 2,
        "content": "For me it is all YES\nExplicit permissions win the inherited (from a group) permissions\nhttps://www.ntfs.com/ntfs-permissions-precedence.htm"
      },
      {
        "date": "2022-10-08T15:00:00.000Z",
        "voteCount": 1,
        "content": "Sorry, my bad !\nJust tested it, the correct answers are Y,Y,N"
      },
      {
        "date": "2022-04-09T08:59:00.000Z",
        "voteCount": 1,
        "content": "What about Group 1 which has \"Deny access to this computer from the network\"? Isn't user 1 blocked, being a member of Group 1, so no access to the folder on Computer1?"
      },
      {
        "date": "2022-04-09T09:00:00.000Z",
        "voteCount": 1,
        "content": "Mmm, I'm sorry, it applies to Computer 2."
      },
      {
        "date": "2021-11-17T02:38:00.000Z",
        "voteCount": 3,
        "content": "Y, N, N.. I agree that the given answer and explanation is correct"
      },
      {
        "date": "2021-10-18T18:13:00.000Z",
        "voteCount": 1,
        "content": "All YES"
      },
      {
        "date": "2021-10-20T16:42:00.000Z",
        "voteCount": 1,
        "content": "Ignore - given is correct"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "13"
  }
]