[
  {
    "topic": 12,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/33541-exam-md-100-topic-12-question-1-discussion/",
    "body": "HOTSPOT -<br>You need to meet the technical requirements for the helpdesk users.<br>What should you do? To answer, select the appropriate options in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0010900001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0010900002.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://www.itprotoday.com/compute-engines/what-group-policy-creator-owners-group",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-20T16:03:00.000Z",
        "voteCount": 14,
        "content": "Incorrect Answer\nThe Get-GPOReport cmdlet generates a report in either XML or HTML format that describes properties and policy settings for a specified Group Policy Object (GPO) or for all GPOs in a domain. The information that is reported for each GPO includes: details, links, security filtering, Windows Management Instrumentation (WMI) filtering, delegation, and computer and user configurations.\n\nGPResult\nTroubleshooting tool to determine the outcome of the gpo’s on that particular machine.\n\nGPUpdate\nApplies the relevant gpo’s\n\nGroup Policy Object Editor\nFor the creation/editing and viewing of group policies\n\n\nMust be GPResult and local admin access"
      },
      {
        "date": "2020-11-18T00:44:00.000Z",
        "voteCount": 3,
        "content": "So are you saying that the correct answers are as below?\n\nFirst box - The Group Policy Creators Owners group in the domain group\nSecond Box : Get-GPOReport"
      },
      {
        "date": "2020-11-24T21:25:00.000Z",
        "voteCount": 12,
        "content": "No.I am going for local admin access and GPResult as the best answer. I only summarised the various options in the 2nd box, although can Get-GPO Result be an option for the 2nd box."
      },
      {
        "date": "2021-02-22T05:57:00.000Z",
        "voteCount": 1,
        "content": "I agree on this."
      },
      {
        "date": "2020-12-13T15:50:00.000Z",
        "voteCount": 2,
        "content": "Ran in a domain environment with the following results:\nGroup Policy Creater Owners in the domain do not have administrative privileges on the domain computer and will not be able to run gpresult\nTo add the group policy editor to a blank mmc on the domain computer requires admin privileges\nGpresult by far is the best tool that the help desk users SHOULD be using.\n\nYes the question details for “least administrative privileges” but you still need enough privileges to deal with the problem at hand. It is a  well-known trick for Microsoft to ask such a question to see if you know  who has the necessary privileges to fix the issue and at times only an administrator can do this."
      },
      {
        "date": "2021-09-25T04:06:00.000Z",
        "voteCount": 4,
        "content": "I'm not completely convinced.\n\nThe Group Policy Creators Owners group gives user the rights to view and create group policies in the Group Policy Editor, but they can't link them. They can still see what's linked though, so they can use the Group Policy Editor to view all GPO's that should be applied.\n\nAnd that's where I'm in doubt, because they can see which policies SHOULD be applied, but not what's actually applied to a specific computer. However, Get-GPOReport also doesn't do this. The requirement states the following:\n\n\"Helpdesk users must be able to troubleshoot Group Policy object (GPO) processing on the Windows 10 computers. The helpdesk users must be able to identify which Group Policies are applied to the computers.\"\n\nThey'd need local administrator rights and GPResult to see what's actually applied. For the computer at least, since administrators are often excluded from user policies.\n\nTricky question... I think I'm gonna go with the given answer, because that way the users can view Machine and User policies with the least amount of privileges."
      },
      {
        "date": "2021-05-27T22:50:00.000Z",
        "voteCount": 9,
        "content": "Group Policy Object Editor is NOT a troubleshooting tool. GPResult is!"
      },
      {
        "date": "2022-09-13T08:31:00.000Z",
        "voteCount": 1,
        "content": "Everybody's right. In the real world, GPResult and local admin access is necessary to realistically troubleshoot.\n\nBut the question/requirement focuses on Group Policy only. The listed answers address Group Policy only.\n\nI wouldn't want to design a test that way, but there it is."
      },
      {
        "date": "2022-06-09T05:25:00.000Z",
        "voteCount": 1,
        "content": "The Group Policy Creator Owners group lets its members create new GPOs. However, those members can only edit or delete GPOs that they have created. The Group Policy Creator Owners group also has no permission to link GPOs to a container such as a domain or OU; that permission still must be manually given.\n\nFrom what i understand they do not need to create gpo`s-"
      },
      {
        "date": "2022-01-26T09:24:00.000Z",
        "voteCount": 1,
        "content": "I agree with the answer because of this 2 links:\n\nhttps://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-R2-and-2008/cc754948(v=ws.10)?redirectedfrom=MSDN#delegating-creation-of-gpos\n\nhttps://docs.microsoft.com/en-us/previous-versions/windows/desktop/Policy/group-policy-object-editor"
      },
      {
        "date": "2021-11-14T07:31:00.000Z",
        "voteCount": 2,
        "content": "I'll go with local admin and gpresult. there is no mention of helpdesk users having access to the domain controller where they can access group policy settings"
      },
      {
        "date": "2022-03-19T15:18:00.000Z",
        "voteCount": 1,
        "content": "Completely overlooked this! This only makes since. My answer would be local admin with gpresult.\nhttps://docs.microsoft.com/en-us/windows-server/administration/windows-commands/gpresult"
      },
      {
        "date": "2021-10-28T23:09:00.000Z",
        "voteCount": 2,
        "content": "GPResult /USER &lt;username&gt; /H &lt;html file&gt;\nGet-GPOReport needs the powershell 'GroupPolicy' module loaded and creates a report for a specified GPO and not the result of an enduser.\nhttps://docs.microsoft.com/en-us/powershell/module/grouppolicy/get-gporeport?view=windowsserver2019-ps"
      },
      {
        "date": "2020-12-05T11:52:00.000Z",
        "voteCount": 5,
        "content": "If there is a set of local Group policies applied on a computer accidentally and causing some issues, get-gporeport with Group Policy Creators Owners group permission will not let helpdesk users to view them. In addition, the question states that helpdesk users must be able to view the group policies processed on the computers. So I agree with @Anthony_2770 that local admin and GPresult are the best answers in this scenario."
      },
      {
        "date": "2020-12-01T09:50:00.000Z",
        "voteCount": 2,
        "content": "Going with answers given as correct.\nWhile it is true that GPResult and local admin would work, I think the trick is noted under the technical requirements stating “The principle of least privilege must be used whenever possible” and “Administrative effort must be minimized whenever possible”. \nI think these push the best answers to be the answers given since those do not require the help desk to be local admins on all machines."
      },
      {
        "date": "2021-01-03T14:51:00.000Z",
        "voteCount": 2,
        "content": "From Anthony's comment: \n\nYes the question details for “least administrative privileges” but you still need enough privileges to deal with the problem at hand. It is a  well-known trick for Microsoft to ask such a question to see if you know  who has the necessary privileges to fix the issue and at times only an administrator can do this."
      },
      {
        "date": "2020-10-03T14:21:00.000Z",
        "voteCount": 4,
        "content": "I don't get this answer.  It could be right but I'd be using GPResult, which requires that you run from an admin cmd prompt to get the computer settings.  So I would think you would need to be local admin."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "12"
  },
  {
    "topic": 12,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/53782-exam-md-100-topic-12-question-2-discussion/",
    "body": "HOTSPOT -<br>You need to meet the technical requirements for the HR department users.<br>Which permissions should you assign to the HR department users for the D:\\Reports folder? To answer, select the appropriate permissions in the answer area.<br>NOTE: Each correct selection is worth one point.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0011000001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0011100001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://www.online-tech-tips.com/computer-tips/set-file-folder-permissions-windows/",
    "votes": [],
    "comments": [
      {
        "date": "2021-05-29T13:23:00.000Z",
        "voteCount": 5,
        "content": "List Folder/Read Data: List Folder allows or denies viewing file names and subfolder names within the folder. List Folder only affects the contents of that folder and does not affect whether the folder you are setting the permission on will be listed. (Applies to folders only.) Read Data allows or denies viewing data in files. (Applies to files only.)"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "12"
  },
  {
    "topic": 12,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/7787-exam-md-100-topic-12-question-3-discussion/",
    "body": "You need to meet the technical requirements for EFS on ComputerA.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun certutil.exe, and then add a certificate to the local computer certificate store.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun cipher.exe, and then add a certificate to the local computer certificate store.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun cipher.exe, and then add a certificate to the local Group Policy.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun certutil.exe, and then add a certificate to the local Group Policy."
    ],
    "answer": "B",
    "answerDescription": "Reference:<br>https://docs.microsoft.com/en-us/windows/security/information-protection/windows-information-protection/create-and-verify-an-efs-dra-certificate",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2019-11-17T19:16:00.000Z",
        "voteCount": 15,
        "content": "THE CORRECT IS B. Run cipher.exe, and then add a certificate to the local computer certificate store."
      },
      {
        "date": "2019-11-19T09:47:00.000Z",
        "voteCount": 1,
        "content": "cipher.exe will not create the cert to add."
      },
      {
        "date": "2020-01-01T20:44:00.000Z",
        "voteCount": 11,
        "content": "It's literally the first command in the link provided: \"cipher /r:&lt;name_of_your_cert&gt;\""
      },
      {
        "date": "2020-07-16T07:16:00.000Z",
        "voteCount": 3,
        "content": "Computer A is separated from all other machines, meaning this is a one off. So no group policy additions. I agree, answer is B based on the linked explanation and considering airgap.\n\nC would be right but with the system being air gapped it wouldn’t make sense to use policy..."
      },
      {
        "date": "2020-02-24T18:25:00.000Z",
        "voteCount": 14,
        "content": "It seems like the answer must be C. According to the instructions literally laid out by the Exam Ref Book. You run Cipher.exe to create the files, and then install the DRA via: Security Settings\\Public Key Policies\\Encrypting File System &gt; Right-Click \"Add Data Recovery Agent\" In the Local Policy settings."
      },
      {
        "date": "2020-09-10T22:44:00.000Z",
        "voteCount": 1,
        "content": "not sure...\nwhat speaks agains local computer certificate store?\n\nI have a doubt about local GP, because:\n- the computer is on an isolated NW  +  \"Helpdesk users must be able to troubleshoot Group Policy object (GPO) processing on the Windows 10 computers. The helpdesk users must be able to identify which Group Policies are applied to the computers.\""
      },
      {
        "date": "2021-02-23T14:16:00.000Z",
        "voteCount": 1,
        "content": "Agreed that answer is C. B only seems partially correct."
      },
      {
        "date": "2022-08-05T06:29:00.000Z",
        "voteCount": 2,
        "content": "\"ComputerA is in a workgroup on an isolated network segment ...\" How could you use GPO in this context ??"
      },
      {
        "date": "2022-12-13T00:56:00.000Z",
        "voteCount": 1,
        "content": "Because Local Group Policy is specified, not Domain"
      },
      {
        "date": "2022-12-23T21:24:00.000Z",
        "voteCount": 1,
        "content": "After a day studing this subject, I have got the whole situation here, since it was new to me.\n\nThe correct answer is letter C.\n\nIt is impossible (there is no other option) to have a recovery agent attached without the Group Policy (in this case the Local GPO), because when you create new files the recovery agent will be attached to those files and then be able to an admin (or a help desk) to retrieve access to the file after installing the .PFX (private key).\n\nThe best source of knowledge you will find is in this video: https://www.youtube.com/watch?v=51v_vuoMp9I"
      },
      {
        "date": "2022-12-22T23:02:00.000Z",
        "voteCount": 2,
        "content": "If you double click a certificate, you will be prompted to install it to a certificate store, otherwise the purpose of add it to a policy means that you will use a local computer configuration and that is critical because of security reasons or domain policy that is even more."
      },
      {
        "date": "2022-12-23T04:54:00.000Z",
        "voteCount": 1,
        "content": "So you have to install for the current user."
      },
      {
        "date": "2022-12-23T21:24:00.000Z",
        "voteCount": 1,
        "content": "After a day studing this subject, I have got the whole situation here, since it was new to me.\n\nThe correct answer is letter C.\n\nIt is impossible (there is no other option) to have a recovery agent attached without the Group Policy (in this case the Local GPO), because when you create new files the recovery agent will be attached to those files and then be able to an admin (or a help desk) to retrieve access to the file after installing the .PFX (private key).\n\nThe best source of knowledge you will find is in this video: https://www.youtube.com/watch?v=51v_vuoMp9I"
      },
      {
        "date": "2022-03-19T17:46:00.000Z",
        "voteCount": 1,
        "content": "After you run the cipher/ r on the DRA account, \"We must import these files that we just created into the Add a Data Recovery Agent to the Encrypting File System policy within Group Policy.\"- Testout PC Pro\nIn the meantime, check out these links and tell me what you think. :3\nCREATE AND VERIFY AN ENCRYPTING FILE SYSTEM (EFS) DATA RECOVEY AGENT (DRA) CERTIFICATE: https://docs.microsoft.com/en-us/windows/security/information-protection/windows-information-protection/create-and-verify-an-efs-dra-certificate\n\nWINDOWS CIPHER COMMAND: https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/cipher"
      },
      {
        "date": "2022-03-19T23:01:00.000Z",
        "voteCount": 1,
        "content": "Oooohkay. I am going to have to back track on what I said... even though I got that info from PC Pro Testout... I am sticking to the given answer. Why? Because I took a practice exam from my school (no I am not going to tell you what school I attend) and the answer they have is: Run Cipher.exe, And Then Add A Certificate To The Local Computer Certificate Store. \nI would rather take my chances with the answer that my school provided. If ANYONE can give hard fact evidence as to why this is then PLEASE HELP /.\\\nThe only thing I can see that points to original answer being correct is the following statement\n\"Find or create a file that's encrypted using Windows Information Protection. For example, you could open an app on your allowed app list, and then create and save a file so it's encrypted by WIP.\""
      },
      {
        "date": "2021-11-15T22:09:00.000Z",
        "voteCount": 3,
        "content": "ANSWER IS C. I have tested this."
      },
      {
        "date": "2021-04-02T17:51:00.000Z",
        "voteCount": 1,
        "content": "To me it does seem correct, I dont see the point of using local group policy for it. I guess no reason not too but just seems a simpler way to do it without local policy."
      },
      {
        "date": "2020-11-06T08:23:00.000Z",
        "voteCount": 3,
        "content": "C. Run cipher.exe, and then add a certificate to the local Group Policy.\nTrick is that the workstation is in a workgroup and basically air-gapped."
      },
      {
        "date": "2020-10-20T18:24:00.000Z",
        "voteCount": 12,
        "content": "Best answer is C :\n In a domain environment, you can import the EFS Recovery Agent's certificate into the Computer Configuration\\Windows Settings\\Security Settings\\PubHc Key Policies\\Encrypting File System policy of a GPO. The GPO must be linked to the organizational unit (OU) where the user's computer account, not the user account, exists. The certificate can be imported from either a Base-64 or DER-encoded certificate file, or from Active Directory if the certificate template enables publication of the certificate file.\n■ In a workgroup environment, you can import the EFS Recovery Agent's certificate into the Computer Configuration\\Windows Settings\\Security Settings \\Public Key Policies\\Encrypting File System policy (of the local computer). In this scenario, the EFS Recovery Agent certificate must be imported from a file.\n\nIn local group policy you are specifically adding a Data Recovery Agent."
      },
      {
        "date": "2022-08-05T06:33:00.000Z",
        "voteCount": 1,
        "content": "What about the fact that the Helpldesk users are \"domain\" users and have no access to this machine from the Domain since the device is in a workgroup ? Using domain GPOs will not work in this context, answer has to be B."
      },
      {
        "date": "2020-05-17T18:42:00.000Z",
        "voteCount": 2,
        "content": "Answer should be C. See reference, and look for workgroup section. You need to use gpedit to import the cert. https://www.serverbrain.org/certificate-security-2003/defining-efs-recovery-agents.html"
      },
      {
        "date": "2020-05-12T11:17:00.000Z",
        "voteCount": 1,
        "content": "The process for creating a DRA certifi cate in Windows 10 for a device that is not domain\njoined can be performed using this procedure:\ncipher /r:"
      },
      {
        "date": "2020-05-12T11:22:00.000Z",
        "voteCount": 1,
        "content": "install The cert by using secpol.msc"
      },
      {
        "date": "2020-01-09T14:11:00.000Z",
        "voteCount": 2,
        "content": "https://docs.microsoft.com/en-us/windows/security/information-protection/windows-information-protection/create-and-verify-an-efs-dra-certificate"
      },
      {
        "date": "2019-11-07T09:22:00.000Z",
        "voteCount": 2,
        "content": "Cipher.exe is used to encrypt files, not create certs. That's reserved for Certutil.exe, then the cert has to be loaded into the GPO under Public Key Policies. The answer is D."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "12"
  }
]