[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/microsoft/view/56878-exam-md-100-topic-1-question-1-discussion/",
    "body": "Your network contains an Active Directory domain. All users have been issued with new computers that run Windows 10 Enterprise. All users have Microsoft 365<br>E3 licenses.<br>A user named Mia Hamm has an Active Directory user account named MHamm and a computer named Computer1. Mia Hamm reports that Computer1 is not activated.<br>You need to ensure that Mia Hamm can activate Computer1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign a Windows 10 Enterprise license to MHamm, and then activate Computer1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Microsoft Deployment Toolkit (MDT), redeploy Computer1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom System Properties on Computer1, enter a Volume License Key, and then activate Computer1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstruct Mia Hamm to perform a local AutoPilot Reset on Computer1, and then activate Computer1.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 9,
        "isMostVoted": true
      },
      {
        "answer": "C",
        "count": 5,
        "isMostVoted": false
      },
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-11-25T02:23:00.000Z",
        "voteCount": 6,
        "content": "I think D is correct. The question says she's logging in using an Active Directory (AD) account, not an Azure Active Directory (AAD) account. If you want to activate the 365 E3 license on a user basis, you need to log in to the PC using your AAD account, not AD. So either she has to login using her AAD account instead, or she could perform an Autopilot-reset to trigger a device-based license activation. It feels like some info is missing in the question, but triggering an Autopilot-reset for a device-based license activation is a possibility and it would explain why she's not trying any of the other methods. So I'd vote for D indeed."
      },
      {
        "date": "2022-03-10T12:26:00.000Z",
        "voteCount": 1,
        "content": "Agreed. Key word here is E3 licenses."
      },
      {
        "date": "2022-09-12T08:06:00.000Z",
        "voteCount": 2,
        "content": "Can't be. You need admin credential for the reset so you cant ask user to do it."
      },
      {
        "date": "2023-03-20T08:10:00.000Z",
        "voteCount": 1,
        "content": "I'm agree. Can't be the Autopilot Reset. This is not posible scenario."
      },
      {
        "date": "2021-07-02T00:44:00.000Z",
        "voteCount": 5,
        "content": "you cant use Autopilot in a normal Active directory so...."
      },
      {
        "date": "2021-08-23T17:13:00.000Z",
        "voteCount": 5,
        "content": "The question must be wrong.  It says you have an Active Directory domain, yet all users have Microsoft 365 E3 licenses."
      },
      {
        "date": "2021-12-12T02:19:00.000Z",
        "voteCount": 1,
        "content": "Very confusing question. :/"
      },
      {
        "date": "2023-09-30T00:22:00.000Z",
        "voteCount": 1,
        "content": "Option A"
      },
      {
        "date": "2023-05-16T17:02:00.000Z",
        "voteCount": 1,
        "content": "Micorosft 365 E3 doesn't have full Windows 10 license. It can only upgrade Pro to Enterprise. \nWindows 10 Pro should be activated before applying E3 license. So 365 subscription has nothing to do with Activation. Moreover, question states that all computers already have Windows Enterprise. And non activated computer could be reactivated with GLVK or KMS. Autopilot and MDT are administrator solutions, user can't trigger them. So answer is C"
      },
      {
        "date": "2023-03-12T15:08:00.000Z",
        "voteCount": 4,
        "content": "I am taking back my previous answer which is D two (2) months ago.\n\nThe correct answer is A. Assign a Windows 10 Enterprise license to MHamm, and then activate Computer1.\n\nExplanation:\nTo activate Windows 10 on a computer, it must have a valid license. In this scenario, Mia Hamm is using a computer named Computer1 that is not activated. To resolve this issue, we need to ensure that Mia Hamm has a valid Windows 10 Enterprise license and then activate Computer1 using that license.\n\nSince all users in the domain have been issued Microsoft 365 E3 licenses, we can assume that Mia Hamm already has a valid license. Therefore, we just need to assign the license to her Active Directory user account and then activate Computer1."
      },
      {
        "date": "2023-03-12T15:09:00.000Z",
        "voteCount": 2,
        "content": "Answer B (redeploying Computer1 using MDT) is not necessary for this scenario since the issue is related to activation and not deployment.\n\nAnswer C (entering a Volume License Key on Computer1) is not recommended since the organization already has Microsoft 365 E3 licenses, which provide all the necessary licensing for Windows 10 Enterprise.\n\nAnswer D (instructing Mia Hamm to perform a local AutoPilot Reset on Computer1) is not necessary for this scenario since the issue is related to activation and not configuration."
      },
      {
        "date": "2023-03-12T15:12:00.000Z",
        "voteCount": 1,
        "content": "AutoPilot Reset is a feature in Windows 10 that allows users to reset their device to its factory settings using the cloud-based Azure Active Directory (AAD) authentication. This feature enables IT administrators to prepare and configure devices for their users without the need for any physical intervention.\n\nWhen a user initiates an AutoPilot Reset on their device, it removes all user data, settings, and applications from the device and reverts it to its original state as if it was just unboxed. During the reset process, the device is automatically reconfigured and enrolled into AAD, so the user can quickly and easily sign back into the device with their AAD credentials.\n\nAutoPilot Reset can be initiated by an end-user or an administrator using Microsoft Endpoint Manager (formerly known as Microsoft Intune). This feature is useful when a device is lost, stolen, or needs to be repurposed."
      },
      {
        "date": "2023-03-20T06:57:00.000Z",
        "voteCount": 1,
        "content": "Answer: A - I think you can't use Autopilot Reset because the user is not an administrator.\n\nAutopilot reset scenarios:\n- Local reset started by IT personnel or other administrators from the organization.\n- Remote reset started remotely by IT personnel via an MDM service such as Microsoft Intune.\n\nhttps://learn.microsoft.com/en-us/mem/autopilot/windows-autopilot-reset"
      },
      {
        "date": "2023-03-20T08:21:00.000Z",
        "voteCount": 1,
        "content": "Can't be A too. It seems a bad question..."
      },
      {
        "date": "2023-06-19T03:01:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/mem/autopilot/tutorial/reset/local-autopilot-reset#enable-local-windows-autopilot-reset-in-intune\n\nI guess is D, assuming the configuration in the aricle above."
      },
      {
        "date": "2023-03-11T12:32:00.000Z",
        "voteCount": 1,
        "content": "Don't be confused because the user has a E3 License.  Remove that statement and try to answer the question.  First, there is no such thing as an \"local autopilot reset\".  You would do a local reset and then have the user join log in with an O365 Account \"Autopilot is set up in the background\" to use that \"E3\" license.  None of that was stated, so, the correct answer is C since it already has the Enterprise version on the computer.  You can't buy Enterprise, thaf version comes with VLK.  Also, the user has a local AD account, not a o354 account which is mandatory for \"autopilot\"."
      },
      {
        "date": "2022-12-19T21:53:00.000Z",
        "voteCount": 1,
        "content": "To ensure that Mia Hamm can activate Computer1, the correct action to take would be to instruct Mia Hamm to perform a local AutoPilot Reset on Computer1, and then activate Computer1. This will ensure that Computer1 is properly activated and ready for use.\n\n***CORRECT***\nOption D, instructing Mia Hamm to perform a local AutoPilot Reset on Computer1 and then activating Computer1, is the correct action to take in this scenario as it will ensure that Computer1 is properly activated and ready for use."
      },
      {
        "date": "2022-12-19T21:54:00.000Z",
        "voteCount": 2,
        "content": "***WRONG***\nOption A, assigning a Windows 10 Enterprise license to MHamm, may not be necessary as Mia Hamm already has a Microsoft 365 E3 license, which includes a Windows 10 Enterprise license.\n\nOption B, redeploying Computer1 using the Microsoft Deployment Toolkit (MDT), may not be necessary as it is not clear that there are any issues with the current deployment of Computer1.\n\nOption C, entering a Volume License Key in System Properties on Computer1, may not be necessary as Mia Hamm already has a valid license through her Microsoft 365 E3 subscription."
      },
      {
        "date": "2022-11-08T10:48:00.000Z",
        "voteCount": 1,
        "content": "You can add a computer by joining it to a domain. The computer can belong to one domain only. Add it to the AD, and it will be active on that licensed domain.\n\nSource: Microsoft"
      },
      {
        "date": "2022-04-07T10:16:00.000Z",
        "voteCount": 1,
        "content": "I think It might be B. She has an E3 license but this info is irrelevant, as she has an Active Directory account and Computer1 is her (not Intune enrolled(I'm assuming as it doesn't specify)) device. Just redeploy Computer1 with MDT and it should be automaticly Activated. Right? Correct me if Im wrong. =)"
      },
      {
        "date": "2022-03-08T02:41:00.000Z",
        "voteCount": 1,
        "content": "Answer is D"
      },
      {
        "date": "2022-01-20T13:00:00.000Z",
        "voteCount": 4,
        "content": "I would go for C since there are no signs of a modern approach being used. VLK with a KMS server is what I would try."
      },
      {
        "date": "2022-01-11T11:55:00.000Z",
        "voteCount": 2,
        "content": "its not Autopilot as you need Azure AD , I think its A\nhttps://docs.microsoft.com/en-us/mem/autopilot/configuration-requirements"
      },
      {
        "date": "2021-11-10T10:53:00.000Z",
        "voteCount": 3,
        "content": "Cant be D since : \"The Autopilot Reset does not support Hybrid Azure AD joined devices; a full device wipe is required. When a hybrid device goes through a full device reset, it may take up to 24 hours for it to be ready to be deployed again. You can expedite this request by re-registering the device\"\n\nSource : https://docs.microsoft.com/en-us/mem/autopilot/windows-autopilot-reset\n\nI would go with A."
      },
      {
        "date": "2021-11-23T00:57:00.000Z",
        "voteCount": 1,
        "content": "I can't see that the device is AD Joined here. Maybe it was in a Workgroup before the user logged on with her AD (Sync) Account. So i would go for D. She already has an E3 license and Windows 10/11 Enterprise is included."
      },
      {
        "date": "2021-12-12T02:30:00.000Z",
        "voteCount": 1,
        "content": "Agree - I was mislead by the wording \"Mia Hamm has an Active Directory user account\"\nI would go for D. Autopilot Reset."
      },
      {
        "date": "2021-10-10T15:31:00.000Z",
        "voteCount": 2,
        "content": "I think the answer is A"
      },
      {
        "date": "2021-07-08T02:00:00.000Z",
        "voteCount": 2,
        "content": "So then it should be C?"
      },
      {
        "date": "2021-07-04T16:55:00.000Z",
        "voteCount": 2,
        "content": "what should be the answer ?"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/microsoft/view/57267-exam-md-100-topic-1-question-2-discussion/",
    "body": "Your network contains an Active Directory domain that is synced to a Microsoft Azure Active Directory (Azure AD) tenant.<br>The company plans to purchase computers preinstalled with Windows 10 Pro for all users.<br>The company the following requirements:<br>✑ The new computers must be upgraded to Windows 10 Enterprise automatically.<br>✑ The new computers must be joined to Azure AD automatically when the user starts the new computers for the first time.<br>✑ The users must not be required to accept the End User License Agreement (EULA).<br>You need to deploy the new computers.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMake use of the wipe and load refresh deployment method.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tPerform in-place upgrade on the new computers.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tProvide provisioning packages for the new computers.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMake use of Windows Autopilot.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "D",
    "answerDescription": "",
    "votes": [
      {
        "answer": "D",
        "count": 9,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-06T03:01:00.000Z",
        "voteCount": 6,
        "content": "The answer is correct due to the Azure AD connection."
      },
      {
        "date": "2023-05-10T07:12:00.000Z",
        "voteCount": 1,
        "content": "D is correct"
      },
      {
        "date": "2022-12-19T21:58:00.000Z",
        "voteCount": 3,
        "content": "To meet the requirements for deploying the new computers, the correct action to take would be Option D: Make use of Windows Autopilot.\n\nWindows Autopilot is a deployment tool that allows you to easily set up and pre-configure new devices, getting them ready for productive use. With Windows Autopilot, you can automatically upgrade the new computers to Windows 10 Enterprise, join them to Azure AD, and skip the EULA acceptance process."
      },
      {
        "date": "2022-12-19T21:59:00.000Z",
        "voteCount": 1,
        "content": "***WRONG***\nOption A, making use of the wipe and load refresh deployment method, would not meet the requirement of automatically upgrading the new computers to Windows 10 Enterprise.\n\nOption B, performing an in-place upgrade on the new computers, would not meet the requirement of automatically joining the new computers to Azure AD.\n\nOption C, providing provisioning packages for the new computers, may not be necessary as Windows Autopilot can handle the required configuration tasks."
      },
      {
        "date": "2022-03-08T02:43:00.000Z",
        "voteCount": 2,
        "content": "D. Make use of Windows Autopilot."
      },
      {
        "date": "2021-12-20T08:06:00.000Z",
        "voteCount": 2,
        "content": "Answer is correct"
      },
      {
        "date": "2021-12-12T02:35:00.000Z",
        "voteCount": 4,
        "content": "D. Make use of Windows Autopilot."
      },
      {
        "date": "2021-11-10T10:57:00.000Z",
        "voteCount": 4,
        "content": "D. Make use of Windows Autopilot."
      },
      {
        "date": "2021-10-13T23:16:00.000Z",
        "voteCount": 3,
        "content": "Answer provided is correct. Autopilot can pre-configure new devices and enhance the out-of-box experience according to company policies."
      },
      {
        "date": "2021-09-26T17:29:00.000Z",
        "voteCount": 1,
        "content": "Can I use the provisioning package for these requirements?"
      },
      {
        "date": "2021-10-10T15:32:00.000Z",
        "voteCount": 2,
        "content": "No, you can't"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 3,
    "url": "https://www.examtopics.com/discussions/microsoft/view/58926-exam-md-100-topic-1-question-3-discussion/",
    "body": "Your company is not connected to the internet. The company purchases several new computers with Windows 10 Pro for its users.<br>None of the new computers are activated.<br>You need to activate the computers without connecting the network to the Internet.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMake use of the Volume Activation Management Tool (VAMT).\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMake use of the Key Management Service (KMS).",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tMake use of the Windows Process Activation Service.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the Get-WmiObject -query cmdlet."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 14,
        "isMostVoted": false
      },
      {
        "answer": "A",
        "count": 14,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-29T06:43:00.000Z",
        "voteCount": 12,
        "content": "the Key Management Service requires 25 systems before it can be used. The Volume Licencing  tool is the more likely solution given the question does not tell us how many systems are being installed."
      },
      {
        "date": "2021-10-03T22:23:00.000Z",
        "voteCount": 2,
        "content": "I agree.\n\nKMS by phone I suppose.\n\nVAMT requires - which is by definition, an online activation as I see it."
      },
      {
        "date": "2022-11-08T10:57:00.000Z",
        "voteCount": 1,
        "content": "That's incorrect. Per Microsoft's website, VAMT does not require internet."
      },
      {
        "date": "2021-12-02T12:42:00.000Z",
        "voteCount": 4,
        "content": "It literally says \"several computers\". A several computers could never been 25 systems. Otherwise it would be many computers"
      },
      {
        "date": "2023-08-14T02:31:00.000Z",
        "voteCount": 1,
        "content": "VAMT requires internet"
      },
      {
        "date": "2023-07-21T05:14:00.000Z",
        "voteCount": 1,
        "content": "In the scenario provided, where the company's computers are not connected to the internet, the best option would be to use the Volume Activation Management Tool (VAMT) in conjunction with a Multiple Activation Key (MAK).\n\nWhile it's true that KMS is generally more secure and efficient for volume activations, it primarily operates over the network and would require an internet connection to reach the Microsoft activation servers or a local KMS server set up within the company's network.\n\nVAMT, on the other hand, can handle offline activations with MAK keys. It allows an administrator to manually install the MAK key and activate it, without the need for the machine itself to be connected to the internet.\n\nPlease note, proper key management and security practices should be followed when using MAK keys to avoid potential security risks.\n\nSo, under these circumstances, the answer would be:\n\nA. Make use of the Volume Activation Management Tool (VAMT)."
      },
      {
        "date": "2023-06-02T08:39:00.000Z",
        "voteCount": 1,
        "content": "I think is B, the Volume Activation Management Tool host computer requires internet access"
      },
      {
        "date": "2023-04-24T06:06:00.000Z",
        "voteCount": 1,
        "content": "I think you can do this activation with A and B but B is a faster configuration. So I will answer B."
      },
      {
        "date": "2023-06-02T06:30:00.000Z",
        "voteCount": 1,
        "content": "I have changed my answer. I choose B. You don't know how many computers means \"several.\" In my opinion it may be enough for KMS. VAMT (Proxy) needs a computer with an Internet connection: \"The VAMT host sends installation IDs to Microsoft on behalf of client products and obtains corresponding confirmation IDs.\"\n\nKMS is the only one that can perform activation via telephone, which does not even require 1 single PC connected to the Internet.\n\nhttps://learn.microsoft.com/en-us/windows/deployment/volume-activation/use-the-volume-activation-management-tool-client"
      },
      {
        "date": "2023-03-23T13:50:00.000Z",
        "voteCount": 1,
        "content": "Answer is B, Microsoft mentions for VAMT: \"By using this method, only the VAMT host computer requires Internet access.\". Question states that your company is not connected to the internet. Without internet there is also no host. KMS offers activation by phone."
      },
      {
        "date": "2023-03-08T04:16:00.000Z",
        "voteCount": 1,
        "content": "Select A: VAMT can be used to activate operating systems without an internet connection, but it requires that the activation keys used are MAK (Multiple Activation Key) or retail product keys."
      },
      {
        "date": "2023-03-07T01:47:00.000Z",
        "voteCount": 2,
        "content": "To activate Windows 10 without an internet connection, you can use the Volume Activation Management Tool (VAMT). VAMT is a tool used to manage and deploy volume activation for Windows operating systems. It can be used to activate client computers running Windows 10 by using the Volume Activation (VA) method, which requires a Multiple Activation Key (MAK) or a Key Management Service (KMS) host key. MAK activation is a one-time process that requires online activation, but KMS activation does not require an internet connection.\n\nKMS activation requires a minimum of 25 client computers to be activated before the KMS host can activate other client computers. However, VAMT can be used to activate client computers with KMS activation without meeting the 25 computer minimum requirement by using the VAMT Proxy Activation feature. This allows VAMT to act as a KMS host for a single client computer, which can then be activated without an internet connection.\n\nTherefore, the correct answer is A, make use of the Volume Activation Management Tool (VAMT)."
      },
      {
        "date": "2023-02-25T18:22:00.000Z",
        "voteCount": 1,
        "content": "A is most likely."
      },
      {
        "date": "2023-02-18T08:34:00.000Z",
        "voteCount": 2,
        "content": "VAMT requires at least one Host computer with internet access for Proxy activation. Assuming \"without connecting the network to the internet\" means \"No computer has internet access\", KMS is the better option"
      },
      {
        "date": "2023-01-27T09:27:00.000Z",
        "voteCount": 2,
        "content": "This was on 1/27/23 test! Know this!"
      },
      {
        "date": "2022-12-19T22:05:00.000Z",
        "voteCount": 1,
        "content": "A. Make use of the Volume Activation Management Tool (VAMT).\n\nThe Volume Activation Management Tool (VAMT) is a tool that can be used to manage and track the activation of Windows and Office products in an organization. VAMT can be used to activate Windows 10 computers without an internet connection, by using a Multiple Activation Key (MAK) or by creating a local Key Management Service (KMS) host.\n\nTo use VAMT to activate Windows 10 computers without an internet connection, follow these steps:\n\n1. Install VAMT on a computer that has an internet connection.\n\n2. Obtain the MAK for your organization's Windows 10 Pro licenses.\n\n3. Connect to the VAMT database.\n\n4. Add the MAK to VAMT by selecting the \"Import Product Keys\" option and providing the MAK.\n\n5. Add the new Windows 10 Pro computers to VAMT by selecting the \"Add Machines\" option and providing the host names or IP addresses of the computers.\n\n6. Select the new Windows 10 Pro computers in VAMT and select the \"Activate\" option.\n\n7. Follow the prompts in the activation wizard to complete the activation process."
      },
      {
        "date": "2022-12-19T22:06:00.000Z",
        "voteCount": 2,
        "content": "Note: Option B, Key Management Service (KMS), can also be used to activate Windows 10 computers without an internet connection. However, it requires setting up a local KMS host and configuring the client computers to use the local KMS host for activation. \n\nOption C, Windows Process Activation Service, is not related to Windows product activation. \n\nOption D, Get-WmiObject cmdlet, is a PowerShell cmdlet that can be used to retrieve WMI (Windows Management Instrumentation) objects, but it is not related to Windows product activation."
      },
      {
        "date": "2023-03-12T15:50:00.000Z",
        "voteCount": 1,
        "content": "Key Management Service (KMS) requires a minimum of 25 computers to activate, and VAMT can be a better choice if the company has only purchased a small number of computers.\n\nHowever, it is worth noting that the exact number of computers that the company has purchased is not specified in the scenario provided. The word \"SEVERAL\" is ambiguous and could mean different things to different people. It is possible that the company has purchased enough computers to meet the minimum threshold for KMS activation, but without more information, it is difficult to say for sure.\n\nIn any case, VAMT is a viable option for activating a small number of computers, and it provides additional features such as license compliance checking that can be useful for managing software licenses in an organization."
      },
      {
        "date": "2022-12-04T21:25:00.000Z",
        "voteCount": 2,
        "content": "VAMT requires internet connectivity. 'Several' is a relative term with no finite number.\n\nThe following table lists the system requirements for the VAMT host computer:\nNetwork\tConnectivity to remote computers via Windows Management Instrumentation (TCP/IP) and Microsoft Activation Web Service on the Internet via HTTPS\n\nhttps://learn.microsoft.com/en-us/windows/deployment/volume-activation/vamt-requirements"
      },
      {
        "date": "2022-12-03T11:27:00.000Z",
        "voteCount": 1,
        "content": "You can use the Volume Activation Management Tool (VAMT) to perform activation for client computers that don't have Internet access. https://learn.microsoft.com/en-us/windows/deployment/volume-activation/proxy-activation-vamt"
      },
      {
        "date": "2022-11-08T10:52:00.000Z",
        "voteCount": 1,
        "content": "VAMT can also activate on behalf of clients without Internet access, acting as a MAK proxy.\n\nSource: Microsoft"
      },
      {
        "date": "2022-11-03T10:46:00.000Z",
        "voteCount": 1,
        "content": "isn't the question actually that you use KSM or MAK. MAK en KMS are a part of VAMT (is just a tool). I think that they use the term VAMT to trow us of guard.\n\n\nKMS has specific requirements :\nClients will activate if the count is 25 or higher\nServers will activate if the count is 5 or higher.\n\n KMS should be your preferable activation method as long as you meet the activation threshold and the (very) basic requirements for deploying KMS (which are DNS and TCP/IP connectivity between the clients and the KMS host). It can also be used offline by using proxy.\n\nMAK activation method should be used only for computers that never connect to the corporate network and for environments where the number of physical computers does not meet the KMS activation threshold and Active Directory-based activation could not be used for some reason.\n\nMy anwser then should be A then. Servel doesn't sound like 25 or more computers. Also the computers never connected to the corporate internet."
      },
      {
        "date": "2022-09-12T18:01:00.000Z",
        "voteCount": 1,
        "content": "Resposta Correta:\nB. Faça uso do Key Management Service (KMS)"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 4,
    "url": "https://www.examtopics.com/discussions/microsoft/view/59887-exam-md-100-topic-1-question-4-discussion/",
    "body": "Your network contains an Active Directory domain. All users have been issued with computers that run Windows 8.1.<br>A user named Mia Hamm has a computer named Computer1. You upgrade Computer1 to Windows 10 by performing a clean installation of Windows 10 without formatting the drives.<br>You need to migrate the settings for Mia Hamm from Windows 8.1 to Windows 10.<br>Which two actions should you perform?<br>NOTE: Each correct selection is worth one point.<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun scanstate.exe and specify the C:\\Users folder",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun loadstate.exe and specify the C:\\Windows.old folder",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun usmultils.exe and specify the C:\\Users folder",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun scanstate.exe and specify the C:\\Windows.old folder\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun loadstate.exe and specify the C:\\Users folder\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"F\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tF.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun usmultils.exe and specify the C:\\Windows.old folder"
    ],
    "answer": "DE",
    "answerDescription": "",
    "votes": [
      {
        "answer": "DE",
        "count": 8,
        "isMostVoted": true
      },
      {
        "answer": "BD",
        "count": 5,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-08-18T07:35:00.000Z",
        "voteCount": 8,
        "content": "Answer is correct. Need to run scanstate to the Old folder which will have the settings used in 8.1"
      },
      {
        "date": "2023-08-13T12:56:00.000Z",
        "voteCount": 1,
        "content": "AI models chat sonic and gpt state a&amp;e"
      },
      {
        "date": "2023-03-12T17:58:00.000Z",
        "voteCount": 2,
        "content": "Situation:\nThe scenario describes a situation where all users in an Active Directory domain have been issued computers that run Windows 8.1. A user named Mia Hamm has a computer named Computer1, which is upgraded to Windows 10 by performing a clean installation of Windows 10 without formatting the drives. The task is to migrate the settings for Mia Hamm from Windows 8.1 to Windows 10.\n\nCorrect answer:\nThe correct actions to migrate the settings for Mia Hamm from Windows 8.1 to Windows 10 are as follows:\n\nAnswer D: Run scanstate.exe and specify the C:\\Windows.old folder to capture the user state data, including settings, from the Windows 8.1 installation that was upgraded to Windows 10.\n\nAnswer E: Run loadstate.exe and specify the C:\\Users folder to load the captured user state data onto the Windows 10 installation."
      },
      {
        "date": "2023-03-12T18:03:00.000Z",
        "voteCount": 1,
        "content": "Explanation:\nAnswer A: Running scanstate.exe and specifying the C:\\Users folder will capture the user state data from the Windows 8.1 installation, but this will not include any settings that were present in the upgraded Windows 10 installation.\n\nAnswer B: Running loadstate.exe and specifying the C:\\Windows.old folder will not work because the C:\\Windows.old folder does not contain any user state data.\n\nAnswers C and F: Running usmultils.exe and specifying the C:\\Users and C:\\Windows.old folders will not capture any user state data because usmultils.exe is a language resource tool, not a user state migration tool."
      },
      {
        "date": "2022-10-26T11:57:00.000Z",
        "voteCount": 3,
        "content": "I'm not getting why E... for me it is B.\n\nhttps://learn.microsoft.com/en-us/windows/deployment/usmt/usmt-loadstate-syntax\n\nStorePath\tIndicates the folder where the files and settings data (to migrate) are stored. You must specify StorePath when using the LoadState command. You cannot specify more than one StorePath."
      },
      {
        "date": "2022-09-21T03:16:00.000Z",
        "voteCount": 2,
        "content": "I don't know if the answer is correct. \nThe following commands do work:\n\nscanstate \\usmt /all /v:13 /hardlink /nocompress /i:miguser.xml /i:migapp.xml /i:migdocs.xml /offlinewindir:\\windows.old\\windows\n\n\nloadstate \\usmt /all /v:13 /hardlink /nocompress /i:miguser.xml /i:migapp.xml /i:migdocs.xml /lac /lae\n\nSo you will need to specify the Windows.old directory with the /offlinewindir parameter but you will also need to specify a store patch where the collected files will be stored.\n\nYou will never have to specify a destination directory like C:\\users\n\nSo I think both commands need to have the same path. I will go with BD."
      },
      {
        "date": "2022-09-21T03:32:00.000Z",
        "voteCount": 2,
        "content": "I checked the commands above, you will always have to define the same Store path, but for the scanstate command you will have to enter the /offlinewindir:\\windows.old\\windows parameter to point it to the offline Windows.old directory. So it's BD!"
      },
      {
        "date": "2022-03-31T00:58:00.000Z",
        "voteCount": 2,
        "content": "answer is incorrect.\nfor the load state command you need to specify the same path that you specified in the scanstate command. If you do not how will it know where the fetch the dat from. The data will be exported automatically to the users folder without you telling it to do so. you can include or exclude user profiles that have been migrated"
      },
      {
        "date": "2022-03-08T02:48:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct"
      },
      {
        "date": "2022-01-20T13:08:00.000Z",
        "voteCount": 3,
        "content": "Answer is correct"
      },
      {
        "date": "2021-12-17T08:01:00.000Z",
        "voteCount": 3,
        "content": "Correct.\n\nUSMT includes two tools that migrate settings and data: ScanState and LoadState. ScanState collects information from the source computer, and LoadState applies that information to the destination computer."
      },
      {
        "date": "2021-11-29T01:49:00.000Z",
        "voteCount": 2,
        "content": "Correct.\n\nUSMT includes two tools that migrate settings and data: ScanState and LoadState. ScanState collects information from the source computer, and LoadState applies that information to the destination computer."
      },
      {
        "date": "2021-11-12T04:18:00.000Z",
        "voteCount": 2,
        "content": "Correct.\n\nUSMT includes two tools that migrate settings and data: ScanState and LoadState. ScanState collects information from the source computer, and LoadState applies that information to the destination computer."
      },
      {
        "date": "2021-10-26T05:00:00.000Z",
        "voteCount": 4,
        "content": "Answer is correct. The correct link should be: https://docs.microsoft.com/en-us/windows/deployment/usmt/usmt-common-migration-scenarios"
      },
      {
        "date": "2021-10-23T21:50:00.000Z",
        "voteCount": 1,
        "content": "The URL in the Solution area is no longer valid.  Can someone update it, please?"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 5,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63543-exam-md-100-topic-1-question-5-discussion/",
    "body": "You have a computer named Computer1 that runs Windows 10.<br>You deploy an application named Application1 to Computer1.<br>You need to assign credentials to Application1.<br>You need to meet the following requirements:<br>✑ Ensure that the credentials for Application1 cannot be used by any user to log on to Computer1.<br>✑ Ensure that the principle of least privilege is maintained.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure Application1 to sign in as the Local System account and select the Allow service to interact with desktop check box.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a user account for Application1 and assign that user account the Deny log on locally user right\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tCreate a user account for Application1 and assign that user account the Deny log on as a service user right",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure Application1 to sign in as the Local Service account and select the Allow service to interact with desktop check box."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 8,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-03-12T17:55:00.000Z",
        "voteCount": 2,
        "content": "Assigning the Service1 account the Deny log-on locally user right would prevent any user from logging on to the computer using that account. This would meet the requirement of ensuring that the credentials for Application1 cannot be used by any user to log on to Computer1. Additionally, by creating a separate user account for Application1 and assigning that account the necessary permissions, you are maintaining the principle of least privilege. \n\nAnswer B is the correct answer."
      },
      {
        "date": "2023-03-12T17:55:00.000Z",
        "voteCount": 2,
        "content": "Answer A is incorrect because configuring Application1 to sign in as the Local System account would give it too much privilege and potentially allow it to perform actions that it doesn't need to perform.\n\nAnswer C is incorrect because denying the log-on as a service user right would prevent the Service1 account from starting any service on the computer, including Application1.\n\nAnswer D is incorrect because configuring Application1 to sign in as the Local Service account would also give it too much privilege and potentially allow it to perform actions that it doesn't need to perform."
      },
      {
        "date": "2022-03-07T16:21:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      },
      {
        "date": "2022-01-20T13:11:00.000Z",
        "voteCount": 2,
        "content": "Correct"
      },
      {
        "date": "2021-12-19T07:13:00.000Z",
        "voteCount": 2,
        "content": "B. Create a user account for Application1 and assign that user account the Deny log on locally user right"
      },
      {
        "date": "2021-12-17T08:03:00.000Z",
        "voteCount": 2,
        "content": "pota, pota and pota"
      },
      {
        "date": "2021-11-29T01:50:00.000Z",
        "voteCount": 2,
        "content": "B. Create a user account for Application1 and assign that user account the Deny log on locally user right"
      },
      {
        "date": "2021-10-26T05:02:00.000Z",
        "voteCount": 3,
        "content": "Correct answer."
      },
      {
        "date": "2021-10-03T23:04:00.000Z",
        "voteCount": 4,
        "content": "Correct! :)"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 6,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63915-exam-md-100-topic-1-question-6-discussion/",
    "body": "Your network contains an Active Directory domain that is synced to a Microsoft Azure Active Directory (Azure AD) tenant. All users have been issued with laptop computers as well as desktop computers that run Windows 10 Enterprise. All users have Microsoft 365 E3 licenses.<br>A user named Mia Hamm informs you that she must perform a BitLocker recovery on her laptop but she does not have her BitLocker recovery key.<br>You need to ensure that Mia Hamm can perform a BitLocker recovery on her laptop.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstruct Mia Hamm to log on to her desktop computer and run the repair-bde.exe command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstruct Mia Hamm to use the BitLocker Recovery Password Viewer to view the computer object of the laptop.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstruct Mia Hamm to log on to her desktop computer and go to https://account.activedirectory.windowsazure.com and view the user account profile.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tInstruct Mia Hamm to run the Enable-BitLocker cmdlet on her laptop."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 8,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-10-10T12:01:00.000Z",
        "voteCount": 6,
        "content": "Correto!"
      },
      {
        "date": "2023-05-10T08:33:00.000Z",
        "voteCount": 1,
        "content": "I didn't find bitlocker recovery key at https://account.activedirectory.windowsazure.com"
      },
      {
        "date": "2023-03-12T18:22:00.000Z",
        "voteCount": 3,
        "content": "Answer C is the correct answer as it allows Mia Hamm to access her recovery key by viewing her user account profile in the Azure AD portal. Since all users in the domain have Microsoft 365 E3 licenses, they have access to Azure AD, and it is likely that the recovery key was stored there when Mia's laptop was first encrypted with BitLocker. \n\nINCORRECT:\nAnswer A is incorrect because running the repair-bde.exe command is used to repair damaged BitLocker-encrypted volumes, not recover a lost recovery key. \n\nAnswer B is incorrect because the BitLocker Recovery Password Viewer is used to view the recovery passwords for BitLocker-encrypted volumes, not the recovery key for a specific device. \n\nAnswer D is incorrect because running the Enable-BitLocker cmdlet would encrypt Mia's laptop with BitLocker, but it does not help her recover her lost recovery key."
      },
      {
        "date": "2023-01-28T04:18:00.000Z",
        "voteCount": 1,
        "content": "Similar question on 1/27/23 exam, know this!"
      },
      {
        "date": "2022-11-14T09:58:00.000Z",
        "voteCount": 1,
        "content": "https://learn.microsoft.com/en-us/training/modules/explore-device-encryption-features/4-recover-bitlocker-encrypted-drive"
      },
      {
        "date": "2022-10-08T11:23:00.000Z",
        "voteCount": 1,
        "content": "“If your device was ever signed into an organization using a work or school email account, your recovery key may be stored in that organization's Azure AD account. You may be able to access it directly or you may need to contact a system administrator to access your recovery key.”\nReference: \nhttps://support.microsoft.com/en-us/windows/finding-your-bitlocker-recovery-key-in-windows-6b71ad27-0b89-ea08-f143-056f5ab347d6"
      },
      {
        "date": "2022-04-07T23:26:00.000Z",
        "voteCount": 3,
        "content": "Nice reference link ..."
      },
      {
        "date": "2021-12-01T08:00:00.000Z",
        "voteCount": 3,
        "content": "C is Correct:\nhttps://account.activedirectory.windowsazure.com/r?/profile#/profile"
      },
      {
        "date": "2021-11-29T01:50:00.000Z",
        "voteCount": 4,
        "content": "C. Instruct Mia Hamm to log on to her desktop computer and go to https://account.activedirectory.windowsazure.com and view the user account profile."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 7,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63544-exam-md-100-topic-1-question-7-discussion/",
    "body": "Your company has an on-premises network that contains an Active Directory domain. The domain is synced to Microsoft Azure Active Directory (Azure AD). All computers in the domain run Windows 10 Enterprise.<br>You have a computer named Computer1 that has a folder named Folder1.<br>You must provide users in group named Group1 with the ability to view the list of files in Folder1. Your solution must ensure that the principle of least privilege is maintained.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign the Full control permissions for the Folder1 folder to Group1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign the Read permissions for the Folder1 folder to Group1.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign the List folder permissions for the Folder1 folder to Group1.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tAssign the Take ownership permissions for the Folder1 folder to Group1."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 7,
        "isMostVoted": true
      },
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": false
      }
    ],
    "comments": [
      {
        "date": "2021-10-06T07:23:00.000Z",
        "voteCount": 6,
        "content": "Read access would allow them to not only see the list of files but also see the contents of the file. This would break the least privelege requirement"
      },
      {
        "date": "2023-03-12T18:28:00.000Z",
        "voteCount": 2,
        "content": "The correct answer is Answer C - Assign the List folder permissions for the Folder1 folder to Group1.\n\nAssigning the List folder permissions for the Folder1 folder to Group1 would allow the members of Group1 to see the list of files in the folder, but they would not be able to open, modify, or delete the files. This solution would maintain the principle of least privilege, as it only grants the minimum necessary permissions required for the task."
      },
      {
        "date": "2023-03-12T18:29:00.000Z",
        "voteCount": 1,
        "content": "INCORRECT:\n\nAssigning Full control permissions (Answer A) would give Group1 more permissions than necessary and could potentially lead to accidental or intentional modification or deletion of files.\n\nAssigning only Read permissions (Answer B) would allow Group1 to VIEW the contents of the files in addition to the list of files, which is not required in this scenario.\n\nAssigning Take ownership permissions (Answer D) would allow Group1 to take ownership of the folder, which is not required for the task and could potentially lead to unintended consequences."
      },
      {
        "date": "2023-03-10T12:22:00.000Z",
        "voteCount": 1,
        "content": "B is correct"
      },
      {
        "date": "2022-04-04T04:51:00.000Z",
        "voteCount": 2,
        "content": "I believe you need to apply the special permission to list folder contents. The read permission in this case is overkill."
      },
      {
        "date": "2022-03-10T22:44:00.000Z",
        "voteCount": 2,
        "content": "Answer is C. List folder (contents). Can use link or in general search, ntfs permissions list.\nhttps://blog.foldersecurityviewer.com/understanding-ntfs-permissions/#:~:text=List%20of%20NTFS%20file%20permissions%3A%20%20%20Permission,a%20file%20...%20%202%20more%20rows%20"
      },
      {
        "date": "2022-03-08T03:39:00.000Z",
        "voteCount": 1,
        "content": "B is correct."
      },
      {
        "date": "2022-03-08T03:40:00.000Z",
        "voteCount": 2,
        "content": "I was mistaken with List Folder Permissions and List Folder Contents. The actual answer here is C. To list the Folder Contents."
      },
      {
        "date": "2022-03-07T16:43:00.000Z",
        "voteCount": 1,
        "content": "correct b"
      },
      {
        "date": "2022-01-24T05:44:00.000Z",
        "voteCount": 3,
        "content": "c is correct"
      },
      {
        "date": "2022-01-11T06:36:00.000Z",
        "voteCount": 3,
        "content": "C - cos list folder contents - That is what they want to do.\n\nIf they want to read then it will be read so they can read the files."
      },
      {
        "date": "2021-11-23T02:22:00.000Z",
        "voteCount": 2,
        "content": "You will need special permissions for this case. List folder / read data is needed here because you can't apply only List folder contents."
      },
      {
        "date": "2021-10-16T20:30:00.000Z",
        "voteCount": 2,
        "content": "I think this is B as well.  I'm not sure how it would be C"
      },
      {
        "date": "2021-10-12T05:30:00.000Z",
        "voteCount": 3,
        "content": "Read permission - Permits viewing and listing of files and subfolders"
      },
      {
        "date": "2021-10-03T23:16:00.000Z",
        "voteCount": 2,
        "content": "I would go with answer B.\n\nAnyone care to explain why this is C?"
      },
      {
        "date": "2021-10-06T14:31:00.000Z",
        "voteCount": 2,
        "content": "IMO B is correct because List folder permissions will give user permission to execute files which is not a least privilege practise."
      },
      {
        "date": "2022-01-29T13:14:00.000Z",
        "voteCount": 5,
        "content": "It´s C: The permission List in folders do not permit execution to files in it. Tested it in Win 10."
      },
      {
        "date": "2021-10-22T06:16:00.000Z",
        "voteCount": 8,
        "content": "correct answer would be C \nWith Read permissions user can actually read the contents of the files, instead of just being able to 'see' the files.in here question clearly stated that solution must ensure the principle of least privilege is maintained\" so answer B is violating the least privileges practice as it is allowing user to view the list of files plus open them and read the content of the files."
      },
      {
        "date": "2021-11-10T11:27:00.000Z",
        "voteCount": 2,
        "content": "Got it!"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 8,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64589-exam-md-100-topic-1-question-8-discussion/",
    "body": "You have a computer named Computer1 that runs Windows 10.<br>Computer1 has a folder named C:\\Folder1.<br>You need to meet the following requirements:<br>✑ Log users that access C:\\Folder1.<br>✑ Log users that modify and delete files in C:\\Folder1.<br>Which two actions should you perform?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of C:\\Folder1, configure the Auditing settings.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the properties of C:\\Folder1, select the Encryption contents to secure data option.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Audit Policy in the local Group Policy, configure Audit directory service access.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Audit Policy in the local Group Policy, you configure Audit object access.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"E\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tE.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tFrom the Audit Policy in the local Group Policy, you configure Audit system events."
    ],
    "answer": "AD",
    "answerDescription": "Files and folders are objects and are audited through object access.<br>Reference:<br>https://www.netwrix.com/how_to_detect_who_changed_file_or_folder_owner.html",
    "votes": [
      {
        "answer": "AD",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-03-12T18:34:00.000Z",
        "voteCount": 2,
        "content": "The two actions you should perform are:\n\nA. From the properties of C:\\Folder1, configure the Auditing settings.\nD. From the Audit Policy in the local Group Policy, configure Audit object access.\n\nExplanation:\n\nA. Configuring the Auditing settings on the C:\\Folder1 folder will allow you to log users that access, modify and delete files in the folder. To configure auditing, you need to go to the Properties of the folder, then to the Security tab, click on Advanced, go to the Auditing tab, and configure the desired audit settings.\n\nD. Configuring the Audit object access policy in the local Group Policy will enable logging of events related to accessing and modifying objects, such as files and folders, on the computer. To configure this policy, open the Local Group Policy Editor, go to Computer Configuration &gt; Windows Settings &gt; Security Settings &gt; Local Policies &gt; Audit Policy, and enable the Audit object access policy."
      },
      {
        "date": "2023-03-12T18:35:00.000Z",
        "voteCount": 1,
        "content": "B, C, and E are not relevant to the requirements in this scenario. The Encryption contents to secure data option in the properties of the folder are not related to logging user activities, and configuring Audit directory service access and Audit system events policies do not provide the desired logging for file and folder access and modifications."
      },
      {
        "date": "2023-01-27T09:27:00.000Z",
        "voteCount": 3,
        "content": "This was on 1/27/23 test! Know this!"
      },
      {
        "date": "2022-01-11T06:36:00.000Z",
        "voteCount": 1,
        "content": "correct A D"
      },
      {
        "date": "2021-11-28T18:01:00.000Z",
        "voteCount": 4,
        "content": "Correct! YouTube - MCITP 70-640: Windows File Auditing for a walkthrough"
      },
      {
        "date": "2021-10-24T02:12:00.000Z",
        "voteCount": 1,
        "content": "Seems OK"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 9,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63545-exam-md-100-topic-1-question-9-discussion/",
    "body": "Your company has a computer named Computer1 that runs Windows 10. Computer1 is used to provide guests with access to the Internet. Computer1 is a member of a workgroup.<br>You want to configure Computer1 to use a user account sign in automatically when the the computer is started. The user must not be prompted for a user name and password.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConfigure Group Policy preferences.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the BCDBoot command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEdit the Registry.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tRun the MSConfig command."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 9,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-10-26T05:46:00.000Z",
        "voteCount": 6,
        "content": "I use this on multiple pc's. Correct answer."
      },
      {
        "date": "2023-03-12T18:43:00.000Z",
        "voteCount": 3,
        "content": "To configure a user account to sign in automatically without prompting for a username and password on a Windows 10 computer that is a member of a workgroup, you can follow these steps:\n\n1. Press the Windows key + R to open the Run dialog box.\n2. Type \"netplwiz\" in the Run dialog box and press Enter.\n3. In the User Accounts dialog box, uncheck the box that says \"Users must enter a username and password to use this computer.\"\n4. Click on the OK button.\n5. In the Automatically sign-in dialog box, type the user name and password of the account you want to use to sign in automatically.\n6. Click on the OK button.\n\nThe correct answer is Answer C. Edit the Registry."
      },
      {
        "date": "2023-03-12T18:44:00.000Z",
        "voteCount": 1,
        "content": "Answer A is incorrect because Group Policy preferences can only be used in a domain environment and not in a workgroup.\n\nAnswer B is incorrect because the BCDBoot command is used to boot an operating system from an installation image, not to configure automatic sign-in.\n\nAnswer D is incorrect because the MSConfig command is used to configure startup options, not to configure automatic sign-in.\n\nIn a workgroup environment, the Registry is used to configure automatic sign-in. Therefore, Answer C is the correct answer."
      },
      {
        "date": "2022-04-25T04:21:00.000Z",
        "voteCount": 1,
        "content": "While C is correct, you can use group policy preferences to push registry settings to a computer in the OU using the registry wizard.  My first reaction to this being a Group Policy admin for so many years was to use group policy preferences.  Buuuutttt, the computer is a member of a workgroup, so no AD.  Charlie is right in this case."
      },
      {
        "date": "2022-04-04T04:54:00.000Z",
        "voteCount": 2,
        "content": "This is definitely C. I have set this up on a few public access computers."
      },
      {
        "date": "2022-03-08T07:17:00.000Z",
        "voteCount": 1,
        "content": "C is correct"
      },
      {
        "date": "2022-02-07T05:03:00.000Z",
        "voteCount": 2,
        "content": "C is correct"
      },
      {
        "date": "2021-10-03T23:18:00.000Z",
        "voteCount": 3,
        "content": "C sounds legit!"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 10,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63116-exam-md-100-topic-1-question-10-discussion/",
    "body": "SIMULATION -<br>You have a computer named Computer1 that runs Windows 10.<br>Computer1 has a folder named C:\\Folder1.<br>You need to meet the following requirements:<br>✑ Provide a user named Jon Ross with the ability to modify the permissions of C:\\Folder1.<br>✑ Ensure that the principle of least privilege is maintained.<br>What should you do?<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. In Windows Explorer, right-click the C:\\Folder1 folder, and then click Properties.<br>2. Click on the Security tab, and then click Edit.<br>3. In the Permissions dialog box, add Jon Ross.<br>4. Specify the Allow Modify permissions for the Jon Ross.<br>5. Click OK twice to close the Security dialog box.<br>6. Click OK twice to close the Properties dialog box.<br>Reference:<br>https://docs.microsoft.com/en-us/iis/web-hosting/configuring-servers-in-the-windows-web-platform/configuring-share-and-ntfs-permissions",
    "votes": [],
    "comments": [
      {
        "date": "2021-09-28T08:33:00.000Z",
        "voteCount": 14,
        "content": "The \"ability to modify the permissions\" in the question is different from the \"Allow Modify permissions\" in the answer.  The first part seems like it needs Full Control."
      },
      {
        "date": "2021-10-25T23:47:00.000Z",
        "voteCount": 11,
        "content": "1. In Windows Explorer, right-click the C:\\Folder1 folder, and then click Properties.\n2. Click on the Security tab, and then click Edit.\n3. In the Permissions dialog box, add Jon Ross.\n4. Click OK\n5. Click Advanced\n6. Select Jon Ross, and click Edit\n7. Click 'Show advanced permissions'\n8. Select only 'Read permissions' and 'Change permissions' (modify permissions &amp; least privilege)\n9. Click 3x OK\n\nWhat about inheritance? Jon Ross is member of the Users group. The Users group has 'Read &amp; Execute' rights"
      },
      {
        "date": "2021-11-01T04:24:00.000Z",
        "voteCount": 1,
        "content": "Jon Ross is member of the 'users' group, The 'users' group has already 'Read permissions' zo Ron Ross needs only 'Change permissions'"
      },
      {
        "date": "2021-11-02T05:50:00.000Z",
        "voteCount": 2,
        "content": "When you remove inheritance rights Jon Ross must als have 'Read Permissions'"
      },
      {
        "date": "2022-01-17T18:35:00.000Z",
        "voteCount": 1,
        "content": "Verified. This is the most correct solution."
      },
      {
        "date": "2023-09-03T02:59:00.000Z",
        "voteCount": 1,
        "content": "Answer is incorrect, the Modify permission allows modifying the object's name AND object's deletion. But you cannot modify its security properties. Jon Ross needs Full Control to manage permissions of the object. If Jon has the Modify permissions on an object and tries to change its permissions, he will be prompted by UAC to login with an account that has the rights to do so."
      },
      {
        "date": "2023-03-12T19:26:00.000Z",
        "voteCount": 1,
        "content": "To maintain the principle of least privilege. The better approach would be to grant Jon Ross the Modify permission for the C:\\Folder1 folder. This can be done by following these steps:\n\n1. Right-click the C:\\Folder1 folder and select \"Properties.\"\n2. Click the \"Security\" tab and then click the \"Edit\" button.\n3. Click the \"Add\" button and type in \"Jon Ross\" in the \"Enter the object names to select\" box.\n4. Click \"Check Names\" to verify that the user account is found, and then click \"OK.\"\n5. In the \"Permissions for Jon Ross\" section, select the \"Modify\" permission and click \"OK.\"\n\nThis will grant Jon Ross the ability to modify the contents of the folder, but not any other settings on the computer."
      },
      {
        "date": "2022-12-19T01:25:00.000Z",
        "voteCount": 1,
        "content": "User should have advanced permission 'Read Permission AND Change Permission'.\nThis uses least privilege. I tested this in a lab environment."
      },
      {
        "date": "2022-09-06T02:33:00.000Z",
        "voteCount": 6,
        "content": "Just tested this, you need Full Controll! Modify isn't enough!"
      },
      {
        "date": "2022-02-08T03:15:00.000Z",
        "voteCount": 2,
        "content": "Whilst \"Full Control\" would give the user the required access you need to make sure we are meeting the criteria:\n\n\"Ensure that the principle of least privilege is maintained\"\n\nAs such we should give the user \"Change Permissions\" from the Advanced Permissions screen in the Security area of the file/folder."
      },
      {
        "date": "2022-01-12T09:01:00.000Z",
        "voteCount": 6,
        "content": "you must have a Full control to modify permissions"
      },
      {
        "date": "2021-10-14T03:38:00.000Z",
        "voteCount": 4,
        "content": "This should be full access."
      },
      {
        "date": "2021-10-04T00:19:00.000Z",
        "voteCount": 5,
        "content": "WRONG.\nAnswer overslept \"Ensure that the principle of least privilege is maintained\".\nChecked on server...\n\nFor user to be allowed to make Permission changes he needs only these two:\n\"Read Permissions\"\n\"Change Permissions\"."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 11,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64800-exam-md-100-topic-1-question-11-discussion/",
    "body": "Your network contains an Active Directory domain. The domain contains computers that run Windows 10.<br>You must ensure that Windows BitLocker Drive Encryption is enabled on all client computers, even though a Trusted Platform Module (TPM) chip is installed in only some of them.<br>You need to accomplish this goal by using one Group Policy object (GPO).<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Allow enhanced PINs for startup policy setting, and select the Allow BitLocker without a compatible TPM check box.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Enable use of BitLocker authentication requiring preboot keyboard input on slates policy setting, and select the Allow BitLocker without a compatible TPM check box.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Require additional authentication at startup policy setting, and select the Allow BitLocker without a compatible TPM check box.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tEnable the Control use of BitLocker on removable drives policy setting, and select the Allow BitLocker without a compatible TPM check box."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 6,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-03-12T20:00:00.000Z",
        "voteCount": 2,
        "content": "The correct answer is C. Enable the Require additional authentication at the startup policy setting, and select the Allow BitLocker without a compatible TPM check box.\n\nExplanation: The Require additional authentication at startup policy setting allows BitLocker to be enabled on a computer without a TPM chip. Additionally, selecting the Allow BitLocker without a compatible TPM check box enables BitLocker to be used on computers that do not have a TPM chip."
      },
      {
        "date": "2023-03-12T20:01:00.000Z",
        "voteCount": 1,
        "content": "INCORRECT:\n\nAnswer A is incorrect because enabling enhanced PINs for a startup does not allow BitLocker to be enabled without a TPM. It simply allows longer PINs or a combination of PINs and startup keys.\n\nAnswer B is incorrect because enabling BitLocker authentication requiring preboot keyboard input on slates does not apply to all client computers, and it also does not enable BitLocker without a compatible TPM.\n\nAnswer D is incorrect because it applies to removable drives, not the local hard drive, and it also does not enable BitLocker without a compatible TPM."
      },
      {
        "date": "2021-11-29T02:32:00.000Z",
        "voteCount": 4,
        "content": "C. Enable the Require additional authentication at startup policy setting, and select the Allow BitLocker without a compatible TPM check box."
      },
      {
        "date": "2021-10-26T05:53:00.000Z",
        "voteCount": 3,
        "content": "Correct answer. \nThis way either a password or a start-up key (on a USB Drive) is required."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 12,
    "url": "https://www.examtopics.com/discussions/microsoft/view/66909-exam-md-100-topic-1-question-12-discussion/",
    "body": "SIMULATION -<br>You have a computer named Computer1. Computer1 runs Windows 10 Pro.<br>You have a mobile device. You use Bluetooth to pair the mobile device to Computer1.<br>You want to enable dynamic lock on Computer1.<br>What should you do?<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. On Computer1, select the Start button &gt; Settings  &gt; Accounts &gt; Sign-in options.<br>2. Under Dynamic lock, select the Allow Windows to automatically lock your device when you're away check box.<br>Reference:<br>https://support.microsoft.com/en-za/help/4028111/windows-lock-your-windows-10-pc-automatically-when-you-step-away-from",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-12T20:08:00.000Z",
        "voteCount": 2,
        "content": "To enable dynamic lock on Computer1, follow these steps:\n\n1. On Computer1, click on the Start menu and select \"Settings\" (gear icon).\n2. Click on \"Accounts\".\n3. Click on \"Sign-in options\" in the left pane.\n4. Scroll down to the \"Dynamic lock\" section and check the box next to \"Allow Windows to automatically lock your device when you're away\".\n5. Click on the \"Add a Bluetooth device\" link.\n6. Select your mobile device from the list of available devices and click \"Pair\".\n7. Once the device is paired, close the Settings window.\n\nThe dynamic lock is now enabled on Computer1, and it will automatically lock itself when the paired mobile device is out of range."
      },
      {
        "date": "2023-02-21T10:14:00.000Z",
        "voteCount": 1,
        "content": "On your Windows 10 PC, select Start &gt; Settings &gt; Accounts &gt; Sign-in options.\nWindows way to do!!!\n\nSelect Dynamic lock, then select the Allow Windows to automatically lock your device when you're away check box.\n\nTake your phone with you when you move away from your PC, and it will automatically lock a minute or so after you're out of Bluetooth range. (Note that Bluetooth range varies by devices.)"
      },
      {
        "date": "2022-12-07T05:33:00.000Z",
        "voteCount": 2,
        "content": "How to answer on this type of questions on real exam? Does they offer answers or something else?"
      },
      {
        "date": "2023-01-14T05:02:00.000Z",
        "voteCount": 2,
        "content": "It's a lab assignment, you need to sign into a machine and perform what's requested"
      },
      {
        "date": "2022-10-27T04:37:00.000Z",
        "voteCount": 1,
        "content": "start--dynamic lock--check box under dinamic lock."
      },
      {
        "date": "2021-11-29T02:35:00.000Z",
        "voteCount": 4,
        "content": "https://support.microsoft.com/en-us/windows/lock-your-windows-pc-automatically-when-you-step-away-from-it-d0a5f536-74ac-0859-820a-4140dac9fcaf"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 13,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63546-exam-md-100-topic-1-question-13-discussion/",
    "body": "HOTSPOT -<br>Your network contains an Active Directory domain. The domain contains computers that run Windows 10.<br>A user named Mia Hamm has a computer named Computer1. Mia Hamm reports that when she logs on to Computer1, she cannot access servers on the network but she can access computers on the internet.<br>You run the ipconfig command on Computer1 and receive the following output.<br><img src=\"/assets/media/exam-media/04292/0001200001.jpg\" class=\"in-exam-image\"><br>You successfully ping the default gateway, the DNS servers, and the DHCP server.<br>You need to resolve the connectivity problem on Computer1.<br>Which setting should you configure? To answer, select the appropriate options in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0001300001.jpg\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0001500001.jpg\" class=\"in-exam-image\">",
    "answerDescription": "The preferred DNS server is located on the internet as it has a public IP Address. The local DNS server should be the preferred DNS server. We could manually change the preferred and alternate DNS server addresses or we could select the \"Obtain DNS server address automatically\" option to have the DNS servers configured through DHCP.",
    "votes": [],
    "comments": [
      {
        "date": "2021-11-04T07:48:00.000Z",
        "voteCount": 9,
        "content": "Obviously the right answer.\nYou're using a Public DNS Server to access local servers/hostname. That won't work."
      },
      {
        "date": "2023-01-08T23:26:00.000Z",
        "voteCount": 1,
        "content": "Alternate DNS server is used if the request to primary server has timed out."
      },
      {
        "date": "2021-10-03T23:40:00.000Z",
        "voteCount": 5,
        "content": "Agreed!"
      },
      {
        "date": "2023-03-12T20:18:00.000Z",
        "voteCount": 1,
        "content": "Public DNS servers may not be able to resolve internal hostnames in your Active Directory domain. You should configure the DNS settings on Computer1 to use the IP address of your domain controller as the primary DNS server. This will allow Mia Hamm to resolve internal hostnames on the network.\n\nAfter configuring the DNS settings, Mia Hamm should be able to access servers on the network.\n\nOptionally, you can also enter the IP address of a public DNS server as the secondary DNS server, in case the primary DNS server is unavailable."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 14,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63547-exam-md-100-topic-1-question-14-discussion/",
    "body": "SIMULATION -<br>You have a computer named Computer1. Computer1 runs Windows 10 Pro. Computer1 has a cellular connection and a Wi-Fi connection.<br>You want to prevent Computer1from using the cellular connection unless a you manually connects to the cellular network.<br>What should you do?<br>To complete this task, sign in to the required computer or computers.<br>",
    "options": [],
    "answer": "See explanation below.",
    "answerDescription": "1. Select the Network icon on the lower right corner of the taskbar, and then select the cellular network  icon.<br>2. Clear the Let Windows manage this connection check box.<br>Reference:<br>https://support.microsoft.com/en-za/help/10739/windows-10-cellular-settings",
    "votes": [],
    "comments": [
      {
        "date": "2021-12-09T02:44:00.000Z",
        "voteCount": 4,
        "content": "Correct!  https://support.microsoft.com/en-us/windows/cellular-settings-in-windows-905568ff-7f31-3013-efc7-3f396ac92cd7"
      },
      {
        "date": "2021-10-03T23:43:00.000Z",
        "voteCount": 3,
        "content": "Correct!"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 15,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64067-exam-md-100-topic-1-question-15-discussion/",
    "body": "You have a computer named Computer1. Computer1 runs Windows 10 Pro.<br>Computer1 is experiencing connectivity issues.<br>You need to view the IP addresses of any remote computer that Computer1 has an active TCP connection to.<br>Should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn Windows Administrative Tools, open Performance Monitor.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Control Panel, open Network and Internet. Then select Network and Sharing Center.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn Windows Administrative Tools, open Resource Monitor.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIn the Setting app, open Update and Security. Then open Windows Security and select Firewall and Network protection."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 1,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-10-16T12:18:00.000Z",
        "voteCount": 17,
        "content": "The Solution is 100 % correct. Tested this my self.\nIn addition you can also run the command netstate -a in cmd/powershell."
      },
      {
        "date": "2021-10-14T00:38:00.000Z",
        "voteCount": 6,
        "content": "I dont think the correct answer is even displayed here. The question states that you need to see the IP adresses of any remote computers that Computer1 has an active TCP connection to. The only way to really to that is to go to cmd and type in: netstat -a\n\nthe -a stands for all active connections."
      },
      {
        "date": "2021-10-22T07:46:00.000Z",
        "voteCount": 14,
        "content": "C is OK\nOpen the Resource Monitor --&gt; Network tab --&gt; TCP Connections --&gt; Remote Address"
      },
      {
        "date": "2023-10-01T14:45:00.000Z",
        "voteCount": 1,
        "content": "netstat -a does not show the remote address"
      },
      {
        "date": "2023-03-12T20:34:00.000Z",
        "voteCount": 1,
        "content": "In Windows Administrative Tools, open Resource Monitor.\n\nResource Monitor provides real-time monitoring of various system resources, including network activity. It allows you to view detailed information about active TCP connections, including the remote IP addresses of the connected computers. By using Resource Monitor, you can easily identify any remote computers that Computer1 has an active TCP connection to, which can help in troubleshooting connectivity issues.\n\nAnswer A (Performance Monitor) allows you to view system performance metrics, but not specific information about active TCP connections.\n\nAnswer B (Network and Sharing Center) allows you to view information about network connections and adapters, but not specific information about active TCP connections.\n\nAnswer D (Windows Security and Firewall and Network protection) allows you to manage firewall and network settings, but not specific information about active TCP connections."
      },
      {
        "date": "2022-10-08T18:15:00.000Z",
        "voteCount": 1,
        "content": "Ways to Launch Resource Monitor in Windows 10\n\n\"Network: Showcases the programs that access the network and the IP address they are connected to.\"  \nReference:\nhttps://www.howto-connect.com/launch-resource-monitor-windows-10/"
      },
      {
        "date": "2022-09-06T17:11:00.000Z",
        "voteCount": 1,
        "content": "C get you the information you need"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 16,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64590-exam-md-100-topic-1-question-16-discussion/",
    "body": "You have a computer named Computer1. Computer1 runs Windows 10 Pro.<br>You attempt to start Computer1 but you receive the following error message:<br>Bootmgr is missing.<br>You need to be able to start Computer1.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart the computer in recovery mode and run the bootrec /rebuildbcd command.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart the computer in recovery mode and run the diskpart /repair command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart the computer in recovery mode and run the bcdboot /s command.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tStart the computer in recovery mode and run the bootcfg /debug command."
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [
      {
        "answer": "A",
        "count": 4,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-10-26T06:10:00.000Z",
        "voteCount": 6,
        "content": "Correct answer.\n\nhttps://support.microsoft.com/en-us/topic/use-bootrec-exe-in-the-windows-re-to-troubleshoot-startup-issues-902ebb04-daa3-4f90-579f-0fbf51f7dd5d\n\nUse the Bootrec.exe tool to troubleshoot a \"Bootmgr Is Missing\" error. If rebuilding the BCD store doesn't resolve the startup issue, you can export and delete the BCD store and then run this option again. By doing this, you make sure that the BCD store is completely rebuilt."
      },
      {
        "date": "2023-03-12T20:39:00.000Z",
        "voteCount": 3,
        "content": "The correct answer is A. Start the computer in recovery mode and run the bootrec /rebuildbcd command.\n\nExplanation: The \"Bootmgr is missing\" error message usually indicates a problem with the Windows bootloader. One way to fix this issue is to run the bootrec /rebuildbcd command from the recovery mode, which can be accessed by using a Windows installation media or the Windows Recovery Environment. This command rebuilds the boot configuration data (BCD) file, which is responsible for loading the operating system."
      },
      {
        "date": "2023-03-12T20:39:00.000Z",
        "voteCount": 1,
        "content": "Answer B is incorrect because the diskpart utility is used for managing disks and volumes and is not used for repairing the boot manager.\n\nAnswer D is incorrect because the bootcfg utility is a command-line tool for modifying the Boot.ini file, which is not used in Windows 10.\n\nAnswer C is partially correct but incomplete. While the bcdboot command can be used to create a new boot loader on the system partition, it requires additional parameters to specify the target location and the boot configuration data. The correct syntax would be \"bcdboot C:\\Windows /s C:\" where C:\\Windows is the location of the Windows installation and C: is the target partition for the boot loader."
      },
      {
        "date": "2022-03-08T07:34:00.000Z",
        "voteCount": 1,
        "content": "Correct answer."
      },
      {
        "date": "2021-11-29T02:36:00.000Z",
        "voteCount": 3,
        "content": "A. Start the computer in recovery mode and run the bootrec /rebuildbcd command."
      },
      {
        "date": "2021-11-10T11:50:00.000Z",
        "voteCount": 4,
        "content": "Agree.\nhttps://support.microsoft.com/en-us/topic/use-bootrec-exe-in-the-windows-re-to-troubleshoot-startup-issues-902ebb04-daa3-4f90-579f-0fbf51f7dd5d"
      },
      {
        "date": "2021-10-24T02:19:00.000Z",
        "voteCount": 2,
        "content": "Answer is OK"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 17,
    "url": "https://www.examtopics.com/discussions/microsoft/view/57123-exam-md-100-topic-1-question-17-discussion/",
    "body": "Your company has several mobile devices that run Windows 10.<br>You need configure the mobile devices to meet the following requirements:<br>✑ Windows updates may only be download when mobile devices are connect to Wi-Fi.<br>✑ Access to email and the Internet must be possible at all times.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen the Setting app and select Update &amp; Security. Then select and configure Change active hours.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen the Setting app and select Network &amp; Internet. Then select Change connection properties, and set the Metered connection option for cellular network connections to On.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen the Setting app and select Network &amp; Internet. Then select Data Usage and set a data limit.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOpen the Setting app and select Update &amp; Security. Then select and configure Delivery Optimization."
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 6,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-07-12T06:37:00.000Z",
        "voteCount": 5,
        "content": "Active Hours just stops your pc from restarting during Active Hours.\nMetered Connections will still download quality updates.\nData limits will still allow critical updates even if the limit is exceeded.\nDelivery Optimization allows for configuring specific usage profiles.\nAnswer is D."
      },
      {
        "date": "2021-10-05T01:16:00.000Z",
        "voteCount": 2,
        "content": "But there is no option/setting to not download updates from cellular networks (which have not been marked as metered so far) right? So how D?"
      },
      {
        "date": "2023-10-01T18:24:00.000Z",
        "voteCount": 1,
        "content": "On a metered connection, which is any connection that has a data limit, Windows won't download updates in most cases.  B"
      },
      {
        "date": "2023-03-12T20:42:00.000Z",
        "voteCount": 2,
        "content": "Answer B is correct.\n\nSetting the Metered connection option for cellular network connections to On will allow Windows to only download updates over Wi-Fi connections. This will help prevent excessive data usage when downloading updates on a mobile device.\n\nAnswer A (Change active hours) is incorrect because it does not address the requirement to only download updates over Wi-Fi.\n\nAnswer C (Set a data limit) is incorrect because it may restrict access to email and the Internet when the data limit is reached.\n\nAnswer D (Delivery Optimization) is incorrect because it does not address the requirement to only download updates over Wi-Fi. Delivery Optimization is a feature that enables you to download Windows updates and apps from other computers on your local network or the Internet to speed up the download process."
      },
      {
        "date": "2022-10-08T19:13:00.000Z",
        "voteCount": 1,
        "content": "B\n\"No modo conexão limitada, algumas atualizações do Windows não são instaladas automaticamente.”\nhttps://support.microsoft.com/pt-br/windows/conex%C3%B5es-com-medidor-em-windows-7b33928f-a144-b265-97b6-f2e95a87c408"
      },
      {
        "date": "2022-03-09T04:05:00.000Z",
        "voteCount": 1,
        "content": "B is Correct."
      },
      {
        "date": "2022-01-20T14:10:00.000Z",
        "voteCount": 3,
        "content": "Correct answer is B. By default, updates don't download over metered connections. You can see this setting in Settings / Update &amp; Security / Advanced Options : Download updates over metered connections.\nSo flipping the cellular connection to metered halts the download of updates."
      },
      {
        "date": "2021-11-04T01:04:00.000Z",
        "voteCount": 2,
        "content": "Answer is D"
      },
      {
        "date": "2021-08-27T10:19:00.000Z",
        "voteCount": 3,
        "content": "I think the answer is correct because by default option \"Download updates over metered connections (extra charges may apply)\" is disabled. So you just have to turn on Metered Connection."
      },
      {
        "date": "2021-11-10T04:27:00.000Z",
        "voteCount": 2,
        "content": "according to this article the answer is B https://www.makeuseof.com/tag/5-ways-temporarily-turn-off-windows-update-windows-10/"
      },
      {
        "date": "2021-08-27T06:20:00.000Z",
        "voteCount": 3,
        "content": "B is Correct. In newer Windows 10 Update download via metered connection ist disablet per default."
      },
      {
        "date": "2021-08-24T00:32:00.000Z",
        "voteCount": 2,
        "content": "it is good https://www.verizon.com/support/knowledge-base-207620/"
      },
      {
        "date": "2021-08-19T06:52:00.000Z",
        "voteCount": 1,
        "content": "This is a badly worded question. Metered connections stop most but not ALL windows updates. The other options won't do anything. You can configure bandwidth usage in Delivery Optimization, but even there you can't set the limit to 0 for downloads in foreground/background. The minimum is 0.1 Mbps"
      },
      {
        "date": "2021-07-07T13:37:00.000Z",
        "voteCount": 2,
        "content": "Wrong.  Turning on Metered Connection only prevents Feature Updates from installing.  I'm going with D."
      },
      {
        "date": "2021-10-26T06:22:00.000Z",
        "voteCount": 4,
        "content": "B seems the best answer given. D (Delivery optimization) only lets you limit the bandwith to a minimum of 0.1 Mbps or 5% of your maximum bandwith. You can't turn it off completely."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 18,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64805-exam-md-100-topic-1-question-18-discussion/",
    "body": "Your company has an on-premises network that contains an Active Directory domain. The domain is synced to Microsoft Azure Active Directory (Azure AD). All computers in the domain run Windows 10 Enterprise.<br>You have a computer named Computer1 that has a folder named C:\\Folder1.<br>You want to use File History to protect C:\\Folder1.<br>Solution: You enable File History on Computer1. You then enable archiving for Folder1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "",
    "votes": [
      {
        "answer": "B",
        "count": 3,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-10-26T06:31:00.000Z",
        "voteCount": 7,
        "content": "Correct answer. Archiving has nothing to do with being able to use the file history."
      },
      {
        "date": "2023-03-12T20:49:00.000Z",
        "voteCount": 1,
        "content": "Answer B is correct because simply enabling archiving for Folder1 does not ensure that the contents of that folder are protected by File History. While archiving can be a helpful feature for storing older versions of files, it does not have the same level of functionality as File History.\n\nTo meet the goal of using File History to protect C:\\Folder1, you need to specifically enable File History on Computer1 and then configure it to include C:\\Folder1 in its backups. Simply enabling archiving for Folder1 is not sufficient to ensure that the contents of that folder are being regularly backed up and can be restored in case of data loss."
      },
      {
        "date": "2022-03-09T04:08:00.000Z",
        "voteCount": 2,
        "content": "Correct answer"
      },
      {
        "date": "2021-11-17T03:49:00.000Z",
        "voteCount": 3,
        "content": "Correct answer"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 19,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64806-exam-md-100-topic-1-question-19-discussion/",
    "body": "Your company has an on-premises network that contains an Active Directory domain. The domain is synced to Microsoft Azure Active Directory (Azure AD). All computers in the domain run Windows 10 Enterprise.<br>You have a computer named Computer1 that has a folder named C:\\Folder1.<br>You want to use File History to protect C:\\Folder1.<br>Solution: You enable File History on Computer1. You then encrypt the contents of Folder1.<br>Does this meet the goal?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tYes",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tNo\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>"
    ],
    "answer": "B",
    "answerDescription": "File History only backs up copies of files that are in Libraries, and Desktop folders and the OneDrive files available offline on your PC. If you have files or folders elsewhere that you want backed up, you can add them to one of these folders.<br>Reference:<br>https://support.microsoft.com/en-us/help/17128/windows-8-file-history",
    "votes": [
      {
        "answer": "B",
        "count": 2,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2023-03-12T20:56:00.000Z",
        "voteCount": 1,
        "content": "Answer B is correct because encrypting the contents of Folder1 is not a necessary step to enable File History to protect C:\\Folder1. Enabling File History on Computer1 alone would be sufficient to protect the contents of C:\\Folder1. \n\nFile History is a built-in feature of Windows that allows you to automatically back up your important files to an external hard drive, network location, or other storage devices. It creates copies of the files in your Documents, Music, Pictures, Videos, and Desktop folders and keeps them in a separate location, so you can restore them if they're lost or damaged.\n\nWhile encrypting the contents of Folder1 is a good security measure to protect the data, it's not required for File History to work."
      },
      {
        "date": "2022-03-09T04:08:00.000Z",
        "voteCount": 1,
        "content": "Correct answer."
      },
      {
        "date": "2021-10-26T06:33:00.000Z",
        "voteCount": 3,
        "content": "Correct answer. Encrypting the files is not a necessary step"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 20,
    "url": "https://www.examtopics.com/discussions/microsoft/view/64591-exam-md-100-topic-1-question-20-discussion/",
    "body": "HOTSPOT -<br>You have a computer named Computer1. Computer1 runs Windows 10 Pro. You want to use Computer1to test new Windows features.<br>You need to configure Computer1to receive preview builds of Windows 10 as soon as they are available.<br>You open the Update &amp; Security section in the Settings app.<br>What should you configure? To answer, select the appropriate options in the answer area.<br>Hot Area:<br><img src=\"/assets/media/exam-media/04292/0002100001.png\" class=\"in-exam-image\"><br>",
    "options": [],
    "answer": "<img src=\"/assets/media/exam-media/04292/0002200001.png\" class=\"in-exam-image\">",
    "answerDescription": "Reference:<br>https://insider.windows.com/en-us/getting-started/",
    "votes": [],
    "comments": [
      {
        "date": "2023-03-12T21:00:00.000Z",
        "voteCount": 2,
        "content": "To receive preview builds of Windows 10 on Computer1, you should configure the following in the Update &amp; Security section of the Settings app:\n\n1. Click on the Windows Insider Program option in the left pane.\n2. Click on the Get started button and link your Microsoft account to the Windows Insider Program.\n3. Choose the level of preview builds you want to receive from the list provided, such as Dev Channel or Beta Channel.\n4. Click on Confirm to accept the terms of the program.\n\nAfter configuring these settings, your Computer1 will receive preview builds of Windows 10 as soon as they are available."
      },
      {
        "date": "2022-09-13T04:16:00.000Z",
        "voteCount": 1,
        "content": "Answer is correct!"
      },
      {
        "date": "2021-11-10T12:01:00.000Z",
        "voteCount": 3,
        "content": "Easy - Windows Insider"
      },
      {
        "date": "2021-10-24T02:21:00.000Z",
        "voteCount": 2,
        "content": "Answer is OK"
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 21,
    "url": "https://www.examtopics.com/discussions/microsoft/view/63550-exam-md-100-topic-1-question-21-discussion/",
    "body": "Note: This question is part of a series of questions that present the same scenario. Each question in the series contains a unique solution that might meet the stated goals. Some question sets might have more than one correct solution, while others might not have a correct solution.<br>After you answer a question in this section, you will NOT be able to return to it. As a result, these questions will not appear in the review screen.<br>Your company has an on-premises network that contains an Active Directory domain. The domain is synced to Microsoft Azure Active Directory (Azure AD). All computers in the domain run Windows 10 Enterprise.<br>You are logged on as the local administrator on a Computer named Computer1.<br>A user named Mia Hamm has a computer named Computer2. Mia Hamm reports that she is experiencing problems with Computer2.<br>You want to use Event Viewer on Computer1 to view the event logs on Computer2.<br>What should you do?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, run the Connect-WSMan -ComputerName \"Computer1\" cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, run the Get-Eventlog -List -ComputerName \"Computer1\" cmdlet.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, log on as a domain administrator, then open Event Viewer and select the Connect to another computer ג€¦ option.\n\t\t\t\t\t\t\t\t\t\t<span class=\"badge badge-success most-voted-answer-badge\" title=\"\" style=\"display: none;\" data-original-title=\"This answer is currently the most voted for in the discussion\">\n                Most Voted\n            </span>",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tOn Computer1, open the Windows Defender Firewall and enable the Remote Event Log Management inbound rule."
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [
      {
        "answer": "C",
        "count": 5,
        "isMostVoted": true
      }
    ],
    "comments": [
      {
        "date": "2021-10-04T01:25:00.000Z",
        "voteCount": 11,
        "content": "Key word here is : \"You are logged on as the local administrator on a Computer named Computer1.\" Local admin dont have access to Computer2. \n\nTherefore answer C is correct."
      },
      {
        "date": "2023-03-13T17:33:00.000Z",
        "voteCount": 1,
        "content": "Answer C is the correct solution. To view the event logs on Computer2 using Event Viewer on Computer1, you need to log on as a domain administrator on Computer1, and then use Event Viewer to connect to Computer2. From there, you can view the event logs on Computer2.\n\nAnswer A is incorrect because the Connect-WSMan cmdlet is used to connect to a remote computer using Windows Remote Management (WinRM), which is not necessary for this scenario.\n\nAnswer B is incorrect because the Get-Eventlog cmdlet is used to retrieve event log information from the local computer, not a remote computer.\n\nAnswer D is incorrect because enabling the Remote Event Log Management inbound rule in Windows Defender Firewall allows you to manage remote event logs on the local computer, but it does not allow you to view event logs on a remote computer."
      },
      {
        "date": "2022-01-18T01:02:00.000Z",
        "voteCount": 4,
        "content": "C is correct, you would use Event Viewer to connect remotely in this scenario."
      }
    ],
    "examNameCode": "md-100",
    "topicNumber": "1"
  }
]