[
  {
    "topic": 1,
    "index": 1,
    "url": "https://www.examtopics.com/discussions/itil/view/36098-exam-itilsc-soa-topic-1-question-1-discussion/",
    "body": "Scenario -<br>A travel company specializes in providing complete holiday packages to meet customer requirements. There have been instances over the past year where the business has been unable to process holiday bookings due to failure of the IT services. Sales have been lost and the failure has been raised at board level. The IT director has assured the board that the situation will be rectified.<br>Most holiday bookings are made either by telephone via the company's call centre or through a dedicated website. Both interface with the same back-end booking-processing service. Apart from the call centre and website, the main business services map onto organizational departments and cover: marketing, finance, business operations and central administration.<br>After some initial investigation within the IT organization, it is clear that the intermittent failures, which were related to a lack of capacity, have occurred during exceptional peak holiday booking periods. The IT organization is not certain when or if these are going to occur in the future. Some booking periods are predictable, such as those associated with promotional offers. Other patterns are totally unpredictable as they often coincide with bad weather being experienced where customers live.<br>You have been asked how the activities of demand management, based on ITIL practices, can be used to address this issue.<br>Refer to Scenario -<br>Which one of the following options is the BEST set of actions required to resolve the issue?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIdentify the pattern of customer enquiries for holiday bookings and the resulting volume, frequency and location of staff activity. Document these as patterns of business activity (PBA) Gain an understanding of the different roles that are performed by staff from all business units and how these relate to the PBA for all business processes. Use this information to identify any shortfall in capacity and create cost estimates of additional resource required to enable the IT services to meet the PBA. Recommend that, where PBA are very predictable, investment should be made in additional resource. Where PBA are unpredictable, the risks associated with railing to meet demand should be discussed with the business managers, and mitigation actions agreed.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIdentify the pattern of customer enquiries for holiday bookings and the resulting volume, frequency and location of staff activity. Document these as PBA. Gain an understanding of the different roles that are performed by the call centre staff and how these relate to the PBA for the call centre business processes. Use this information to identify any shortfall in capacity and create cost estimates of additional resource required to enable the IT services to meet the PBA. Discuss the risks associated with failing to meet demand with the business managers. Reach agreement on how to avoid a repeat of the IT failures caused by demand at busy periods.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tIdentify and understand the PBA resulting from metrics of all the IT services. Ensure that the volume, frequency and location of service use is taken into account. Gain an understanding of how the PBA relate to the use of the IT assets especially the hardware and software that may be the cause of the IT failures. Once these activities have been completed, the PBA will be used to plan and implement sufficient capacity to meet all demand at all times. Discuss the risks associated with failing to meet demand with capacity management and technical staff. Reach agreement on how to avoid a repeat of the IT failures caused by demand at busy periods.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tImmediately implement demand management, document the process and allocate roles and responsibilities. The demand manager should initiate an activity to identify and understand user profiles resulting from business use of the IT services. Code the user profiles linking them to the associated business roles. Match the user profiles to the IT services and analyze any shortfall in capacity required to meet the business objectives. Create a business case for the additional resource required to exceed the business demand for the IT services to account for unpredictable business activity. Work with service portfolio management and financial management to agree on the approval of the investment and initiate the project to acquire all the"
    ],
    "answer": "A",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-11-04T13:33:00.000Z",
        "voteCount": 2,
        "content": "The right answer A contains the following keywords to make it the right one.\n1.-PBA activity: Identify the pattern of customer inquiries for holiday bookings. \n2.- UP(User Profile) Gain an understanding of the different roles that are performed by staff from all business units.\n3.- Take action for solution: Use this information to identify any shortfall in capacity and create cost estimates of additional resources required to enable the IT services to meet the PBA.\n4.- Correct mitigations related to the identified risk. Where PBA are unpredictable, the risks associated with railing to meet demand should be discussed with the business managers, and mitigation actions agreed."
      }
    ],
    "examNameCode": "itilsc-soa",
    "topicNumber": "1"
  },
  {
    "topic": 1,
    "index": 2,
    "url": "https://www.examtopics.com/discussions/itil/view/34058-exam-itilsc-soa-topic-1-question-11-discussion/",
    "body": "Scenario -<br>A financial services organization has undergone a period of rapid expansion. From its operating base it has expanded to serve customers in over 25 countries spread around the globe. There are plans to enter more markets in the next 12 months.<br>The key stakeholders involved in the global expansion project have briefed the chief information officer (CIO) on the plans. They have identified IT service performance as one of the major threats to the plan. The CIO has been under pressure from the board due to poor IT service performance in the previous six months. The chief concern has been significant performance variations in network connectivity and communications.<br>The organization currently has three contracts with different local external suppliers in operating markets supporting three IT network hubs. Whilst the suppliers are all happy to follow local internal IT processes, getting the three to work together on incidents or changes has proved increasingly difficult.<br>A number of outages have resulted in a blame culture where even the local internal IT departments have been sympathetic to their service providers, resulting in strained relationships between these internal departments at an operational level.<br>Other issues encountered at one or more locations have included:<br>✑ Long-term service improvements have been sacrificed in favour of short-term fixes that avoid the payment of contract penalties by the suppliers<br>✑ Changes in ownership of the customer relationship by the suppliers<br>The CIO believes that a lack of communication between suppliers has been the key cause of failures.<br>All three supplier contracts are due for renewal in the next 12 months. After consultation, a decision to re-tender for network services has been taken by IT, and approved by the CIO and the board of directors.<br>Refer to the Scenario.<br>When considering suppliers, which one of the following options would BEST ensure that network issues are addressed in order to meet the needs of the financial services organization?<br>",
    "options": [
      "<span class=\"multi-choice-letter\" data-choice-letter=\"A\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tA.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConsideration should be given to entering into a partnership with three local suppliers who have worked together before in similar circumstances. This will ensure both communication and local cultural differences are addressed. Supplier management should have a single, defined local point of ownership with responsibility granted for operational management of issues. The threat of contractual penalties should be removed to encourage suppliers to think longer term about sustainable service improvements. Suppliers will commit to the use of local IT processes to ensure compliance and good communication. Suppliers are to ensure that staff engaged in the contract (in particular the account managers and customer service managers) are fully ITIL trained so they understand and can implement service management best practice disciplines.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"B\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tB.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConsideration should be given to entering into a partnership with a single supplier where mutual trust and a good relationship can be established. Supplier management should have a single, defined point of ownership within each country to manage all local operational issues. A risk-reward framework should be mapped out as an incentive for the supplier to solve local issues. A strategic alignment should be sought with the supplier where values, goals and cultural fit are similar to that of the financial services organization. The supplier should set up its own dedicated global account management team to deal with transition and on-going issues by working with local IT support teams.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"C\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tC.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConsideration should be given to entering into a partnership with a single supplier where mutual trust and a good relationship can be established. Supplier management should have a single, defined point of ownership with local responsibility granted for operational management of issues. A long-term, risk-reward framework should be mapped out to encourage the supplier to work towards sustainable service improvements instead of shorter- term quick fixes. A strategic alignment should be sought with the supplier where values, goals and cultural fit are similar to that of the financial services organization. Implementation of a joint partnership team to initially ensure a smooth transition of the service to the new supplier and to subsequently manage on-going service improvement.",
      "<span class=\"multi-choice-letter\" data-choice-letter=\"D\">\n\t\t\t\t\t\t\t\t\t\t\t\t\tD.\n\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\tConsideration should be given to re-contracting with the three current local suppliers. There is no suggestion that they are technically incompetent; it appears to be communication and local cultural differences that cause problems. Supplier management should have a single, defined local point of ownership with responsibility granted for operational management of issues. The threat of contractual penalties should be removed to encourage suppliers to think longer term about sustainable service improvements. Communication issues should be addressed by ensuring all incidents are reported to a single global service desk that the financial institution should implement. Suppliers are to ensure that staff engaged in the contract (in particular the account managers and customer service managers) are fully ITIL trained so they"
    ],
    "answer": "C",
    "answerDescription": "",
    "votes": [],
    "comments": [
      {
        "date": "2020-10-08T10:08:00.000Z",
        "voteCount": 1,
        "content": "Single supplier is the right answer ?"
      }
    ],
    "examNameCode": "itilsc-soa",
    "topicNumber": "1"
  }
]